; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/borthog.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/borthog.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }
%struct.PetscOps = type { i32 (%struct._p_PetscObject*, %struct.ompi_communicator_t**)*, i32 (%struct._p_PetscObject*, %struct._p_PetscViewer*)*, i32 (%struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject*)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, void ()*)*, i32 (%struct._p_PetscObject*, i8*, void ()**)* }

!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133}
!127 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!128 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!129 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!130 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!131 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!132 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!133 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!134 = !{!135, !183, !186, !265, !156, !627, !630, !255, !26, !633, !207}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_GMRES", file: !137, line: 55, baseType: !138)
!137 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/gmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 53, size: 1600, elements: !139)
!139 = !{!140, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !157, !158, !609, !611, !612, !613, !614, !615, !616, !617, !619, !620, !621, !622, !623, !624, !625, !626}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !138, file: !137, line: 54, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !144)
!144 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !138, file: !137, line: 54, baseType: !152, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !138, file: !137, line: 54, baseType: !143, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 672)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !138, file: !137, line: 54, baseType: !159, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !163, !156}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !166)
!166 = !{!167, !370, !424, !429, !430, !431, !432, !462, !463, !464, !465, !466, !468, !473, !474, !475, !476, !477, !478, !479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !502, !508, !509, !510, !511, !516, !517, !518, !519, !524, !525, !526, !527, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !579, !580, !581, !582, !583, !590, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !606, !607, !608}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !165, file: !102, line: 76, baseType: !168, size: 4480)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !169, line: 122, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !169, line: 73, size: 4480, elements: !171)
!171 = !{!172, !174, !228, !229, !230, !232, !233, !234, !235, !243, !244, !246, !250, !254, !256, !257, !258, !259, !260, !261, !262, !263, !264, !266, !268, !269, !270, !272, !273, !275, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !289, !291, !292, !293, !303, !305, !306, !310, !311, !360, !365, !367, !368, !369}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !170, file: !169, line: 74, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !170, file: !169, line: 75, baseType: !175, size: 448, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 448, elements: !226)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !169, line: 53, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 45, size: 448, elements: !178)
!178 = !{!179, !190, !198, !203, !210, !214, !221}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !177, file: !169, line: 46, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!162, !183, !185}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !187, line: 330, baseType: !188)
!187 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !187, line: 330, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !177, file: !169, line: 47, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!162, !183, !194}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !195, line: 16, baseType: !196)
!195 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !195, line: 16, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !177, file: !169, line: 48, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!162, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !177, file: !169, line: 49, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!162, !183, !207, !183}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !177, file: !169, line: 50, baseType: !211, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!162, !183, !207, !202}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !177, file: !169, line: 51, baseType: !215, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!162, !183, !207, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !177, file: !169, line: 52, baseType: !222, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!162, !183, !207, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!226 = !{!227}
!227 = !DISubrange(count: 1)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !170, file: !169, line: 76, baseType: !186, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 77, baseType: !156, size: 32, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !170, file: !169, line: 78, baseType: !231, size: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !170, file: !169, line: 78, baseType: !231, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !170, file: !169, line: 78, baseType: !231, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !170, file: !169, line: 78, baseType: !231, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !170, file: !169, line: 79, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !239, line: 27, baseType: !240)
!239 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !241, line: 43, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !170, file: !169, line: 80, baseType: !156, size: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !170, file: !169, line: 81, baseType: !245, size: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !170, file: !169, line: 82, baseType: !247, size: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !170, file: !169, line: 83, baseType: !251, size: 64, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !170, file: !169, line: 84, baseType: !255, size: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !170, file: !169, line: 85, baseType: !255, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !170, file: !169, line: 86, baseType: !255, size: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !170, file: !169, line: 87, baseType: !255, size: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !170, file: !169, line: 88, baseType: !183, size: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !170, file: !169, line: 89, baseType: !236, size: 64, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !169, line: 90, baseType: !255, size: 64, offset: 1536)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !170, file: !169, line: 91, baseType: !255, size: 64, offset: 1600)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !170, file: !169, line: 92, baseType: !156, size: 32, offset: 1664)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !170, file: !169, line: 93, baseType: !265, size: 64, offset: 1728)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !170, file: !169, line: 94, baseType: !267, size: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !237)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !170, file: !169, line: 95, baseType: !156, size: 32, offset: 1856)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !170, file: !169, line: 95, baseType: !156, size: 32, offset: 1888)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !170, file: !169, line: 96, baseType: !271, size: 64, offset: 1920)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !170, file: !169, line: 96, baseType: !271, size: 64, offset: 1984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !170, file: !169, line: 97, baseType: !274, size: 64, offset: 2048)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !170, file: !169, line: 97, baseType: !276, size: 64, offset: 2112)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !170, file: !169, line: 98, baseType: !156, size: 32, offset: 2176)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !170, file: !169, line: 98, baseType: !156, size: 32, offset: 2208)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !170, file: !169, line: 99, baseType: !271, size: 64, offset: 2240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !170, file: !169, line: 99, baseType: !271, size: 64, offset: 2304)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !170, file: !169, line: 100, baseType: !152, size: 64, offset: 2368)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !170, file: !169, line: 100, baseType: !283, size: 64, offset: 2432)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !170, file: !169, line: 101, baseType: !156, size: 32, offset: 2496)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !170, file: !169, line: 101, baseType: !156, size: 32, offset: 2528)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !170, file: !169, line: 102, baseType: !271, size: 64, offset: 2560)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !170, file: !169, line: 102, baseType: !271, size: 64, offset: 2624)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !170, file: !169, line: 103, baseType: !141, size: 64, offset: 2688)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !170, file: !169, line: 103, baseType: !290, size: 64, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !170, file: !169, line: 104, baseType: !225, size: 64, offset: 2816)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !170, file: !169, line: 105, baseType: !156, size: 32, offset: 2880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !170, file: !169, line: 106, baseType: !294, size: 128, offset: 2944)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 128, elements: !301)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !169, line: 64, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 61, size: 128, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !169, line: 62, baseType: !218, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !297, file: !169, line: 63, baseType: !265, size: 64, offset: 64)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !170, file: !169, line: 107, baseType: !304, size: 64, offset: 3072)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !170, file: !169, line: 108, baseType: !265, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !170, file: !169, line: 109, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!162, !265}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !170, file: !169, line: 111, baseType: !156, size: 32, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !170, file: !169, line: 112, baseType: !312, size: 320, offset: 3328)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !358)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!162, !316, !183, !265}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !319)
!319 = !{!320, !321, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !10, line: 100, baseType: !156, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !10, line: 101, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !333, !334, !335, !339, !341, !343, !344, !345}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !324, file: !10, line: 84, baseType: !255, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !324, file: !10, line: 85, baseType: !255, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !10, line: 86, baseType: !265, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !324, file: !10, line: 87, baseType: !247, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !10, line: 88, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !324, file: !10, line: 89, baseType: !209, size: 8, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !324, file: !10, line: 90, baseType: !255, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !324, file: !10, line: 91, baseType: !336, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !337, line: 46, baseType: !338)
!337 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!338 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !10, line: 92, baseType: !340, size: 32, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !10, line: 93, baseType: !342, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !10, line: 94, baseType: !322, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !324, file: !10, line: 95, baseType: !255, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !324, file: !10, line: 96, baseType: !265, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !10, line: 102, baseType: !255, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !318, file: !10, line: 102, baseType: !255, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !318, file: !10, line: 103, baseType: !255, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !10, line: 104, baseType: !186, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !318, file: !10, line: 105, baseType: !340, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !318, file: !10, line: 105, baseType: !340, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !318, file: !10, line: 105, baseType: !340, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !318, file: !10, line: 106, baseType: !183, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !10, line: 107, baseType: !355, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!358 = !{!359}
!359 = !DISubrange(count: 5)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !170, file: !169, line: 113, baseType: !361, size: 320, offset: 3648)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 320, elements: !358)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!162, !183, !265}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !170, file: !169, line: 114, baseType: !366, size: 320, offset: 3968)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 320, elements: !358)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !170, file: !169, line: 115, baseType: !340, size: 32, offset: 4288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !170, file: !169, line: 120, baseType: !355, size: 64, offset: 4352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !170, file: !169, line: 121, baseType: !340, size: 32, offset: 4416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !165, file: !102, line: 76, baseType: !371, size: 896, offset: 4480)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 896, elements: !226)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !373)
!373 = !{!374, !383, !387, !391, !399, !400, !404, !405, !409, !413, !417, !418, !422, !423}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !372, file: !102, line: 19, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!162, !163, !378, !382}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !379, line: 21, baseType: !380)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !379, line: 21, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !372, file: !102, line: 22, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!162, !163, !378, !378, !382}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !372, file: !102, line: 25, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!162, !163}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !372, file: !102, line: 26, baseType: !392, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!162, !163, !395, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !396, line: 16, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !396, line: 16, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !372, file: !102, line: 27, baseType: !388, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !372, file: !102, line: 28, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!162, !316, !163}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !372, file: !102, line: 29, baseType: !388, size: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !372, file: !102, line: 30, baseType: !406, size: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!162, !163, !152, !152}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !372, file: !102, line: 31, baseType: !410, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!162, !163, !156, !152, !152, !274}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !372, file: !102, line: 32, baseType: !414, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!162, !163, !340, !340, !274, !382, !152, !152}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !372, file: !102, line: 33, baseType: !388, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !372, file: !102, line: 34, baseType: !419, size: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!162, !163, !194}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !372, file: !102, line: 35, baseType: !388, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !372, file: !102, line: 36, baseType: !419, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !165, file: !102, line: 77, baseType: !425, size: 64, offset: 5376)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !426, line: 14, baseType: !427)
!426 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !426, line: 14, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !165, file: !102, line: 78, baseType: !340, size: 32, offset: 5440)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !165, file: !102, line: 79, baseType: !340, size: 32, offset: 5472)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !165, file: !102, line: 81, baseType: !156, size: 32, offset: 5504)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !165, file: !102, line: 82, baseType: !433, size: 64, offset: 5568)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !436)
!436 = !{!437, !438, !458, !459, !460, !461}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !435, file: !102, line: 55, baseType: !168, size: 4480)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !435, file: !102, line: 55, baseType: !439, size: 448, offset: 4480)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 448, elements: !226)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !441)
!441 = !{!442, !446, !447, !451, !452, !453, !457}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !440, file: !102, line: 42, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!162, !433, !378, !378}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !440, file: !102, line: 43, baseType: !443, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !440, file: !102, line: 44, baseType: !448, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!162, !433}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !440, file: !102, line: 45, baseType: !448, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !440, file: !102, line: 46, baseType: !448, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !440, file: !102, line: 47, baseType: !454, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!162, !433, !194}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !440, file: !102, line: 48, baseType: !448, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !435, file: !102, line: 56, baseType: !163, size: 64, offset: 4928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !435, file: !102, line: 57, baseType: !395, size: 64, offset: 4992)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !435, file: !102, line: 58, baseType: !267, size: 64, offset: 5056)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !435, file: !102, line: 59, baseType: !265, size: 64, offset: 5120)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !165, file: !102, line: 83, baseType: !340, size: 32, offset: 5632)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !165, file: !102, line: 84, baseType: !340, size: 32, offset: 5664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !165, file: !102, line: 85, baseType: !340, size: 32, offset: 5696)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !165, file: !102, line: 86, baseType: !340, size: 32, offset: 5728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !165, file: !102, line: 87, baseType: !467, size: 32, offset: 5760)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !165, file: !102, line: 88, baseType: !469, size: 384, offset: 5792)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 384, elements: !470)
!470 = !{!471, !472}
!471 = !DISubrange(count: 4)
!472 = !DISubrange(count: 3)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !165, file: !102, line: 89, baseType: !143, size: 64, offset: 6208)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !165, file: !102, line: 90, baseType: !143, size: 64, offset: 6272)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !165, file: !102, line: 91, baseType: !143, size: 64, offset: 6336)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !165, file: !102, line: 92, baseType: !143, size: 64, offset: 6400)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !165, file: !102, line: 93, baseType: !143, size: 64, offset: 6464)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !165, file: !102, line: 94, baseType: !143, size: 64, offset: 6528)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !165, file: !102, line: 95, baseType: !480, size: 32, offset: 6592)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !165, file: !102, line: 96, baseType: !340, size: 32, offset: 6624)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !165, file: !102, line: 98, baseType: !378, size: 64, offset: 6656)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !165, file: !102, line: 98, baseType: !378, size: 64, offset: 6720)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !165, file: !102, line: 102, baseType: !152, size: 64, offset: 6784)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !165, file: !102, line: 103, baseType: !152, size: 64, offset: 6848)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !165, file: !102, line: 104, baseType: !156, size: 32, offset: 6912)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !165, file: !102, line: 105, baseType: !156, size: 32, offset: 6944)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !165, file: !102, line: 106, baseType: !340, size: 32, offset: 6976)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !165, file: !102, line: 107, baseType: !152, size: 64, offset: 7040)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !165, file: !102, line: 108, baseType: !152, size: 64, offset: 7104)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !165, file: !102, line: 109, baseType: !156, size: 32, offset: 7168)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !165, file: !102, line: 110, baseType: !156, size: 32, offset: 7200)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !165, file: !102, line: 111, baseType: !340, size: 32, offset: 7232)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !165, file: !102, line: 113, baseType: !156, size: 32, offset: 7264)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !165, file: !102, line: 114, baseType: !340, size: 32, offset: 7296)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !165, file: !102, line: 117, baseType: !156, size: 32, offset: 7328)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !165, file: !102, line: 120, baseType: !498, size: 320, offset: 7360)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !358)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!162, !163, !156, !143, !265}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !165, file: !102, line: 121, baseType: !503, size: 320, offset: 7680)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !358)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!162, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !165, file: !102, line: 122, baseType: !366, size: 320, offset: 8000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !165, file: !102, line: 123, baseType: !156, size: 32, offset: 8320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !165, file: !102, line: 124, baseType: !340, size: 32, offset: 8352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !165, file: !102, line: 126, baseType: !512, size: 320, offset: 8384)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !358)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!162, !163, !265}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !165, file: !102, line: 127, baseType: !503, size: 320, offset: 8704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !165, file: !102, line: 128, baseType: !366, size: 320, offset: 9024)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !165, file: !102, line: 129, baseType: !156, size: 32, offset: 9344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !165, file: !102, line: 131, baseType: !520, size: 64, offset: 9408)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!162, !163, !156, !143, !523, !265}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !165, file: !102, line: 132, baseType: !307, size: 64, offset: 9472)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !165, file: !102, line: 133, baseType: !265, size: 64, offset: 9536)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !165, file: !102, line: 135, baseType: !265, size: 64, offset: 9600)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !165, file: !102, line: 137, baseType: !528, size: 64, offset: 9664)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !102, line: 139, baseType: !265, size: 64, offset: 9728)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9792)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9824)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9856)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9888)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9920)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9952)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 9984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10016)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10080)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10112)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10144)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10176)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !165, file: !102, line: 142, baseType: !340, size: 32, offset: 10208)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10240)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10432)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10496)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10560)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10624)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10688)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10752)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10816)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10880)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 10944)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 11008)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !165, file: !102, line: 143, baseType: !194, size: 64, offset: 11072)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11136)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11168)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11200)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11232)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11264)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11296)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11328)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11360)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11392)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11424)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11456)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11488)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11520)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !165, file: !102, line: 144, baseType: !561, size: 32, offset: 11552)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !165, file: !102, line: 147, baseType: !156, size: 32, offset: 11584)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !165, file: !102, line: 148, baseType: !382, size: 64, offset: 11648)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !165, file: !102, line: 150, baseType: !578, size: 32, offset: 11712)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !165, file: !102, line: 151, baseType: !340, size: 32, offset: 11744)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !165, file: !102, line: 153, baseType: !156, size: 32, offset: 11776)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !165, file: !102, line: 154, baseType: !156, size: 32, offset: 11808)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !165, file: !102, line: 156, baseType: !340, size: 32, offset: 11840)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !165, file: !102, line: 161, baseType: !584, size: 192, offset: 11904)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !102, line: 157, size: 192, elements: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !584, file: !102, line: 158, baseType: !395, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !584, file: !102, line: 158, baseType: !395, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !584, file: !102, line: 159, baseType: !340, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !584, file: !102, line: 160, baseType: !340, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !165, file: !102, line: 163, baseType: !591, size: 32, offset: 12096)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !165, file: !102, line: 165, baseType: !467, size: 32, offset: 12128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !165, file: !102, line: 166, baseType: !591, size: 32, offset: 12160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !165, file: !102, line: 171, baseType: !340, size: 32, offset: 12192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !165, file: !102, line: 172, baseType: !340, size: 32, offset: 12224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !165, file: !102, line: 173, baseType: !340, size: 32, offset: 12256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !165, file: !102, line: 174, baseType: !378, size: 64, offset: 12288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !165, file: !102, line: 175, baseType: !378, size: 64, offset: 12352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !165, file: !102, line: 177, baseType: !156, size: 32, offset: 12416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !165, file: !102, line: 178, baseType: !340, size: 32, offset: 12448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !165, file: !102, line: 180, baseType: !194, size: 64, offset: 12480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !165, file: !102, line: 182, baseType: !603, size: 64, offset: 12544)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!162, !163, !378, !378, !265}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !165, file: !102, line: 183, baseType: !603, size: 64, offset: 12608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !165, file: !102, line: 184, baseType: !265, size: 64, offset: 12672)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !165, file: !102, line: 184, baseType: !265, size: 64, offset: 12736)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !138, file: !137, line: 54, baseType: !610, size: 32, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !138, file: !137, line: 54, baseType: !382, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !138, file: !137, line: 54, baseType: !382, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 992)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 1056)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !138, file: !137, line: 54, baseType: !618, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !138, file: !137, line: 54, baseType: !274, size: 64, offset: 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 1248)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !138, file: !137, line: 54, baseType: !156, size: 32, offset: 1280)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !138, file: !137, line: 54, baseType: !141, size: 64, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !138, file: !137, line: 54, baseType: !378, size: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !138, file: !137, line: 54, baseType: !143, size: 64, offset: 1472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !138, file: !137, line: 54, baseType: !143, size: 64, offset: 1536)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !187, line: 331, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !187, line: 331, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !187, line: 338, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !187, line: 338, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !125)
!634 = !{i32 7, !"Dwarf Version", i32 4}
!635 = !{i32 2, !"Debug Info Version", i32 3}
!636 = !{i32 1, !"wchar_size", i32 4}
!637 = !{i32 7, !"PIC Level", i32 2}
!638 = !{i32 7, !"uwtable", i32 1}
!639 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!640 = distinct !DISubprogram(name: "KSPGMRESModifiedGramSchmidtOrthogonalization", scope: !641, file: !641, line: 32, type: !160, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !642)
!641 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/borthog.c", directory: "/home/users/ndemeye/xSDK")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !652, !657, !663, !664, !665, !666, !668, !670, !676, !677, !681, !683, !685}
!643 = !DILocalVariable(name: "ksp", arg: 1, scope: !640, file: !641, line: 32, type: !163)
!644 = !DILocalVariable(name: "it", arg: 2, scope: !640, file: !641, line: 32, type: !156)
!645 = !DILocalVariable(name: "gmres", scope: !640, file: !641, line: 34, type: !135)
!646 = !DILocalVariable(name: "ierr", scope: !640, file: !641, line: 35, type: !162)
!647 = !DILocalVariable(name: "j", scope: !640, file: !641, line: 36, type: !156)
!648 = !DILocalVariable(name: "hh", scope: !640, file: !641, line: 37, type: !141)
!649 = !DILocalVariable(name: "hes", scope: !640, file: !641, line: 37, type: !141)
!650 = !DILocalVariable(name: "ierr__", scope: !651, file: !641, line: 40, type: !162)
!651 = distinct !DILexicalBlock(scope: !640, file: !641, line: 40, column: 67)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !641, line: 46, type: !162)
!653 = distinct !DILexicalBlock(scope: !654, file: !641, line: 46, column: 48)
!654 = distinct !DILexicalBlock(scope: !655, file: !641, line: 44, column: 25)
!655 = distinct !DILexicalBlock(scope: !656, file: !641, line: 44, column: 3)
!656 = distinct !DILexicalBlock(scope: !640, file: !641, line: 44, column: 3)
!657 = !DILocalVariable(name: "ierr", scope: !658, file: !641, line: 47, type: !162)
!658 = distinct !DILexicalBlock(scope: !659, file: !641, line: 47, column: 5)
!659 = distinct !DILexicalBlock(scope: !660, file: !641, line: 47, column: 5)
!660 = distinct !DILexicalBlock(scope: !661, file: !641, line: 47, column: 5)
!661 = distinct !DILexicalBlock(scope: !662, file: !641, line: 47, column: 5)
!662 = distinct !DILexicalBlock(scope: !654, file: !641, line: 47, column: 5)
!663 = !DILocalVariable(name: "pcreason", scope: !658, file: !641, line: 47, type: !633)
!664 = !DILocalVariable(name: "sendbuf", scope: !658, file: !641, line: 47, type: !156)
!665 = !DILocalVariable(name: "recvbuf", scope: !658, file: !641, line: 47, type: !156)
!666 = !DILocalVariable(name: "ierr__", scope: !667, file: !641, line: 47, type: !162)
!667 = distinct !DILexicalBlock(scope: !658, file: !641, line: 47, column: 5)
!668 = !DILocalVariable(name: "_7_errorcode", scope: !669, file: !641, line: 47, type: !162)
!669 = distinct !DILexicalBlock(scope: !658, file: !641, line: 47, column: 5)
