; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/field/interface/dmfieldregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/field/interface/dmfieldregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_DMField = type { %struct._p_PetscObject, [1 x %struct._DMFieldOps], %struct._p_DM*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!125 = distinct !DILexicalBlock(scope: !126, file: !74, line: 23, column: 33)
!126 = distinct !DILexicalBlock(scope: !118, file: !74, line: 23, column: 33)
!127 = !DILocation(line: 23, column: 33, scope: !123)
!128 = !DILocation(line: 23, column: 33, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !74, line: 23, column: 33)
!130 = distinct !DILexicalBlock(scope: !122, file: !74, line: 23, column: 33)
!131 = !{!110, !103, i64 1544}
!132 = !DILocation(line: 23, column: 33, scope: !130)
!133 = !DILocation(line: 23, column: 33, scope: !134)
!134 = distinct !DILexicalBlock(scope: !129, file: !74, line: 23, column: 33)
!135 = !DILocation(line: 23, column: 33, scope: !136)
!136 = distinct !DILexicalBlock(scope: !122, file: !74, line: 23, column: 33)
!137 = !DILocation(line: 23, column: 33, scope: !138)
!138 = distinct !DILexicalBlock(scope: !136, file: !74, line: 23, column: 33)
!139 = !DILocation(line: 23, column: 33, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !74, line: 23, column: 33)
!141 = distinct !DILexicalBlock(scope: !138, file: !74, line: 23, column: 33)
!142 = !DILocation(line: 23, column: 33, scope: !141)
!143 = !DILocation(line: 23, column: 33, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !74, line: 23, column: 33)
!145 = !DILocation(line: 24, column: 28, scope: !84)
!146 = !DILocation(line: 25, column: 10, scope: !84)
!147 = !DILocation(line: 0, scope: !84)
!148 = !DILocation(line: 0, scope: !92)
!149 = !DILocation(line: 25, column: 58, scope: !150)
!150 = distinct !DILexicalBlock(scope: !92, file: !74, line: 25, column: 58)
!151 = !DILocation(line: 25, column: 58, scope: !92)
!152 = !{!"branch_weights", i32 2000, i32 1}
!153 = !DILocation(line: 26, column: 10, scope: !84)
!154 = !DILocation(line: 0, scope: !94)
!155 = !DILocation(line: 26, column: 58, scope: !156)
!156 = distinct !DILexicalBlock(scope: !94, file: !74, line: 26, column: 58)
!157 = !DILocation(line: 26, column: 58, scope: !94)
!158 = !DILocation(line: 27, column: 10, scope: !84)
!159 = !DILocation(line: 0, scope: !96)
!160 = !DILocation(line: 27, column: 61, scope: !161)
!161 = distinct !DILexicalBlock(scope: !96, file: !74, line: 27, column: 61)
!162 = !DILocation(line: 27, column: 61, scope: !96)
!163 = !DILocation(line: 28, column: 3, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !74, line: 28, column: 3)
!165 = distinct !DILexicalBlock(scope: !166, file: !74, line: 28, column: 3)
!166 = distinct !DILexicalBlock(scope: !84, file: !74, line: 28, column: 3)
!167 = !DILocation(line: 28, column: 3, scope: !165)
!168 = !DILocation(line: 28, column: 3, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !74, line: 28, column: 3)
!170 = distinct !DILexicalBlock(scope: !164, file: !74, line: 28, column: 3)
!171 = !DILocation(line: 28, column: 3, scope: !170)
!172 = !DILocation(line: 28, column: 3, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !74, line: 28, column: 3)
!174 = distinct !DILexicalBlock(scope: !169, file: !74, line: 28, column: 3)
!175 = !DILocation(line: 28, column: 3, scope: !174)
!176 = !DILocation(line: 28, column: 3, scope: !177)
!177 = distinct !DILexicalBlock(scope: !173, file: !74, line: 28, column: 3)
!178 = !DILocation(line: 28, column: 3, scope: !179)
!179 = distinct !DILexicalBlock(scope: !169, file: !74, line: 28, column: 3)
!180 = !DILocation(line: 28, column: 3, scope: !181)
!181 = distinct !DILexicalBlock(scope: !179, file: !74, line: 28, column: 3)
!182 = !DILocation(line: 28, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !74, line: 28, column: 3)
!184 = distinct !DILexicalBlock(scope: !181, file: !74, line: 28, column: 3)
!185 = !DILocation(line: 28, column: 3, scope: !184)
!186 = !DILocation(line: 28, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !183, file: !74, line: 28, column: 3)
!188 = !DILocation(line: 29, column: 1, scope: !84)
!189 = distinct !DISubprogram(name: "DMFieldRegister", scope: !74, file: !74, line: 55, type: !190, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !482)
!190 = !DISubroutineType(types: !191)
!191 = !{!87, !60, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!87, !195}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !196, line: 165, baseType: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !199, line: 24, size: 5376, elements: !200)
!199 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmfieldimpl.h", directory: "/home/users/ndemeye/xSDK")
!200 = !{!201, !396, !474, !478, !480, !481}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !198, file: !199, line: 25, baseType: !202, size: 4480)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !203, line: 122, baseType: !204)
!203 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !203, line: 73, size: 4480, elements: !205)
!205 = !{!206, !208, !252, !253, !255, !258, !259, !260, !261, !269, !270, !272, !273, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !292, !294, !295, !297, !299, !300, !301, !302, !303, !306, !308, !309, !310, !311, !312, !315, !317, !318, !319, !329, !331, !332, !336, !337, !386, !391, !393, !394, !395}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !204, file: !203, line: 74, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !88)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !204, file: !203, line: 75, baseType: !209, size: 448, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 448, elements: !250)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !203, line: 53, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 45, size: 448, elements: !212)
!212 = !{!213, !220, !228, !233, !237, !241, !245}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !211, file: !203, line: 46, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!87, !217, !219}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !211, file: !203, line: 47, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!87, !217, !224}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !225, line: 16, baseType: !226)
!225 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !225, line: 16, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !211, file: !203, line: 48, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!87, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !211, file: !203, line: 49, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!87, !217, !60, !217}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !211, file: !203, line: 50, baseType: !238, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!87, !217, !60, !232}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !211, file: !203, line: 51, baseType: !242, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!87, !217, !60, !70}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !211, file: !203, line: 52, baseType: !246, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!87, !217, !60, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!250 = !{!251}
!251 = !DISubrange(count: 1)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !204, file: !203, line: 76, baseType: !63, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !203, line: 77, baseType: !254, size: 32, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !88)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !204, file: !203, line: 78, baseType: !256, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !257)
!257 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !204, file: !203, line: 78, baseType: !256, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !204, file: !203, line: 78, baseType: !256, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !204, file: !203, line: 78, baseType: !256, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !204, file: !203, line: 79, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !265, line: 27, baseType: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !267, line: 43, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !204, file: !203, line: 80, baseType: !254, size: 32, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !204, file: !203, line: 81, baseType: !271, size: 32, offset: 992)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !88)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !204, file: !203, line: 82, baseType: !75, size: 64, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !204, file: !203, line: 83, baseType: !274, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !204, file: !203, line: 84, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !204, file: !203, line: 85, baseType: !278, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !204, file: !203, line: 86, baseType: !278, size: 64, offset: 1280)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !204, file: !203, line: 87, baseType: !278, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !204, file: !203, line: 88, baseType: !217, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !204, file: !203, line: 89, baseType: !262, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !203, line: 90, baseType: !278, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !204, file: !203, line: 91, baseType: !278, size: 64, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !204, file: !203, line: 92, baseType: !254, size: 32, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !204, file: !203, line: 93, baseType: !67, size: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !204, file: !203, line: 94, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !263)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !204, file: !203, line: 95, baseType: !254, size: 32, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !204, file: !203, line: 95, baseType: !254, size: 32, offset: 1888)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !204, file: !203, line: 96, baseType: !293, size: 64, offset: 1920)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !204, file: !203, line: 96, baseType: !293, size: 64, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !204, file: !203, line: 97, baseType: !296, size: 64, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !204, file: !203, line: 97, baseType: !298, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !204, file: !203, line: 98, baseType: !254, size: 32, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !204, file: !203, line: 98, baseType: !254, size: 32, offset: 2208)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !204, file: !203, line: 99, baseType: !293, size: 64, offset: 2240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !204, file: !203, line: 99, baseType: !293, size: 64, offset: 2304)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !204, file: !203, line: 100, baseType: !304, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !257)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !204, file: !203, line: 100, baseType: !307, size: 64, offset: 2432)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !204, file: !203, line: 101, baseType: !254, size: 32, offset: 2496)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !204, file: !203, line: 101, baseType: !254, size: 32, offset: 2528)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !204, file: !203, line: 102, baseType: !293, size: 64, offset: 2560)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !204, file: !203, line: 102, baseType: !293, size: 64, offset: 2624)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !204, file: !203, line: 103, baseType: !313, size: 64, offset: 2688)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !305)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !204, file: !203, line: 103, baseType: !316, size: 64, offset: 2752)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !204, file: !203, line: 104, baseType: !249, size: 64, offset: 2816)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !204, file: !203, line: 105, baseType: !254, size: 32, offset: 2880)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !204, file: !203, line: 106, baseType: !320, size: 128, offset: 2944)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, elements: !327)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !203, line: 64, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 61, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !323, file: !203, line: 62, baseType: !70, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !323, file: !203, line: 63, baseType: !67, size: 64, offset: 64)
!327 = !{!328}
!328 = !DISubrange(count: 2)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !204, file: !203, line: 107, baseType: !330, size: 64, offset: 3072)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !327)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !204, file: !203, line: 108, baseType: !67, size: 64, offset: 3136)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !204, file: !203, line: 109, baseType: !333, size: 64, offset: 3200)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!87, !67}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !204, file: !203, line: 111, baseType: !254, size: 32, offset: 3264)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !204, file: !203, line: 112, baseType: !338, size: 320, offset: 3328)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!87, !342, !217, !67}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !345)
!345 = !{!346, !347, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !344, file: !12, line: 100, baseType: !254, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !12, line: 101, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !359, !360, !361, !365, !367, !369, !370, !371}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !350, file: !12, line: 84, baseType: !278, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !350, file: !12, line: 85, baseType: !278, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !12, line: 86, baseType: !67, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !350, file: !12, line: 87, baseType: !75, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !350, file: !12, line: 88, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !350, file: !12, line: 89, baseType: !62, size: 8, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !350, file: !12, line: 90, baseType: !278, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !350, file: !12, line: 91, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !363, line: 46, baseType: !364)
!363 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!364 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !350, file: !12, line: 92, baseType: !366, size: 32, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !12, line: 93, baseType: !368, size: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !12, line: 94, baseType: !348, size: 64, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !350, file: !12, line: 95, baseType: !278, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !350, file: !12, line: 96, baseType: !67, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !344, file: !12, line: 102, baseType: !278, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !344, file: !12, line: 102, baseType: !278, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !344, file: !12, line: 103, baseType: !278, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !344, file: !12, line: 104, baseType: !63, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !344, file: !12, line: 106, baseType: !217, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !344, file: !12, line: 107, baseType: !381, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!384 = !{!385}
!385 = !DISubrange(count: 5)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !204, file: !203, line: 113, baseType: !387, size: 320, offset: 3648)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 320, elements: !384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!87, !217, !67}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !204, file: !203, line: 114, baseType: !392, size: 320, offset: 3968)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, elements: !384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !204, file: !203, line: 115, baseType: !366, size: 32, offset: 4288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !204, file: !203, line: 120, baseType: !381, size: 64, offset: 4352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !204, file: !203, line: 121, baseType: !366, size: 32, offset: 4416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !198, file: !199, line: 25, baseType: !397, size: 704, offset: 4480)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 704, elements: !250)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMFieldOps", file: !199, line: 11, size: 704, elements: !399)
!399 = !{!400, !401, !402, !406, !407, !411, !420, !432, !436, !440, !445}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !398, file: !199, line: 12, baseType: !192, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !398, file: !199, line: 13, baseType: !192, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !398, file: !199, line: 14, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!87, !342, !195}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !398, file: !199, line: 15, baseType: !192, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !398, file: !199, line: 16, baseType: !408, size: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!87, !195, !224}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate", scope: !398, file: !199, line: 17, baseType: !412, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!87, !195, !415, !419, !67, !67, !67}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !416, line: 21, baseType: !417)
!416 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !416, line: 21, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !6, line: 389, baseType: !26)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "evaluateFE", scope: !398, file: !199, line: 18, baseType: !421, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!87, !195, !424, !428, !419, !67, !67, !67}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !425, line: 11, baseType: !426)
!425 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !425, line: 11, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscQuadrature", file: !429, line: 18, baseType: !430)
!429 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscQuadrature", file: !429, line: 18, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "evaluateFV", scope: !398, file: !199, line: 19, baseType: !433, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!87, !195, !424, !419, !67, !67, !67}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "getDegree", scope: !398, file: !199, line: 20, baseType: !437, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!87, !195, !424, !296, !296}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "createDefaultQuadrature", scope: !398, file: !199, line: 21, baseType: !441, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!87, !195, !424, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "computeFaceData", scope: !398, file: !199, line: 22, baseType: !446, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!87, !195, !424, !428, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFEGeom", file: !451, line: 28, baseType: !452)
!451 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfe.h", directory: "/home/users/ndemeye/xSDK")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFEGeom", file: !451, line: 11, size: 1024, elements: !453)
!453 = !{!454, !457, !458, !459, !460, !461, !462, !464, !466, !467, !468, !469, !470, !471, !472, !473}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !452, file: !451, line: 12, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !452, file: !451, line: 13, baseType: !304, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "J", scope: !452, file: !451, line: 14, baseType: !304, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "invJ", scope: !452, file: !451, line: 15, baseType: !304, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "detJ", scope: !452, file: !451, line: 16, baseType: !304, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !452, file: !451, line: 17, baseType: !304, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !452, file: !451, line: 18, baseType: !463, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "suppJ", scope: !452, file: !451, line: 19, baseType: !465, size: 128, offset: 448)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !327)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "suppInvJ", scope: !452, file: !451, line: 20, baseType: !465, size: 128, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "suppDetJ", scope: !452, file: !451, line: 21, baseType: !465, size: 128, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !452, file: !451, line: 22, baseType: !254, size: 32, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !452, file: !451, line: 23, baseType: !254, size: 32, offset: 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "numCells", scope: !452, file: !451, line: 24, baseType: !254, size: 32, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !452, file: !451, line: 25, baseType: !254, size: 32, offset: 928)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "isAffine", scope: !452, file: !451, line: 26, baseType: !366, size: 32, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !452, file: !451, line: 27, baseType: !366, size: 32, offset: 992)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !198, file: !199, line: 26, baseType: !475, size: 64, offset: 5184)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !196, line: 14, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !196, line: 14, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "continuity", scope: !198, file: !199, line: 27, baseType: !479, size: 32, offset: 5248)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFieldContinuity", file: !47, line: 27, baseType: !46)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "numComponents", scope: !198, file: !199, line: 28, baseType: !254, size: 32, offset: 5280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !199, line: 29, baseType: !67, size: 64, offset: 5312)
!482 = !{!483, !484, !485, !486}
!483 = !DILocalVariable(name: "sname", arg: 1, scope: !189, file: !74, line: 55, type: !60)
!484 = !DILocalVariable(name: "function", arg: 2, scope: !189, file: !74, line: 55, type: !192)
!485 = !DILocalVariable(name: "ierr", scope: !189, file: !74, line: 57, type: !87)
!486 = !DILocalVariable(name: "ierr__", scope: !487, file: !74, line: 60, type: !87)
!487 = distinct !DILexicalBlock(scope: !189, file: !74, line: 60, column: 60)
!488 = !DILocation(line: 0, scope: !189)
!489 = !DILocation(line: 59, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !491, file: !74, line: 59, column: 3)
!491 = distinct !DILexicalBlock(scope: !492, file: !74, line: 59, column: 3)
!492 = distinct !DILexicalBlock(scope: !189, file: !74, line: 59, column: 3)
!493 = !DILocation(line: 59, column: 3, scope: !491)
!494 = !DILocation(line: 59, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !74, line: 59, column: 3)
!496 = distinct !DILexicalBlock(scope: !490, file: !74, line: 59, column: 3)
!497 = !DILocation(line: 59, column: 3, scope: !496)
!498 = !DILocation(line: 59, column: 3, scope: !499)
!499 = distinct !DILexicalBlock(scope: !495, file: !74, line: 59, column: 3)
!500 = !DILocation(line: 60, column: 10, scope: !189)
!501 = !DILocation(line: 0, scope: !487)
!502 = !DILocation(line: 60, column: 60, scope: !503)
!503 = distinct !DILexicalBlock(scope: !487, file: !74, line: 60, column: 60)
!504 = !DILocation(line: 60, column: 60, scope: !487)
!505 = !DILocation(line: 61, column: 3, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !74, line: 61, column: 3)
!507 = distinct !DILexicalBlock(scope: !508, file: !74, line: 61, column: 3)
!508 = distinct !DILexicalBlock(scope: !189, file: !74, line: 61, column: 3)
!509 = !DILocation(line: 61, column: 3, scope: !507)
!510 = !DILocation(line: 61, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !74, line: 61, column: 3)
!512 = distinct !DILexicalBlock(scope: !506, file: !74, line: 61, column: 3)
!513 = !DILocation(line: 61, column: 3, scope: !512)
!514 = !DILocation(line: 61, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !74, line: 61, column: 3)
!516 = distinct !DILexicalBlock(scope: !511, file: !74, line: 61, column: 3)
!517 = !DILocation(line: 61, column: 3, scope: !516)
!518 = !DILocation(line: 61, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !74, line: 61, column: 3)
!520 = !DILocation(line: 61, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !511, file: !74, line: 61, column: 3)
!522 = !DILocation(line: 61, column: 3, scope: !523)
!523 = distinct !DILexicalBlock(scope: !521, file: !74, line: 61, column: 3)
!524 = !DILocation(line: 61, column: 3, scope: !525)
!525 = distinct !DILexicalBlock(scope: !526, file: !74, line: 61, column: 3)
!526 = distinct !DILexicalBlock(scope: !523, file: !74, line: 61, column: 3)
!527 = !DILocation(line: 61, column: 3, scope: !526)
!528 = !DILocation(line: 61, column: 3, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !74, line: 61, column: 3)
!530 = !DILocation(line: 62, column: 1, scope: !189)
!531 = !DISubprogram(name: "PetscError", scope: !54, file: !54, line: 668, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!87, !65, !88, !60, !60, !88, !53, !60, null}
!534 = !{}
!535 = !DISubprogram(name: "PetscFunctionListAdd_Private", scope: !69, file: !69, line: 1564, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !534)
!536 = !DISubroutineType(types: !537)
!537 = !{!88, !538, !60, !70}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
