; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipecg2/pipecg2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipecg2/pipecg2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !{!121, !125, !126, !129, !329, !332, !211, !26, !201, !335, !5, !249}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !122, line: 330, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !122, line: 330, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !132, line: 73, size: 4480, elements: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!133 = !{!134, !136, !182, !183, !185, !188, !189, !190, !191, !199, !200, !202, !206, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !223, !224, !225, !227, !228, !230, !232, !233, !234, !235, !236, !239, !241, !242, !243, !244, !245, !248, !250, !251, !252, !262, !264, !265, !269, !270, !319, !324, !326, !327, !328}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !131, file: !132, line: 74, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !131, file: !132, line: 75, baseType: !137, size: 448, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 448, elements: !180)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !132, line: 53, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 45, size: 448, elements: !140)
!140 = !{!141, !147, !155, !160, !164, !168, !175}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !139, file: !132, line: 46, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !129, !146}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !139, file: !132, line: 47, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!145, !129, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !152, line: 16, baseType: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !152, line: 16, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !139, file: !132, line: 48, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!145, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !139, file: !132, line: 49, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!145, !129, !126, !129}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !139, file: !132, line: 50, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!145, !129, !126, !159}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !139, file: !132, line: 51, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!145, !129, !126, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !139, file: !132, line: 52, baseType: !176, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!145, !129, !126, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !131, file: !132, line: 76, baseType: !121, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !132, line: 77, baseType: !184, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !131, file: !132, line: 78, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !187)
!187 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !131, file: !132, line: 78, baseType: !186, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !131, file: !132, line: 78, baseType: !186, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !131, file: !132, line: 78, baseType: !186, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !132, line: 79, baseType: !192, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !195, line: 27, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !197, line: 43, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !131, file: !132, line: 80, baseType: !184, size: 32, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !131, file: !132, line: 81, baseType: !201, size: 32, offset: 992)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !131, file: !132, line: 82, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !131, file: !132, line: 83, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !131, file: !132, line: 84, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !131, file: !132, line: 85, baseType: !211, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !131, file: !132, line: 86, baseType: !211, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !131, file: !132, line: 87, baseType: !211, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !131, file: !132, line: 88, baseType: !129, size: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !131, file: !132, line: 89, baseType: !192, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 90, baseType: !211, size: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !131, file: !132, line: 91, baseType: !211, size: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !131, file: !132, line: 92, baseType: !184, size: 32, offset: 1664)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !131, file: !132, line: 93, baseType: !125, size: 64, offset: 1728)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !131, file: !132, line: 94, baseType: !222, size: 64, offset: 1792)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !193)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !131, file: !132, line: 95, baseType: !184, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !131, file: !132, line: 95, baseType: !184, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !131, file: !132, line: 96, baseType: !226, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !131, file: !132, line: 96, baseType: !226, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !131, file: !132, line: 97, baseType: !229, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !131, file: !132, line: 97, baseType: !231, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !131, file: !132, line: 98, baseType: !184, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !131, file: !132, line: 98, baseType: !184, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !131, file: !132, line: 99, baseType: !226, size: 64, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !131, file: !132, line: 99, baseType: !226, size: 64, offset: 2304)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !131, file: !132, line: 100, baseType: !237, size: 64, offset: 2368)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !187)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !131, file: !132, line: 100, baseType: !240, size: 64, offset: 2432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !131, file: !132, line: 101, baseType: !184, size: 32, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !131, file: !132, line: 101, baseType: !184, size: 32, offset: 2528)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !131, file: !132, line: 102, baseType: !226, size: 64, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !131, file: !132, line: 102, baseType: !226, size: 64, offset: 2624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !131, file: !132, line: 103, baseType: !246, size: 64, offset: 2688)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !131, file: !132, line: 103, baseType: !249, size: 64, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !131, file: !132, line: 104, baseType: !179, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !131, file: !132, line: 105, baseType: !184, size: 32, offset: 2880)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !131, file: !132, line: 106, baseType: !253, size: 128, offset: 2944)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !260)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !132, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 61, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !132, line: 62, baseType: !172, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !256, file: !132, line: 63, baseType: !125, size: 64, offset: 64)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !131, file: !132, line: 107, baseType: !263, size: 64, offset: 3072)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !131, file: !132, line: 108, baseType: !125, size: 64, offset: 3136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !131, file: !132, line: 109, baseType: !266, size: 64, offset: 3200)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!145, !125}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !131, file: !132, line: 111, baseType: !184, size: 32, offset: 3264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !131, file: !132, line: 112, baseType: !271, size: 320, offset: 3328)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !317)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!145, !275, !129, !125}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !278)
!278 = !{!279, !280, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !10, line: 100, baseType: !184, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !10, line: 101, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !298, !300, !302, !303, !304}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !10, line: 84, baseType: !211, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !283, file: !10, line: 85, baseType: !211, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !10, line: 86, baseType: !125, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !283, file: !10, line: 87, baseType: !203, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !10, line: 88, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !283, file: !10, line: 89, baseType: !128, size: 8, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !283, file: !10, line: 90, baseType: !211, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !283, file: !10, line: 91, baseType: !295, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 46, baseType: !297)
!296 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !10, line: 92, baseType: !299, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !10, line: 93, baseType: !301, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !10, line: 94, baseType: !281, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !283, file: !10, line: 95, baseType: !211, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !283, file: !10, line: 96, baseType: !125, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !10, line: 102, baseType: !211, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !277, file: !10, line: 102, baseType: !211, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !277, file: !10, line: 103, baseType: !211, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !10, line: 104, baseType: !121, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !277, file: !10, line: 106, baseType: !129, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !10, line: 107, baseType: !314, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !131, file: !132, line: 113, baseType: !320, size: 320, offset: 3648)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!145, !129, !125}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !131, file: !132, line: 114, baseType: !325, size: 320, offset: 3968)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 320, elements: !317)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !131, file: !132, line: 115, baseType: !299, size: 32, offset: 4288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !131, file: !132, line: 120, baseType: !314, size: 64, offset: 4352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !131, file: !132, line: 121, baseType: !299, size: 32, offset: 4416)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !122, line: 331, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !122, line: 331, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !122, line: 338, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !122, line: 338, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!338 = !{i32 7, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{i32 7, !"PIC Level", i32 2}
!342 = !{i32 7, !"uwtable", i32 1}
!343 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!344 = distinct !DISubprogram(name: "KSPCreate_PIPECG2", scope: !345, file: !345, line: 719, type: !346, scopeLine: 720, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !591)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipecg2/pipecg2.c", directory: "/home/users/ndemeye/xSDK")
!346 = !DISubroutineType(types: !347)
!347 = !{!145, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !351)
!351 = !{!352, !354, !406, !411, !412, !413, !414, !444, !445, !446, !447, !448, !450, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !484, !490, !491, !492, !493, !498, !499, !500, !501, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !561, !562, !563, !564, !565, !572, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !588, !589, !590}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !350, file: !102, line: 76, baseType: !353, size: 4480)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !132, line: 122, baseType: !131)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !350, file: !102, line: 76, baseType: !355, size: 896, offset: 4480)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 896, elements: !180)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !357)
!357 = !{!358, !367, !371, !373, !381, !382, !386, !387, !391, !395, !399, !400, !404, !405}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !356, file: !102, line: 19, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!145, !348, !362, !366}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !363, line: 21, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !363, line: 21, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !356, file: !102, line: 22, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!145, !348, !362, !362, !366}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !356, file: !102, line: 25, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !356, file: !102, line: 26, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!145, !348, !377, !377}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !378, line: 16, baseType: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !378, line: 16, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !356, file: !102, line: 27, baseType: !372, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !356, file: !102, line: 28, baseType: !383, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!145, !275, !348}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !356, file: !102, line: 29, baseType: !372, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !356, file: !102, line: 30, baseType: !388, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!145, !348, !237, !237}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !356, file: !102, line: 31, baseType: !392, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!145, !348, !184, !237, !237, !229}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !356, file: !102, line: 32, baseType: !396, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!145, !348, !299, !299, !229, !366, !237, !237}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !356, file: !102, line: 33, baseType: !372, size: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !356, file: !102, line: 34, baseType: !401, size: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!145, !348, !151}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !356, file: !102, line: 35, baseType: !372, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !356, file: !102, line: 36, baseType: !401, size: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !350, file: !102, line: 77, baseType: !407, size: 64, offset: 5376)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !408, line: 14, baseType: !409)
!408 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !408, line: 14, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !350, file: !102, line: 78, baseType: !299, size: 32, offset: 5440)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !350, file: !102, line: 79, baseType: !299, size: 32, offset: 5472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !350, file: !102, line: 81, baseType: !184, size: 32, offset: 5504)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !350, file: !102, line: 82, baseType: !415, size: 64, offset: 5568)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !418)
!418 = !{!419, !420, !440, !441, !442, !443}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !417, file: !102, line: 55, baseType: !353, size: 4480)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !417, file: !102, line: 55, baseType: !421, size: 448, offset: 4480)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 448, elements: !180)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !423)
!423 = !{!424, !428, !429, !433, !434, !435, !439}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !422, file: !102, line: 42, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!145, !415, !362, !362}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !422, file: !102, line: 43, baseType: !425, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !422, file: !102, line: 44, baseType: !430, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!145, !415}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !422, file: !102, line: 45, baseType: !430, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !422, file: !102, line: 46, baseType: !430, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !422, file: !102, line: 47, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!145, !415, !151}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !422, file: !102, line: 48, baseType: !430, size: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !417, file: !102, line: 56, baseType: !348, size: 64, offset: 4928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !417, file: !102, line: 57, baseType: !377, size: 64, offset: 4992)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !417, file: !102, line: 58, baseType: !222, size: 64, offset: 5056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !102, line: 59, baseType: !125, size: 64, offset: 5120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !350, file: !102, line: 83, baseType: !299, size: 32, offset: 5632)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !350, file: !102, line: 84, baseType: !299, size: 32, offset: 5664)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !350, file: !102, line: 85, baseType: !299, size: 32, offset: 5696)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !350, file: !102, line: 86, baseType: !299, size: 32, offset: 5728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !350, file: !102, line: 87, baseType: !449, size: 32, offset: 5760)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !350, file: !102, line: 88, baseType: !451, size: 384, offset: 5792)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 384, elements: !452)
!452 = !{!453, !454}
!453 = !DISubrange(count: 4)
!454 = !DISubrange(count: 3)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !350, file: !102, line: 89, baseType: !238, size: 64, offset: 6208)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !350, file: !102, line: 90, baseType: !238, size: 64, offset: 6272)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !350, file: !102, line: 91, baseType: !238, size: 64, offset: 6336)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !350, file: !102, line: 92, baseType: !238, size: 64, offset: 6400)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !350, file: !102, line: 93, baseType: !238, size: 64, offset: 6464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !350, file: !102, line: 94, baseType: !238, size: 64, offset: 6528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !350, file: !102, line: 95, baseType: !462, size: 32, offset: 6592)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !350, file: !102, line: 96, baseType: !299, size: 32, offset: 6624)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !350, file: !102, line: 98, baseType: !362, size: 64, offset: 6656)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !350, file: !102, line: 98, baseType: !362, size: 64, offset: 6720)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !350, file: !102, line: 102, baseType: !237, size: 64, offset: 6784)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !350, file: !102, line: 103, baseType: !237, size: 64, offset: 6848)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !350, file: !102, line: 104, baseType: !184, size: 32, offset: 6912)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !350, file: !102, line: 105, baseType: !184, size: 32, offset: 6944)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !350, file: !102, line: 106, baseType: !299, size: 32, offset: 6976)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !350, file: !102, line: 107, baseType: !237, size: 64, offset: 7040)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !350, file: !102, line: 108, baseType: !237, size: 64, offset: 7104)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !350, file: !102, line: 109, baseType: !184, size: 32, offset: 7168)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !350, file: !102, line: 110, baseType: !184, size: 32, offset: 7200)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !350, file: !102, line: 111, baseType: !299, size: 32, offset: 7232)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !350, file: !102, line: 113, baseType: !184, size: 32, offset: 7264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !350, file: !102, line: 114, baseType: !299, size: 32, offset: 7296)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !350, file: !102, line: 117, baseType: !184, size: 32, offset: 7328)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !350, file: !102, line: 120, baseType: !480, size: 320, offset: 7360)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 320, elements: !317)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!145, !348, !184, !238, !125}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !350, file: !102, line: 121, baseType: !485, size: 320, offset: 7680)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !317)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!145, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !350, file: !102, line: 122, baseType: !325, size: 320, offset: 8000)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !350, file: !102, line: 123, baseType: !184, size: 32, offset: 8320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !350, file: !102, line: 124, baseType: !299, size: 32, offset: 8352)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !350, file: !102, line: 126, baseType: !494, size: 320, offset: 8384)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 320, elements: !317)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!145, !348, !125}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !350, file: !102, line: 127, baseType: !485, size: 320, offset: 8704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !350, file: !102, line: 128, baseType: !325, size: 320, offset: 9024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !350, file: !102, line: 129, baseType: !184, size: 32, offset: 9344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !350, file: !102, line: 131, baseType: !502, size: 64, offset: 9408)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!145, !348, !184, !238, !505, !125}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !350, file: !102, line: 132, baseType: !266, size: 64, offset: 9472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !350, file: !102, line: 133, baseType: !125, size: 64, offset: 9536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !350, file: !102, line: 135, baseType: !125, size: 64, offset: 9600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !350, file: !102, line: 137, baseType: !510, size: 64, offset: 9664)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !102, line: 139, baseType: !125, size: 64, offset: 9728)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9792)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9824)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9888)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9920)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9952)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 9984)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10016)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10048)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10080)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10112)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10144)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !350, file: !102, line: 142, baseType: !299, size: 32, offset: 10208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10368)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10432)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10496)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10560)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10624)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10688)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10752)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10816)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10880)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 10944)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 11008)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !350, file: !102, line: 143, baseType: !151, size: 64, offset: 11072)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11136)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11168)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11200)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11232)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11264)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11296)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11328)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11360)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11392)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11424)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11456)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11488)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !350, file: !102, line: 144, baseType: !543, size: 32, offset: 11552)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !350, file: !102, line: 147, baseType: !184, size: 32, offset: 11584)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !350, file: !102, line: 148, baseType: !366, size: 64, offset: 11648)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !350, file: !102, line: 150, baseType: !560, size: 32, offset: 11712)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !350, file: !102, line: 151, baseType: !299, size: 32, offset: 11744)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !350, file: !102, line: 153, baseType: !184, size: 32, offset: 11776)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !350, file: !102, line: 154, baseType: !184, size: 32, offset: 11808)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !350, file: !102, line: 156, baseType: !299, size: 32, offset: 11840)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !350, file: !102, line: 161, baseType: !566, size: 192, offset: 11904)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !350, file: !102, line: 157, size: 192, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !566, file: !102, line: 158, baseType: !377, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !566, file: !102, line: 158, baseType: !377, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !566, file: !102, line: 159, baseType: !299, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !566, file: !102, line: 160, baseType: !299, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !350, file: !102, line: 163, baseType: !573, size: 32, offset: 12096)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !350, file: !102, line: 165, baseType: !449, size: 32, offset: 12128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !350, file: !102, line: 166, baseType: !573, size: 32, offset: 12160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !350, file: !102, line: 171, baseType: !299, size: 32, offset: 12192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !350, file: !102, line: 172, baseType: !299, size: 32, offset: 12224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !350, file: !102, line: 173, baseType: !299, size: 32, offset: 12256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !350, file: !102, line: 174, baseType: !362, size: 64, offset: 12288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !350, file: !102, line: 175, baseType: !362, size: 64, offset: 12352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !350, file: !102, line: 177, baseType: !184, size: 32, offset: 12416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !350, file: !102, line: 178, baseType: !299, size: 32, offset: 12448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !350, file: !102, line: 180, baseType: !151, size: 64, offset: 12480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !350, file: !102, line: 182, baseType: !585, size: 64, offset: 12544)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!145, !348, !362, !362, !125}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !350, file: !102, line: 183, baseType: !585, size: 64, offset: 12608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !350, file: !102, line: 184, baseType: !125, size: 64, offset: 12672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !350, file: !102, line: 184, baseType: !125, size: 64, offset: 12736)
!591 = !{!592, !593, !594, !596, !598, !600}
!592 = !DILocalVariable(name: "ksp", arg: 1, scope: !344, file: !345, line: 719, type: !348)
!593 = !DILocalVariable(name: "ierr", scope: !344, file: !345, line: 721, type: !145)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !345, line: 724, type: !145)
!595 = distinct !DILexicalBlock(scope: !344, file: !345, line: 724, column: 71)
!596 = !DILocalVariable(name: "ierr__", scope: !597, file: !345, line: 725, type: !145)
!597 = distinct !DILexicalBlock(scope: !344, file: !345, line: 725, column: 69)
!598 = !DILocalVariable(name: "ierr__", scope: !599, file: !345, line: 726, type: !145)
!599 = distinct !DILexicalBlock(scope: !344, file: !345, line: 726, column: 62)
!600 = !DILocalVariable(name: "ierr__", scope: !601, file: !345, line: 727, type: !145)
!601 = distinct !DILexicalBlock(scope: !344, file: !345, line: 727, column: 59)
!602 = !DILocation(line: 0, scope: !344)
!603 = !DILocation(line: 723, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !345, line: 723, column: 3)
!605 = distinct !DILexicalBlock(scope: !606, file: !345, line: 723, column: 3)
!606 = distinct !DILexicalBlock(scope: !344, file: !345, line: 723, column: 3)
!607 = !{!608, !608, i64 0}
!608 = !{!"any pointer", !609, i64 0}
!609 = !{!"omnipotent char", !610, i64 0}
!610 = !{!"Simple C/C++ TBAA"}
!611 = !DILocation(line: 723, column: 3, scope: !605)
!612 = !DILocation(line: 723, column: 3, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !345, line: 723, column: 3)
!614 = distinct !DILexicalBlock(scope: !604, file: !345, line: 723, column: 3)
!615 = !{!616, !617, i64 1536}
!616 = !{!"", !609, i64 0, !609, i64 512, !609, i64 1024, !609, i64 1280, !617, i64 1536, !617, i64 1540, !609, i64 1544}
!617 = !{!"int", !609, i64 0}
!618 = !DILocation(line: 723, column: 3, scope: !614)
!619 = !DILocation(line: 723, column: 3, scope: !620)
!620 = distinct !DILexicalBlock(scope: !613, file: !345, line: 723, column: 3)
!621 = !{!617, !617, i64 0}
!622 = !{!616, !617, i64 1540}
!623 = !DILocation(line: 724, column: 10, scope: !344)
!624 = !DILocation(line: 0, scope: !595)
!625 = !DILocation(line: 724, column: 71, scope: !626)
!626 = distinct !DILexicalBlock(scope: !595, file: !345, line: 724, column: 71)
!627 = !DILocation(line: 724, column: 71, scope: !595)
!628 = !{!"branch_weights", i32 2000, i32 1}
!629 = !DILocation(line: 725, column: 10, scope: !344)
!630 = !DILocation(line: 0, scope: !597)
!631 = !DILocation(line: 725, column: 69, scope: !632)
!632 = distinct !DILexicalBlock(scope: !597, file: !345, line: 725, column: 69)
!633 = !DILocation(line: 725, column: 69, scope: !597)
!634 = !DILocation(line: 726, column: 10, scope: !344)
!635 = !DILocation(line: 0, scope: !599)
!636 = !DILocation(line: 726, column: 62, scope: !637)
!637 = distinct !DILexicalBlock(scope: !599, file: !345, line: 726, column: 62)
!638 = !DILocation(line: 726, column: 62, scope: !599)
!639 = !DILocation(line: 727, column: 10, scope: !344)
!640 = !DILocation(line: 0, scope: !601)
!641 = !DILocation(line: 727, column: 59, scope: !642)
!642 = distinct !DILexicalBlock(scope: !601, file: !345, line: 727, column: 59)
!643 = !DILocation(line: 727, column: 59, scope: !601)
!644 = !DILocation(line: 729, column: 13, scope: !344)
!645 = !DILocation(line: 729, column: 28, scope: !344)
!646 = !{!647, !608, i64 32}
!647 = !{!"_KSPOps", !608, i64 0, !608, i64 8, !608, i64 16, !608, i64 24, !608, i64 32, !608, i64 40, !608, i64 48, !608, i64 56, !608, i64 64, !608, i64 72, !608, i64 80, !608, i64 88, !608, i64 96, !608, i64 104}
!648 = !DILocation(line: 730, column: 13, scope: !344)
!649 = !DILocation(line: 730, column: 28, scope: !344)
!650 = !{!647, !608, i64 16}
!651 = !DILocation(line: 731, column: 13, scope: !344)
!652 = !DILocation(line: 731, column: 28, scope: !344)
!653 = !{!647, !608, i64 80}
!654 = !DILocation(line: 732, column: 13, scope: !344)
!655 = !DILocation(line: 732, column: 28, scope: !344)
!656 = !{!647, !608, i64 88}
!657 = !DILocation(line: 733, column: 13, scope: !344)
!658 = !DILocation(line: 733, column: 28, scope: !344)
!659 = !{!647, !608, i64 40}
!660 = !DILocation(line: 734, column: 13, scope: !344)
!661 = !DILocation(line: 734, column: 28, scope: !344)
!662 = !{!647, !608, i64 0}
!663 = !DILocation(line: 735, column: 13, scope: !344)
!664 = !DILocation(line: 735, column: 28, scope: !344)
!665 = !{!647, !608, i64 8}
!666 = !DILocation(line: 736, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !345, line: 736, column: 3)
!668 = distinct !DILexicalBlock(scope: !669, file: !345, line: 736, column: 3)
!669 = distinct !DILexicalBlock(scope: !344, file: !345, line: 736, column: 3)
!670 = !DILocation(line: 736, column: 3, scope: !668)
!671 = !DILocation(line: 736, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !345, line: 736, column: 3)
!673 = distinct !DILexicalBlock(scope: !667, file: !345, line: 736, column: 3)
!674 = !DILocation(line: 736, column: 3, scope: !673)
!675 = !DILocation(line: 736, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !345, line: 736, column: 3)
!677 = distinct !DILexicalBlock(scope: !672, file: !345, line: 736, column: 3)
!678 = !{!616, !609, i64 1544}
!679 = !DILocation(line: 736, column: 3, scope: !677)
!680 = !DILocation(line: 736, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !676, file: !345, line: 736, column: 3)
!682 = !DILocation(line: 736, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !672, file: !345, line: 736, column: 3)
!684 = !DILocation(line: 736, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !683, file: !345, line: 736, column: 3)
!686 = !DILocation(line: 736, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !345, line: 736, column: 3)
!688 = distinct !DILexicalBlock(scope: !685, file: !345, line: 736, column: 3)
!689 = !DILocation(line: 736, column: 3, scope: !688)
!690 = !DILocation(line: 736, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !687, file: !345, line: 736, column: 3)
!692 = !DILocation(line: 737, column: 1, scope: !344)
!693 = !DISubprogram(name: "KSPSetSupportedNorm", scope: !33, file: !33, line: 496, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{!26, !349, !107, !24, !26}
!696 = !{}
!697 = !DISubprogram(name: "PetscError", scope: !115, file: !115, line: 668, type: !698, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !696)
!698 = !DISubroutineType(types: !699)
!699 = !{!145, !123, !26, !126, !126, !26, !114, !126, null}
!700 = distinct !DISubprogram(name: "KSPSetUp_PIPECG2", scope: !345, file: !345, line: 515, type: !346, scopeLine: 516, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !701)
!701 = !{!702, !703, !704}
!702 = !DILocalVariable(name: "ksp", arg: 1, scope: !700, file: !345, line: 515, type: !348)
!703 = !DILocalVariable(name: "ierr", scope: !700, file: !345, line: 517, type: !145)
!704 = !DILocalVariable(name: "ierr__", scope: !705, file: !345, line: 521, type: !145)
!705 = distinct !DILexicalBlock(scope: !700, file: !345, line: 521, column: 33)
!706 = !DILocation(line: 0, scope: !700)
!707 = !DILocation(line: 519, column: 3, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !345, line: 519, column: 3)
!709 = distinct !DILexicalBlock(scope: !710, file: !345, line: 519, column: 3)
!710 = distinct !DILexicalBlock(scope: !700, file: !345, line: 519, column: 3)
!711 = !DILocation(line: 519, column: 3, scope: !709)
!712 = !DILocation(line: 519, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !714, file: !345, line: 519, column: 3)
!714 = distinct !DILexicalBlock(scope: !708, file: !345, line: 519, column: 3)
!715 = !DILocation(line: 519, column: 3, scope: !714)
!716 = !DILocation(line: 519, column: 3, scope: !717)
!717 = distinct !DILexicalBlock(scope: !713, file: !345, line: 519, column: 3)
!718 = !DILocation(line: 521, column: 10, scope: !700)
!719 = !DILocation(line: 0, scope: !705)
!720 = !DILocation(line: 521, column: 33, scope: !721)
!721 = distinct !DILexicalBlock(scope: !705, file: !345, line: 521, column: 33)
!722 = !DILocation(line: 521, column: 33, scope: !705)
!723 = !DILocation(line: 522, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !345, line: 522, column: 3)
!725 = distinct !DILexicalBlock(scope: !726, file: !345, line: 522, column: 3)
!726 = distinct !DILexicalBlock(scope: !700, file: !345, line: 522, column: 3)
!727 = !DILocation(line: 522, column: 3, scope: !725)
!728 = !DILocation(line: 522, column: 3, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !345, line: 522, column: 3)
!730 = distinct !DILexicalBlock(scope: !724, file: !345, line: 522, column: 3)
!731 = !DILocation(line: 522, column: 3, scope: !730)
!732 = !DILocation(line: 522, column: 3, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !345, line: 522, column: 3)
!734 = distinct !DILexicalBlock(scope: !729, file: !345, line: 522, column: 3)
!735 = !DILocation(line: 522, column: 3, scope: !734)
!736 = !DILocation(line: 522, column: 3, scope: !737)
!737 = distinct !DILexicalBlock(scope: !733, file: !345, line: 522, column: 3)
!738 = !DILocation(line: 522, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !729, file: !345, line: 522, column: 3)
!740 = !DILocation(line: 522, column: 3, scope: !741)
!741 = distinct !DILexicalBlock(scope: !739, file: !345, line: 522, column: 3)
!742 = !DILocation(line: 522, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !744, file: !345, line: 522, column: 3)
!744 = distinct !DILexicalBlock(scope: !741, file: !345, line: 522, column: 3)
!745 = !DILocation(line: 522, column: 3, scope: !744)
!746 = !DILocation(line: 522, column: 3, scope: !747)
!747 = distinct !DILexicalBlock(scope: !743, file: !345, line: 522, column: 3)
!748 = !DILocation(line: 523, column: 1, scope: !700)
!749 = distinct !DISubprogram(name: "KSPSolve_PIPECG2", scope: !345, file: !345, line: 528, type: !346, scopeLine: 529, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !750)
!750 = !{!751, !752, !753, !754, !755, !757, !758, !759, !760, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !795, !804, !806, !808, !810, !812, !814, !816, !818, !820, !824, !826, !829, !831, !833, !835, !837, !843, !844, !846, !848, !850, !852, !854, !856, !858, !861, !862, !864, !866, !870, !871, !873, !876, !877, !879, !882, !883, !885, !888, !889, !891, !892, !893, !895, !898, !899, !901, !904, !905, !907, !910, !911, !913, !915, !917, !924, !927, !929, !932, !933, !935, !937, !939, !941, !943, !946, !947, !951, !953}
!751 = !DILocalVariable(name: "ksp", arg: 1, scope: !749, file: !345, line: 528, type: !348)
!752 = !DILocalVariable(name: "ierr", scope: !749, file: !345, line: 530, type: !145)
!753 = !DILocalVariable(name: "i", scope: !749, file: !345, line: 531, type: !184)
!754 = !DILocalVariable(name: "n", scope: !749, file: !345, line: 531, type: !184)
!755 = !DILocalVariable(name: "alpha", scope: !749, file: !345, line: 532, type: !756)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, elements: !260)
!757 = !DILocalVariable(name: "beta", scope: !749, file: !345, line: 532, type: !756)
!758 = !DILocalVariable(name: "gamma", scope: !749, file: !345, line: 532, type: !756)
!759 = !DILocalVariable(name: "delta", scope: !749, file: !345, line: 532, type: !756)
!760 = !DILocalVariable(name: "lambda", scope: !749, file: !345, line: 532, type: !761)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 960, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 15)
!764 = !DILocalVariable(name: "dps", scope: !749, file: !345, line: 533, type: !247)
!765 = !DILocalVariable(name: "alphaold", scope: !749, file: !345, line: 533, type: !247)
!766 = !DILocalVariable(name: "dp", scope: !749, file: !345, line: 534, type: !238)
!767 = !DILocalVariable(name: "X", scope: !749, file: !345, line: 535, type: !362)
!768 = !DILocalVariable(name: "B", scope: !749, file: !345, line: 535, type: !362)
!769 = !DILocalVariable(name: "Z", scope: !749, file: !345, line: 535, type: !362)
!770 = !DILocalVariable(name: "P", scope: !749, file: !345, line: 535, type: !362)
!771 = !DILocalVariable(name: "W", scope: !749, file: !345, line: 535, type: !362)
!772 = !DILocalVariable(name: "Q", scope: !749, file: !345, line: 535, type: !362)
!773 = !DILocalVariable(name: "U", scope: !749, file: !345, line: 535, type: !362)
!774 = !DILocalVariable(name: "M", scope: !749, file: !345, line: 535, type: !362)
!775 = !DILocalVariable(name: "N", scope: !749, file: !345, line: 535, type: !362)
!776 = !DILocalVariable(name: "R", scope: !749, file: !345, line: 535, type: !362)
!777 = !DILocalVariable(name: "S", scope: !749, file: !345, line: 535, type: !362)
!778 = !DILocalVariable(name: "C", scope: !749, file: !345, line: 535, type: !362)
!779 = !DILocalVariable(name: "D", scope: !749, file: !345, line: 535, type: !362)
!780 = !DILocalVariable(name: "E", scope: !749, file: !345, line: 535, type: !362)
!781 = !DILocalVariable(name: "F", scope: !749, file: !345, line: 535, type: !362)
!782 = !DILocalVariable(name: "G", scope: !749, file: !345, line: 535, type: !783)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 128, elements: !260)
!784 = !DILocalVariable(name: "H", scope: !749, file: !345, line: 535, type: !783)
!785 = !DILocalVariable(name: "A1", scope: !749, file: !345, line: 535, type: !362)
!786 = !DILocalVariable(name: "B1", scope: !749, file: !345, line: 535, type: !362)
!787 = !DILocalVariable(name: "Amat", scope: !749, file: !345, line: 536, type: !377)
!788 = !DILocalVariable(name: "Pmat", scope: !749, file: !345, line: 536, type: !377)
!789 = !DILocalVariable(name: "diagonalscale", scope: !749, file: !345, line: 537, type: !299)
!790 = !DILocalVariable(name: "pcomm", scope: !749, file: !345, line: 538, type: !121)
!791 = !DILocalVariable(name: "req", scope: !749, file: !345, line: 539, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !122, line: 339, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !122, line: 339, flags: DIFlagFwdDecl)
!795 = !DILocalVariable(name: "stat", scope: !749, file: !345, line: 540, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !122, line: 341, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !122, line: 351, size: 192, elements: !798)
!798 = !{!799, !800, !801, !802, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !797, file: !122, line: 354, baseType: !26, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !797, file: !122, line: 355, baseType: !26, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !797, file: !122, line: 356, baseType: !26, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !797, file: !122, line: 361, baseType: !26, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !797, file: !122, line: 362, baseType: !295, size: 64, offset: 128)
!804 = !DILocalVariable(name: "ierr__", scope: !805, file: !345, line: 544, type: !145)
!805 = distinct !DILexicalBlock(scope: !749, file: !345, line: 544, column: 53)
!806 = !DILocalVariable(name: "ierr__", scope: !807, file: !345, line: 569, type: !145)
!807 = distinct !DILexicalBlock(scope: !749, file: !345, line: 569, column: 52)
!808 = !DILocalVariable(name: "ierr__", scope: !809, file: !345, line: 570, type: !145)
!809 = distinct !DILexicalBlock(scope: !749, file: !345, line: 570, column: 51)
!810 = !DILocalVariable(name: "ierr__", scope: !811, file: !345, line: 571, type: !145)
!811 = distinct !DILexicalBlock(scope: !749, file: !345, line: 571, column: 52)
!812 = !DILocalVariable(name: "ierr__", scope: !813, file: !345, line: 572, type: !145)
!813 = distinct !DILexicalBlock(scope: !749, file: !345, line: 572, column: 52)
!814 = !DILocalVariable(name: "ierr__", scope: !815, file: !345, line: 573, type: !145)
!815 = distinct !DILexicalBlock(scope: !749, file: !345, line: 573, column: 54)
!816 = !DILocalVariable(name: "ierr__", scope: !817, file: !345, line: 575, type: !145)
!817 = distinct !DILexicalBlock(scope: !749, file: !345, line: 575, column: 32)
!818 = !DILocalVariable(name: "ierr__", scope: !819, file: !345, line: 576, type: !145)
!819 = distinct !DILexicalBlock(scope: !749, file: !345, line: 576, column: 46)
!820 = !DILocalVariable(name: "ierr__", scope: !821, file: !345, line: 580, type: !145)
!821 = distinct !DILexicalBlock(scope: !822, file: !345, line: 580, column: 38)
!822 = distinct !DILexicalBlock(scope: !823, file: !345, line: 579, column: 25)
!823 = distinct !DILexicalBlock(scope: !749, file: !345, line: 579, column: 7)
!824 = !DILocalVariable(name: "ierr__", scope: !825, file: !345, line: 581, type: !145)
!825 = distinct !DILexicalBlock(scope: !822, file: !345, line: 581, column: 30)
!826 = !DILocalVariable(name: "ierr__", scope: !827, file: !345, line: 583, type: !145)
!827 = distinct !DILexicalBlock(scope: !828, file: !345, line: 583, column: 25)
!828 = distinct !DILexicalBlock(scope: !823, file: !345, line: 582, column: 10)
!829 = !DILocalVariable(name: "ierr__", scope: !830, file: !345, line: 586, type: !145)
!830 = distinct !DILexicalBlock(scope: !749, file: !345, line: 586, column: 31)
!831 = !DILocalVariable(name: "ierr__", scope: !832, file: !345, line: 587, type: !145)
!832 = distinct !DILexicalBlock(scope: !749, file: !345, line: 587, column: 36)
!833 = !DILocalVariable(name: "ierr__", scope: !834, file: !345, line: 589, type: !145)
!834 = distinct !DILexicalBlock(scope: !749, file: !345, line: 589, column: 77)
!835 = !DILocalVariable(name: "_7_errorcode", scope: !836, file: !345, line: 595, type: !145)
!836 = distinct !DILexicalBlock(scope: !749, file: !345, line: 595, column: 85)
!837 = !DILocalVariable(name: "_7_errorstring", scope: !838, file: !345, line: 595, type: !840)
!838 = distinct !DILexicalBlock(scope: !839, file: !345, line: 595, column: 85)
!839 = distinct !DILexicalBlock(scope: !836, file: !345, line: 595, column: 85)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 256)
!843 = !DILocalVariable(name: "_7_resultlen", scope: !838, file: !345, line: 595, type: !201)
!844 = !DILocalVariable(name: "ierr__", scope: !845, file: !345, line: 601, type: !145)
!845 = distinct !DILexicalBlock(scope: !749, file: !345, line: 601, column: 31)
!846 = !DILocalVariable(name: "ierr__", scope: !847, file: !345, line: 602, type: !145)
!847 = distinct !DILexicalBlock(scope: !749, file: !345, line: 602, column: 36)
!848 = !DILocalVariable(name: "ierr__", scope: !849, file: !345, line: 604, type: !145)
!849 = distinct !DILexicalBlock(scope: !749, file: !345, line: 604, column: 34)
!850 = !DILocalVariable(name: "ierr__", scope: !851, file: !345, line: 605, type: !145)
