; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 75, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmstag.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "DMSTAG_STENCIL_NONE", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "DMSTAG_STENCIL_STAR", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "DMSTAG_STENCIL_BOX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 30, baseType: !5, size: 32, elements: !100)
!99 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !107)
!107 = !{!108}
!108 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 624, baseType: !5, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!116 = !{!117, !120, !121, !124, !160, !210, !325, !372, !373, !131, !295}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !110, line: 330, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !110, line: 330, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !123)
!122 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !127, line: 73, size: 4480, elements: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!128 = !{!129, !132, !181, !182, !184, !187, !188, !189, !190, !198, !199, !201, !205, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222, !223, !224, !226, !227, !229, !231, !232, !233, !234, !235, !238, !240, !241, !242, !243, !244, !247, !249, !250, !251, !261, !263, !264, !268, !269, !315, !320, !322, !323, !324}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !126, file: !127, line: 74, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !131)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !126, file: !127, line: 75, baseType: !133, size: 448, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 448, elements: !179)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !127, line: 53, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 45, size: 448, elements: !136)
!136 = !{!137, !143, !151, !156, !163, !167, !174}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !135, file: !127, line: 46, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !124, !142}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !131)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !135, file: !127, line: 47, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!141, !124, !147}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !148, line: 16, baseType: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !148, line: 16, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !135, file: !127, line: 48, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!141, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !135, file: !127, line: 49, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!141, !124, !160, !124}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !135, file: !127, line: 50, baseType: !164, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!141, !124, !160, !155}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !135, file: !127, line: 51, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!141, !124, !160, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !135, file: !127, line: 52, baseType: !175, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!141, !124, !160, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !126, file: !127, line: 76, baseType: !117, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !127, line: 77, baseType: !183, size: 32, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !131)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !126, file: !127, line: 78, baseType: !185, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !186)
!186 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !126, file: !127, line: 78, baseType: !185, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !126, file: !127, line: 78, baseType: !185, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !126, file: !127, line: 78, baseType: !185, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !126, file: !127, line: 79, baseType: !191, size: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !194, line: 27, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !196, line: 43, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!197 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !126, file: !127, line: 80, baseType: !183, size: 32, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !126, file: !127, line: 81, baseType: !200, size: 32, offset: 992)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !131)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !126, file: !127, line: 82, baseType: !202, size: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !126, file: !127, line: 83, baseType: !206, size: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !126, file: !127, line: 84, baseType: !210, size: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !126, file: !127, line: 85, baseType: !210, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !126, file: !127, line: 86, baseType: !210, size: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !126, file: !127, line: 87, baseType: !210, size: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !126, file: !127, line: 88, baseType: !124, size: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !126, file: !127, line: 89, baseType: !191, size: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 90, baseType: !210, size: 64, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !126, file: !127, line: 91, baseType: !210, size: 64, offset: 1600)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !126, file: !127, line: 92, baseType: !183, size: 32, offset: 1664)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !126, file: !127, line: 93, baseType: !120, size: 64, offset: 1728)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !127, line: 94, baseType: !221, size: 64, offset: 1792)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !126, file: !127, line: 95, baseType: !183, size: 32, offset: 1856)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !126, file: !127, line: 95, baseType: !183, size: 32, offset: 1888)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !126, file: !127, line: 96, baseType: !225, size: 64, offset: 1920)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !126, file: !127, line: 96, baseType: !225, size: 64, offset: 1984)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !126, file: !127, line: 97, baseType: !228, size: 64, offset: 2048)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !126, file: !127, line: 97, baseType: !230, size: 64, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !126, file: !127, line: 98, baseType: !183, size: 32, offset: 2176)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !126, file: !127, line: 98, baseType: !183, size: 32, offset: 2208)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !126, file: !127, line: 99, baseType: !225, size: 64, offset: 2240)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !126, file: !127, line: 99, baseType: !225, size: 64, offset: 2304)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !126, file: !127, line: 100, baseType: !236, size: 64, offset: 2368)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !186)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !126, file: !127, line: 100, baseType: !239, size: 64, offset: 2432)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !126, file: !127, line: 101, baseType: !183, size: 32, offset: 2496)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !126, file: !127, line: 101, baseType: !183, size: 32, offset: 2528)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !126, file: !127, line: 102, baseType: !225, size: 64, offset: 2560)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !126, file: !127, line: 102, baseType: !225, size: 64, offset: 2624)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !126, file: !127, line: 103, baseType: !245, size: 64, offset: 2688)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !237)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !126, file: !127, line: 103, baseType: !248, size: 64, offset: 2752)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !126, file: !127, line: 104, baseType: !178, size: 64, offset: 2816)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !126, file: !127, line: 105, baseType: !183, size: 32, offset: 2880)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !126, file: !127, line: 106, baseType: !252, size: 128, offset: 2944)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, elements: !259)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !127, line: 64, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 61, size: 128, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !255, file: !127, line: 62, baseType: !171, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !255, file: !127, line: 63, baseType: !120, size: 64, offset: 64)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !126, file: !127, line: 107, baseType: !262, size: 64, offset: 3072)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !259)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !126, file: !127, line: 108, baseType: !120, size: 64, offset: 3136)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !126, file: !127, line: 109, baseType: !265, size: 64, offset: 3200)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!141, !120}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !126, file: !127, line: 111, baseType: !183, size: 32, offset: 3264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !126, file: !127, line: 112, baseType: !270, size: 320, offset: 3328)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 320, elements: !313)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!141, !274, !124, !120}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !277)
!277 = !{!278, !279, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !276, file: !10, line: 100, baseType: !183, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !10, line: 101, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !291, !292, !293, !294, !296, !298, !299, !300}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !282, file: !10, line: 84, baseType: !210, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !282, file: !10, line: 85, baseType: !210, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !10, line: 86, baseType: !120, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !282, file: !10, line: 87, baseType: !202, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !282, file: !10, line: 88, baseType: !289, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !282, file: !10, line: 89, baseType: !162, size: 8, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !282, file: !10, line: 90, baseType: !210, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !282, file: !10, line: 91, baseType: !121, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !282, file: !10, line: 92, baseType: !295, size: 32, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !10, line: 93, baseType: !297, size: 32, offset: 544)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !10, line: 94, baseType: !280, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !282, file: !10, line: 95, baseType: !210, size: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !282, file: !10, line: 96, baseType: !120, size: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !276, file: !10, line: 102, baseType: !210, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !276, file: !10, line: 102, baseType: !210, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !276, file: !10, line: 103, baseType: !210, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !276, file: !10, line: 104, baseType: !117, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !276, file: !10, line: 105, baseType: !295, size: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !276, file: !10, line: 105, baseType: !295, size: 32, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !276, file: !10, line: 105, baseType: !295, size: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !276, file: !10, line: 106, baseType: !124, size: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !276, file: !10, line: 107, baseType: !310, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!313 = !{!314}
!314 = !DISubrange(count: 5)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !126, file: !127, line: 113, baseType: !316, size: 320, offset: 3648)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 320, elements: !313)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!141, !124, !120}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !126, file: !127, line: 114, baseType: !321, size: 320, offset: 3968)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 320, elements: !313)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !126, file: !127, line: 115, baseType: !295, size: 32, offset: 4288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !126, file: !127, line: 120, baseType: !310, size: 64, offset: 4352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !126, file: !127, line: 121, baseType: !295, size: 32, offset: 4416)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Stag", file: !327, line: 47, baseType: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmstagimpl.h", directory: "/home/users/ndemeye/xSDK")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 13, size: 1792, elements: !329)
!329 = !{!330, !334, !335, !337, !341, !343, !344, !347, !348, !351, !352, !353, !354, !356, !358, !364, !365, !366, !367, !368, !369, !371}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !328, file: !327, line: 16, baseType: !331, size: 96)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 96, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 3)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !328, file: !327, line: 17, baseType: !331, size: 96, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !328, file: !327, line: 18, baseType: !336, size: 192, offset: 192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 192, elements: !332)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !328, file: !327, line: 19, baseType: !338, size: 128, offset: 384)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 4)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "stencilType", scope: !328, file: !327, line: 20, baseType: !342, size: 32, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMStagStencilType", file: !67, line: 75, baseType: !66)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stencilWidth", scope: !328, file: !327, line: 21, baseType: !183, size: 32, offset: 544)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "boundaryType", scope: !328, file: !327, line: 22, baseType: !345, size: 96, offset: 576)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 96, elements: !332)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nRanks", scope: !328, file: !327, line: 23, baseType: !331, size: 96, offset: 672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDMType", scope: !328, file: !327, line: 26, baseType: !349, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMType", file: !350, line: 26, baseType: !160)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nGhost", scope: !328, file: !327, line: 31, baseType: !331, size: 96, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !328, file: !327, line: 32, baseType: !331, size: 96, offset: 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "startGhost", scope: !328, file: !327, line: 33, baseType: !331, size: 96, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !328, file: !327, line: 34, baseType: !355, size: 96, offset: 1120)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 96, elements: !332)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !328, file: !327, line: 35, baseType: !357, size: 64, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !328, file: !327, line: 36, baseType: !359, size: 64, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !360, line: 59, baseType: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !360, line: 15, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !360, line: 15, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ltog_injective", scope: !328, file: !327, line: 37, baseType: !359, size: 64, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "locationOffsets", scope: !328, file: !327, line: 38, baseType: !228, size: 64, offset: 1408)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "entriesPerElement", scope: !328, file: !327, line: 41, baseType: !183, size: 32, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !328, file: !327, line: 42, baseType: !183, size: 32, offset: 1504)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "entriesGhost", scope: !328, file: !327, line: 43, baseType: !183, size: 32, offset: 1536)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "firstRank", scope: !328, file: !327, line: 44, baseType: !370, size: 96, offset: 1568)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 96, elements: !332)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lastRank", scope: !328, file: !327, line: 45, baseType: !370, size: 96, offset: 1664)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !106)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!374 = !{i32 7, !"Dwarf Version", i32 4}
!375 = !{i32 2, !"Debug Info Version", i32 3}
!376 = !{i32 1, !"wchar_size", i32 4}
!377 = !{i32 7, !"PIC Level", i32 2}
!378 = !{i32 7, !"uwtable", i32 1}
!379 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!380 = distinct !DISubprogram(name: "DMCreate_Stag", scope: !381, file: !381, line: 443, type: !382, scopeLine: 444, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1122)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag.c", directory: "/home/users/ndemeye/xSDK")
!382 = !DISubroutineType(types: !383)
!383 = !{!141, !384}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !387)
!387 = !{!388, !390, !618, !622, !623, !624, !625, !635, !636, !644, !645, !653, !654, !655, !656, !660, !661, !665, !667, !669, !670, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !698, !710, !722, !734, !743, !744, !767, !768, !769, !770, !771, !772, !774, !865, !866, !886, !887, !888, !889, !890, !891, !895, !896, !900, !901, !902, !903, !904, !905, !906, !907, !908, !910, !922, !923, !924, !933, !1021, !1022, !1110, !1111, !1112, !1113, !1115, !1117, !1118, !1119, !1120, !1121}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !386, file: !47, line: 203, baseType: !389, size: 4480)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !127, line: 122, baseType: !126)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !386, file: !47, line: 203, baseType: !391, size: 3456, offset: 4480)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 3456, elements: !179)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !393)
!393 = !{!394, !398, !399, !404, !408, !410, !411, !412, !420, !421, !422, !434, !435, !443, !452, !461, !465, !469, !470, !475, !476, !480, !481, !485, !486, !494, !498, !503, !504, !505, !506, !507, !508, !509, !513, !519, !523, !528, !532, !538, !542, !547, !554, !558, !559, !564, !575, !579, !589, !593, !601, !605, !613, !614}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !392, file: !47, line: 31, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!141, !384, !147}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !392, file: !47, line: 32, baseType: !395, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !392, file: !47, line: 33, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!141, !384, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !392, file: !47, line: 34, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!141, !274, !384}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !392, file: !47, line: 35, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !392, file: !47, line: 36, baseType: !409, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !392, file: !47, line: 37, baseType: !409, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !392, file: !47, line: 38, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!141, !384, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !99, line: 21, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !99, line: 21, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !392, file: !47, line: 39, baseType: !413, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !392, file: !47, line: 40, baseType: !409, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !392, file: !47, line: 41, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!141, !384, !228, !426, !428}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !431, line: 11, baseType: !432)
!431 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !431, line: 11, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !392, file: !47, line: 42, baseType: !400, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !392, file: !47, line: 43, baseType: !436, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!141, !384, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !392, file: !47, line: 45, baseType: !444, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!141, !384, !447, !448}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !431, line: 51, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !431, line: 51, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !392, file: !47, line: 46, baseType: !453, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!141, !384, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !458, line: 16, baseType: !459)
!458 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !458, line: 16, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !392, file: !47, line: 47, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!141, !384, !384, !456, !416}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !392, file: !47, line: 48, baseType: !466, size: 64, offset: 1024)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!141, !384, !384, !456}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !392, file: !47, line: 49, baseType: !466, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !392, file: !47, line: 50, baseType: !471, size: 64, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!141, !384, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !392, file: !47, line: 51, baseType: !466, size: 64, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !392, file: !47, line: 53, baseType: !477, size: 64, offset: 1280)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!141, !384, !117, !403}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !392, file: !47, line: 54, baseType: !477, size: 64, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !392, file: !47, line: 55, baseType: !482, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!141, !384, !183, !403}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !392, file: !47, line: 56, baseType: !482, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !392, file: !47, line: 57, baseType: !487, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!141, !384, !490, !403}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !491, line: 12, baseType: !492)
!491 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !491, line: 12, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !392, file: !47, line: 58, baseType: !495, size: 64, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!141, !384, !417, !490, !403}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !392, file: !47, line: 60, baseType: !499, size: 64, offset: 1664)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!141, !384, !417, !502, !417}
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !392, file: !47, line: 61, baseType: !499, size: 64, offset: 1728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !392, file: !47, line: 62, baseType: !499, size: 64, offset: 1792)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !392, file: !47, line: 63, baseType: !499, size: 64, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !392, file: !47, line: 64, baseType: !499, size: 64, offset: 1920)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !392, file: !47, line: 65, baseType: !499, size: 64, offset: 1984)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !392, file: !47, line: 67, baseType: !409, size: 64, offset: 2048)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !392, file: !47, line: 69, baseType: !510, size: 64, offset: 2112)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!141, !384, !417, !417}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !392, file: !47, line: 71, baseType: !514, size: 64, offset: 2176)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!141, !384, !183, !517, !429, !403}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !392, file: !47, line: 72, baseType: !520, size: 64, offset: 2240)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!141, !403, !183, !428, !403}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !392, file: !47, line: 73, baseType: !524, size: 64, offset: 2304)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!141, !384, !228, !426, !428, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !392, file: !47, line: 74, baseType: !529, size: 64, offset: 2368)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!141, !384, !228, !426, !428, !428, !527}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !392, file: !47, line: 75, baseType: !533, size: 64, offset: 2432)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!141, !384, !183, !403, !536, !536, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !392, file: !47, line: 77, baseType: !539, size: 64, offset: 2496)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!141, !384, !183, !228, !228}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !392, file: !47, line: 78, baseType: !543, size: 64, offset: 2560)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!141, !384, !417, !546, !361}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !392, file: !47, line: 79, baseType: !548, size: 64, offset: 2624)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!141, !384, !228, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !392, file: !47, line: 80, baseType: !555, size: 64, offset: 2688)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!141, !384, !236, !236}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !392, file: !47, line: 81, baseType: !555, size: 64, offset: 2752)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !392, file: !47, line: 82, baseType: !560, size: 64, offset: 2816)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!141, !384, !417, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !392, file: !47, line: 84, baseType: !565, size: 64, offset: 2880)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!141, !384, !237, !568, !574, !502, !417}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!141, !183, !237, !572, !183, !245, !120}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !392, file: !47, line: 85, baseType: !576, size: 64, offset: 2944)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!141, !384, !237, !490, !183, !517, !183, !517, !568, !574, !502, !417}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !392, file: !47, line: 86, baseType: !580, size: 64, offset: 3008)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!141, !384, !237, !417, !583, !502, !417}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !183, !183, !183, !517, !517, !587, !587, !587, !517, !517, !587, !587, !587, !237, !572, !183, !587, !245}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !392, file: !47, line: 87, baseType: !590, size: 64, offset: 3072)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!141, !384, !237, !490, !183, !517, !183, !517, !417, !583, !502, !417}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !392, file: !47, line: 88, baseType: !594, size: 64, offset: 3136)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!141, !384, !237, !490, !183, !517, !183, !517, !417, !597, !502, !417}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !183, !183, !183, !517, !517, !587, !587, !587, !517, !517, !587, !587, !587, !237, !572, !572, !183, !587, !245}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !392, file: !47, line: 89, baseType: !602, size: 64, offset: 3200)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!141, !384, !237, !568, !574, !417, !236}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !392, file: !47, line: 90, baseType: !606, size: 64, offset: 3264)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!141, !384, !237, !609, !574, !417, !572, !236}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!141, !183, !237, !572, !572, !183, !245, !120}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !392, file: !47, line: 91, baseType: !602, size: 64, offset: 3328)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !392, file: !47, line: 93, baseType: !615, size: 64, offset: 3392)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!141, !384, !384, !474, !474}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !386, file: !47, line: 204, baseType: !619, size: 6400, offset: 7936)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 6400, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 100)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !386, file: !47, line: 204, baseType: !619, size: 6400, offset: 14336)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !386, file: !47, line: 205, baseType: !619, size: 6400, offset: 20736)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !386, file: !47, line: 205, baseType: !619, size: 6400, offset: 27136)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !386, file: !47, line: 206, baseType: !626, size: 64, offset: 33536)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !629)
!629 = !{!630, !631, !632, !634}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !628, file: !47, line: 143, baseType: !417, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !47, line: 144, baseType: !210, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !628, file: !47, line: 145, baseType: !633, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !47, line: 146, baseType: !626, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !386, file: !47, line: 207, baseType: !626, size: 64, offset: 33600)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !386, file: !47, line: 208, baseType: !637, size: 64, offset: 33664)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !639, file: !47, line: 151, baseType: !121, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !639, file: !47, line: 152, baseType: !120, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !639, file: !47, line: 153, baseType: !637, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !386, file: !47, line: 208, baseType: !637, size: 64, offset: 33728)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !386, file: !47, line: 209, baseType: !646, size: 64, offset: 33792)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !648, file: !47, line: 159, baseType: !490, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !648, file: !47, line: 160, baseType: !295, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !47, line: 161, baseType: !647, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !386, file: !47, line: 210, baseType: !490, size: 64, offset: 33856)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !386, file: !47, line: 211, baseType: !490, size: 64, offset: 33920)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !386, file: !47, line: 212, baseType: !120, size: 64, offset: 33984)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !386, file: !47, line: 213, baseType: !657, size: 64, offset: 34048)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!141, !574}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !386, file: !47, line: 214, baseType: !447, size: 32, offset: 34112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !386, file: !47, line: 215, baseType: !662, size: 64, offset: 34176)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !458, line: 1378, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !458, line: 1378, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !386, file: !47, line: 216, baseType: !666, size: 64, offset: 34240)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !99, line: 83, baseType: !160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !386, file: !47, line: 217, baseType: !668, size: 64, offset: 34304)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !458, line: 25, baseType: !160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !386, file: !47, line: 218, baseType: !183, size: 32, offset: 34368)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !386, file: !47, line: 219, baseType: !671, size: 64, offset: 34432)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !431, line: 30, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !431, line: 30, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !386, file: !47, line: 220, baseType: !295, size: 32, offset: 34496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !386, file: !47, line: 221, baseType: !295, size: 32, offset: 34528)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !386, file: !47, line: 222, baseType: !183, size: 32, offset: 34560)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !386, file: !47, line: 222, baseType: !183, size: 32, offset: 34592)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !386, file: !47, line: 223, baseType: !295, size: 32, offset: 34624)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !386, file: !47, line: 224, baseType: !295, size: 32, offset: 34656)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !47, line: 225, baseType: !120, size: 64, offset: 34688)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !386, file: !47, line: 227, baseType: !384, size: 64, offset: 34752)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !386, file: !47, line: 228, baseType: !384, size: 64, offset: 34816)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !386, file: !47, line: 229, baseType: !684, size: 64, offset: 34880)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !687)
!687 = !{!688, !692, !696, !697}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !686, file: !47, line: 102, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!141, !384, !384, !120}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !686, file: !47, line: 103, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!141, !384, !457, !417, !457, !384, !120}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !686, file: !47, line: 104, baseType: !120, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !47, line: 105, baseType: !684, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !386, file: !47, line: 230, baseType: !699, size: 64, offset: 34944)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !702)
!702 = !{!703, !704, !708, !709}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !701, file: !47, line: 110, baseType: !689, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !701, file: !47, line: 111, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!141, !384, !457, !384, !120}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !701, file: !47, line: 112, baseType: !120, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !47, line: 113, baseType: !699, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !386, file: !47, line: 231, baseType: !711, size: 64, offset: 35008)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !714)
!714 = !{!715, !716, !720, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !713, file: !47, line: 118, baseType: !689, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !713, file: !47, line: 119, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!141, !384, !359, !359, !384, !120}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !713, file: !47, line: 120, baseType: !120, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !47, line: 121, baseType: !711, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !386, file: !47, line: 232, baseType: !723, size: 64, offset: 35072)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !726)
!726 = !{!727, !731, !732, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !725, file: !47, line: 126, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!141, !384, !417, !502, !417, !120}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !725, file: !47, line: 127, baseType: !728, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !725, file: !47, line: 128, baseType: !120, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !725, file: !47, line: 129, baseType: !723, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !386, file: !47, line: 233, baseType: !735, size: 64, offset: 35136)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !737, file: !47, line: 134, baseType: !728, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !737, file: !47, line: 135, baseType: !728, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !737, file: !47, line: 136, baseType: !120, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !47, line: 137, baseType: !735, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !386, file: !47, line: 235, baseType: !183, size: 32, offset: 35200)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !386, file: !47, line: 237, baseType: !745, size: 64, offset: 35264)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !749)
!749 = !{!750, !754, !755, !756, !757, !759, !766}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !748, file: !47, line: 27, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !752, line: 166, baseType: !753)
!752 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !752, line: 139, baseType: !5)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !748, file: !47, line: 27, baseType: !751, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !748, file: !47, line: 27, baseType: !751, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !748, file: !47, line: 27, baseType: !751, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !748, file: !47, line: 27, baseType: !758, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !748, file: !47, line: 27, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !762, file: !47, line: 19, baseType: !490, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !762, file: !47, line: 20, baseType: !183, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !748, file: !47, line: 27, baseType: !416, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !386, file: !47, line: 239, baseType: !361, size: 64, offset: 35328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !386, file: !47, line: 240, baseType: !361, size: 64, offset: 35392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !386, file: !47, line: 241, baseType: !361, size: 64, offset: 35456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !386, file: !47, line: 242, baseType: !361, size: 64, offset: 35520)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !386, file: !47, line: 243, baseType: !295, size: 32, offset: 35584)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !386, file: !47, line: 245, baseType: !773, size: 64, offset: 35616)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !259)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !386, file: !47, line: 246, baseType: !775, size: 64, offset: 35712)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !776, line: 18, baseType: !777)
!776 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !779, line: 29, size: 5760, elements: !780)
!779 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!780 = !{!781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !828, !829, !830}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !778, file: !779, line: 30, baseType: !389, size: 4480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !778, file: !779, line: 30, baseType: !783, size: 32, offset: 4480)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !179)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !778, file: !779, line: 31, baseType: !183, size: 32, offset: 4512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !778, file: !779, line: 31, baseType: !183, size: 32, offset: 4544)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !778, file: !779, line: 32, baseType: !430, size: 64, offset: 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !778, file: !779, line: 33, baseType: !295, size: 32, offset: 4672)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !778, file: !779, line: 34, baseType: !295, size: 32, offset: 4704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !778, file: !779, line: 35, baseType: !228, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !778, file: !779, line: 36, baseType: !228, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !778, file: !779, line: 37, baseType: !183, size: 32, offset: 4864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !778, file: !779, line: 38, baseType: !775, size: 64, offset: 4928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !778, file: !779, line: 39, baseType: !228, size: 64, offset: 4992)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !778, file: !779, line: 40, baseType: !295, size: 32, offset: 5056)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !778, file: !779, line: 42, baseType: !183, size: 32, offset: 5088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !778, file: !779, line: 43, baseType: !427, size: 64, offset: 5120)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !778, file: !779, line: 44, baseType: !228, size: 64, offset: 5184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !778, file: !779, line: 45, baseType: !799, size: 64, offset: 5248)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !778, file: !779, line: 46, baseType: !295, size: 32, offset: 5312)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !778, file: !779, line: 47, baseType: !426, size: 64, offset: 5376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !778, file: !779, line: 49, baseType: !124, size: 64, offset: 5440)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !778, file: !779, line: 50, baseType: !804, size: 64, offset: 5504)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !779, line: 27, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !779, line: 27, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !779, line: 27, size: 320, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !821}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !807, file: !779, line: 27, baseType: !751, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !807, file: !779, line: 27, baseType: !751, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !807, file: !779, line: 27, baseType: !751, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !807, file: !779, line: 27, baseType: !751, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !779, line: 27, baseType: !758, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !807, file: !779, line: 27, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !779, line: 10, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !779, line: 8, size: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !817, file: !779, line: 9, baseType: !183, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !817, file: !779, line: 9, baseType: !183, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !807, file: !779, line: 27, baseType: !822, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !779, line: 14, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 12, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !824, file: !779, line: 13, baseType: !228, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !824, file: !779, line: 13, baseType: !228, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !778, file: !779, line: 51, baseType: !775, size: 64, offset: 5568)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !778, file: !779, line: 52, baseType: !430, size: 64, offset: 5632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !778, file: !779, line: 53, baseType: !831, size: 64, offset: 5696)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !776, line: 33, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !779, line: 72, size: 4864, elements: !834)
!834 = !{!835, !836, !854, !855, !864}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !833, file: !779, line: 73, baseType: !389, size: 4480)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !833, file: !779, line: 73, baseType: !837, size: 192, offset: 4480)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 192, elements: !179)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !779, line: 56, size: 192, elements: !839)
!839 = !{!840, !846, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !838, file: !779, line: 57, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!141, !831, !775, !183, !517, !844, !845}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !838, file: !779, line: 58, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!141, !831}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !838, file: !779, line: 59, baseType: !851, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!141, !831, !147}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !833, file: !779, line: 74, baseType: !120, size: 64, offset: 4672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !833, file: !779, line: 75, baseType: !856, size: 64, offset: 4736)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !779, line: 62, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !779, line: 64, size: 256, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !779, line: 66, baseType: !856, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !858, file: !779, line: 67, baseType: !844, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !858, file: !779, line: 68, baseType: !845, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !858, file: !779, line: 69, baseType: !183, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !833, file: !779, line: 76, baseType: !856, size: 64, offset: 4800)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !386, file: !47, line: 247, baseType: !775, size: 64, offset: 35776)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !386, file: !47, line: 248, baseType: !867, size: 64, offset: 35840)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !431, line: 60, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !869, file: !25, line: 241, baseType: !117, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !869, file: !25, line: 242, baseType: !200, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !869, file: !25, line: 243, baseType: !183, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !869, file: !25, line: 243, baseType: !183, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !869, file: !25, line: 244, baseType: !183, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !869, file: !25, line: 244, baseType: !183, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !869, file: !25, line: 245, baseType: !228, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !869, file: !25, line: 246, baseType: !295, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !869, file: !25, line: 247, baseType: !183, size: 32, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !869, file: !25, line: 251, baseType: !183, size: 32, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !869, file: !25, line: 252, baseType: !671, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !869, file: !25, line: 253, baseType: !295, size: 32, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !869, file: !25, line: 254, baseType: !183, size: 32, offset: 544)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !869, file: !25, line: 254, baseType: !183, size: 32, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !869, file: !25, line: 255, baseType: !183, size: 32, offset: 608)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !386, file: !47, line: 250, baseType: !775, size: 64, offset: 35904)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !386, file: !47, line: 251, baseType: !457, size: 64, offset: 35968)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !386, file: !47, line: 253, baseType: !384, size: 64, offset: 36032)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !386, file: !47, line: 254, baseType: !417, size: 64, offset: 36096)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !386, file: !47, line: 255, baseType: !120, size: 64, offset: 36160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !386, file: !47, line: 256, baseType: !892, size: 64, offset: 36224)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!141, !384, !120}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !386, file: !47, line: 257, baseType: !892, size: 64, offset: 36288)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !386, file: !47, line: 258, baseType: !897, size: 64, offset: 36352)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!141, !384, !572, !295, !845, !120}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !386, file: !47, line: 260, baseType: !183, size: 32, offset: 36416)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !386, file: !47, line: 261, baseType: !384, size: 64, offset: 36480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !386, file: !47, line: 262, baseType: !417, size: 64, offset: 36544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !386, file: !47, line: 263, baseType: !417, size: 64, offset: 36608)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !386, file: !47, line: 264, baseType: !295, size: 32, offset: 36672)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !386, file: !47, line: 265, baseType: !440, size: 64, offset: 36736)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !386, file: !47, line: 266, baseType: !236, size: 64, offset: 36800)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !386, file: !47, line: 266, baseType: !236, size: 64, offset: 36864)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !386, file: !47, line: 267, baseType: !909, size: 64, offset: 36928)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !386, file: !47, line: 269, baseType: !911, size: 640, offset: 36992)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 640, elements: !920)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!141, !384, !183, !183, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !458, line: 1723, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !458, line: 1723, flags: DIFlagFwdDecl)
!920 = !{!921}
!921 = !DISubrange(count: 10)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !386, file: !47, line: 270, baseType: !911, size: 640, offset: 37632)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !386, file: !47, line: 272, baseType: !183, size: 32, offset: 38272)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !386, file: !47, line: 273, baseType: !925, size: 64, offset: 38336)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !927, file: !47, line: 174, baseType: !124, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !927, file: !47, line: 175, baseType: !490, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !927, file: !47, line: 176, baseType: !773, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !927, file: !47, line: 177, baseType: !295, size: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !386, file: !47, line: 274, baseType: !934, size: 64, offset: 38400)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !937)
!937 = !{!938, !1019, !1020}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !936, file: !47, line: 168, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !940, line: 11, baseType: !941)
!940 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !940, line: 13, size: 832, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !1010, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !940, line: 14, baseType: !160, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !942, file: !940, line: 15, baseType: !490, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !942, file: !940, line: 16, baseType: !160, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !942, file: !940, line: 17, baseType: !183, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !942, file: !940, line: 18, baseType: !228, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !942, file: !940, line: 19, baseType: !950, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !951, line: 22, baseType: !952)
!951 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !940, line: 81, size: 4992, elements: !954)
!954 = !{!955, !956, !970, !971, !972, !981}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !953, file: !940, line: 82, baseType: !389, size: 4480)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !953, file: !940, line: 82, baseType: !957, size: 256, offset: 4480)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 256, elements: !179)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !940, line: 74, size: 256, elements: !959)
!959 = !{!960, !964, !965, !969}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !958, file: !940, line: 75, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!141, !950}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !958, file: !940, line: 76, baseType: !961, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !958, file: !940, line: 77, baseType: !966, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!141, !950, !147}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !958, file: !940, line: 78, baseType: !961, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !953, file: !940, line: 83, baseType: !120, size: 64, offset: 4736)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !953, file: !940, line: 85, baseType: !183, size: 32, offset: 4800)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !953, file: !940, line: 86, baseType: !973, size: 64, offset: 4864)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !940, line: 41, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !940, line: 36, size: 256, elements: !976)
!976 = !{!977, !978, !979, !980}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !975, file: !940, line: 37, baseType: !121, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !975, file: !940, line: 38, baseType: !121, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !975, file: !940, line: 39, baseType: !121, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !975, file: !940, line: 40, baseType: !210, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !953, file: !940, line: 87, baseType: !982, size: 64, offset: 4928)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !940, line: 54, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !940, line: 54, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !940, line: 54, size: 320, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !1002}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !986, file: !940, line: 54, baseType: !751, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !986, file: !940, line: 54, baseType: !751, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !986, file: !940, line: 54, baseType: !751, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !986, file: !940, line: 54, baseType: !751, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !940, line: 54, baseType: !758, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !986, file: !940, line: 54, baseType: !994, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !951, line: 41, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !951, line: 35, size: 192, elements: !997)
!997 = !{!998, !999, !1000, !1001}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !996, file: !951, line: 37, baseType: !490, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !996, file: !951, line: 38, baseType: !183, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !996, file: !951, line: 39, baseType: !183, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !996, file: !951, line: 40, baseType: !183, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !986, file: !940, line: 54, baseType: !1003, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !940, line: 34, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !940, line: 30, size: 96, elements: !1006)
!1006 = !{!1007, !1008, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1005, file: !940, line: 31, baseType: !183, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1005, file: !940, line: 32, baseType: !183, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1005, file: !940, line: 33, baseType: !183, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !940, line: 20, baseType: !1011, size: 32, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !942, file: !940, line: 21, baseType: !183, size: 32, offset: 416)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !942, file: !940, line: 22, baseType: !183, size: 32, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !942, file: !940, line: 23, baseType: !228, size: 64, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !942, file: !940, line: 24, baseType: !171, size: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !942, file: !940, line: 25, baseType: !171, size: 64, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !942, file: !940, line: 26, baseType: !120, size: 64, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !940, line: 27, baseType: !939, size: 64, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !936, file: !47, line: 169, baseType: !490, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !47, line: 170, baseType: !934, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !386, file: !47, line: 275, baseType: !183, size: 32, offset: 38464)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !386, file: !47, line: 276, baseType: !1023, size: 64, offset: 38528)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !1026)
!1026 = !{!1027, !1108, !1109}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1025, file: !47, line: 181, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !951, line: 13, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !940, line: 98, size: 7232, elements: !1031)
!1031 = !{!1032, !1033, !1047, !1048, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1064, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1030, file: !940, line: 99, baseType: !389, size: 4480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1030, file: !940, line: 99, baseType: !1034, size: 256, offset: 4480)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 256, elements: !179)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !940, line: 91, size: 256, elements: !1036)
!1036 = !{!1037, !1041, !1042, !1046}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1035, file: !940, line: 92, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!141, !1028}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1035, file: !940, line: 93, baseType: !1038, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1035, file: !940, line: 94, baseType: !1043, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!141, !1028, !147}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1035, file: !940, line: 95, baseType: !1038, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1030, file: !940, line: 100, baseType: !120, size: 64, offset: 4736)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1030, file: !940, line: 101, baseType: !1049, size: 64, offset: 4800)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1030, file: !940, line: 102, baseType: !295, size: 32, offset: 4864)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !1030, file: !940, line: 103, baseType: !295, size: 32, offset: 4896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !1030, file: !940, line: 104, baseType: !183, size: 32, offset: 4928)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1030, file: !940, line: 105, baseType: !183, size: 32, offset: 4960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1030, file: !940, line: 106, baseType: !155, size: 64, offset: 4992)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !1030, file: !940, line: 108, baseType: !939, size: 64, offset: 5056)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !1030, file: !940, line: 109, baseType: !295, size: 32, offset: 5120)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !1030, file: !940, line: 110, baseType: !474, size: 64, offset: 5184)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !1030, file: !940, line: 111, baseType: !228, size: 64, offset: 5248)
