; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 663, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !57)
!57 = !{!58, !59}
!58 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 24, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!75 = !{!76, !166, !95, !176, !83, !251, !116, !285, !375, !628, !156, !436, !372, !141}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !79, line: 73, size: 4480, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !84, !137, !138, !140, !143, !144, !145, !146, !154, !155, !157, !161, !165, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !179, !180, !181, !183, !184, !186, !188, !189, !190, !191, !192, !195, !197, !198, !199, !200, !201, !204, !206, !207, !208, !218, !220, !221, !225, !226, !275, !280, !282, !283, !284}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !78, file: !79, line: 74, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !83)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !78, file: !79, line: 75, baseType: !85, size: 448, offset: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 448, elements: !135)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !79, line: 53, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 45, size: 448, elements: !88)
!88 = !{!89, !99, !107, !112, !119, !123, !130}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !87, file: !79, line: 46, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !76, !94}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !83)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !96, line: 330, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !96, line: 330, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !87, file: !79, line: 47, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!93, !76, !103}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !104, line: 16, baseType: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !104, line: 16, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !87, file: !79, line: 48, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!93, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !87, file: !79, line: 49, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!93, !76, !116, !76}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !87, file: !79, line: 50, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!93, !76, !116, !111}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !87, file: !79, line: 51, baseType: !124, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!93, !76, !116, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !87, file: !79, line: 52, baseType: !131, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!93, !76, !116, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !78, file: !79, line: 76, baseType: !95, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 77, baseType: !139, size: 32, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !83)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !78, file: !79, line: 78, baseType: !141, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !142)
!142 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !78, file: !79, line: 78, baseType: !141, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !78, file: !79, line: 78, baseType: !141, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !78, file: !79, line: 78, baseType: !141, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !79, line: 79, baseType: !147, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !150, line: 27, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !152, line: 43, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!153 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !78, file: !79, line: 80, baseType: !139, size: 32, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !78, file: !79, line: 81, baseType: !156, size: 32, offset: 992)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !83)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !78, file: !79, line: 82, baseType: !158, size: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !78, file: !79, line: 83, baseType: !162, size: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !78, file: !79, line: 84, baseType: !166, size: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !78, file: !79, line: 85, baseType: !166, size: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !78, file: !79, line: 86, baseType: !166, size: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !78, file: !79, line: 87, baseType: !166, size: 64, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !79, line: 88, baseType: !76, size: 64, offset: 1408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !78, file: !79, line: 89, baseType: !147, size: 64, offset: 1472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !79, line: 90, baseType: !166, size: 64, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !79, line: 91, baseType: !166, size: 64, offset: 1600)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !78, file: !79, line: 92, baseType: !139, size: 32, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !78, file: !79, line: 93, baseType: !176, size: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !79, line: 94, baseType: !178, size: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !148)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !78, file: !79, line: 95, baseType: !139, size: 32, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !78, file: !79, line: 95, baseType: !139, size: 32, offset: 1888)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !78, file: !79, line: 96, baseType: !182, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !78, file: !79, line: 96, baseType: !182, size: 64, offset: 1984)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !78, file: !79, line: 97, baseType: !185, size: 64, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !78, file: !79, line: 97, baseType: !187, size: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !78, file: !79, line: 98, baseType: !139, size: 32, offset: 2176)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !78, file: !79, line: 98, baseType: !139, size: 32, offset: 2208)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !78, file: !79, line: 99, baseType: !182, size: 64, offset: 2240)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !78, file: !79, line: 99, baseType: !182, size: 64, offset: 2304)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !78, file: !79, line: 100, baseType: !193, size: 64, offset: 2368)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !142)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !78, file: !79, line: 100, baseType: !196, size: 64, offset: 2432)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !78, file: !79, line: 101, baseType: !139, size: 32, offset: 2496)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !78, file: !79, line: 101, baseType: !139, size: 32, offset: 2528)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !78, file: !79, line: 102, baseType: !182, size: 64, offset: 2560)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !78, file: !79, line: 102, baseType: !182, size: 64, offset: 2624)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !78, file: !79, line: 103, baseType: !202, size: 64, offset: 2688)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !194)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !78, file: !79, line: 103, baseType: !205, size: 64, offset: 2752)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !78, file: !79, line: 104, baseType: !134, size: 64, offset: 2816)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !78, file: !79, line: 105, baseType: !139, size: 32, offset: 2880)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !78, file: !79, line: 106, baseType: !209, size: 128, offset: 2944)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !216)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !79, line: 64, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 61, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !212, file: !79, line: 62, baseType: !127, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !212, file: !79, line: 63, baseType: !176, size: 64, offset: 64)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !78, file: !79, line: 107, baseType: !219, size: 64, offset: 3072)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !216)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !78, file: !79, line: 108, baseType: !176, size: 64, offset: 3136)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !78, file: !79, line: 109, baseType: !222, size: 64, offset: 3200)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!93, !176}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !78, file: !79, line: 111, baseType: !139, size: 32, offset: 3264)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !78, file: !79, line: 112, baseType: !227, size: 320, offset: 3328)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 320, elements: !273)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!93, !231, !76, !176}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !234)
!234 = !{!235, !236, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !233, file: !10, line: 100, baseType: !139, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !10, line: 101, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !248, !249, !250, !254, !256, !258, !259, !260}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !239, file: !10, line: 84, baseType: !166, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !239, file: !10, line: 85, baseType: !166, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !10, line: 86, baseType: !176, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !239, file: !10, line: 87, baseType: !158, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !239, file: !10, line: 88, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !239, file: !10, line: 89, baseType: !118, size: 8, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !239, file: !10, line: 90, baseType: !166, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !239, file: !10, line: 91, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !252, line: 46, baseType: !253)
!252 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!253 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !239, file: !10, line: 92, baseType: !255, size: 32, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !10, line: 93, baseType: !257, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !10, line: 94, baseType: !237, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !239, file: !10, line: 95, baseType: !166, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !239, file: !10, line: 96, baseType: !176, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !233, file: !10, line: 102, baseType: !166, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !233, file: !10, line: 102, baseType: !166, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !233, file: !10, line: 103, baseType: !166, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !233, file: !10, line: 104, baseType: !95, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !233, file: !10, line: 105, baseType: !255, size: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !233, file: !10, line: 105, baseType: !255, size: 32, offset: 416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !233, file: !10, line: 105, baseType: !255, size: 32, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !233, file: !10, line: 106, baseType: !76, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !233, file: !10, line: 107, baseType: !270, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!273 = !{!274}
!274 = !DISubrange(count: 5)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !78, file: !79, line: 113, baseType: !276, size: 320, offset: 3648)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !273)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!93, !76, !176}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !78, file: !79, line: 114, baseType: !281, size: 320, offset: 3968)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !273)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !78, file: !79, line: 115, baseType: !255, size: 32, offset: 4288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !78, file: !79, line: 120, baseType: !270, size: 64, offset: 4352)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !78, file: !79, line: 121, baseType: !255, size: 32, offset: 4416)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Allgatherv", file: !287, line: 11, baseType: !288)
!287 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.h", directory: "/home/users/ndemeye/xSDK")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 8, size: 1280, elements: !289)
!289 = !{!290, !291, !292, !294, !295, !296, !297, !299, !300, !302, !303, !318, !319, !320, !321, !625, !626, !627}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !288, file: !287, line: 9, baseType: !156, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !288, file: !287, line: 9, baseType: !156, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !288, file: !287, line: 9, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !288, file: !287, line: 9, baseType: !139, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !288, file: !287, line: 9, baseType: !185, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !288, file: !287, line: 9, baseType: !185, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !288, file: !287, line: 9, baseType: !298, size: 128, offset: 320)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !288, file: !287, line: 9, baseType: !219, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !288, file: !287, line: 9, baseType: !301, size: 64, offset: 512)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !288, file: !287, line: 9, baseType: !219, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !288, file: !287, line: 9, baseType: !304, size: 128, offset: 640)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 128, elements: !216)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !66, line: 41, size: 576, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !307, file: !66, line: 42, baseType: !185, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !307, file: !66, line: 43, baseType: !139, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !307, file: !66, line: 44, baseType: !185, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !307, file: !66, line: 45, baseType: !185, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !307, file: !66, line: 46, baseType: !185, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !307, file: !66, line: 46, baseType: !185, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !307, file: !66, line: 46, baseType: !185, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !307, file: !66, line: 47, baseType: !185, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !307, file: !66, line: 47, baseType: !185, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !288, file: !287, line: 9, baseType: !304, size: 128, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !288, file: !287, line: 9, baseType: !301, size: 64, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !288, file: !287, line: 9, baseType: !139, size: 32, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !288, file: !287, line: 9, baseType: !322, size: 64, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !323, line: 6, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !66, line: 52, size: 6592, elements: !326)
!326 = !{!327, !334, !527, !528, !529, !530, !534, !535, !539, !540, !541, !545, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !608, !609, !610, !611, !618, !619, !621, !622, !623, !624}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !325, file: !66, line: 53, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!93, !322, !331, !176, !331, !332, !251}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !325, file: !66, line: 54, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!93, !338, !322, !526}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !339, line: 15, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !342)
!342 = !{!343, !345, !441, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !487, !488, !489, !490, !491, !493, !494, !519, !520, !521, !522, !523, !525}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !341, file: !44, line: 67, baseType: !344, size: 4480)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !79, line: 122, baseType: !78)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !341, file: !44, line: 67, baseType: !346, size: 1344, offset: 4480)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 1344, elements: !135)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !348)
!348 = !{!349, !353, !354, !355, !359, !363, !368, !378, !382, !383, !384, !388, !392, !396, !406, !410, !415, !427, !431, !432, !437}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !347, file: !44, line: 40, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!93, !338}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !347, file: !44, line: 41, baseType: !350, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !347, file: !44, line: 42, baseType: !350, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !347, file: !44, line: 43, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!93, !231, !338}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !347, file: !44, line: 44, baseType: !360, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!93, !338, !103}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !347, file: !44, line: 45, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!93, !338, !367, !338}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !347, file: !44, line: 46, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!93, !338, !372, !331, !332, !331, !176, !375}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !96, line: 331, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !96, line: 331, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !96, line: 338, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !96, line: 338, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !347, file: !44, line: 47, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!93, !338, !372, !332, !176, !375}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !347, file: !44, line: 48, baseType: !369, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !347, file: !44, line: 49, baseType: !379, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !347, file: !44, line: 50, baseType: !385, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!93, !338, !372, !331, !176, !331, !332, !176, !375}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !347, file: !44, line: 51, baseType: !389, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!93, !338, !372, !176, !332, !176, !375}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !347, file: !44, line: 52, baseType: !393, size: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!93, !338, !372, !331, !332, !331, !176}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !347, file: !44, line: 53, baseType: !397, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!93, !338, !185, !400, !403, !403, !403}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !347, file: !44, line: 54, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!93, !338, !185, !400, !403, !403}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !347, file: !44, line: 55, baseType: !411, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!93, !338, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !347, file: !44, line: 56, baseType: !416, size: 64, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!93, !338, !185, !185, !403, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !339, line: 49, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 46, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !423, file: !339, line: 47, baseType: !139, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !423, file: !339, line: 48, baseType: !139, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !347, file: !44, line: 57, baseType: !428, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!93, !338, !139, !404, !414}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !347, file: !44, line: 58, baseType: !428, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !347, file: !44, line: 60, baseType: !433, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!93, !331, !251, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !347, file: !44, line: 61, baseType: !438, size: 64, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!93, !331, !176}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !341, file: !44, line: 78, baseType: !442, size: 512, offset: 5824)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !44, line: 68, size: 512, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !451, !452, !453, !454, !455}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !442, file: !44, line: 69, baseType: !139, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !442, file: !44, line: 69, baseType: !139, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !442, file: !44, line: 70, baseType: !255, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !442, file: !44, line: 71, baseType: !255, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !442, file: !44, line: 72, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !442, file: !44, line: 73, baseType: !202, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !442, file: !44, line: 74, baseType: !338, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !442, file: !44, line: 75, baseType: !139, size: 32, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !442, file: !44, line: 76, baseType: !372, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !442, file: !44, line: 77, baseType: !255, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !341, file: !44, line: 81, baseType: !139, size: 32, offset: 6336)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !341, file: !44, line: 82, baseType: !139, size: 32, offset: 6368)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !341, file: !44, line: 83, baseType: !185, size: 64, offset: 6400)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !341, file: !44, line: 84, baseType: !185, size: 64, offset: 6464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !341, file: !44, line: 85, baseType: !139, size: 32, offset: 6528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !341, file: !44, line: 85, baseType: !139, size: 32, offset: 6560)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !341, file: !44, line: 86, baseType: !463, size: 64, offset: 6592)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !341, file: !44, line: 87, baseType: !463, size: 64, offset: 6656)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !341, file: !44, line: 88, baseType: !139, size: 32, offset: 6720)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !341, file: !44, line: 89, baseType: !139, size: 32, offset: 6752)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !341, file: !44, line: 90, baseType: !293, size: 64, offset: 6784)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !341, file: !44, line: 91, baseType: !185, size: 64, offset: 6848)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !341, file: !44, line: 92, baseType: !185, size: 64, offset: 6912)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !341, file: !44, line: 93, baseType: !298, size: 128, offset: 6976)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !341, file: !44, line: 96, baseType: !219, size: 64, offset: 7104)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !341, file: !44, line: 97, baseType: !301, size: 64, offset: 7168)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !341, file: !44, line: 98, baseType: !219, size: 64, offset: 7232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !341, file: !44, line: 99, baseType: !304, size: 128, offset: 7296)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !341, file: !44, line: 100, baseType: !304, size: 128, offset: 7424)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !341, file: !44, line: 101, baseType: !301, size: 64, offset: 7552)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !341, file: !44, line: 103, baseType: !139, size: 32, offset: 7616)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !341, file: !44, line: 104, baseType: !185, size: 64, offset: 7680)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !341, file: !44, line: 105, baseType: !255, size: 32, offset: 7744)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !341, file: !44, line: 106, baseType: !185, size: 64, offset: 7808)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !341, file: !44, line: 107, baseType: !185, size: 64, offset: 7872)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !341, file: !44, line: 108, baseType: !255, size: 32, offset: 7936)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !341, file: !44, line: 109, baseType: !484, size: 64, offset: 8000)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !96, line: 336, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !96, line: 336, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !341, file: !44, line: 110, baseType: !484, size: 64, offset: 8064)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !341, file: !44, line: 111, baseType: !338, size: 64, offset: 8128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !341, file: !44, line: 112, baseType: !255, size: 32, offset: 8192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !341, file: !44, line: 113, baseType: !255, size: 32, offset: 8224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !341, file: !44, line: 114, baseType: !492, size: 32, offset: 8256)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !341, file: !44, line: 115, baseType: !255, size: 32, offset: 8288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !341, file: !44, line: 116, baseType: !495, size: 64, offset: 8320)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !496, line: 60, baseType: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !499, line: 240, size: 640, elements: !500)
!499 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !517, !518}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !498, file: !499, line: 241, baseType: !95, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !498, file: !499, line: 242, baseType: !156, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !498, file: !499, line: 243, baseType: !139, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !498, file: !499, line: 243, baseType: !139, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !498, file: !499, line: 244, baseType: !139, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !498, file: !499, line: 244, baseType: !139, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !498, file: !499, line: 245, baseType: !185, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !498, file: !499, line: 246, baseType: !255, size: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !498, file: !499, line: 247, baseType: !139, size: 32, offset: 352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !498, file: !499, line: 251, baseType: !139, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !498, file: !499, line: 252, baseType: !512, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !496, line: 30, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !496, line: 30, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !498, file: !499, line: 253, baseType: !255, size: 32, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !498, file: !499, line: 254, baseType: !139, size: 32, offset: 544)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !498, file: !499, line: 254, baseType: !139, size: 32, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !498, file: !499, line: 255, baseType: !139, size: 32, offset: 608)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !341, file: !44, line: 117, baseType: !255, size: 32, offset: 8384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !341, file: !44, line: 118, baseType: !255, size: 32, offset: 8416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !341, file: !44, line: 119, baseType: !255, size: 32, offset: 8448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !341, file: !44, line: 120, baseType: !139, size: 32, offset: 8480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !341, file: !44, line: 121, baseType: !524, size: 32, offset: 8512)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !44, line: 122, baseType: !176, size: 64, offset: 8576)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !56)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !325, file: !66, line: 55, baseType: !335, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !325, file: !66, line: 56, baseType: !335, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !325, file: !66, line: 57, baseType: !335, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !325, file: !66, line: 58, baseType: !531, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!93, !322}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !325, file: !66, line: 59, baseType: !531, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !325, file: !66, line: 60, baseType: !536, size: 64, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!93, !338, !322}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !325, file: !66, line: 62, baseType: !335, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !325, file: !66, line: 63, baseType: !335, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !325, file: !66, line: 65, baseType: !542, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!93, !322, !139, !139, !305, !404, !332, !176}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !325, file: !66, line: 66, baseType: !546, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!93, !322, !139, !139, !305, !404, !176, !332}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !325, file: !66, line: 67, baseType: !546, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !325, file: !66, line: 68, baseType: !546, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !325, file: !66, line: 69, baseType: !546, size: 64, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !325, file: !66, line: 70, baseType: !546, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !325, file: !66, line: 71, baseType: !546, size: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !325, file: !66, line: 72, baseType: !546, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !325, file: !66, line: 73, baseType: !546, size: 64, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !325, file: !66, line: 74, baseType: !546, size: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !325, file: !66, line: 75, baseType: !546, size: 64, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !325, file: !66, line: 76, baseType: !546, size: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !325, file: !66, line: 77, baseType: !546, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !325, file: !66, line: 78, baseType: !546, size: 64, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !325, file: !66, line: 79, baseType: !562, size: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!93, !322, !139, !139, !305, !404, !176, !176}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !325, file: !66, line: 81, baseType: !566, size: 64, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!93, !322, !139, !139, !305, !404, !332, !139, !305, !404, !176}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !325, file: !66, line: 82, baseType: !566, size: 64, offset: 1664)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !325, file: !66, line: 83, baseType: !566, size: 64, offset: 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !325, file: !66, line: 84, baseType: !566, size: 64, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !325, file: !66, line: 85, baseType: !566, size: 64, offset: 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !325, file: !66, line: 86, baseType: !566, size: 64, offset: 1920)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !325, file: !66, line: 87, baseType: !566, size: 64, offset: 1984)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !325, file: !66, line: 88, baseType: !566, size: 64, offset: 2048)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !325, file: !66, line: 89, baseType: !566, size: 64, offset: 2112)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !325, file: !66, line: 90, baseType: !566, size: 64, offset: 2176)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !325, file: !66, line: 91, baseType: !566, size: 64, offset: 2240)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !325, file: !66, line: 92, baseType: !566, size: 64, offset: 2304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !325, file: !66, line: 93, baseType: !566, size: 64, offset: 2368)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !325, file: !66, line: 95, baseType: !582, size: 64, offset: 2432)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!93, !322, !139, !139, !305, !404, !176, !139, !305, !404, !332, !176}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !325, file: !66, line: 97, baseType: !255, size: 32, offset: 2496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !325, file: !66, line: 168, baseType: !156, size: 32, offset: 2528)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !325, file: !66, line: 169, baseType: !372, size: 64, offset: 2560)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !325, file: !66, line: 170, baseType: !372, size: 64, offset: 2624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !325, file: !66, line: 171, baseType: !255, size: 32, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !325, file: !66, line: 172, baseType: !251, size: 64, offset: 2752)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !325, file: !66, line: 173, baseType: !139, size: 32, offset: 2816)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !325, file: !66, line: 174, baseType: !332, size: 64, offset: 2880)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !325, file: !66, line: 174, baseType: !332, size: 64, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !325, file: !66, line: 175, baseType: !331, size: 32, offset: 3008)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !325, file: !66, line: 175, baseType: !331, size: 32, offset: 3040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !325, file: !66, line: 178, baseType: !331, size: 32, offset: 3072)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !325, file: !66, line: 178, baseType: !331, size: 32, offset: 3104)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !325, file: !66, line: 179, baseType: !301, size: 64, offset: 3136)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !325, file: !66, line: 179, baseType: !301, size: 64, offset: 3200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !325, file: !66, line: 180, baseType: !139, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !325, file: !66, line: 180, baseType: !139, size: 32, offset: 3296)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !325, file: !66, line: 181, baseType: !603, size: 256, offset: 3328)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 256, elements: !604)
!604 = !{!217, !217}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !325, file: !66, line: 182, baseType: !603, size: 256, offset: 3584)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !325, file: !66, line: 183, baseType: !607, size: 256, offset: 3840)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 256, elements: !604)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !325, file: !66, line: 185, baseType: !607, size: 256, offset: 4096)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !325, file: !66, line: 186, baseType: !607, size: 256, offset: 4352)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !325, file: !66, line: 187, baseType: !607, size: 256, offset: 4608)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !325, file: !66, line: 188, baseType: !612, size: 512, offset: 4864)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 512, elements: !617)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !96, line: 339, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !96, line: 339, flags: DIFlagFwdDecl)
!617 = !{!217, !217, !217}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !325, file: !66, line: 189, baseType: !612, size: 512, offset: 5376)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !325, file: !66, line: 190, baseType: !620, size: 256, offset: 5888)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !617)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !325, file: !66, line: 191, baseType: !620, size: 256, offset: 6144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !325, file: !66, line: 192, baseType: !613, size: 64, offset: 6400)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !66, line: 193, baseType: !322, size: 64, offset: 6464)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !325, file: !66, line: 195, baseType: !255, size: 32, offset: 6528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !288, file: !287, line: 9, baseType: !322, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "displs", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "recvcounts", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !96, line: 341, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !96, line: 351, size: 192, elements: !631)
!631 = !{!632, !633, !634, !635, !636}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !630, file: !96, line: 354, baseType: !83, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !630, file: !96, line: 355, baseType: !83, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !630, file: !96, line: 356, baseType: !83, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !630, file: !96, line: 361, baseType: !83, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !630, file: !96, line: 362, baseType: !251, size: 64, offset: 128)
!637 = !{i32 7, !"Dwarf Version", i32 4}
!638 = !{i32 2, !"Debug Info Version", i32 3}
!639 = !{i32 1, !"wchar_size", i32 4}
!640 = !{i32 7, !"PIC Level", i32 2}
!641 = !{i32 7, !"uwtable", i32 1}
!642 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!643 = distinct !DISubprogram(name: "PetscSFGetGraph_Allgatherv", scope: !644, file: !644, line: 6, type: !417, scopeLine: 7, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !645)
!644 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.c", directory: "/home/users/ndemeye/xSDK")
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !659, !665, !666, !672}
!646 = !DILocalVariable(name: "sf", arg: 1, scope: !643, file: !644, line: 6, type: !338)
!647 = !DILocalVariable(name: "nroots", arg: 2, scope: !643, file: !644, line: 6, type: !185)
!648 = !DILocalVariable(name: "nleaves", arg: 3, scope: !643, file: !644, line: 6, type: !185)
!649 = !DILocalVariable(name: "ilocal", arg: 4, scope: !643, file: !644, line: 6, type: !403)
!650 = !DILocalVariable(name: "iremote", arg: 5, scope: !643, file: !644, line: 6, type: !419)
!651 = !DILocalVariable(name: "ierr", scope: !643, file: !644, line: 8, type: !93)
!652 = !DILocalVariable(name: "i", scope: !643, file: !644, line: 9, type: !139)
!653 = !DILocalVariable(name: "j", scope: !643, file: !644, line: 9, type: !139)
!654 = !DILocalVariable(name: "k", scope: !643, file: !644, line: 9, type: !139)
!655 = !DILocalVariable(name: "range", scope: !643, file: !644, line: 10, type: !404)
!656 = !DILocalVariable(name: "size", scope: !643, file: !644, line: 11, type: !156)
!657 = !DILocalVariable(name: "_7_errorcode", scope: !658, file: !644, line: 14, type: !93)
!658 = distinct !DILexicalBlock(scope: !643, file: !644, line: 14, column: 64)
!659 = !DILocalVariable(name: "_7_errorstring", scope: !660, file: !644, line: 14, type: !662)
!660 = distinct !DILexicalBlock(scope: !661, file: !644, line: 14, column: 64)
!661 = distinct !DILexicalBlock(scope: !658, file: !644, line: 14, column: 64)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2048, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 256)
!665 = !DILocalVariable(name: "_7_resultlen", scope: !660, file: !644, line: 14, type: !156)
!666 = !DILocalVariable(name: "ierr__", scope: !667, file: !644, line: 20, type: !93)
!667 = distinct !DILexicalBlock(scope: !668, file: !644, line: 20, column: 51)
!668 = distinct !DILexicalBlock(scope: !669, file: !644, line: 19, column: 37)
!669 = distinct !DILexicalBlock(scope: !670, file: !644, line: 19, column: 9)
!670 = distinct !DILexicalBlock(scope: !671, file: !644, line: 18, column: 16)
!671 = distinct !DILexicalBlock(scope: !643, file: !644, line: 18, column: 7)
!672 = !DILocalVariable(name: "ierr__", scope: !673, file: !644, line: 21, type: !93)
!673 = distinct !DILexicalBlock(scope: !668, file: !644, line: 21, column: 52)
!674 = !DILocation(line: 0, scope: !643)
!675 = !DILocation(line: 10, column: 3, scope: !643)
!676 = !DILocation(line: 11, column: 3, scope: !643)
!677 = !DILocation(line: 13, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !644, line: 13, column: 3)
!679 = distinct !DILexicalBlock(scope: !680, file: !644, line: 13, column: 3)
!680 = distinct !DILexicalBlock(scope: !643, file: !644, line: 13, column: 3)
!681 = !{!682, !682, i64 0}
!682 = !{!"any pointer", !683, i64 0}
!683 = !{!"omnipotent char", !684, i64 0}
!684 = !{!"Simple C/C++ TBAA"}
!685 = !DILocation(line: 13, column: 3, scope: !679)
!686 = !DILocation(line: 13, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !644, line: 13, column: 3)
