; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/zerodiag.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/zerodiag.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 48, baseType: !5, size: 32, elements: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/isimpl.h", directory: "/home/users/ndemeye/xSDK")
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "IS_INFO_UNKNOWN", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "IS_INFO_FALSE", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "IS_INFO_TRUE", value: 2, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 149, baseType: !5, size: 32, elements: !312)
!312 = !{!313, !314}
!313 = !DIEnumerator(name: "IS_GTOLM_MASK", value: 0, isUnsigned: true)
!314 = !DIEnumerator(name: "IS_GTOLM_DROP", value: 1, isUnsigned: true)
!315 = !{!316, !524, !334, !415, !355, !527}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !319, line: 73, size: 4480, elements: !320)
!319 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!320 = !{!321, !323, !376, !377, !379, !382, !383, !384, !385, !393, !394, !396, !400, !404, !406, !407, !408, !409, !410, !411, !412, !413, !414, !416, !418, !419, !420, !422, !423, !425, !427, !428, !429, !430, !431, !434, !436, !437, !438, !439, !440, !443, !445, !446, !447, !457, !459, !460, !464, !465, !514, !519, !521, !522, !523}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !318, file: !319, line: 74, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !318, file: !319, line: 75, baseType: !324, size: 448, offset: 64)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 448, elements: !374)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !319, line: 53, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 45, size: 448, elements: !327)
!327 = !{!328, !338, !346, !351, !358, !362, !369}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !326, file: !319, line: 46, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !316, !333}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !335, line: 330, baseType: !336)
!335 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !335, line: 330, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !326, file: !319, line: 47, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!332, !316, !342}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !343, line: 16, baseType: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !343, line: 16, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !326, file: !319, line: 48, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!332, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !326, file: !319, line: 49, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!332, !316, !355, !316}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !326, file: !319, line: 50, baseType: !359, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!332, !316, !355, !350}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !326, file: !319, line: 51, baseType: !363, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!332, !316, !355, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !326, file: !319, line: 52, baseType: !370, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!332, !316, !355, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!374 = !{!375}
!375 = !DISubrange(count: 1)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !319, line: 76, baseType: !334, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !319, line: 77, baseType: !378, size: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !318, file: !319, line: 78, baseType: !380, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !381)
!381 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !318, file: !319, line: 78, baseType: !380, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !318, file: !319, line: 78, baseType: !380, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !318, file: !319, line: 78, baseType: !380, size: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !318, file: !319, line: 79, baseType: !386, size: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !389, line: 27, baseType: !390)
!389 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !391, line: 43, baseType: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!392 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !318, file: !319, line: 80, baseType: !378, size: 32, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !318, file: !319, line: 81, baseType: !395, size: 32, offset: 992)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !318, file: !319, line: 82, baseType: !397, size: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !318, file: !319, line: 83, baseType: !401, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !318, file: !319, line: 84, baseType: !405, size: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !318, file: !319, line: 85, baseType: !405, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !318, file: !319, line: 86, baseType: !405, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !318, file: !319, line: 87, baseType: !405, size: 64, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !318, file: !319, line: 88, baseType: !316, size: 64, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !318, file: !319, line: 89, baseType: !386, size: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 90, baseType: !405, size: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !319, line: 91, baseType: !405, size: 64, offset: 1600)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !318, file: !319, line: 92, baseType: !378, size: 32, offset: 1664)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !318, file: !319, line: 93, baseType: !415, size: 64, offset: 1728)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !319, line: 94, baseType: !417, size: 64, offset: 1792)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !387)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !318, file: !319, line: 95, baseType: !378, size: 32, offset: 1856)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !318, file: !319, line: 95, baseType: !378, size: 32, offset: 1888)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !318, file: !319, line: 96, baseType: !421, size: 64, offset: 1920)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !318, file: !319, line: 96, baseType: !421, size: 64, offset: 1984)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !318, file: !319, line: 97, baseType: !424, size: 64, offset: 2048)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !318, file: !319, line: 97, baseType: !426, size: 64, offset: 2112)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !318, file: !319, line: 98, baseType: !378, size: 32, offset: 2176)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !318, file: !319, line: 98, baseType: !378, size: 32, offset: 2208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !318, file: !319, line: 99, baseType: !421, size: 64, offset: 2240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !318, file: !319, line: 99, baseType: !421, size: 64, offset: 2304)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !318, file: !319, line: 100, baseType: !432, size: 64, offset: 2368)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !381)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !318, file: !319, line: 100, baseType: !435, size: 64, offset: 2432)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !318, file: !319, line: 101, baseType: !378, size: 32, offset: 2496)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !318, file: !319, line: 101, baseType: !378, size: 32, offset: 2528)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !318, file: !319, line: 102, baseType: !421, size: 64, offset: 2560)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !318, file: !319, line: 102, baseType: !421, size: 64, offset: 2624)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !318, file: !319, line: 103, baseType: !441, size: 64, offset: 2688)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !433)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !318, file: !319, line: 103, baseType: !444, size: 64, offset: 2752)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !318, file: !319, line: 104, baseType: !373, size: 64, offset: 2816)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !318, file: !319, line: 105, baseType: !378, size: 32, offset: 2880)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !318, file: !319, line: 106, baseType: !448, size: 128, offset: 2944)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 128, elements: !455)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !319, line: 64, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 61, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !451, file: !319, line: 62, baseType: !366, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !451, file: !319, line: 63, baseType: !415, size: 64, offset: 64)
!455 = !{!456}
!456 = !DISubrange(count: 2)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !318, file: !319, line: 107, baseType: !458, size: 64, offset: 3072)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 64, elements: !455)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !318, file: !319, line: 108, baseType: !415, size: 64, offset: 3136)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !318, file: !319, line: 109, baseType: !461, size: 64, offset: 3200)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!332, !415}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !318, file: !319, line: 111, baseType: !378, size: 32, offset: 3264)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !318, file: !319, line: 112, baseType: !466, size: 320, offset: 3328)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 320, elements: !512)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!332, !470, !316, !415}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !473)
!473 = !{!474, !475, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !472, file: !10, line: 100, baseType: !378, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !10, line: 101, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !487, !488, !489, !493, !495, !497, !498, !499}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !478, file: !10, line: 84, baseType: !405, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !478, file: !10, line: 85, baseType: !405, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !478, file: !10, line: 86, baseType: !415, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !478, file: !10, line: 87, baseType: !397, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !478, file: !10, line: 88, baseType: !485, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !478, file: !10, line: 89, baseType: !357, size: 8, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !478, file: !10, line: 90, baseType: !405, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !478, file: !10, line: 91, baseType: !490, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !491, line: 46, baseType: !492)
!491 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!492 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !478, file: !10, line: 92, baseType: !494, size: 32, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !10, line: 93, baseType: !496, size: 32, offset: 544)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !10, line: 94, baseType: !476, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !478, file: !10, line: 95, baseType: !405, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !478, file: !10, line: 96, baseType: !415, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !472, file: !10, line: 102, baseType: !405, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !472, file: !10, line: 102, baseType: !405, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !472, file: !10, line: 103, baseType: !405, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !472, file: !10, line: 104, baseType: !334, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !472, file: !10, line: 105, baseType: !494, size: 32, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !472, file: !10, line: 105, baseType: !494, size: 32, offset: 416)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !472, file: !10, line: 105, baseType: !494, size: 32, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !472, file: !10, line: 106, baseType: !316, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !472, file: !10, line: 107, baseType: !509, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!512 = !{!513}
!513 = !DISubrange(count: 5)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !318, file: !319, line: 113, baseType: !515, size: 320, offset: 3648)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 320, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!332, !316, !415}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !318, file: !319, line: 114, baseType: !520, size: 320, offset: 3968)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 320, elements: !512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !318, file: !319, line: 115, baseType: !494, size: 32, offset: 4288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !319, line: 120, baseType: !509, size: 64, offset: 4352)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !318, file: !319, line: 121, baseType: !494, size: 32, offset: 4416)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !526, line: 1451, baseType: !366)
!526 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS_General", file: !529, line: 14, baseType: !530)
!529 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/is/impls/general/general.h", directory: "/home/users/ndemeye/xSDK")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 10, size: 128, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !530, file: !529, line: 11, baseType: !494, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !530, file: !529, line: 12, baseType: !494, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !530, file: !529, line: 13, baseType: !424, size: 64, offset: 64)
!535 = !{i32 7, !"Dwarf Version", i32 4}
!536 = !{i32 2, !"Debug Info Version", i32 3}
!537 = !{i32 1, !"wchar_size", i32 4}
!538 = !{i32 7, !"PIC Level", i32 2}
!539 = !{i32 7, !"uwtable", i32 1}
!540 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!541 = distinct !DISubprogram(name: "MatReorderForNonzeroDiagonal", scope: !542, file: !542, line: 50, type: !543, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1434)
!542 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/zerodiag.c", directory: "/home/users/ndemeye/xSDK")
!543 = !DISubroutineType(types: !544)
!544 = !{!332, !545, !433, !591, !591}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !548, line: 436, size: 23424, elements: !549)
!548 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!549 = !{!550, !552, !1196, !1197, !1198, !1199, !1201, !1202, !1203, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1330, !1331, !1347, !1348, !1349, !1350, !1351, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1386, !1406, !1407, !1409, !1410, !1411, !1412, !1413, !1414, !1432, !1433}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !547, file: !548, line: 437, baseType: !551, size: 4480)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !319, line: 122, baseType: !318)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !547, file: !548, line: 437, baseType: !553, size: 9472, offset: 4480)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 9472, elements: !374)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !548, line: 32, size: 9472, elements: !555)
!555 = !{!556, !565, !569, !570, !577, !581, !582, !583, !584, !585, !586, !587, !745, !749, !754, !760, !779, !783, !787, !788, !793, !798, !799, !804, !808, !812, !816, !820, !824, !825, !826, !827, !828, !832, !833, !838, !839, !840, !841, !842, !847, !854, !858, !862, !866, !870, !874, !875, !879, !880, !887, !891, !892, !893, !894, !968, !973, !974, !978, !979, !983, !984, !988, !993, !994, !998, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1016, !1017, !1021, !1025, !1029, !1030, !1031, !1035, !1045, !1046, !1050, !1051, !1055, !1056, !1060, !1061, !1066, !1067, !1071, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1085, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1105, !1109, !1110, !1111, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1126, !1127, !1132, !1136, !1137, !1141, !1142, !1143, !1144, !1170, !1174, !1175, !1176, !1177, !1178, !1182, !1183, !1184, !1185, !1186, !1190, !1194, !1195}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !554, file: !548, line: 34, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!332, !545, !378, !560, !378, !560, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !554, file: !548, line: 35, baseType: !566, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!332, !545, !378, !424, !426, !444}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !554, file: !548, line: 36, baseType: !566, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !554, file: !548, line: 37, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!332, !545, !574, !574}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !554, file: !548, line: 38, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!332, !545, !574, !574, !574}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !554, file: !548, line: 40, baseType: !571, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !554, file: !548, line: 41, baseType: !578, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !554, file: !548, line: 42, baseType: !571, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !554, file: !548, line: 43, baseType: !578, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !554, file: !548, line: 44, baseType: !571, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !554, file: !548, line: 46, baseType: !578, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !554, file: !548, line: 47, baseType: !588, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!332, !545, !591, !591, !729}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !592, line: 11, baseType: !593)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !306, line: 50, size: 7104, elements: !595)
!595 = !{!596, !597, !662, !716, !717, !718, !719, !720, !721, !722, !723, !726}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !594, file: !306, line: 51, baseType: !551, size: 4480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !594, file: !306, line: 51, baseType: !598, size: 1536, offset: 4480)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 1536, elements: !374)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !306, line: 21, size: 1536, elements: !600)
!600 = !{!601, !606, !607, !612, !616, !617, !622, !626, !627, !631, !632, !636, !637, !642, !646, !650, !654, !655, !656, !657, !658, !659, !660, !661}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !599, file: !306, line: 22, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!332, !591, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !599, file: !306, line: 23, baseType: !602, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !599, file: !306, line: 24, baseType: !608, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!332, !591, !378, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !599, file: !306, line: 25, baseType: !613, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!332, !591}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !599, file: !306, line: 26, baseType: !613, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !599, file: !306, line: 27, baseType: !618, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!332, !591, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !599, file: !306, line: 28, baseType: !623, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!332, !591, !611}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !599, file: !306, line: 29, baseType: !613, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !599, file: !306, line: 30, baseType: !628, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!332, !591, !342}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !599, file: !306, line: 31, baseType: !628, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !599, file: !306, line: 32, baseType: !633, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!332, !591, !591}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !599, file: !306, line: 33, baseType: !613, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !599, file: !306, line: 34, baseType: !638, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!332, !591, !334, !641, !611}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !300)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !599, file: !306, line: 35, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!332, !591, !378}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !599, file: !306, line: 36, baseType: !647, size: 64, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!332, !591, !378, !378, !424, !621}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !599, file: !306, line: 37, baseType: !651, size: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!332, !591, !378, !424}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !599, file: !306, line: 38, baseType: !618, size: 64, offset: 1024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !599, file: !306, line: 39, baseType: !618, size: 64, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !599, file: !306, line: 40, baseType: !618, size: 64, offset: 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !599, file: !306, line: 41, baseType: !618, size: 64, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !599, file: !306, line: 42, baseType: !618, size: 64, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !599, file: !306, line: 43, baseType: !618, size: 64, offset: 1344)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !599, file: !306, line: 44, baseType: !618, size: 64, offset: 1408)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !599, file: !306, line: 45, baseType: !618, size: 64, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !594, file: !306, line: 52, baseType: !663, size: 64, offset: 6016)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !592, line: 60, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !712, !713, !714, !715}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !665, file: !114, line: 241, baseType: !334, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !114, line: 242, baseType: !395, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !665, file: !114, line: 243, baseType: !378, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !665, file: !114, line: 243, baseType: !378, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !665, file: !114, line: 244, baseType: !378, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !665, file: !114, line: 244, baseType: !378, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !665, file: !114, line: 245, baseType: !424, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !665, file: !114, line: 246, baseType: !494, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !665, file: !114, line: 247, baseType: !378, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !665, file: !114, line: 251, baseType: !378, size: 32, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !665, file: !114, line: 252, baseType: !678, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !592, line: 30, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !306, line: 73, size: 5440, elements: !681)
!681 = !{!682, !683, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !680, file: !306, line: 74, baseType: !551, size: 4480)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !680, file: !306, line: 74, baseType: !684, size: 256, offset: 4480)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 256, elements: !374)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !306, line: 66, size: 256, elements: !686)
!686 = !{!687, !691, !696, !697}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !685, file: !306, line: 67, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!332, !678}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !685, file: !306, line: 68, baseType: !692, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!332, !678, !695, !378, !560, !424, !424}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !114, line: 149, baseType: !311)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !685, file: !306, line: 69, baseType: !692, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !685, file: !306, line: 70, baseType: !688, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !680, file: !306, line: 75, baseType: !378, size: 32, offset: 4736)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !680, file: !306, line: 76, baseType: !378, size: 32, offset: 4768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !680, file: !306, line: 77, baseType: !424, size: 64, offset: 4800)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !680, file: !306, line: 78, baseType: !378, size: 32, offset: 4864)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !680, file: !306, line: 79, baseType: !378, size: 32, offset: 4896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !680, file: !306, line: 80, baseType: !494, size: 32, offset: 4928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !680, file: !306, line: 81, baseType: !494, size: 32, offset: 4960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !680, file: !306, line: 82, baseType: !378, size: 32, offset: 4992)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !680, file: !306, line: 83, baseType: !424, size: 64, offset: 5056)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !680, file: !306, line: 84, baseType: !424, size: 64, offset: 5120)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !680, file: !306, line: 85, baseType: !426, size: 64, offset: 5184)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !680, file: !306, line: 86, baseType: !424, size: 64, offset: 5248)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !680, file: !306, line: 87, baseType: !426, size: 64, offset: 5312)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !306, line: 88, baseType: !415, size: 64, offset: 5376)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !665, file: !114, line: 253, baseType: !494, size: 32, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !665, file: !114, line: 254, baseType: !378, size: 32, offset: 544)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !665, file: !114, line: 254, baseType: !378, size: 32, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !665, file: !114, line: 255, baseType: !378, size: 32, offset: 608)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !594, file: !306, line: 53, baseType: !378, size: 32, offset: 6080)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !594, file: !306, line: 53, baseType: !378, size: 32, offset: 6112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !306, line: 54, baseType: !415, size: 64, offset: 6144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !594, file: !306, line: 55, baseType: !424, size: 64, offset: 6208)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !594, file: !306, line: 55, baseType: !424, size: 64, offset: 6272)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !594, file: !306, line: 56, baseType: !378, size: 32, offset: 6336)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !594, file: !306, line: 57, baseType: !591, size: 64, offset: 6400)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !594, file: !306, line: 58, baseType: !724, size: 320, offset: 6464)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !725)
!725 = !{!456, !513}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !594, file: !306, line: 59, baseType: !727, size: 320, offset: 6784)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 320, elements: !725)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !306, line: 48, baseType: !305)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !732, file: !36, line: 1227, baseType: !433, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !732, file: !36, line: 1228, baseType: !433, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !732, file: !36, line: 1229, baseType: !433, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !732, file: !36, line: 1230, baseType: !433, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !732, file: !36, line: 1231, baseType: !433, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !732, file: !36, line: 1232, baseType: !433, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !732, file: !36, line: 1233, baseType: !433, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !732, file: !36, line: 1234, baseType: !433, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !732, file: !36, line: 1236, baseType: !433, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !732, file: !36, line: 1237, baseType: !433, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !732, file: !36, line: 1238, baseType: !433, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !554, file: !548, line: 48, baseType: !746, size: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!332, !545, !591, !729}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !554, file: !548, line: 49, baseType: !750, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!332, !545, !574, !433, !753, !433, !378, !378, !574}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !554, file: !548, line: 50, baseType: !755, size: 64, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!332, !545, !758, !759}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !554, file: !548, line: 52, baseType: !761, size: 64, offset: 960)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!332, !545, !764, !765}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !767, file: !36, line: 593, baseType: !380, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !767, file: !36, line: 594, baseType: !380, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !767, file: !36, line: 594, baseType: !380, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !767, file: !36, line: 594, baseType: !380, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !767, file: !36, line: 595, baseType: !380, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !767, file: !36, line: 596, baseType: !380, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !767, file: !36, line: 597, baseType: !380, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !767, file: !36, line: 598, baseType: !380, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !767, file: !36, line: 598, baseType: !380, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !767, file: !36, line: 599, baseType: !380, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !554, file: !548, line: 53, baseType: !780, size: 64, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!332, !545, !545, !621}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !554, file: !548, line: 54, baseType: !784, size: 64, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!332, !545, !574}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !554, file: !548, line: 55, baseType: !571, size: 64, offset: 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !554, file: !548, line: 56, baseType: !789, size: 64, offset: 1216)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!332, !545, !792, !432}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !554, file: !548, line: 58, baseType: !794, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!332, !545, !797}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !554, file: !548, line: 59, baseType: !794, size: 64, offset: 1344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !554, file: !548, line: 60, baseType: !800, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!332, !545, !803, !494}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !554, file: !548, line: 61, baseType: !805, size: 64, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!332, !545}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !554, file: !548, line: 63, baseType: !809, size: 64, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!332, !545, !378, !560, !442, !574, !574}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !554, file: !548, line: 64, baseType: !813, size: 64, offset: 1600)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!332, !545, !545, !591, !591, !729}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !554, file: !548, line: 65, baseType: !817, size: 64, offset: 1664)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!332, !545, !545, !729}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !554, file: !548, line: 66, baseType: !821, size: 64, offset: 1728)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!332, !545, !545, !591, !729}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !554, file: !548, line: 67, baseType: !817, size: 64, offset: 1792)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !554, file: !548, line: 69, baseType: !805, size: 64, offset: 1856)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !554, file: !548, line: 70, baseType: !813, size: 64, offset: 1920)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !554, file: !548, line: 71, baseType: !821, size: 64, offset: 1984)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !554, file: !548, line: 72, baseType: !829, size: 64, offset: 2048)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!332, !545, !759}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !554, file: !548, line: 73, baseType: !805, size: 64, offset: 2112)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !554, file: !548, line: 75, baseType: !834, size: 64, offset: 2176)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!332, !545, !837, !759}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !554, file: !548, line: 76, baseType: !571, size: 64, offset: 2240)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !554, file: !548, line: 77, baseType: !571, size: 64, offset: 2304)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !554, file: !548, line: 78, baseType: !588, size: 64, offset: 2368)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !554, file: !548, line: 79, baseType: !746, size: 64, offset: 2432)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !554, file: !548, line: 81, baseType: !843, size: 64, offset: 2496)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!332, !545, !442, !545, !846}
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !554, file: !548, line: 82, baseType: !848, size: 64, offset: 2560)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!332, !545, !378, !851, !851, !758, !853}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !554, file: !548, line: 83, baseType: !855, size: 64, offset: 2624)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!332, !545, !378, !611, !378}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !554, file: !548, line: 84, baseType: !859, size: 64, offset: 2688)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!332, !545, !378, !560, !378, !560, !441}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !554, file: !548, line: 85, baseType: !863, size: 64, offset: 2752)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!332, !545, !545, !846}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !554, file: !548, line: 87, baseType: !867, size: 64, offset: 2816)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!332, !545, !574, !424}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !554, file: !548, line: 88, baseType: !871, size: 64, offset: 2880)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!332, !545, !442}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !554, file: !548, line: 89, baseType: !871, size: 64, offset: 2944)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !554, file: !548, line: 90, baseType: !876, size: 64, offset: 3008)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!332, !545, !574, !564}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !554, file: !548, line: 91, baseType: !809, size: 64, offset: 3072)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !554, file: !548, line: 93, baseType: !881, size: 64, offset: 3136)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!332, !545, !884}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !554, file: !548, line: 94, baseType: !888, size: 64, offset: 3200)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!332, !545, !378, !494, !494, !424, !605, !605, !621}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !554, file: !548, line: 95, baseType: !888, size: 64, offset: 3264)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !554, file: !548, line: 96, baseType: !888, size: 64, offset: 3328)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !554, file: !548, line: 97, baseType: !888, size: 64, offset: 3392)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !554, file: !548, line: 99, baseType: !895, size: 64, offset: 3456)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!332, !545, !898, !914}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !592, line: 51, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !306, line: 91, size: 384, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !910, !911, !913}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !900, file: !306, line: 92, baseType: !378, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !900, file: !306, line: 93, baseType: !378, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !900, file: !306, line: 94, baseType: !611, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !900, file: !306, line: 95, baseType: !334, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !900, file: !306, line: 96, baseType: !907, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !909)
!909 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !900, file: !306, line: 97, baseType: !378, size: 32, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !900, file: !306, line: 98, baseType: !912, size: 32, offset: 288)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !900, file: !306, line: 99, baseType: !494, size: 32, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !548, line: 609, size: 6208, elements: !917)
!917 = !{!918, !919, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !938, !945, !946, !947, !948, !949, !950, !951, !952, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !916, file: !548, line: 610, baseType: !551, size: 4480)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !916, file: !548, line: 610, baseType: !920, size: 32, offset: 4480)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !374)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !916, file: !548, line: 611, baseType: !378, size: 32, offset: 4512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !916, file: !548, line: 611, baseType: !378, size: 32, offset: 4544)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !916, file: !548, line: 611, baseType: !378, size: 32, offset: 4576)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !916, file: !548, line: 612, baseType: !378, size: 32, offset: 4608)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !916, file: !548, line: 613, baseType: !378, size: 32, offset: 4640)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !916, file: !548, line: 614, baseType: !424, size: 64, offset: 4672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !916, file: !548, line: 615, baseType: !426, size: 64, offset: 4736)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !916, file: !548, line: 616, baseType: !611, size: 64, offset: 4800)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !916, file: !548, line: 617, baseType: !424, size: 64, offset: 4864)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !916, file: !548, line: 618, baseType: !931, size: 64, offset: 4928)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !548, line: 602, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 598, size: 128, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !933, file: !548, line: 599, baseType: !378, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !933, file: !548, line: 600, baseType: !378, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !933, file: !548, line: 601, baseType: !441, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !916, file: !548, line: 619, baseType: !939, size: 64, offset: 4992)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !548, line: 607, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 604, size: 128, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !941, file: !548, line: 605, baseType: !378, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !941, file: !548, line: 606, baseType: !441, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !916, file: !548, line: 620, baseType: !441, size: 64, offset: 5056)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !916, file: !548, line: 621, baseType: !433, size: 64, offset: 5120)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !916, file: !548, line: 622, baseType: !433, size: 64, offset: 5184)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !916, file: !548, line: 623, baseType: !574, size: 64, offset: 5248)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !916, file: !548, line: 623, baseType: !574, size: 64, offset: 5312)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !916, file: !548, line: 623, baseType: !574, size: 64, offset: 5376)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !916, file: !548, line: 624, baseType: !494, size: 32, offset: 5440)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !916, file: !548, line: 625, baseType: !953, size: 64, offset: 5504)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!332}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !916, file: !548, line: 626, baseType: !415, size: 64, offset: 5568)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !916, file: !548, line: 627, baseType: !574, size: 64, offset: 5632)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !916, file: !548, line: 628, baseType: !378, size: 32, offset: 5696)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !916, file: !548, line: 629, baseType: !355, size: 64, offset: 5760)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !916, file: !548, line: 630, baseType: !912, size: 32, offset: 5824)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !916, file: !548, line: 631, baseType: !378, size: 32, offset: 5856)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !916, file: !548, line: 631, baseType: !378, size: 32, offset: 5888)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !916, file: !548, line: 632, baseType: !494, size: 32, offset: 5920)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !916, file: !548, line: 633, baseType: !494, size: 32, offset: 5952)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !916, file: !548, line: 634, baseType: !366, size: 64, offset: 6016)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !916, file: !548, line: 634, baseType: !415, size: 64, offset: 6080)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !916, file: !548, line: 635, baseType: !386, size: 64, offset: 6144)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !554, file: !548, line: 100, baseType: !969, size: 64, offset: 3520)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!332, !545, !378, !378, !907, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !554, file: !548, line: 101, baseType: !805, size: 64, offset: 3584)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !554, file: !548, line: 102, baseType: !975, size: 64, offset: 3648)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!332, !545, !591, !591, !759}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !554, file: !548, line: 103, baseType: !557, size: 64, offset: 3712)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !554, file: !548, line: 105, baseType: !980, size: 64, offset: 3776)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!332, !545, !591, !591, !758, !759}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !554, file: !548, line: 106, baseType: !805, size: 64, offset: 3840)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !554, file: !548, line: 107, baseType: !985, size: 64, offset: 3904)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!332, !545, !342}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !554, file: !548, line: 108, baseType: !989, size: 64, offset: 3968)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!332, !545, !992, !758, !759}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !355)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !554, file: !548, line: 109, baseType: !953, size: 64, offset: 4032)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !554, file: !548, line: 111, baseType: !995, size: 64, offset: 4096)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!332, !545, !545, !545, !433, !545}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !554, file: !548, line: 112, baseType: !999, size: 64, offset: 4160)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!332, !545, !545, !545, !545}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !554, file: !548, line: 113, baseType: !1003, size: 64, offset: 4224)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!332, !545, !678, !678}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !554, file: !548, line: 114, baseType: !557, size: 64, offset: 4288)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !554, file: !548, line: 115, baseType: !809, size: 64, offset: 4352)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !554, file: !548, line: 117, baseType: !867, size: 64, offset: 4416)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !554, file: !548, line: 118, baseType: !867, size: 64, offset: 4480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !554, file: !548, line: 119, baseType: !989, size: 64, offset: 4544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !554, file: !548, line: 120, baseType: !1012, size: 64, offset: 4608)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!332, !545, !1015, !621}
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !554, file: !548, line: 121, baseType: !953, size: 64, offset: 4672)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !554, file: !548, line: 123, baseType: !1018, size: 64, offset: 4736)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!332, !545, !378, !415}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !554, file: !548, line: 124, baseType: !1022, size: 64, offset: 4800)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!332, !545, !914, !574, !415}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !554, file: !548, line: 125, baseType: !1026, size: 64, offset: 4864)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!332, !470, !545}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !554, file: !548, line: 126, baseType: !571, size: 64, offset: 4928)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !554, file: !548, line: 127, baseType: !571, size: 64, offset: 4992)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !554, file: !548, line: 129, baseType: !1032, size: 64, offset: 5056)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!332, !545, !611}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !554, file: !548, line: 130, baseType: !1036, size: 64, offset: 5120)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!332, !545, !1039, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1041, file: !60, line: 653, baseType: !378, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1041, file: !60, line: 653, baseType: !574, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !554, file: !548, line: 131, baseType: !1036, size: 64, offset: 5184)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !554, file: !548, line: 132, baseType: !1047, size: 64, offset: 5248)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!332, !545, !424, !424, !424}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !554, file: !548, line: 133, baseType: !985, size: 64, offset: 5312)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !554, file: !548, line: 135, baseType: !1052, size: 64, offset: 5376)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!332, !545, !433, !621}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !554, file: !548, line: 136, baseType: !1052, size: 64, offset: 5440)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !554, file: !548, line: 137, baseType: !1057, size: 64, offset: 5504)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!332, !545, !621}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !554, file: !548, line: 138, baseType: !557, size: 64, offset: 5568)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !554, file: !548, line: 139, baseType: !1062, size: 64, offset: 5632)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!332, !545, !1065, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !554, file: !548, line: 141, baseType: !953, size: 64, offset: 5696)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !554, file: !548, line: 142, baseType: !1068, size: 64, offset: 5760)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!332, !545, !545, !433, !545}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !554, file: !548, line: 143, baseType: !1072, size: 64, offset: 5824)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!332, !545, !545, !545}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !554, file: !548, line: 144, baseType: !953, size: 64, offset: 5888)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !554, file: !548, line: 145, baseType: !1068, size: 64, offset: 5952)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !554, file: !548, line: 147, baseType: !1072, size: 64, offset: 6016)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !554, file: !548, line: 148, baseType: !953, size: 64, offset: 6080)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !554, file: !548, line: 149, baseType: !1068, size: 64, offset: 6144)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !554, file: !548, line: 150, baseType: !1072, size: 64, offset: 6208)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !554, file: !548, line: 151, baseType: !1082, size: 64, offset: 6272)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!332, !545, !494}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !554, file: !548, line: 153, baseType: !805, size: 64, offset: 6336)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !554, file: !548, line: 154, baseType: !805, size: 64, offset: 6400)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !554, file: !548, line: 155, baseType: !805, size: 64, offset: 6464)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !554, file: !548, line: 156, baseType: !805, size: 64, offset: 6528)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !554, file: !548, line: 157, baseType: !985, size: 64, offset: 6592)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !554, file: !548, line: 159, baseType: !1091, size: 64, offset: 6656)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!332, !545, !378, !562}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !554, file: !548, line: 160, baseType: !805, size: 64, offset: 6720)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !554, file: !548, line: 161, baseType: !805, size: 64, offset: 6784)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !554, file: !548, line: 162, baseType: !805, size: 64, offset: 6848)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !554, file: !548, line: 163, baseType: !805, size: 64, offset: 6912)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !554, file: !548, line: 165, baseType: !1072, size: 64, offset: 6976)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !554, file: !548, line: 166, baseType: !1072, size: 64, offset: 7040)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !554, file: !548, line: 167, baseType: !867, size: 64, offset: 7104)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !554, file: !548, line: 168, baseType: !1102, size: 64, offset: 7168)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!332, !545, !574, !378}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !554, file: !548, line: 169, baseType: !1106, size: 64, offset: 7232)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!332, !545, !621, !424}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !554, file: !548, line: 171, baseType: !829, size: 64, offset: 7296)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !554, file: !548, line: 172, baseType: !805, size: 64, offset: 7360)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !554, file: !548, line: 173, baseType: !1112, size: 64, offset: 7424)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!332, !545, !424, !605}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !554, file: !548, line: 174, baseType: !975, size: 64, offset: 7488)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !554, file: !548, line: 175, baseType: !975, size: 64, offset: 7552)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !554, file: !548, line: 177, baseType: !571, size: 64, offset: 7616)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !554, file: !548, line: 178, baseType: !755, size: 64, offset: 7680)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !554, file: !548, line: 179, baseType: !571, size: 64, offset: 7744)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !554, file: !548, line: 180, baseType: !578, size: 64, offset: 7808)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !554, file: !548, line: 181, baseType: !1122, size: 64, offset: 7872)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!332, !545, !334, !758, !759}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !554, file: !548, line: 183, baseType: !1032, size: 64, offset: 7936)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !554, file: !548, line: 184, baseType: !789, size: 64, offset: 8000)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !554, file: !548, line: 185, baseType: !1128, size: 64, offset: 8064)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!332, !545, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !554, file: !548, line: 186, baseType: !1133, size: 64, offset: 8128)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!332, !545, !378, !560, !441}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !554, file: !548, line: 187, baseType: !848, size: 64, offset: 8192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !554, file: !548, line: 189, baseType: !1138, size: 64, offset: 8256)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!332, !545, !378, !378, !424, !562}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !554, file: !548, line: 190, baseType: !953, size: 64, offset: 8320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !554, file: !548, line: 191, baseType: !1068, size: 64, offset: 8384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !554, file: !548, line: 192, baseType: !1072, size: 64, offset: 8448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !554, file: !548, line: 193, baseType: !1145, size: 64, offset: 8512)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!332, !545, !898, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !548, line: 660, size: 5312, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1150, file: !548, line: 661, baseType: !551, size: 4480)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1150, file: !548, line: 661, baseType: !920, size: 32, offset: 4480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1150, file: !548, line: 662, baseType: !378, size: 32, offset: 4512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1150, file: !548, line: 662, baseType: !378, size: 32, offset: 4544)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1150, file: !548, line: 662, baseType: !378, size: 32, offset: 4576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1150, file: !548, line: 663, baseType: !378, size: 32, offset: 4608)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1150, file: !548, line: 664, baseType: !378, size: 32, offset: 4640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1150, file: !548, line: 665, baseType: !424, size: 64, offset: 4672)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1150, file: !548, line: 666, baseType: !424, size: 64, offset: 4736)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1150, file: !548, line: 667, baseType: !378, size: 32, offset: 4800)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1150, file: !548, line: 668, baseType: !912, size: 32, offset: 4832)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1150, file: !548, line: 670, baseType: !424, size: 64, offset: 4864)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1150, file: !548, line: 670, baseType: !424, size: 64, offset: 4928)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1150, file: !548, line: 671, baseType: !424, size: 64, offset: 4992)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1150, file: !548, line: 672, baseType: !424, size: 64, offset: 5056)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1150, file: !548, line: 673, baseType: !424, size: 64, offset: 5120)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1150, file: !548, line: 674, baseType: !378, size: 32, offset: 5184)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1150, file: !548, line: 675, baseType: !424, size: 64, offset: 5248)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !554, file: !548, line: 195, baseType: !1171, size: 64, offset: 8576)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!332, !1148, !545, !545}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !554, file: !548, line: 196, baseType: !1171, size: 64, offset: 8640)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !554, file: !548, line: 197, baseType: !953, size: 64, offset: 8704)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !554, file: !548, line: 198, baseType: !1068, size: 64, offset: 8768)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !554, file: !548, line: 199, baseType: !1072, size: 64, offset: 8832)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !554, file: !548, line: 201, baseType: !1179, size: 64, offset: 8896)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!332, !545, !378, !378}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !554, file: !548, line: 202, baseType: !843, size: 64, offset: 8960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !554, file: !548, line: 203, baseType: !578, size: 64, offset: 9024)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !554, file: !548, line: 204, baseType: !895, size: 64, offset: 9088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !554, file: !548, line: 205, baseType: !1032, size: 64, offset: 9152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !554, file: !548, line: 206, baseType: !1187, size: 64, offset: 9216)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!332, !334, !545, !378, !758, !759}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !554, file: !548, line: 208, baseType: !1191, size: 64, offset: 9280)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!332, !378, !853}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !554, file: !548, line: 209, baseType: !1072, size: 64, offset: 9344)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !554, file: !548, line: 210, baseType: !859, size: 64, offset: 9408)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !547, file: !548, line: 438, baseType: !663, size: 64, offset: 13952)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !547, file: !548, line: 438, baseType: !663, size: 64, offset: 14016)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !547, file: !548, line: 439, baseType: !415, size: 64, offset: 14080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !547, file: !548, line: 440, baseType: !1200, size: 32, offset: 14144)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !547, file: !548, line: 441, baseType: !494, size: 32, offset: 14176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !547, file: !548, line: 442, baseType: !494, size: 32, offset: 14208)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !547, file: !548, line: 443, baseType: !1204, size: 448, offset: 14272)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 448, elements: !1206)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !355)
!1206 = !{!1207}
!1207 = !DISubrange(count: 7)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !547, file: !548, line: 444, baseType: !494, size: 32, offset: 14720)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !547, file: !548, line: 445, baseType: !494, size: 32, offset: 14752)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !547, file: !548, line: 446, baseType: !378, size: 32, offset: 14784)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !547, file: !548, line: 447, baseType: !417, size: 64, offset: 14848)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !547, file: !548, line: 448, baseType: !417, size: 64, offset: 14912)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !547, file: !548, line: 449, baseType: !766, size: 640, offset: 14976)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !547, file: !548, line: 450, baseType: !564, size: 32, offset: 15616)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !547, file: !548, line: 451, baseType: !1216, size: 2880, offset: 15680)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !548, line: 318, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !548, line: 319, size: 2880, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223, !1224, !1225, !1238, !1239, !1244, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1264, !1265, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1297, !1298, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1321, !1322, !1323, !1327, !1328}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1217, file: !548, line: 320, baseType: !378, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1217, file: !548, line: 321, baseType: !378, size: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1217, file: !548, line: 322, baseType: !378, size: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1217, file: !548, line: 323, baseType: !378, size: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1217, file: !548, line: 324, baseType: !378, size: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1217, file: !548, line: 325, baseType: !378, size: 32, offset: 160)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1217, file: !548, line: 326, baseType: !1226, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !548, line: 293, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !548, line: 295, size: 448, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1228, file: !548, line: 296, baseType: !1226, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1228, file: !548, line: 297, baseType: !441, size: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1228, file: !548, line: 297, baseType: !441, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1228, file: !548, line: 298, baseType: !424, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1228, file: !548, line: 298, baseType: !424, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1228, file: !548, line: 299, baseType: !378, size: 32, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1228, file: !548, line: 300, baseType: !378, size: 32, offset: 352)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1228, file: !548, line: 301, baseType: !378, size: 32, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1217, file: !548, line: 326, baseType: !1226, size: 64, offset: 256)
