; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipelcg/pipelcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipelcg/pipelcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !140, line: 70, baseType: !5, size: 32, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !143, !144}
!142 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!143 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 451, baseType: !64, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151}
!147 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!148 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!149 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!150 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!151 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 663, baseType: !5, size: 32, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !156, !157}
!155 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!158 = !{!159, !162, !180, !261, !201, !367, !689, !692, !251, !64, !648, !227}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !160, line: 46, baseType: !161)
!160 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!161 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !165, line: 73, size: 4480, elements: !166)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!166 = !{!167, !169, !222, !223, !225, !228, !229, !230, !231, !239, !240, !242, !246, !250, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !264, !265, !266, !268, !269, !271, !273, !274, !275, !276, !277, !280, !282, !283, !284, !285, !286, !289, !291, !292, !293, !303, !305, !306, !310, !311, !357, !362, !364, !365, !366}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !164, file: !165, line: 74, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !164, file: !165, line: 75, baseType: !170, size: 448, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, elements: !220)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !165, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 45, size: 448, elements: !173)
!173 = !{!174, !184, !192, !197, !204, !208, !215}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !172, file: !165, line: 46, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !162, !179}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !181, line: 330, baseType: !182)
!181 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !181, line: 330, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !172, file: !165, line: 47, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!178, !162, !188}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !189, line: 16, baseType: !190)
!189 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !189, line: 16, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !172, file: !165, line: 48, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!178, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !172, file: !165, line: 49, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!178, !162, !201, !162}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !172, file: !165, line: 50, baseType: !205, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!178, !162, !201, !196}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !172, file: !165, line: 51, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!178, !162, !201, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !172, file: !165, line: 52, baseType: !216, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!178, !162, !201, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !164, file: !165, line: 76, baseType: !180, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 77, baseType: !224, size: 32, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !227)
!227 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 79, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !235, line: 27, baseType: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !237, line: 43, baseType: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!238 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !164, file: !165, line: 80, baseType: !224, size: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !164, file: !165, line: 81, baseType: !241, size: 32, offset: 992)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !164, file: !165, line: 82, baseType: !243, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !164, file: !165, line: 83, baseType: !247, size: 64, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !164, file: !165, line: 84, baseType: !251, size: 64, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !164, file: !165, line: 85, baseType: !251, size: 64, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !164, file: !165, line: 86, baseType: !251, size: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !164, file: !165, line: 87, baseType: !251, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 88, baseType: !162, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !164, file: !165, line: 89, baseType: !232, size: 64, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 90, baseType: !251, size: 64, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !164, file: !165, line: 91, baseType: !251, size: 64, offset: 1600)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !164, file: !165, line: 92, baseType: !224, size: 32, offset: 1664)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !164, file: !165, line: 93, baseType: !261, size: 64, offset: 1728)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 94, baseType: !263, size: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !233)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !164, file: !165, line: 95, baseType: !224, size: 32, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !164, file: !165, line: 95, baseType: !224, size: 32, offset: 1888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !164, file: !165, line: 96, baseType: !267, size: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !164, file: !165, line: 96, baseType: !267, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !164, file: !165, line: 97, baseType: !270, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !164, file: !165, line: 97, baseType: !272, size: 64, offset: 2112)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !164, file: !165, line: 98, baseType: !224, size: 32, offset: 2176)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !164, file: !165, line: 98, baseType: !224, size: 32, offset: 2208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !164, file: !165, line: 99, baseType: !267, size: 64, offset: 2240)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !164, file: !165, line: 99, baseType: !267, size: 64, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !164, file: !165, line: 100, baseType: !278, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !227)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !164, file: !165, line: 100, baseType: !281, size: 64, offset: 2432)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !164, file: !165, line: 101, baseType: !224, size: 32, offset: 2496)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !164, file: !165, line: 101, baseType: !224, size: 32, offset: 2528)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !164, file: !165, line: 102, baseType: !267, size: 64, offset: 2560)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !164, file: !165, line: 102, baseType: !267, size: 64, offset: 2624)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !164, file: !165, line: 103, baseType: !287, size: 64, offset: 2688)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !279)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !164, file: !165, line: 103, baseType: !290, size: 64, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !164, file: !165, line: 104, baseType: !219, size: 64, offset: 2816)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !164, file: !165, line: 105, baseType: !224, size: 32, offset: 2880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !164, file: !165, line: 106, baseType: !294, size: 128, offset: 2944)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 128, elements: !301)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !165, line: 64, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 61, size: 128, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !165, line: 62, baseType: !212, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !297, file: !165, line: 63, baseType: !261, size: 64, offset: 64)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !164, file: !165, line: 107, baseType: !304, size: 64, offset: 3072)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !164, file: !165, line: 108, baseType: !261, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !164, file: !165, line: 109, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!178, !261}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !164, file: !165, line: 111, baseType: !224, size: 32, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !164, file: !165, line: 112, baseType: !312, size: 320, offset: 3328)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !355)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!178, !316, !162, !261}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !319)
!319 = !{!320, !321, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !10, line: 100, baseType: !224, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !10, line: 101, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !333, !334, !335, !336, !338, !340, !341, !342}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !324, file: !10, line: 84, baseType: !251, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !324, file: !10, line: 85, baseType: !251, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !10, line: 86, baseType: !261, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !324, file: !10, line: 87, baseType: !243, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !10, line: 88, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !324, file: !10, line: 89, baseType: !203, size: 8, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !324, file: !10, line: 90, baseType: !251, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !324, file: !10, line: 91, baseType: !159, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !10, line: 92, baseType: !337, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !10, line: 93, baseType: !339, size: 32, offset: 544)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !10, line: 94, baseType: !322, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !324, file: !10, line: 95, baseType: !251, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !324, file: !10, line: 96, baseType: !261, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !10, line: 102, baseType: !251, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !318, file: !10, line: 102, baseType: !251, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !318, file: !10, line: 103, baseType: !251, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !10, line: 104, baseType: !180, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !318, file: !10, line: 106, baseType: !162, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !10, line: 107, baseType: !352, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!355 = !{!356}
!356 = !DISubrange(count: 5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !164, file: !165, line: 113, baseType: !358, size: 320, offset: 3648)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 320, elements: !355)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!178, !162, !261}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !164, file: !165, line: 114, baseType: !363, size: 320, offset: 3968)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !355)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !164, file: !165, line: 115, baseType: !337, size: 32, offset: 4288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !164, file: !165, line: 120, baseType: !352, size: 64, offset: 4352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !164, file: !165, line: 121, baseType: !337, size: 32, offset: 4416)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_CG_PIPE_L", file: !369, line: 14, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipelcg/pipelcg.c", directory: "/home/users/ndemeye/xSDK")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KSP_CG_PIPE_L_s", file: !369, line: 15, size: 960, elements: !371)
!371 = !{!372, !373, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !370, file: !369, line: 16, baseType: !224, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !370, file: !369, line: 17, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !378, line: 142, size: 12800, elements: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!379 = !{!380, !382, !601, !622, !623, !624, !670, !671, !672, !673, !675}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !377, file: !378, line: 143, baseType: !381, size: 4480)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !165, line: 122, baseType: !164)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !377, file: !378, line: 143, baseType: !383, size: 5248, offset: 4480)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 5248, elements: !220)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !378, line: 23, size: 5248, elements: !385)
!385 = !{!386, !390, !395, !399, !403, !409, !414, !415, !416, !420, !424, !425, !426, !430, !434, !440, !441, !445, !449, !453, !454, !461, !465, !466, !470, !474, !475, !476, !480, !481, !488, !493, !494, !495, !499, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !520, !521, !522, !526, !530, !531, !532, !533, !537, !538, !539, !540, !541, !542, !543, !547, !548, !552, !559, !560, !565, !566, !570, !571, !572, !573, !574, !575, !576, !577, !581, !582, !583, !589, !593, !594, !595}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !384, file: !378, line: 24, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!178, !375, !374}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !384, file: !378, line: 25, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!178, !375, !224, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !384, file: !378, line: 26, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!178, !224, !374}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !384, file: !378, line: 27, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!178, !375, !375, !287}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !384, file: !378, line: 28, baseType: !404, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!178, !375, !224, !407, !287}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !384, file: !378, line: 29, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!178, !375, !413, !278}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !384, file: !378, line: 30, baseType: !400, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !384, file: !378, line: 31, baseType: !404, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !384, file: !378, line: 32, baseType: !417, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!178, !375, !288}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !384, file: !378, line: 33, baseType: !421, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!178, !375, !375}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !384, file: !378, line: 34, baseType: !417, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !384, file: !378, line: 35, baseType: !421, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !384, file: !378, line: 36, baseType: !427, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!178, !375, !288, !375}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !384, file: !378, line: 37, baseType: !431, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!178, !375, !288, !288, !375}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !384, file: !378, line: 38, baseType: !435, size: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!178, !375, !224, !438, !374}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !384, file: !378, line: 39, baseType: !427, size: 64, offset: 960)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !384, file: !378, line: 40, baseType: !442, size: 64, offset: 1024)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!178, !375, !288, !375, !375}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !384, file: !378, line: 41, baseType: !446, size: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!178, !375, !288, !288, !288, !375, !375}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !384, file: !378, line: 42, baseType: !450, size: 64, offset: 1152)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!178, !375, !375, !375}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !384, file: !378, line: 43, baseType: !450, size: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !384, file: !378, line: 44, baseType: !455, size: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!178, !375, !224, !458, !438, !460}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !384, file: !378, line: 45, baseType: !462, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!178, !375}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !384, file: !378, line: 46, baseType: !462, size: 64, offset: 1408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !384, file: !378, line: 47, baseType: !467, size: 64, offset: 1472)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!178, !375, !290}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !384, file: !378, line: 48, baseType: !471, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!178, !375, !270}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !384, file: !378, line: 49, baseType: !471, size: 64, offset: 1600)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !384, file: !378, line: 50, baseType: !467, size: 64, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !384, file: !378, line: 51, baseType: !477, size: 64, offset: 1728)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!178, !375, !270, !278}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !384, file: !378, line: 52, baseType: !477, size: 64, offset: 1792)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !384, file: !378, line: 53, baseType: !482, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!178, !375, !485}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !384, file: !378, line: 54, baseType: !489, size: 64, offset: 1920)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!178, !375, !492, !337}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !384, file: !378, line: 55, baseType: !455, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !384, file: !378, line: 56, baseType: !462, size: 64, offset: 2048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !384, file: !378, line: 57, baseType: !496, size: 64, offset: 2112)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!178, !375, !188}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !384, file: !378, line: 58, baseType: !500, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!178, !375, !438}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !384, file: !378, line: 59, baseType: !500, size: 64, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !384, file: !378, line: 60, baseType: !400, size: 64, offset: 2304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !384, file: !378, line: 61, baseType: !400, size: 64, offset: 2368)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !384, file: !378, line: 62, baseType: !410, size: 64, offset: 2432)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !384, file: !378, line: 63, baseType: !404, size: 64, offset: 2496)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !384, file: !378, line: 64, baseType: !404, size: 64, offset: 2560)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !384, file: !378, line: 65, baseType: !496, size: 64, offset: 2624)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !384, file: !378, line: 66, baseType: !462, size: 64, offset: 2688)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !384, file: !378, line: 67, baseType: !462, size: 64, offset: 2752)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !384, file: !378, line: 68, baseType: !513, size: 64, offset: 2816)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!178, !375, !516}
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !517, line: 30, baseType: !518)
!517 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !517, line: 30, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !384, file: !378, line: 69, baseType: !455, size: 64, offset: 2880)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !384, file: !378, line: 70, baseType: !462, size: 64, offset: 2944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !384, file: !378, line: 71, baseType: !523, size: 64, offset: 3008)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!178, !316, !375}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !384, file: !378, line: 72, baseType: !527, size: 64, offset: 3072)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!178, !375, !375, !278}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !384, file: !378, line: 73, baseType: !450, size: 64, offset: 3136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !384, file: !378, line: 74, baseType: !450, size: 64, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !384, file: !378, line: 75, baseType: !450, size: 64, offset: 3264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !384, file: !378, line: 76, baseType: !534, size: 64, offset: 3328)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!178, !375, !224, !458, !287}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !384, file: !378, line: 77, baseType: !462, size: 64, offset: 3392)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !384, file: !378, line: 78, baseType: !462, size: 64, offset: 3456)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !384, file: !378, line: 79, baseType: !462, size: 64, offset: 3520)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !384, file: !378, line: 80, baseType: !462, size: 64, offset: 3584)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !384, file: !378, line: 81, baseType: !417, size: 64, offset: 3648)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !384, file: !378, line: 82, baseType: !462, size: 64, offset: 3712)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !384, file: !378, line: 83, baseType: !544, size: 64, offset: 3776)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!178, !375, !224, !375, !460}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !384, file: !378, line: 84, baseType: !544, size: 64, offset: 3840)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !384, file: !378, line: 85, baseType: !549, size: 64, offset: 3904)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!178, !375, !375, !287, !287}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !384, file: !378, line: 86, baseType: !553, size: 64, offset: 3968)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!178, !375, !556, !374}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !517, line: 11, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !517, line: 11, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !384, file: !378, line: 87, baseType: !553, size: 64, offset: 4032)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !384, file: !378, line: 88, baseType: !561, size: 64, offset: 4096)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!178, !375, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !384, file: !378, line: 89, baseType: !561, size: 64, offset: 4160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !384, file: !378, line: 90, baseType: !567, size: 64, offset: 4224)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!178, !375, !224, !458, !458, !375, !460}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !384, file: !378, line: 91, baseType: !567, size: 64, offset: 4288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !384, file: !378, line: 92, baseType: !496, size: 64, offset: 4352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !384, file: !378, line: 93, baseType: !496, size: 64, offset: 4416)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !384, file: !378, line: 94, baseType: !421, size: 64, offset: 4480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !384, file: !378, line: 95, baseType: !421, size: 64, offset: 4544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !384, file: !378, line: 96, baseType: !421, size: 64, offset: 4608)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !384, file: !378, line: 97, baseType: !421, size: 64, offset: 4672)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !384, file: !378, line: 98, baseType: !578, size: 64, offset: 4736)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!178, !375, !337}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !384, file: !378, line: 99, baseType: !467, size: 64, offset: 4800)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !384, file: !378, line: 100, baseType: !467, size: 64, offset: 4864)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !384, file: !378, line: 101, baseType: !584, size: 64, offset: 4928)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!178, !375, !290, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !384, file: !378, line: 102, baseType: !590, size: 64, offset: 4992)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!178, !375, !564, !587}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !384, file: !378, line: 103, baseType: !467, size: 64, offset: 5056)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !384, file: !378, line: 104, baseType: !561, size: 64, offset: 5120)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !384, file: !378, line: 105, baseType: !596, size: 64, offset: 5184)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!178, !224, !407, !374, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !377, file: !378, line: 144, baseType: !602, size: 64, offset: 9728)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !517, line: 60, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !605, line: 240, size: 640, elements: !606)
!605 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !604, file: !605, line: 241, baseType: !180, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !605, line: 242, baseType: !241, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !604, file: !605, line: 243, baseType: !224, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !604, file: !605, line: 243, baseType: !224, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !604, file: !605, line: 244, baseType: !224, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !604, file: !605, line: 244, baseType: !224, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !604, file: !605, line: 245, baseType: !270, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !604, file: !605, line: 246, baseType: !337, size: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !604, file: !605, line: 247, baseType: !224, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !604, file: !605, line: 251, baseType: !224, size: 32, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !604, file: !605, line: 252, baseType: !516, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !604, file: !605, line: 253, baseType: !337, size: 32, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !604, file: !605, line: 254, baseType: !224, size: 32, offset: 544)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !604, file: !605, line: 254, baseType: !224, size: 32, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !604, file: !605, line: 255, baseType: !224, size: 32, offset: 608)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !377, file: !378, line: 145, baseType: !261, size: 64, offset: 9792)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !377, file: !378, line: 146, baseType: !337, size: 32, offset: 9856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !377, file: !378, line: 147, baseType: !625, size: 1344, offset: 9920)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !378, line: 140, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 114, size: 1344, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !646, !647, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !626, file: !378, line: 115, baseType: !224, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !626, file: !378, line: 116, baseType: !224, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !626, file: !378, line: 117, baseType: !224, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !626, file: !378, line: 118, baseType: !224, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !626, file: !378, line: 119, baseType: !224, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !626, file: !378, line: 120, baseType: !224, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !626, file: !378, line: 121, baseType: !270, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !626, file: !378, line: 122, baseType: !287, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !626, file: !378, line: 124, baseType: !180, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !626, file: !378, line: 125, baseType: !241, size: 32, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !626, file: !378, line: 125, baseType: !241, size: 32, offset: 416)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !626, file: !378, line: 126, baseType: !241, size: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !626, file: !378, line: 126, baseType: !241, size: 32, offset: 480)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !626, file: !378, line: 127, baseType: !642, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !181, line: 339, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !181, line: 339, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !626, file: !378, line: 128, baseType: !642, size: 64, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !626, file: !378, line: 129, baseType: !648, size: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !181, line: 341, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !181, line: 351, size: 192, elements: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !650, file: !181, line: 354, baseType: !64, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !650, file: !181, line: 355, baseType: !64, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !650, file: !181, line: 356, baseType: !64, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !650, file: !181, line: 361, baseType: !64, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !650, file: !181, line: 362, baseType: !159, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !626, file: !378, line: 130, baseType: !224, size: 32, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !626, file: !378, line: 130, baseType: !224, size: 32, offset: 736)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !626, file: !378, line: 131, baseType: !287, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !626, file: !378, line: 131, baseType: !287, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !626, file: !378, line: 132, baseType: !270, size: 64, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !626, file: !378, line: 132, baseType: !270, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !626, file: !378, line: 133, baseType: !224, size: 32, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !626, file: !378, line: 134, baseType: !270, size: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !626, file: !378, line: 135, baseType: !224, size: 32, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !626, file: !378, line: 136, baseType: !337, size: 32, offset: 1184)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !626, file: !378, line: 137, baseType: !337, size: 32, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !626, file: !378, line: 138, baseType: !460, size: 32, offset: 1248)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !626, file: !378, line: 139, baseType: !270, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !377, file: !378, line: 147, baseType: !625, size: 1344, offset: 11264)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !377, file: !378, line: 148, baseType: !337, size: 32, offset: 12608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !378, line: 149, baseType: !224, size: 32, offset: 12640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !377, file: !378, line: 150, baseType: !674, size: 32, offset: 12672)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !377, file: !378, line: 157, baseType: !251, size: 64, offset: 12736)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !370, file: !369, line: 18, baseType: !374, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !370, file: !369, line: 19, baseType: !374, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !370, file: !369, line: 20, baseType: !374, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !370, file: !369, line: 21, baseType: !375, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !370, file: !369, line: 22, baseType: !287, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !370, file: !369, line: 23, baseType: !287, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !370, file: !369, line: 23, baseType: !287, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !370, file: !369, line: 23, baseType: !287, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lmin", scope: !370, file: !369, line: 24, baseType: !279, size: 64, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lmax", scope: !370, file: !369, line: 24, baseType: !279, size: 64, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !370, file: !369, line: 25, baseType: !278, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !370, file: !369, line: 26, baseType: !642, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "show_rstrt", scope: !370, file: !369, line: 27, baseType: !337, size: 32, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !181, line: 331, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !181, line: 331, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !181, line: 338, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !181, line: 338, flags: DIFlagFwdDecl)
!695 = !{i32 7, !"Dwarf Version", i32 4}
!696 = !{i32 2, !"Debug Info Version", i32 3}
!697 = !{i32 1, !"wchar_size", i32 4}
!698 = !{i32 7, !"PIC Level", i32 2}
!699 = !{i32 7, !"uwtable", i32 1}
!700 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!701 = distinct !DISubprogram(name: "KSPCreate_PIPELCG", scope: !369, file: !369, line: 547, type: !702, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !941)
!702 = !DISubroutineType(types: !703)
!703 = !{!178, !704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !71, line: 22, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !140, line: 75, size: 12800, elements: !707)
!707 = !{!708, !709, !756, !761, !762, !763, !764, !794, !795, !796, !797, !798, !800, !805, !806, !807, !808, !809, !810, !811, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !834, !840, !841, !842, !843, !848, !849, !850, !851, !856, !857, !858, !859, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !911, !912, !913, !914, !915, !922, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !938, !939, !940}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !706, file: !140, line: 76, baseType: !381, size: 4480)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !706, file: !140, line: 76, baseType: !710, size: 896, offset: 4480)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 896, elements: !220)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !140, line: 18, size: 896, elements: !712)
!712 = !{!713, !717, !721, !723, !731, !732, !736, !737, !741, !745, !749, !750, !754, !755}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !711, file: !140, line: 19, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!178, !704, !375, !374}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !711, file: !140, line: 22, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!178, !704, !375, !375, !374}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !711, file: !140, line: 25, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !711, file: !140, line: 26, baseType: !724, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!178, !704, !727, !727}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !728, line: 16, baseType: !729)
!728 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !728, line: 16, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !711, file: !140, line: 27, baseType: !722, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !711, file: !140, line: 28, baseType: !733, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!178, !316, !704}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !711, file: !140, line: 29, baseType: !722, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !711, file: !140, line: 30, baseType: !738, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!178, !704, !278, !278}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !711, file: !140, line: 31, baseType: !742, size: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!178, !704, !224, !278, !278, !270}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !711, file: !140, line: 32, baseType: !746, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!178, !704, !337, !337, !270, !374, !278, !278}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !711, file: !140, line: 33, baseType: !722, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !711, file: !140, line: 34, baseType: !751, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!178, !704, !188}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !711, file: !140, line: 35, baseType: !722, size: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !711, file: !140, line: 36, baseType: !751, size: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !706, file: !140, line: 77, baseType: !757, size: 64, offset: 5376)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !758, line: 14, baseType: !759)
!758 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !758, line: 14, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !706, file: !140, line: 78, baseType: !337, size: 32, offset: 5440)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !706, file: !140, line: 79, baseType: !337, size: 32, offset: 5472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !706, file: !140, line: 81, baseType: !224, size: 32, offset: 5504)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !706, file: !140, line: 82, baseType: !765, size: 64, offset: 5568)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !71, line: 752, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !140, line: 54, size: 5184, elements: !768)
!768 = !{!769, !770, !790, !791, !792, !793}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !767, file: !140, line: 55, baseType: !381, size: 4480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !767, file: !140, line: 55, baseType: !771, size: 448, offset: 4480)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 448, elements: !220)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !140, line: 41, size: 448, elements: !773)
!773 = !{!774, !778, !779, !783, !784, !785, !789}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !772, file: !140, line: 42, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!178, !765, !375, !375}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !772, file: !140, line: 43, baseType: !775, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !772, file: !140, line: 44, baseType: !780, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!178, !765}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !772, file: !140, line: 45, baseType: !780, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !772, file: !140, line: 46, baseType: !780, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !772, file: !140, line: 47, baseType: !786, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!178, !765, !188}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !772, file: !140, line: 48, baseType: !780, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !767, file: !140, line: 56, baseType: !704, size: 64, offset: 4928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !767, file: !140, line: 57, baseType: !727, size: 64, offset: 4992)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !767, file: !140, line: 58, baseType: !263, size: 64, offset: 5056)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !140, line: 59, baseType: !261, size: 64, offset: 5120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !706, file: !140, line: 83, baseType: !337, size: 32, offset: 5632)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !706, file: !140, line: 84, baseType: !337, size: 32, offset: 5664)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !706, file: !140, line: 85, baseType: !337, size: 32, offset: 5696)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !706, file: !140, line: 86, baseType: !337, size: 32, offset: 5728)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !706, file: !140, line: 87, baseType: !799, size: 32, offset: 5760)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !63, line: 85, baseType: !62)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !706, file: !140, line: 88, baseType: !801, size: 384, offset: 5792)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 384, elements: !802)
!802 = !{!803, !804}
!803 = !DISubrange(count: 4)
!804 = !DISubrange(count: 3)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !706, file: !140, line: 89, baseType: !279, size: 64, offset: 6208)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !706, file: !140, line: 90, baseType: !279, size: 64, offset: 6272)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !706, file: !140, line: 91, baseType: !279, size: 64, offset: 6336)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !706, file: !140, line: 92, baseType: !279, size: 64, offset: 6400)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !706, file: !140, line: 93, baseType: !279, size: 64, offset: 6464)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !706, file: !140, line: 94, baseType: !279, size: 64, offset: 6528)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !706, file: !140, line: 95, baseType: !812, size: 32, offset: 6592)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !71, line: 540, baseType: !70)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !706, file: !140, line: 96, baseType: !337, size: 32, offset: 6624)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !706, file: !140, line: 98, baseType: !375, size: 64, offset: 6656)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !706, file: !140, line: 98, baseType: !375, size: 64, offset: 6720)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !706, file: !140, line: 102, baseType: !278, size: 64, offset: 6784)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !706, file: !140, line: 103, baseType: !278, size: 64, offset: 6848)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !706, file: !140, line: 104, baseType: !224, size: 32, offset: 6912)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !706, file: !140, line: 105, baseType: !224, size: 32, offset: 6944)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !706, file: !140, line: 106, baseType: !337, size: 32, offset: 6976)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !706, file: !140, line: 107, baseType: !278, size: 64, offset: 7040)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !706, file: !140, line: 108, baseType: !278, size: 64, offset: 7104)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !706, file: !140, line: 109, baseType: !224, size: 32, offset: 7168)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !706, file: !140, line: 110, baseType: !224, size: 32, offset: 7200)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !706, file: !140, line: 111, baseType: !337, size: 32, offset: 7232)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !706, file: !140, line: 113, baseType: !224, size: 32, offset: 7264)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !706, file: !140, line: 114, baseType: !337, size: 32, offset: 7296)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !706, file: !140, line: 117, baseType: !224, size: 32, offset: 7328)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !706, file: !140, line: 120, baseType: !830, size: 320, offset: 7360)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 320, elements: !355)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!178, !704, !224, !279, !261}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !706, file: !140, line: 121, baseType: !835, size: 320, offset: 7680)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 320, elements: !355)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!178, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !706, file: !140, line: 122, baseType: !363, size: 320, offset: 8000)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !706, file: !140, line: 123, baseType: !224, size: 32, offset: 8320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !706, file: !140, line: 124, baseType: !337, size: 32, offset: 8352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !706, file: !140, line: 126, baseType: !844, size: 320, offset: 8384)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 320, elements: !355)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!178, !704, !261}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !706, file: !140, line: 127, baseType: !835, size: 320, offset: 8704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !706, file: !140, line: 128, baseType: !363, size: 320, offset: 9024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !706, file: !140, line: 129, baseType: !224, size: 32, offset: 9344)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !706, file: !140, line: 131, baseType: !852, size: 64, offset: 9408)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!178, !704, !224, !279, !855, !261}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !706, file: !140, line: 132, baseType: !307, size: 64, offset: 9472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !706, file: !140, line: 133, baseType: !261, size: 64, offset: 9536)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !706, file: !140, line: 135, baseType: !261, size: 64, offset: 9600)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !706, file: !140, line: 137, baseType: !860, size: 64, offset: 9664)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !63, line: 11, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !63, line: 11, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !706, file: !140, line: 139, baseType: !261, size: 64, offset: 9728)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9792)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9824)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9856)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9888)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9920)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9952)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 9984)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10016)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10048)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10080)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10112)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10144)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10176)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !706, file: !140, line: 142, baseType: !337, size: 32, offset: 10208)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10240)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10304)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10368)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10496)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10560)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10624)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10688)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10752)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10816)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10880)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 10944)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 11008)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !706, file: !140, line: 143, baseType: !188, size: 64, offset: 11072)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11136)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !95, line: 162, baseType: !94)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11168)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11200)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11232)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11264)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11296)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11328)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11360)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11392)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11424)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11456)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11488)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11520)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !706, file: !140, line: 144, baseType: !893, size: 32, offset: 11552)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !706, file: !140, line: 147, baseType: !224, size: 32, offset: 11584)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !706, file: !140, line: 148, baseType: !374, size: 64, offset: 11648)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !706, file: !140, line: 150, baseType: !910, size: 32, offset: 11712)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !140, line: 70, baseType: !139)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !706, file: !140, line: 151, baseType: !337, size: 32, offset: 11744)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !706, file: !140, line: 153, baseType: !224, size: 32, offset: 11776)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !706, file: !140, line: 154, baseType: !224, size: 32, offset: 11808)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !706, file: !140, line: 156, baseType: !337, size: 32, offset: 11840)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !706, file: !140, line: 161, baseType: !916, size: 192, offset: 11904)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !706, file: !140, line: 157, size: 192, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !916, file: !140, line: 158, baseType: !727, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !916, file: !140, line: 158, baseType: !727, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !916, file: !140, line: 159, baseType: !337, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !916, file: !140, line: 160, baseType: !337, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !706, file: !140, line: 163, baseType: !923, size: 32, offset: 12096)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !71, line: 451, baseType: !145)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !706, file: !140, line: 165, baseType: !799, size: 32, offset: 12128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !706, file: !140, line: 166, baseType: !923, size: 32, offset: 12160)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !706, file: !140, line: 171, baseType: !337, size: 32, offset: 12192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !706, file: !140, line: 172, baseType: !337, size: 32, offset: 12224)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !706, file: !140, line: 173, baseType: !337, size: 32, offset: 12256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !706, file: !140, line: 174, baseType: !375, size: 64, offset: 12288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !706, file: !140, line: 175, baseType: !375, size: 64, offset: 12352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !706, file: !140, line: 177, baseType: !224, size: 32, offset: 12416)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !706, file: !140, line: 178, baseType: !337, size: 32, offset: 12448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !706, file: !140, line: 180, baseType: !188, size: 64, offset: 12480)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !706, file: !140, line: 182, baseType: !935, size: 64, offset: 12544)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!178, !704, !375, !375, !261}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !706, file: !140, line: 183, baseType: !935, size: 64, offset: 12608)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !706, file: !140, line: 184, baseType: !261, size: 64, offset: 12672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !706, file: !140, line: 184, baseType: !261, size: 64, offset: 12736)
!941 = !{!942, !943, !944, !945, !947, !949}
!942 = !DILocalVariable(name: "ksp", arg: 1, scope: !701, file: !369, line: 547, type: !704)
!943 = !DILocalVariable(name: "ierr", scope: !701, file: !369, line: 549, type: !178)
!944 = !DILocalVariable(name: "plcg", scope: !701, file: !369, line: 550, type: !367)
!945 = !DILocalVariable(name: "ierr__", scope: !946, file: !369, line: 553, type: !178)
!946 = distinct !DILexicalBlock(scope: !701, file: !369, line: 553, column: 33)
!947 = !DILocalVariable(name: "ierr__", scope: !948, file: !369, line: 556, type: !178)
!948 = distinct !DILexicalBlock(scope: !701, file: !369, line: 556, column: 59)
!949 = !DILocalVariable(name: "ierr__", scope: !950, file: !369, line: 557, type: !178)
!950 = distinct !DILexicalBlock(scope: !701, file: !369, line: 557, column: 62)
!951 = !DILocation(line: 0, scope: !701)
!952 = !DILocation(line: 550, column: 3, scope: !701)
!953 = !DILocation(line: 550, column: 19, scope: !701)
!954 = !{!955, !955, i64 0}
!955 = !{!"any pointer", !956, i64 0}
!956 = !{!"omnipotent char", !957, i64 0}
!957 = !{!"Simple C/C++ TBAA"}
!958 = !DILocation(line: 552, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !369, line: 552, column: 3)
!960 = distinct !DILexicalBlock(scope: !961, file: !369, line: 552, column: 3)
!961 = distinct !DILexicalBlock(scope: !701, file: !369, line: 552, column: 3)
!962 = !DILocation(line: 552, column: 3, scope: !960)
!963 = !DILocation(line: 552, column: 3, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !369, line: 552, column: 3)
!965 = distinct !DILexicalBlock(scope: !959, file: !369, line: 552, column: 3)
!966 = !{!967, !968, i64 1536}
!967 = !{!"", !956, i64 0, !956, i64 512, !956, i64 1024, !956, i64 1280, !968, i64 1536, !968, i64 1540, !956, i64 1544}
!968 = !{!"int", !956, i64 0}
!969 = !DILocation(line: 552, column: 3, scope: !965)
!970 = !DILocation(line: 552, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !964, file: !369, line: 552, column: 3)
!972 = !{!968, !968, i64 0}
!973 = !{!967, !968, i64 1540}
!974 = !DILocation(line: 553, column: 10, scope: !701)
!975 = !{!"branch_weights", i32 2146410443, i32 1073205}
!976 = !DILocation(line: 0, scope: !946)
!977 = !DILocation(line: 553, column: 33, scope: !946)
!978 = !{!"branch_weights", i32 2000, i32 1}
!979 = !DILocation(line: 553, column: 33, scope: !980)
!980 = distinct !DILexicalBlock(scope: !946, file: !369, line: 553, column: 33)
!981 = !DILocation(line: 554, column: 22, scope: !701)
!982 = !DILocation(line: 554, column: 8, scope: !701)
!983 = !DILocation(line: 554, column: 13, scope: !701)
!984 = !{!985, !955, i64 1216}
