; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/smg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/smg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }
%struct.PetscOps = type { i32 (%struct._p_PetscObject*, %struct.ompi_communicator_t**)*, i32 (%struct._p_PetscObject*, %struct._p_PetscViewer*)*, i32 (%struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject*)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, void ()*)*, i32 (%struct._p_PetscObject*, i8*, void ()**)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !65, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/smg.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !32, !38, !45, !54, !60}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 563, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "MAT_DO_NOT_COPY_VALUES", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_COPY_VALUES", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MAT_SHARE_NONZERO_PATTERN", value: 2, isUnsigned: true)
!65 = !{!66, !84, !165, !105}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !69, line: 73, size: 4480, elements: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!70 = !{!71, !73, !126, !127, !129, !132, !133, !134, !135, !143, !144, !146, !150, !154, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !168, !169, !170, !172, !173, !175, !177, !178, !179, !180, !181, !184, !186, !187, !188, !189, !190, !193, !195, !196, !197, !207, !209, !210, !214, !215, !264, !269, !271, !272, !273}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !68, file: !69, line: 74, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !68, file: !69, line: 75, baseType: !74, size: 448, offset: 64)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 448, elements: !124)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !69, line: 53, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 45, size: 448, elements: !77)
!77 = !{!78, !88, !96, !101, !108, !112, !119}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !76, file: !69, line: 46, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !66, !83}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !85, line: 330, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !85, line: 330, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !76, file: !69, line: 47, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!82, !66, !92}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !93, line: 16, baseType: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !93, line: 16, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !76, file: !69, line: 48, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!82, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !76, file: !69, line: 49, baseType: !102, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!82, !66, !105, !66}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !76, file: !69, line: 50, baseType: !109, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!82, !66, !105, !100}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !76, file: !69, line: 51, baseType: !113, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!82, !66, !105, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !76, file: !69, line: 52, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!82, !66, !105, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!124 = !{!125}
!125 = !DISubrange(count: 1)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !68, file: !69, line: 76, baseType: !84, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !69, line: 77, baseType: !128, size: 32, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !68, file: !69, line: 78, baseType: !130, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !131)
!131 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !68, file: !69, line: 78, baseType: !130, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !68, file: !69, line: 78, baseType: !130, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !68, file: !69, line: 78, baseType: !130, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !68, file: !69, line: 79, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !139, line: 27, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !141, line: 43, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!142 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !68, file: !69, line: 80, baseType: !128, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !68, file: !69, line: 81, baseType: !145, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !68, file: !69, line: 82, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !68, file: !69, line: 83, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !68, file: !69, line: 84, baseType: !155, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !68, file: !69, line: 85, baseType: !155, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !68, file: !69, line: 86, baseType: !155, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !68, file: !69, line: 87, baseType: !155, size: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !68, file: !69, line: 88, baseType: !66, size: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !68, file: !69, line: 89, baseType: !136, size: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 90, baseType: !155, size: 64, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !68, file: !69, line: 91, baseType: !155, size: 64, offset: 1600)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !68, file: !69, line: 92, baseType: !128, size: 32, offset: 1664)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !68, file: !69, line: 93, baseType: !165, size: 64, offset: 1728)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !68, file: !69, line: 94, baseType: !167, size: 64, offset: 1792)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !137)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !68, file: !69, line: 95, baseType: !128, size: 32, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !68, file: !69, line: 95, baseType: !128, size: 32, offset: 1888)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !68, file: !69, line: 96, baseType: !171, size: 64, offset: 1920)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !68, file: !69, line: 96, baseType: !171, size: 64, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !68, file: !69, line: 97, baseType: !174, size: 64, offset: 2048)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !68, file: !69, line: 97, baseType: !176, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !68, file: !69, line: 98, baseType: !128, size: 32, offset: 2176)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !68, file: !69, line: 98, baseType: !128, size: 32, offset: 2208)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !68, file: !69, line: 99, baseType: !171, size: 64, offset: 2240)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !68, file: !69, line: 99, baseType: !171, size: 64, offset: 2304)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !68, file: !69, line: 100, baseType: !182, size: 64, offset: 2368)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !131)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !68, file: !69, line: 100, baseType: !185, size: 64, offset: 2432)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !68, file: !69, line: 101, baseType: !128, size: 32, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !68, file: !69, line: 101, baseType: !128, size: 32, offset: 2528)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !68, file: !69, line: 102, baseType: !171, size: 64, offset: 2560)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !68, file: !69, line: 102, baseType: !171, size: 64, offset: 2624)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !68, file: !69, line: 103, baseType: !191, size: 64, offset: 2688)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !183)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !68, file: !69, line: 103, baseType: !194, size: 64, offset: 2752)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !68, file: !69, line: 104, baseType: !123, size: 64, offset: 2816)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !68, file: !69, line: 105, baseType: !128, size: 32, offset: 2880)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !68, file: !69, line: 106, baseType: !198, size: 128, offset: 2944)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 128, elements: !205)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !69, line: 64, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 61, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !201, file: !69, line: 62, baseType: !116, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !201, file: !69, line: 63, baseType: !165, size: 64, offset: 64)
!205 = !{!206}
!206 = !DISubrange(count: 2)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !68, file: !69, line: 107, baseType: !208, size: 64, offset: 3072)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !205)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !68, file: !69, line: 108, baseType: !165, size: 64, offset: 3136)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !68, file: !69, line: 109, baseType: !211, size: 64, offset: 3200)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!82, !165}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !68, file: !69, line: 111, baseType: !128, size: 32, offset: 3264)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !68, file: !69, line: 112, baseType: !216, size: 320, offset: 3328)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 320, elements: !262)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!82, !220, !66, !165}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !223)
!223 = !{!224, !225, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !222, file: !10, line: 100, baseType: !128, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !10, line: 101, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !237, !238, !239, !243, !245, !247, !248, !249}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !228, file: !10, line: 84, baseType: !155, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !228, file: !10, line: 85, baseType: !155, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !10, line: 86, baseType: !165, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !228, file: !10, line: 87, baseType: !147, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !228, file: !10, line: 88, baseType: !235, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !228, file: !10, line: 89, baseType: !107, size: 8, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !228, file: !10, line: 90, baseType: !155, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !228, file: !10, line: 91, baseType: !240, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !241, line: 46, baseType: !242)
!241 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!242 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !228, file: !10, line: 92, baseType: !244, size: 32, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !10, line: 93, baseType: !246, size: 32, offset: 544)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !10, line: 94, baseType: !226, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !228, file: !10, line: 95, baseType: !155, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !228, file: !10, line: 96, baseType: !165, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !222, file: !10, line: 102, baseType: !155, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !222, file: !10, line: 102, baseType: !155, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !222, file: !10, line: 103, baseType: !155, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !222, file: !10, line: 104, baseType: !84, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !222, file: !10, line: 105, baseType: !244, size: 32, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !222, file: !10, line: 105, baseType: !244, size: 32, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !222, file: !10, line: 105, baseType: !244, size: 32, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !222, file: !10, line: 106, baseType: !66, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !222, file: !10, line: 107, baseType: !259, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!262 = !{!263}
!263 = !DISubrange(count: 5)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !68, file: !69, line: 113, baseType: !265, size: 320, offset: 3648)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 320, elements: !262)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!82, !66, !165}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !68, file: !69, line: 114, baseType: !270, size: 320, offset: 3968)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 320, elements: !262)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !68, file: !69, line: 115, baseType: !244, size: 32, offset: 4288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !68, file: !69, line: 120, baseType: !259, size: 64, offset: 4352)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !68, file: !69, line: 121, baseType: !244, size: 32, offset: 4416)
!274 = !{i32 7, !"Dwarf Version", i32 4}
!275 = !{i32 2, !"Debug Info Version", i32 3}
!276 = !{i32 1, !"wchar_size", i32 4}
!277 = !{i32 7, !"PIC Level", i32 2}
!278 = !{i32 7, !"uwtable", i32 1}
!279 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!280 = distinct !DISubprogram(name: "PCMGACycle_Private", scope: !281, file: !281, line: 7, type: !282, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !437)
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/smg.c", directory: "/home/users/ndemeye/xSDK")
!282 = !DISubroutineType(types: !283)
!283 = !{!82, !284, !394, !244, !244}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !287, line: 37, size: 6720, elements: !288)
!287 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!288 = !{!289, !291, !358, !363, !364, !365, !366, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !387, !388, !389, !390, !391, !393}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !286, file: !287, line: 38, baseType: !290, size: 4480)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !69, line: 122, baseType: !68)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !286, file: !287, line: 38, baseType: !292, size: 1152, offset: 4480)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1152, elements: !124)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !287, line: 13, size: 1152, elements: !294)
!294 = !{!295, !299, !307, !314, !320, !325, !326, !330, !334, !342, !343, !348, !349, !350, !351, !352, !356, !357}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !293, file: !287, line: 14, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!82, !284}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !293, file: !287, line: 15, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!82, !284, !303, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !304, line: 21, baseType: !305)
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !304, line: 21, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !293, file: !287, line: 16, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!82, !284, !311, !311}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !293, file: !287, line: 17, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!82, !284, !303, !303, !303, !183, !183, !183, !128, !244, !174, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !293, file: !287, line: 18, baseType: !321, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!82, !284, !324, !303, !303, !303}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !293, file: !287, line: 19, baseType: !300, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !293, file: !287, line: 20, baseType: !327, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!82, !284, !128, !303, !303, !303}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !293, file: !287, line: 21, baseType: !331, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!82, !220, !284}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !293, file: !287, line: 22, baseType: !335, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!82, !284, !338, !303, !303}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !339, line: 22, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !339, line: 22, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !293, file: !287, line: 23, baseType: !335, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !293, file: !287, line: 24, baseType: !344, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!82, !284, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !293, file: !287, line: 25, baseType: !300, size: 64, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !293, file: !287, line: 26, baseType: !300, size: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !293, file: !287, line: 27, baseType: !296, size: 64, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !293, file: !287, line: 28, baseType: !296, size: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !293, file: !287, line: 29, baseType: !353, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!82, !284, !92}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !293, file: !287, line: 30, baseType: !296, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !293, file: !287, line: 31, baseType: !353, size: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !286, file: !287, line: 39, baseType: !359, size: 64, offset: 5632)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !360, line: 14, baseType: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !360, line: 14, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !286, file: !287, line: 40, baseType: !128, size: 32, offset: 5696)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !286, file: !287, line: 41, baseType: !167, size: 64, offset: 5760)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !286, file: !287, line: 41, baseType: !167, size: 64, offset: 5824)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !286, file: !287, line: 42, baseType: !244, size: 32, offset: 5888)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !287, line: 43, baseType: !368, size: 32, offset: 5920)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !286, file: !287, line: 45, baseType: !128, size: 32, offset: 5952)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !286, file: !287, line: 46, baseType: !244, size: 32, offset: 5984)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !286, file: !287, line: 47, baseType: !311, size: 64, offset: 6016)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !286, file: !287, line: 47, baseType: !311, size: 64, offset: 6080)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !286, file: !287, line: 48, baseType: !303, size: 64, offset: 6144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !286, file: !287, line: 48, baseType: !303, size: 64, offset: 6208)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !286, file: !287, line: 49, baseType: !244, size: 32, offset: 6272)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !286, file: !287, line: 50, baseType: !244, size: 32, offset: 6304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !286, file: !287, line: 51, baseType: !378, size: 64, offset: 6336)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!82, !284, !128, !381, !381, !347, !165}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !384, line: 11, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !384, line: 11, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !286, file: !287, line: 52, baseType: !165, size: 64, offset: 6400)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !287, line: 53, baseType: !165, size: 64, offset: 6464)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !286, file: !287, line: 54, baseType: !128, size: 32, offset: 6528)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !286, file: !287, line: 55, baseType: !165, size: 64, offset: 6592)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !286, file: !287, line: 56, baseType: !392, size: 32, offset: 6656)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !286, file: !287, line: 57, baseType: !392, size: 32, offset: 6688)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !397, line: 48, baseType: !398)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 14, size: 1600, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !411, !415, !416, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !434, !435, !436}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !398, file: !397, line: 15, baseType: !128, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !398, file: !397, line: 16, baseType: !128, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !398, file: !397, line: 17, baseType: !128, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !398, file: !397, line: 18, baseType: !303, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !398, file: !397, line: 19, baseType: !303, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !398, file: !397, line: 20, baseType: !303, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !398, file: !397, line: 21, baseType: !311, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !398, file: !397, line: 22, baseType: !311, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !398, file: !397, line: 23, baseType: !311, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpace", scope: !398, file: !397, line: 24, baseType: !410, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !398, file: !397, line: 29, baseType: !412, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!82, !311, !303, !303, !303}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "residualtranspose", scope: !398, file: !397, line: 30, baseType: !412, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "matresidual", scope: !398, file: !397, line: 31, baseType: !417, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!82, !311, !311, !311, !311}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "matresidualtranspose", scope: !398, file: !397, line: 32, baseType: !417, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !398, file: !397, line: 34, baseType: !311, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "smoothd", scope: !398, file: !397, line: 35, baseType: !338, size: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "smoothu", scope: !398, file: !397, line: 36, baseType: !338, size: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !398, file: !397, line: 37, baseType: !338, size: 64, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "crx", scope: !398, file: !397, line: 38, baseType: !303, size: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "crb", scope: !398, file: !397, line: 39, baseType: !303, size: 64, offset: 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !398, file: !397, line: 40, baseType: !311, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "restrct", scope: !398, file: !397, line: 41, baseType: !311, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "inject", scope: !398, file: !397, line: 42, baseType: !311, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rscale", scope: !398, file: !397, line: 43, baseType: !303, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsetup", scope: !398, file: !397, line: 44, baseType: !432, size: 32, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !433, line: 80, baseType: !26)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsolve", scope: !398, file: !397, line: 45, baseType: !432, size: 32, offset: 1504)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "eventresidual", scope: !398, file: !397, line: 46, baseType: !432, size: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "eventinterprestrict", scope: !398, file: !397, line: 47, baseType: !432, size: 32, offset: 1568)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !452, !458, !461, !466, !469, !473, !482, !485, !488, !492, !498, !500, !503, !505, !508, !510, !514, !521, !527, !530, !535, !538}
!438 = !DILocalVariable(name: "pc", arg: 1, scope: !280, file: !281, line: 7, type: !284)
!439 = !DILocalVariable(name: "mglevels", arg: 2, scope: !280, file: !281, line: 7, type: !394)
!440 = !DILocalVariable(name: "transpose", arg: 3, scope: !280, file: !281, line: 7, type: !244)
!441 = !DILocalVariable(name: "matapp", arg: 4, scope: !280, file: !281, line: 7, type: !244)
!442 = !DILocalVariable(name: "ierr", scope: !280, file: !281, line: 9, type: !82)
!443 = !DILocalVariable(name: "i", scope: !280, file: !281, line: 10, type: !128)
!444 = !DILocalVariable(name: "l", scope: !280, file: !281, line: 10, type: !128)
!445 = !DILocalVariable(name: "ierr__", scope: !446, file: !281, line: 15, type: !82)
!446 = distinct !DILexicalBlock(scope: !447, file: !281, line: 15, column: 112)
!447 = distinct !DILexicalBlock(scope: !448, file: !281, line: 15, column: 43)
!448 = distinct !DILexicalBlock(scope: !449, file: !281, line: 15, column: 9)
!449 = distinct !DILexicalBlock(scope: !450, file: !281, line: 14, column: 25)
!450 = distinct !DILexicalBlock(scope: !451, file: !281, line: 14, column: 3)
!451 = distinct !DILexicalBlock(scope: !280, file: !281, line: 14, column: 3)
!452 = !DILocalVariable(name: "ierr__", scope: !453, file: !281, line: 17, type: !82)
!453 = distinct !DILexicalBlock(scope: !454, file: !281, line: 17, column: 98)
!454 = distinct !DILexicalBlock(scope: !455, file: !281, line: 17, column: 19)
!455 = distinct !DILexicalBlock(scope: !456, file: !281, line: 17, column: 11)
!456 = distinct !DILexicalBlock(scope: !457, file: !281, line: 16, column: 21)
!457 = distinct !DILexicalBlock(scope: !449, file: !281, line: 16, column: 9)
!458 = !DILocalVariable(name: "ierr__", scope: !459, file: !281, line: 18, type: !82)
!459 = distinct !DILexicalBlock(scope: !460, file: !281, line: 18, column: 87)
!460 = distinct !DILexicalBlock(scope: !455, file: !281, line: 18, column: 12)
!461 = !DILocalVariable(name: "ierr__", scope: !462, file: !281, line: 20, type: !82)
!462 = distinct !DILexicalBlock(scope: !463, file: !281, line: 20, column: 102)
!463 = distinct !DILexicalBlock(scope: !464, file: !281, line: 20, column: 19)
!464 = distinct !DILexicalBlock(scope: !465, file: !281, line: 20, column: 11)
!465 = distinct !DILexicalBlock(scope: !457, file: !281, line: 19, column: 12)
!466 = !DILocalVariable(name: "ierr__", scope: !467, file: !281, line: 21, type: !82)
!467 = distinct !DILexicalBlock(scope: !468, file: !281, line: 21, column: 91)
!468 = distinct !DILexicalBlock(scope: !464, file: !281, line: 21, column: 12)
!469 = !DILocalVariable(name: "ierr__", scope: !470, file: !281, line: 23, type: !82)
!470 = distinct !DILexicalBlock(scope: !471, file: !281, line: 23, column: 110)
!471 = distinct !DILexicalBlock(scope: !472, file: !281, line: 23, column: 43)
!472 = distinct !DILexicalBlock(scope: !449, file: !281, line: 23, column: 9)
!473 = !DILocalVariable(name: "ierr__", scope: !474, file: !281, line: 29, type: !82)
!474 = distinct !DILexicalBlock(scope: !475, file: !281, line: 29, column: 84)
!475 = distinct !DILexicalBlock(scope: !476, file: !281, line: 28, column: 28)
!476 = distinct !DILexicalBlock(scope: !477, file: !281, line: 28, column: 11)
!477 = distinct !DILexicalBlock(scope: !478, file: !281, line: 27, column: 17)
!478 = distinct !DILexicalBlock(scope: !479, file: !281, line: 27, column: 9)
!479 = distinct !DILexicalBlock(scope: !480, file: !281, line: 26, column: 23)
!480 = distinct !DILexicalBlock(scope: !481, file: !281, line: 26, column: 3)
!481 = distinct !DILexicalBlock(scope: !280, file: !281, line: 26, column: 3)
!482 = !DILocalVariable(name: "ierr__", scope: !483, file: !281, line: 31, type: !82)
