; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffd.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!267 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!268 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 161, baseType: !7, size: 32, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280}
!273 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!278 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!279 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!280 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 1265, baseType: !7, size: 32, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 1203, baseType: !7, size: 32, elements: !287)
!287 = !{!288, !289, !290, !291, !292}
!288 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!292 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 187, baseType: !7, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301}
!295 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!300 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!301 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!304 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!322 = !{!323, !327, !328, !331, !531, !532, !497, !534, !535, !374, !403, !536, !539, !413, !80, !389, !7}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !324, line: 330, baseType: !325)
!324 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !324, line: 330, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !334, line: 73, size: 4480, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !338, !384, !385, !387, !390, !391, !392, !393, !401, !402, !404, !408, !412, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !425, !426, !427, !429, !430, !432, !434, !435, !436, !437, !438, !441, !443, !444, !445, !446, !447, !450, !452, !453, !454, !464, !466, !467, !471, !472, !521, !526, !528, !529, !530}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !333, file: !334, line: 74, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !333, file: !334, line: 75, baseType: !339, size: 448, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 448, elements: !382)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !334, line: 53, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 45, size: 448, elements: !342)
!342 = !{!343, !349, !357, !362, !366, !370, !377}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !341, file: !334, line: 46, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !331, !348}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !80)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !341, file: !334, line: 47, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!347, !331, !353}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !354, line: 16, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !354, line: 16, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !341, file: !334, line: 48, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!347, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !341, file: !334, line: 49, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!347, !331, !328, !331}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !341, file: !334, line: 50, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!347, !331, !328, !361}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !341, file: !334, line: 51, baseType: !371, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!347, !331, !328, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !341, file: !334, line: 52, baseType: !378, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!347, !331, !328, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!382 = !{!383}
!383 = !DISubrange(count: 1)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !333, file: !334, line: 76, baseType: !323, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !334, line: 77, baseType: !386, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !80)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !333, file: !334, line: 78, baseType: !388, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !389)
!389 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !333, file: !334, line: 78, baseType: !388, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !333, file: !334, line: 78, baseType: !388, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !333, file: !334, line: 78, baseType: !388, size: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !334, line: 79, baseType: !394, size: 64, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !397, line: 27, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !399, line: 43, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!400 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !333, file: !334, line: 80, baseType: !386, size: 32, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !333, file: !334, line: 81, baseType: !403, size: 32, offset: 992)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !80)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !333, file: !334, line: 82, baseType: !405, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !333, file: !334, line: 83, baseType: !409, size: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !333, file: !334, line: 84, baseType: !413, size: 64, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !333, file: !334, line: 85, baseType: !413, size: 64, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !333, file: !334, line: 86, baseType: !413, size: 64, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !333, file: !334, line: 87, baseType: !413, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !333, file: !334, line: 88, baseType: !331, size: 64, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !333, file: !334, line: 89, baseType: !394, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !334, line: 90, baseType: !413, size: 64, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !333, file: !334, line: 91, baseType: !413, size: 64, offset: 1600)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !333, file: !334, line: 92, baseType: !386, size: 32, offset: 1664)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !333, file: !334, line: 93, baseType: !327, size: 64, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !334, line: 94, baseType: !424, size: 64, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !395)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !333, file: !334, line: 95, baseType: !386, size: 32, offset: 1856)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !333, file: !334, line: 95, baseType: !386, size: 32, offset: 1888)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !333, file: !334, line: 96, baseType: !428, size: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !333, file: !334, line: 96, baseType: !428, size: 64, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !333, file: !334, line: 97, baseType: !431, size: 64, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !333, file: !334, line: 97, baseType: !433, size: 64, offset: 2112)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !333, file: !334, line: 98, baseType: !386, size: 32, offset: 2176)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !333, file: !334, line: 98, baseType: !386, size: 32, offset: 2208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !333, file: !334, line: 99, baseType: !428, size: 64, offset: 2240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !333, file: !334, line: 99, baseType: !428, size: 64, offset: 2304)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !333, file: !334, line: 100, baseType: !439, size: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !389)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !333, file: !334, line: 100, baseType: !442, size: 64, offset: 2432)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !333, file: !334, line: 101, baseType: !386, size: 32, offset: 2496)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !333, file: !334, line: 101, baseType: !386, size: 32, offset: 2528)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !333, file: !334, line: 102, baseType: !428, size: 64, offset: 2560)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !333, file: !334, line: 102, baseType: !428, size: 64, offset: 2624)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !333, file: !334, line: 103, baseType: !448, size: 64, offset: 2688)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !440)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !333, file: !334, line: 103, baseType: !451, size: 64, offset: 2752)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !333, file: !334, line: 104, baseType: !381, size: 64, offset: 2816)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !333, file: !334, line: 105, baseType: !386, size: 32, offset: 2880)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !333, file: !334, line: 106, baseType: !455, size: 128, offset: 2944)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 128, elements: !462)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !334, line: 64, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 61, size: 128, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !458, file: !334, line: 62, baseType: !374, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !458, file: !334, line: 63, baseType: !327, size: 64, offset: 64)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !333, file: !334, line: 107, baseType: !465, size: 64, offset: 3072)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 64, elements: !462)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !333, file: !334, line: 108, baseType: !327, size: 64, offset: 3136)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !333, file: !334, line: 109, baseType: !468, size: 64, offset: 3200)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!347, !327}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !333, file: !334, line: 111, baseType: !386, size: 32, offset: 3264)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !333, file: !334, line: 112, baseType: !473, size: 320, offset: 3328)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 320, elements: !519)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!347, !477, !331, !327}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !480)
!480 = !{!481, !482, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !479, file: !18, line: 100, baseType: !386, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !18, line: 101, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !494, !495, !496, !500, !502, !504, !505, !506}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !485, file: !18, line: 84, baseType: !413, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !485, file: !18, line: 85, baseType: !413, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !18, line: 86, baseType: !327, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !485, file: !18, line: 87, baseType: !405, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !485, file: !18, line: 88, baseType: !492, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !485, file: !18, line: 89, baseType: !330, size: 8, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !485, file: !18, line: 90, baseType: !413, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !485, file: !18, line: 91, baseType: !497, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !498, line: 46, baseType: !499)
!498 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!499 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !485, file: !18, line: 92, baseType: !501, size: 32, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !18, line: 93, baseType: !503, size: 32, offset: 544)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !485, file: !18, line: 94, baseType: !483, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !485, file: !18, line: 95, baseType: !413, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !485, file: !18, line: 96, baseType: !327, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !479, file: !18, line: 102, baseType: !413, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !479, file: !18, line: 102, baseType: !413, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !479, file: !18, line: 103, baseType: !413, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !479, file: !18, line: 104, baseType: !323, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !479, file: !18, line: 105, baseType: !501, size: 32, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !479, file: !18, line: 105, baseType: !501, size: 32, offset: 416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !479, file: !18, line: 105, baseType: !501, size: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !479, file: !18, line: 106, baseType: !331, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !479, file: !18, line: 107, baseType: !516, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!519 = !{!520}
!520 = !DISubrange(count: 5)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !333, file: !334, line: 113, baseType: !522, size: 320, offset: 3648)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !519)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!347, !331, !327}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !333, file: !334, line: 114, baseType: !527, size: 320, offset: 3968)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 320, elements: !519)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !333, file: !334, line: 115, baseType: !501, size: 32, offset: 4288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !333, file: !334, line: 120, baseType: !516, size: 64, offset: 4352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !333, file: !334, line: 121, baseType: !501, size: 32, offset: 4416)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !533, line: 1451, baseType: !374)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !334, line: 130, baseType: !358)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !334, line: 131, baseType: !350)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !324, line: 331, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !324, line: 331, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !324, line: 338, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !324, line: 338, flags: DIFlagFwdDecl)
!542 = !{!0, !543, !546, !548, !552}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "MatMFFDRegisterAllCalled", scope: !2, file: !545, line: 6, type: !501, isLocal: false, isDefinition: true)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffd.c", directory: "/home/users/ndemeye/xSDK")
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "MATMFFD_CLASSID", scope: !2, file: !545, line: 8, type: !337, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "MATMFFD_Mult", scope: !2, file: !545, line: 9, type: !550, isLocal: false, isDefinition: true)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !551, line: 80, baseType: !80)
!551 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "MatMFFDPackageInitialized", scope: !2, file: !545, line: 11, type: !501, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!555 = !{i32 7, !"Dwarf Version", i32 4}
!556 = !{i32 2, !"Debug Info Version", i32 3}
!557 = !{i32 1, !"wchar_size", i32 4}
!558 = !{i32 7, !"PIC Level", i32 2}
!559 = !{i32 7, !"uwtable", i32 1}
!560 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!561 = distinct !DISubprogram(name: "MatMFFDFinalizePackage", scope: !545, file: !545, line: 20, type: !562, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!347}
!564 = !{!565, !566}
!565 = !DILocalVariable(name: "ierr", scope: !561, file: !545, line: 22, type: !347)
!566 = !DILocalVariable(name: "ierr__", scope: !567, file: !545, line: 25, type: !347)
!567 = distinct !DILexicalBlock(scope: !561, file: !545, line: 25, column: 49)
!568 = !DILocation(line: 24, column: 3, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !545, line: 24, column: 3)
!570 = distinct !DILexicalBlock(scope: !571, file: !545, line: 24, column: 3)
!571 = distinct !DILexicalBlock(scope: !561, file: !545, line: 24, column: 3)
!572 = !{!573, !573, i64 0}
!573 = !{!"any pointer", !574, i64 0}
!574 = !{!"omnipotent char", !575, i64 0}
!575 = !{!"Simple C/C++ TBAA"}
!576 = !DILocation(line: 24, column: 3, scope: !570)
!577 = !DILocation(line: 24, column: 3, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !545, line: 24, column: 3)
!579 = distinct !DILexicalBlock(scope: !569, file: !545, line: 24, column: 3)
!580 = !{!581, !582, i64 1536}
!581 = !{!"", !574, i64 0, !574, i64 512, !574, i64 1024, !574, i64 1280, !582, i64 1536, !582, i64 1540, !574, i64 1544}
!582 = !{!"int", !574, i64 0}
!583 = !DILocation(line: 24, column: 3, scope: !579)
!584 = !DILocation(line: 24, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !578, file: !545, line: 24, column: 3)
!586 = !{!582, !582, i64 0}
!587 = !{!581, !582, i64 1540}
!588 = !DILocation(line: 25, column: 10, scope: !561)
!589 = !DILocation(line: 0, scope: !561)
!590 = !DILocation(line: 0, scope: !567)
!591 = !DILocation(line: 25, column: 49, scope: !592)
!592 = distinct !DILexicalBlock(scope: !567, file: !545, line: 25, column: 49)
!593 = !DILocation(line: 25, column: 49, scope: !567)
!594 = !{!"branch_weights", i32 2000, i32 1}
!595 = !DILocation(line: 26, column: 29, scope: !561)
!596 = !DILocation(line: 27, column: 29, scope: !561)
!597 = !{!574, !574, i64 0}
!598 = !DILocation(line: 28, column: 3, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !545, line: 28, column: 3)
!600 = distinct !DILexicalBlock(scope: !601, file: !545, line: 28, column: 3)
!601 = distinct !DILexicalBlock(scope: !561, file: !545, line: 28, column: 3)
!602 = !DILocation(line: 28, column: 3, scope: !600)
!603 = !DILocation(line: 28, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !545, line: 28, column: 3)
!605 = distinct !DILexicalBlock(scope: !599, file: !545, line: 28, column: 3)
!606 = !DILocation(line: 28, column: 3, scope: !605)
!607 = !DILocation(line: 28, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !545, line: 28, column: 3)
!609 = distinct !DILexicalBlock(scope: !604, file: !545, line: 28, column: 3)
!610 = !{!581, !574, i64 1544}
!611 = !DILocation(line: 28, column: 3, scope: !609)
!612 = !DILocation(line: 28, column: 3, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !545, line: 28, column: 3)
!614 = !DILocation(line: 28, column: 3, scope: !615)
!615 = distinct !DILexicalBlock(scope: !604, file: !545, line: 28, column: 3)
!616 = !DILocation(line: 28, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !615, file: !545, line: 28, column: 3)
!618 = !DILocation(line: 28, column: 3, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !545, line: 28, column: 3)
!620 = distinct !DILexicalBlock(scope: !617, file: !545, line: 28, column: 3)
!621 = !DILocation(line: 28, column: 3, scope: !620)
!622 = !DILocation(line: 28, column: 3, scope: !623)
!623 = distinct !DILexicalBlock(scope: !619, file: !545, line: 28, column: 3)
!624 = !DILocation(line: 29, column: 1, scope: !561)
!625 = !DISubprogram(name: "PetscFunctionListDestroy", scope: !533, file: !533, line: 1565, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!626 = !DISubroutineType(types: !627)
!627 = !{!80, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!629 = !{}
!630 = !DISubprogram(name: "PetscError", scope: !12, file: !12, line: 668, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!631 = !DISubroutineType(types: !632)
!632 = !{!347, !325, !80, !328, !328, !80, !11, !328, null}
!633 = distinct !DISubprogram(name: "MatMFFDInitializePackage", scope: !545, file: !545, line: 39, type: !562, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !634)
!634 = !{!635, !639, !640, !641, !642, !644, !646, !648, !651, !653, !655, !659, !663}
!635 = !DILocalVariable(name: "logList", scope: !633, file: !545, line: 41, type: !636)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 2048, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 256)
!639 = !DILocalVariable(name: "opt", scope: !633, file: !545, line: 42, type: !501)
!640 = !DILocalVariable(name: "pkg", scope: !633, file: !545, line: 42, type: !501)
!641 = !DILocalVariable(name: "ierr", scope: !633, file: !545, line: 43, type: !347)
!642 = !DILocalVariable(name: "ierr__", scope: !643, file: !545, line: 49, type: !347)
!643 = distinct !DILexicalBlock(scope: !633, file: !545, line: 49, column: 59)
!644 = !DILocalVariable(name: "ierr__", scope: !645, file: !545, line: 51, type: !347)
!645 = distinct !DILexicalBlock(scope: !633, file: !545, line: 51, column: 31)
!646 = !DILocalVariable(name: "ierr__", scope: !647, file: !545, line: 53, type: !347)
!647 = distinct !DILexicalBlock(scope: !633, file: !545, line: 53, column: 76)
!648 = !DILocalVariable(name: "classids", scope: !649, file: !545, line: 56, type: !650)
!649 = distinct !DILexicalBlock(scope: !633, file: !545, line: 55, column: 3)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !382)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !545, line: 59, type: !347)
!652 = distinct !DILexicalBlock(scope: !649, file: !545, line: 59, column: 58)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !545, line: 62, type: !347)
!654 = distinct !DILexicalBlock(scope: !633, file: !545, line: 62, column: 87)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !545, line: 64, type: !347)
!656 = distinct !DILexicalBlock(scope: !657, file: !545, line: 64, column: 55)
!657 = distinct !DILexicalBlock(scope: !658, file: !545, line: 63, column: 12)
!658 = distinct !DILexicalBlock(scope: !633, file: !545, line: 63, column: 7)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !545, line: 65, type: !347)
!660 = distinct !DILexicalBlock(scope: !661, file: !545, line: 65, column: 65)
!661 = distinct !DILexicalBlock(scope: !662, file: !545, line: 65, column: 14)
!662 = distinct !DILexicalBlock(scope: !657, file: !545, line: 65, column: 9)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !545, line: 68, type: !347)
!664 = distinct !DILexicalBlock(scope: !633, file: !545, line: 68, column: 56)
!665 = !DILocation(line: 41, column: 3, scope: !633)
!666 = !DILocation(line: 41, column: 18, scope: !633)
!667 = !DILocation(line: 42, column: 3, scope: !633)
!668 = !DILocation(line: 45, column: 3, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !545, line: 45, column: 3)
!670 = distinct !DILexicalBlock(scope: !671, file: !545, line: 45, column: 3)
!671 = distinct !DILexicalBlock(scope: !633, file: !545, line: 45, column: 3)
!672 = !DILocation(line: 45, column: 3, scope: !670)
!673 = !DILocation(line: 45, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !545, line: 45, column: 3)
!675 = distinct !DILexicalBlock(scope: !669, file: !545, line: 45, column: 3)
!676 = !DILocation(line: 45, column: 3, scope: !675)
!677 = !DILocation(line: 45, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !674, file: !545, line: 45, column: 3)
!679 = !DILocation(line: 46, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !633, file: !545, line: 46, column: 7)
!681 = !DILocation(line: 46, column: 7, scope: !633)
!682 = !DILocation(line: 46, column: 34, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !545, line: 46, column: 34)
!684 = distinct !DILexicalBlock(scope: !685, file: !545, line: 46, column: 34)
!685 = distinct !DILexicalBlock(scope: !686, file: !545, line: 46, column: 34)
!686 = distinct !DILexicalBlock(scope: !687, file: !545, line: 46, column: 34)
!687 = distinct !DILexicalBlock(scope: !680, file: !545, line: 46, column: 34)
!688 = !DILocation(line: 46, column: 34, scope: !684)
!689 = !DILocation(line: 46, column: 34, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !545, line: 46, column: 34)
!691 = distinct !DILexicalBlock(scope: !683, file: !545, line: 46, column: 34)
!692 = !DILocation(line: 46, column: 34, scope: !691)
!693 = !DILocation(line: 46, column: 34, scope: !694)
!694 = distinct !DILexicalBlock(scope: !690, file: !545, line: 46, column: 34)
!695 = !DILocation(line: 46, column: 34, scope: !696)
!696 = distinct !DILexicalBlock(scope: !683, file: !545, line: 46, column: 34)
!697 = !DILocation(line: 46, column: 34, scope: !698)
!698 = distinct !DILexicalBlock(scope: !696, file: !545, line: 46, column: 34)
!699 = !DILocation(line: 46, column: 34, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !545, line: 46, column: 34)
!701 = distinct !DILexicalBlock(scope: !698, file: !545, line: 46, column: 34)
!702 = !DILocation(line: 46, column: 34, scope: !701)
!703 = !DILocation(line: 46, column: 34, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !545, line: 46, column: 34)
!705 = !DILocation(line: 47, column: 29, scope: !633)
!706 = !DILocation(line: 49, column: 10, scope: !633)
!707 = !DILocation(line: 0, scope: !633)
!708 = !DILocation(line: 0, scope: !643)
!709 = !DILocation(line: 49, column: 59, scope: !710)
!710 = distinct !DILexicalBlock(scope: !643, file: !545, line: 49, column: 59)
!711 = !DILocation(line: 49, column: 59, scope: !643)
!712 = !DILocation(line: 51, column: 10, scope: !633)
!713 = !DILocation(line: 0, scope: !645)
!714 = !DILocation(line: 51, column: 31, scope: !715)
!715 = distinct !DILexicalBlock(scope: !645, file: !545, line: 51, column: 31)
!716 = !DILocation(line: 51, column: 31, scope: !645)
!717 = !DILocation(line: 53, column: 45, scope: !633)
!718 = !DILocation(line: 53, column: 10, scope: !633)
!719 = !DILocation(line: 0, scope: !647)
!720 = !DILocation(line: 53, column: 76, scope: !721)
!721 = distinct !DILexicalBlock(scope: !647, file: !545, line: 53, column: 76)
!722 = !DILocation(line: 53, column: 76, scope: !647)
!723 = !DILocation(line: 56, column: 5, scope: !649)
!724 = !DILocation(line: 56, column: 19, scope: !649)
!725 = !DILocation(line: 58, column: 19, scope: !649)
!726 = !DILocation(line: 58, column: 5, scope: !649)
!727 = !DILocation(line: 58, column: 17, scope: !649)
!728 = !DILocation(line: 59, column: 12, scope: !649)
!729 = !DILocation(line: 0, scope: !652)
!730 = !DILocation(line: 59, column: 58, scope: !731)
!731 = distinct !DILexicalBlock(scope: !652, file: !545, line: 59, column: 58)
!732 = !DILocation(line: 59, column: 58, scope: !652)
!733 = !DILocation(line: 60, column: 3, scope: !633)
!734 = !DILocation(line: 62, column: 10, scope: !633)
!735 = !DILocation(line: 0, scope: !654)
!736 = !DILocation(line: 62, column: 87, scope: !737)
!737 = distinct !DILexicalBlock(scope: !654, file: !545, line: 62, column: 87)
!738 = !DILocation(line: 62, column: 87, scope: !654)
!739 = !DILocation(line: 63, column: 7, scope: !658)
!740 = !DILocation(line: 63, column: 7, scope: !633)
!741 = !DILocation(line: 64, column: 12, scope: !657)
!742 = !DILocation(line: 0, scope: !656)
!743 = !DILocation(line: 64, column: 55, scope: !744)
!744 = distinct !DILexicalBlock(scope: !656, file: !545, line: 64, column: 55)
!745 = !DILocation(line: 64, column: 55, scope: !656)
!746 = !DILocation(line: 65, column: 9, scope: !662)
!747 = !DILocation(line: 65, column: 9, scope: !657)
!748 = !DILocation(line: 65, column: 48, scope: !661)
!749 = !DILocation(line: 65, column: 22, scope: !661)
!750 = !DILocation(line: 0, scope: !660)
!751 = !DILocation(line: 65, column: 65, scope: !752)
!752 = distinct !DILexicalBlock(scope: !660, file: !545, line: 65, column: 65)
!753 = !DILocation(line: 65, column: 65, scope: !660)
!754 = !DILocation(line: 68, column: 10, scope: !633)
!755 = !DILocation(line: 0, scope: !664)
!756 = !DILocation(line: 68, column: 56, scope: !757)
!757 = distinct !DILexicalBlock(scope: !664, file: !545, line: 68, column: 56)
!758 = !DILocation(line: 68, column: 56, scope: !664)
!759 = !DILocation(line: 69, column: 3, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !545, line: 69, column: 3)
!761 = distinct !DILexicalBlock(scope: !762, file: !545, line: 69, column: 3)
!762 = distinct !DILexicalBlock(scope: !633, file: !545, line: 69, column: 3)
!763 = !DILocation(line: 69, column: 3, scope: !761)
!764 = !DILocation(line: 69, column: 3, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !545, line: 69, column: 3)
!766 = distinct !DILexicalBlock(scope: !760, file: !545, line: 69, column: 3)
!767 = !DILocation(line: 69, column: 3, scope: !766)
!768 = !DILocation(line: 69, column: 3, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !545, line: 69, column: 3)
!770 = distinct !DILexicalBlock(scope: !765, file: !545, line: 69, column: 3)
!771 = !DILocation(line: 69, column: 3, scope: !770)
!772 = !DILocation(line: 69, column: 3, scope: !773)
!773 = distinct !DILexicalBlock(scope: !769, file: !545, line: 69, column: 3)
!774 = !DILocation(line: 69, column: 3, scope: !775)
!775 = distinct !DILexicalBlock(scope: !765, file: !545, line: 69, column: 3)
!776 = !DILocation(line: 69, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !775, file: !545, line: 69, column: 3)
!778 = !DILocation(line: 69, column: 3, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !545, line: 69, column: 3)
!780 = distinct !DILexicalBlock(scope: !777, file: !545, line: 69, column: 3)
!781 = !DILocation(line: 69, column: 3, scope: !780)
!782 = !DILocation(line: 69, column: 3, scope: !783)
!783 = distinct !DILexicalBlock(scope: !779, file: !545, line: 69, column: 3)
!784 = !DILocation(line: 70, column: 1, scope: !633)
!785 = !DISubprogram(name: "PetscClassIdRegister", scope: !533, file: !533, line: 1408, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!786 = !DISubroutineType(types: !787)
!787 = !{!80, !328, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!789 = !DISubprogram(name: "MatMFFDRegisterAll", scope: !790, file: !790, line: 61, type: !791, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!790 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/mffd/mffdimpl.h", directory: "/home/users/ndemeye/xSDK")
!791 = !DISubroutineType(types: !792)
!792 = !{!80}
!793 = !DISubprogram(name: "PetscLogEventRegister", scope: !551, file: !551, line: 388, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!794 = !DISubroutineType(types: !795)
!795 = !{!80, !328, !80, !788}
!796 = !DISubprogram(name: "PetscInfoProcessClass", scope: !551, file: !551, line: 66, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!797 = !DISubprogram(name: "PetscOptionsGetString", scope: !18, file: !18, line: 26, type: !798, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!798 = !DISubroutineType(types: !799)
!799 = !{!80, !517, !328, !328, !413, !499, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!801 = !DISubprogram(name: "PetscStrInList", scope: !533, file: !533, line: 1376, type: !802, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!802 = !DISubroutineType(types: !803)
!803 = !{!80, !328, !328, !330, !800}
!804 = !DISubprogram(name: "PetscLogEventExcludeClass", scope: !551, file: !551, line: 391, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!805 = !DISubroutineType(types: !806)
!806 = !{!80, !80}
!807 = !DISubprogram(name: "PetscRegisterFinalize", scope: !533, file: !533, line: 1509, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !629)
!808 = !DISubroutineType(types: !809)
!809 = !{!80, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!811 = distinct !DISubprogram(name: "MatMFFDSetType", scope: !545, file: !545, line: 120, type: !812, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1581)
!812 = !DISubroutineType(types: !813)
!813 = !{!347, !814, !1580}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !44, line: 16, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !817, line: 436, size: 23424, elements: !818)
!817 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!818 = !{!819, !821, !1326, !1346, !1347, !1348, !1350, !1351, !1352, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1476, !1477, !1493, !1494, !1495, !1496, !1497, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1532, !1552, !1553, !1555, !1556, !1557, !1558, !1559, !1560, !1578, !1579}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !816, file: !817, line: 437, baseType: !820, size: 4480)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !334, line: 122, baseType: !333)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !816, file: !817, line: 437, baseType: !822, size: 9472, offset: 4480)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 9472, elements: !382)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !817, line: 32, size: 9472, elements: !824)
!824 = !{!825, !834, !838, !839, !846, !850, !851, !852, !853, !854, !855, !856, !880, !884, !889, !895, !914, !919, !923, !924, !929, !934, !935, !940, !944, !948, !952, !956, !960, !961, !962, !963, !964, !968, !969, !974, !975, !976, !977, !978, !983, !990, !995, !999, !1003, !1007, !1011, !1012, !1016, !1017, !1024, !1029, !1030, !1031, !1032, !1092, !1100, !1101, !1105, !1106, !1110, !1111, !1115, !1120, !1121, !1125, !1129, !1136, !1137, !1138, !1139, !1140, !1141, !1146, !1147, !1151, !1155, !1159, !1160, !1161, !1165, !1175, !1176, !1180, !1181, !1185, !1186, !1190, !1191, !1196, !1197, !1201, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1215, !1216, !1217, !1218, !1219, !1220, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235, !1239, !1240, !1241, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1255, !1256, !1257, !1262, !1266, !1267, !1271, !1272, !1273, !1274, !1300, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1314, !1315, !1316, !1320, !1324, !1325}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !823, file: !817, line: 34, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!347, !814, !386, !829, !386, !829, !831, !833}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !823, file: !817, line: 35, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!347, !814, !386, !431, !433, !451}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !823, file: !817, line: 36, baseType: !835, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !823, file: !817, line: 37, baseType: !840, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!347, !814, !843, !843}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !68, line: 21, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !68, line: 21, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !823, file: !817, line: 38, baseType: !847, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!347, !814, !843, !843, !843}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !823, file: !817, line: 40, baseType: !840, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !823, file: !817, line: 41, baseType: !847, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !823, file: !817, line: 42, baseType: !840, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !823, file: !817, line: 43, baseType: !847, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !823, file: !817, line: 44, baseType: !840, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !823, file: !817, line: 46, baseType: !847, size: 64, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !823, file: !817, line: 47, baseType: !857, size: 64, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!347, !814, !860, !860, !864}
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !861, line: 11, baseType: !862)
!861 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !861, line: 11, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !44, line: 1239, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 1226, size: 704, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !867, file: !44, line: 1227, baseType: !440, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !867, file: !44, line: 1228, baseType: !440, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !867, file: !44, line: 1229, baseType: !440, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !867, file: !44, line: 1230, baseType: !440, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !867, file: !44, line: 1231, baseType: !440, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !867, file: !44, line: 1232, baseType: !440, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !867, file: !44, line: 1233, baseType: !440, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !867, file: !44, line: 1234, baseType: !440, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !867, file: !44, line: 1236, baseType: !440, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !867, file: !44, line: 1237, baseType: !440, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !867, file: !44, line: 1238, baseType: !440, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !823, file: !817, line: 48, baseType: !881, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!347, !814, !860, !864}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !823, file: !817, line: 49, baseType: !885, size: 64, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!347, !814, !843, !440, !888, !440, !386, !386, !843}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !44, line: 1291, baseType: !43)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !823, file: !817, line: 50, baseType: !890, size: 64, offset: 896)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!347, !814, !893, !894}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !44, line: 238, baseType: !56)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !823, file: !817, line: 52, baseType: !896, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!347, !814, !899, !900}
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !44, line: 612, baseType: !62)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !44, line: 600, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 592, size: 640, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !902, file: !44, line: 593, baseType: !388, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !902, file: !44, line: 594, baseType: !388, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !902, file: !44, line: 594, baseType: !388, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !902, file: !44, line: 594, baseType: !388, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !902, file: !44, line: 595, baseType: !388, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !902, file: !44, line: 596, baseType: !388, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !902, file: !44, line: 597, baseType: !388, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !902, file: !44, line: 598, baseType: !388, size: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !902, file: !44, line: 598, baseType: !388, size: 64, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !902, file: !44, line: 599, baseType: !388, size: 64, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !823, file: !817, line: 53, baseType: !915, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!347, !814, !814, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !823, file: !817, line: 54, baseType: !920, size: 64, offset: 1088)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!347, !814, !843}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !823, file: !817, line: 55, baseType: !840, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !823, file: !817, line: 56, baseType: !925, size: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!347, !814, !928, !439}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !68, line: 155, baseType: !67)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !823, file: !817, line: 58, baseType: !930, size: 64, offset: 1280)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!347, !814, !933}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !44, line: 424, baseType: !75)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !823, file: !817, line: 59, baseType: !930, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !823, file: !817, line: 60, baseType: !936, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!347, !814, !939, !501}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !44, line: 469, baseType: !79)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !823, file: !817, line: 61, baseType: !941, size: 64, offset: 1472)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!347, !814}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !823, file: !817, line: 63, baseType: !945, size: 64, offset: 1536)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!347, !814, !386, !829, !449, !843, !843}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !823, file: !817, line: 64, baseType: !949, size: 64, offset: 1600)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!347, !814, !814, !860, !860, !864}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !823, file: !817, line: 65, baseType: !953, size: 64, offset: 1664)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!347, !814, !814, !864}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !823, file: !817, line: 66, baseType: !957, size: 64, offset: 1728)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!347, !814, !814, !860, !864}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !823, file: !817, line: 67, baseType: !953, size: 64, offset: 1792)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !823, file: !817, line: 69, baseType: !941, size: 64, offset: 1856)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !823, file: !817, line: 70, baseType: !949, size: 64, offset: 1920)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !823, file: !817, line: 71, baseType: !957, size: 64, offset: 1984)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !823, file: !817, line: 72, baseType: !965, size: 64, offset: 2048)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!347, !814, !894}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !823, file: !817, line: 73, baseType: !941, size: 64, offset: 2112)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !823, file: !817, line: 75, baseType: !970, size: 64, offset: 2176)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!347, !814, !973, !894}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !44, line: 563, baseType: !110)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !823, file: !817, line: 76, baseType: !840, size: 64, offset: 2240)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !823, file: !817, line: 77, baseType: !840, size: 64, offset: 2304)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !823, file: !817, line: 78, baseType: !857, size: 64, offset: 2368)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !823, file: !817, line: 79, baseType: !881, size: 64, offset: 2432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !823, file: !817, line: 81, baseType: !979, size: 64, offset: 2496)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!347, !814, !449, !814, !982}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !44, line: 285, baseType: !115)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !823, file: !817, line: 82, baseType: !984, size: 64, offset: 2560)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!347, !814, !386, !987, !987, !893, !989}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !823, file: !817, line: 83, baseType: !991, size: 64, offset: 2624)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!347, !814, !386, !994, !386}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !823, file: !817, line: 84, baseType: !996, size: 64, offset: 2688)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!347, !814, !386, !829, !386, !829, !448}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !823, file: !817, line: 85, baseType: !1000, size: 64, offset: 2752)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!347, !814, !814, !982}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !823, file: !817, line: 87, baseType: !1004, size: 64, offset: 2816)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!347, !814, !843, !431}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !823, file: !817, line: 88, baseType: !1008, size: 64, offset: 2880)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!347, !814, !449}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !823, file: !817, line: 89, baseType: !1008, size: 64, offset: 2944)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !823, file: !817, line: 90, baseType: !1013, size: 64, offset: 3008)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!347, !814, !843, !833}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !823, file: !817, line: 91, baseType: !945, size: 64, offset: 3072)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !823, file: !817, line: 93, baseType: !1018, size: 64, offset: 3136)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!347, !814, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !823, file: !817, line: 94, baseType: !1025, size: 64, offset: 3200)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!347, !814, !386, !501, !501, !431, !1028, !1028, !918}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !823, file: !817, line: 95, baseType: !1025, size: 64, offset: 3264)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !823, file: !817, line: 96, baseType: !1025, size: 64, offset: 3328)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !823, file: !817, line: 97, baseType: !1025, size: 64, offset: 3392)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !823, file: !817, line: 99, baseType: !1033, size: 64, offset: 3456)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!347, !814, !1036, !1039}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !861, line: 51, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !861, line: 51, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !44, line: 1378, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !817, line: 609, size: 6208, elements: !1042)
!1042 = !{!1043, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1063, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1041, file: !817, line: 610, baseType: !820, size: 4480)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1041, file: !817, line: 610, baseType: !1045, size: 32, offset: 4480)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !382)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1041, file: !817, line: 611, baseType: !386, size: 32, offset: 4512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1041, file: !817, line: 611, baseType: !386, size: 32, offset: 4544)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1041, file: !817, line: 611, baseType: !386, size: 32, offset: 4576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1041, file: !817, line: 612, baseType: !386, size: 32, offset: 4608)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1041, file: !817, line: 613, baseType: !386, size: 32, offset: 4640)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1041, file: !817, line: 614, baseType: !431, size: 64, offset: 4672)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1041, file: !817, line: 615, baseType: !433, size: 64, offset: 4736)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1041, file: !817, line: 616, baseType: !994, size: 64, offset: 4800)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1041, file: !817, line: 617, baseType: !431, size: 64, offset: 4864)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1041, file: !817, line: 618, baseType: !1056, size: 64, offset: 4928)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !817, line: 602, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 598, size: 128, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1058, file: !817, line: 599, baseType: !386, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1058, file: !817, line: 600, baseType: !386, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1058, file: !817, line: 601, baseType: !448, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1041, file: !817, line: 619, baseType: !1064, size: 64, offset: 4992)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !817, line: 607, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 604, size: 128, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1066, file: !817, line: 605, baseType: !386, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1066, file: !817, line: 606, baseType: !448, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1041, file: !817, line: 620, baseType: !448, size: 64, offset: 5056)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1041, file: !817, line: 621, baseType: !440, size: 64, offset: 5120)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1041, file: !817, line: 622, baseType: !440, size: 64, offset: 5184)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1041, file: !817, line: 623, baseType: !843, size: 64, offset: 5248)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1041, file: !817, line: 623, baseType: !843, size: 64, offset: 5312)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1041, file: !817, line: 623, baseType: !843, size: 64, offset: 5376)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1041, file: !817, line: 624, baseType: !501, size: 32, offset: 5440)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1041, file: !817, line: 625, baseType: !1078, size: 64, offset: 5504)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1041, file: !817, line: 626, baseType: !327, size: 64, offset: 5568)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1041, file: !817, line: 627, baseType: !843, size: 64, offset: 5632)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1041, file: !817, line: 628, baseType: !386, size: 32, offset: 5696)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1041, file: !817, line: 629, baseType: !328, size: 64, offset: 5760)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1041, file: !817, line: 630, baseType: !1084, size: 32, offset: 5824)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !122, line: 213, baseType: !121)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1041, file: !817, line: 631, baseType: !386, size: 32, offset: 5856)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1041, file: !817, line: 631, baseType: !386, size: 32, offset: 5888)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1041, file: !817, line: 632, baseType: !501, size: 32, offset: 5920)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1041, file: !817, line: 633, baseType: !501, size: 32, offset: 5952)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1041, file: !817, line: 634, baseType: !374, size: 64, offset: 6016)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1041, file: !817, line: 634, baseType: !327, size: 64, offset: 6080)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1041, file: !817, line: 635, baseType: !394, size: 64, offset: 6144)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !823, file: !817, line: 100, baseType: !1093, size: 64, offset: 3520)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!347, !814, !386, !386, !1096, !1099}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !122, line: 215, baseType: !1098)
!1098 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !823, file: !817, line: 101, baseType: !941, size: 64, offset: 3584)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !823, file: !817, line: 102, baseType: !1102, size: 64, offset: 3648)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!347, !814, !860, !860, !894}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !823, file: !817, line: 103, baseType: !826, size: 64, offset: 3712)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !823, file: !817, line: 105, baseType: !1107, size: 64, offset: 3776)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!347, !814, !860, !860, !893, !894}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !823, file: !817, line: 106, baseType: !941, size: 64, offset: 3840)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !823, file: !817, line: 107, baseType: !1112, size: 64, offset: 3904)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!347, !814, !353}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !823, file: !817, line: 108, baseType: !1116, size: 64, offset: 3968)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!347, !814, !1119, !893, !894}
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !44, line: 25, baseType: !328)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !823, file: !817, line: 109, baseType: !1078, size: 64, offset: 4032)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !823, file: !817, line: 111, baseType: !1122, size: 64, offset: 4096)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!347, !814, !814, !814, !440, !814}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !823, file: !817, line: 112, baseType: !1126, size: 64, offset: 4160)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!347, !814, !814, !814, !814}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !823, file: !817, line: 113, baseType: !1130, size: 64, offset: 4224)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!347, !814, !1133, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !861, line: 30, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !861, line: 30, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !823, file: !817, line: 114, baseType: !826, size: 64, offset: 4288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !823, file: !817, line: 115, baseType: !945, size: 64, offset: 4352)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !823, file: !817, line: 117, baseType: !1004, size: 64, offset: 4416)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !823, file: !817, line: 118, baseType: !1004, size: 64, offset: 4480)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !823, file: !817, line: 119, baseType: !1116, size: 64, offset: 4544)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !823, file: !817, line: 120, baseType: !1142, size: 64, offset: 4608)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!347, !814, !1145, !918}
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !44, line: 1675, baseType: !126)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !823, file: !817, line: 121, baseType: !1078, size: 64, offset: 4672)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !823, file: !817, line: 123, baseType: !1148, size: 64, offset: 4736)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!347, !814, !386, !327}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !823, file: !817, line: 124, baseType: !1152, size: 64, offset: 4800)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!347, !814, !1039, !843, !327}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !823, file: !817, line: 125, baseType: !1156, size: 64, offset: 4864)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!347, !477, !814}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !823, file: !817, line: 126, baseType: !840, size: 64, offset: 4928)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !823, file: !817, line: 127, baseType: !840, size: 64, offset: 4992)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !823, file: !817, line: 129, baseType: !1162, size: 64, offset: 5056)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!347, !814, !994}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !823, file: !817, line: 130, baseType: !1166, size: 64, offset: 5120)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!347, !814, !1169, !1169}
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !68, line: 654, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !68, line: 653, size: 128, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1171, file: !68, line: 653, baseType: !386, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1171, file: !68, line: 653, baseType: !843, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !823, file: !817, line: 131, baseType: !1166, size: 64, offset: 5184)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !823, file: !817, line: 132, baseType: !1177, size: 64, offset: 5248)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!347, !814, !431, !431, !431}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !823, file: !817, line: 133, baseType: !1112, size: 64, offset: 5312)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !823, file: !817, line: 135, baseType: !1182, size: 64, offset: 5376)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!347, !814, !440, !918}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !823, file: !817, line: 136, baseType: !1182, size: 64, offset: 5440)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !823, file: !817, line: 137, baseType: !1187, size: 64, offset: 5504)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!347, !814, !918}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !823, file: !817, line: 138, baseType: !826, size: 64, offset: 5568)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !823, file: !817, line: 139, baseType: !1192, size: 64, offset: 5632)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!347, !814, !1195, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !823, file: !817, line: 141, baseType: !1078, size: 64, offset: 5696)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !823, file: !817, line: 142, baseType: !1198, size: 64, offset: 5760)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!347, !814, !814, !440, !814}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !823, file: !817, line: 143, baseType: !1202, size: 64, offset: 5824)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!347, !814, !814, !814}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !823, file: !817, line: 144, baseType: !1078, size: 64, offset: 5888)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !823, file: !817, line: 145, baseType: !1198, size: 64, offset: 5952)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !823, file: !817, line: 147, baseType: !1202, size: 64, offset: 6016)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !823, file: !817, line: 148, baseType: !1078, size: 64, offset: 6080)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !823, file: !817, line: 149, baseType: !1198, size: 64, offset: 6144)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !823, file: !817, line: 150, baseType: !1202, size: 64, offset: 6208)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !823, file: !817, line: 151, baseType: !1212, size: 64, offset: 6272)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!347, !814, !501}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !823, file: !817, line: 153, baseType: !941, size: 64, offset: 6336)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !823, file: !817, line: 154, baseType: !941, size: 64, offset: 6400)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !823, file: !817, line: 155, baseType: !941, size: 64, offset: 6464)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !823, file: !817, line: 156, baseType: !941, size: 64, offset: 6528)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !823, file: !817, line: 157, baseType: !1112, size: 64, offset: 6592)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !823, file: !817, line: 159, baseType: !1221, size: 64, offset: 6656)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!347, !814, !386, !831}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !823, file: !817, line: 160, baseType: !941, size: 64, offset: 6720)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !823, file: !817, line: 161, baseType: !941, size: 64, offset: 6784)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !823, file: !817, line: 162, baseType: !941, size: 64, offset: 6848)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !823, file: !817, line: 163, baseType: !941, size: 64, offset: 6912)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !823, file: !817, line: 165, baseType: !1202, size: 64, offset: 6976)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !823, file: !817, line: 166, baseType: !1202, size: 64, offset: 7040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !823, file: !817, line: 167, baseType: !1004, size: 64, offset: 7104)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !823, file: !817, line: 168, baseType: !1232, size: 64, offset: 7168)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!347, !814, !843, !386}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !823, file: !817, line: 169, baseType: !1236, size: 64, offset: 7232)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!347, !814, !918, !431}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !823, file: !817, line: 171, baseType: !965, size: 64, offset: 7296)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !823, file: !817, line: 172, baseType: !941, size: 64, offset: 7360)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !823, file: !817, line: 173, baseType: !1242, size: 64, offset: 7424)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!347, !814, !431, !1028}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !823, file: !817, line: 174, baseType: !1102, size: 64, offset: 7488)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !823, file: !817, line: 175, baseType: !1102, size: 64, offset: 7552)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !823, file: !817, line: 177, baseType: !840, size: 64, offset: 7616)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !823, file: !817, line: 178, baseType: !890, size: 64, offset: 7680)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !823, file: !817, line: 179, baseType: !840, size: 64, offset: 7744)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !823, file: !817, line: 180, baseType: !847, size: 64, offset: 7808)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !823, file: !817, line: 181, baseType: !1252, size: 64, offset: 7872)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!347, !814, !323, !893, !894}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !823, file: !817, line: 183, baseType: !1162, size: 64, offset: 7936)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !823, file: !817, line: 184, baseType: !925, size: 64, offset: 8000)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !823, file: !817, line: 185, baseType: !1258, size: 64, offset: 8064)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!347, !814, !1261}
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !823, file: !817, line: 186, baseType: !1263, size: 64, offset: 8128)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!347, !814, !386, !829, !448}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !823, file: !817, line: 187, baseType: !984, size: 64, offset: 8192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !823, file: !817, line: 189, baseType: !1268, size: 64, offset: 8256)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!347, !814, !386, !386, !431, !831}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !823, file: !817, line: 190, baseType: !1078, size: 64, offset: 8320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !823, file: !817, line: 191, baseType: !1198, size: 64, offset: 8384)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !823, file: !817, line: 192, baseType: !1202, size: 64, offset: 8448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !823, file: !817, line: 193, baseType: !1275, size: 64, offset: 8512)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!347, !814, !1036, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !44, line: 1401, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !817, line: 660, size: 5312, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1280, file: !817, line: 661, baseType: !820, size: 4480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1280, file: !817, line: 661, baseType: !1045, size: 32, offset: 4480)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1280, file: !817, line: 662, baseType: !386, size: 32, offset: 4512)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1280, file: !817, line: 662, baseType: !386, size: 32, offset: 4544)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1280, file: !817, line: 662, baseType: !386, size: 32, offset: 4576)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1280, file: !817, line: 663, baseType: !386, size: 32, offset: 4608)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1280, file: !817, line: 664, baseType: !386, size: 32, offset: 4640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1280, file: !817, line: 665, baseType: !431, size: 64, offset: 4672)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1280, file: !817, line: 666, baseType: !431, size: 64, offset: 4736)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1280, file: !817, line: 667, baseType: !386, size: 32, offset: 4800)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1280, file: !817, line: 668, baseType: !1084, size: 32, offset: 4832)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1280, file: !817, line: 670, baseType: !431, size: 64, offset: 4864)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1280, file: !817, line: 670, baseType: !431, size: 64, offset: 4928)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1280, file: !817, line: 671, baseType: !431, size: 64, offset: 4992)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1280, file: !817, line: 672, baseType: !431, size: 64, offset: 5056)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1280, file: !817, line: 673, baseType: !431, size: 64, offset: 5120)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1280, file: !817, line: 674, baseType: !386, size: 32, offset: 5184)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1280, file: !817, line: 675, baseType: !431, size: 64, offset: 5248)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !823, file: !817, line: 195, baseType: !1301, size: 64, offset: 8576)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!347, !1278, !814, !814}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !823, file: !817, line: 196, baseType: !1301, size: 64, offset: 8640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !823, file: !817, line: 197, baseType: !1078, size: 64, offset: 8704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !823, file: !817, line: 198, baseType: !1198, size: 64, offset: 8768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !823, file: !817, line: 199, baseType: !1202, size: 64, offset: 8832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !823, file: !817, line: 201, baseType: !1309, size: 64, offset: 8896)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!347, !814, !386, !386}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !823, file: !817, line: 202, baseType: !979, size: 64, offset: 8960)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !823, file: !817, line: 203, baseType: !847, size: 64, offset: 9024)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !823, file: !817, line: 204, baseType: !1033, size: 64, offset: 9088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !823, file: !817, line: 205, baseType: !1162, size: 64, offset: 9152)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !823, file: !817, line: 206, baseType: !1317, size: 64, offset: 9216)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!347, !323, !814, !386, !893, !894}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !823, file: !817, line: 208, baseType: !1321, size: 64, offset: 9280)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!347, !386, !989}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !823, file: !817, line: 209, baseType: !1202, size: 64, offset: 9344)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !823, file: !817, line: 210, baseType: !996, size: 64, offset: 9408)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !816, file: !817, line: 438, baseType: !1327, size: 64, offset: 13952)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !861, line: 60, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !122, line: 240, size: 640, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1329, file: !122, line: 241, baseType: !323, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1329, file: !122, line: 242, baseType: !403, size: 32, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1329, file: !122, line: 243, baseType: !386, size: 32, offset: 96)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1329, file: !122, line: 243, baseType: !386, size: 32, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1329, file: !122, line: 244, baseType: !386, size: 32, offset: 160)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1329, file: !122, line: 244, baseType: !386, size: 32, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1329, file: !122, line: 245, baseType: !431, size: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1329, file: !122, line: 246, baseType: !501, size: 32, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1329, file: !122, line: 247, baseType: !386, size: 32, offset: 352)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1329, file: !122, line: 251, baseType: !386, size: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1329, file: !122, line: 252, baseType: !1133, size: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1329, file: !122, line: 253, baseType: !501, size: 32, offset: 512)
