; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntl/ntl.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntl/ntl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 517, baseType: !28, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!57 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!58 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!59 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!60 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!61 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!62 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!63 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!64 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!65 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!66 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!67 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!68 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!69 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!70 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!71 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!72 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!73 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!74 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!75 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!76 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!77 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 6, baseType: !28, size: 32, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!81 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!82 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!83 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!84 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!85 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!86 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!87 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!88 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!89 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!90 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!91 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!92 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 155, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!101 = !{!102, !105, !123, !204, !144, !310, !222}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!104 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !108, line: 73, size: 4480, elements: !109)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!109 = !{!110, !112, !165, !166, !168, !171, !172, !173, !174, !182, !183, !185, !189, !193, !195, !196, !197, !198, !199, !200, !201, !202, !203, !205, !207, !208, !209, !211, !212, !214, !216, !217, !218, !219, !220, !223, !225, !226, !227, !228, !229, !232, !234, !235, !236, !246, !248, !249, !253, !254, !300, !305, !307, !308, !309}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !107, file: !108, line: 74, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !107, file: !108, line: 75, baseType: !113, size: 448, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 448, elements: !163)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !108, line: 53, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 45, size: 448, elements: !116)
!116 = !{!117, !127, !135, !140, !147, !151, !158}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !115, file: !108, line: 46, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !105, !122}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !124, line: 330, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !124, line: 330, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !115, file: !108, line: 47, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!121, !105, !131}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !132, line: 16, baseType: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !132, line: 16, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !115, file: !108, line: 48, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!121, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !115, file: !108, line: 49, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!121, !105, !144, !105}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !115, file: !108, line: 50, baseType: !148, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!121, !105, !144, !139}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !115, file: !108, line: 51, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!121, !105, !144, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !115, file: !108, line: 52, baseType: !159, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!121, !105, !144, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!163 = !{!164}
!164 = !DISubrange(count: 1)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !107, file: !108, line: 76, baseType: !123, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !108, line: 77, baseType: !167, size: 32, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !107, file: !108, line: 78, baseType: !169, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !170)
!170 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !107, file: !108, line: 78, baseType: !169, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !107, file: !108, line: 78, baseType: !169, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !107, file: !108, line: 78, baseType: !169, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !108, line: 79, baseType: !175, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !178, line: 27, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !180, line: 43, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !107, file: !108, line: 80, baseType: !167, size: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !107, file: !108, line: 81, baseType: !184, size: 32, offset: 992)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !107, file: !108, line: 82, baseType: !186, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !107, file: !108, line: 83, baseType: !190, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !107, file: !108, line: 84, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !107, file: !108, line: 85, baseType: !194, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !107, file: !108, line: 86, baseType: !194, size: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !107, file: !108, line: 87, baseType: !194, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !108, line: 88, baseType: !105, size: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !107, file: !108, line: 89, baseType: !175, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !108, line: 90, baseType: !194, size: 64, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !107, file: !108, line: 91, baseType: !194, size: 64, offset: 1600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !107, file: !108, line: 92, baseType: !167, size: 32, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !107, file: !108, line: 93, baseType: !204, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !107, file: !108, line: 94, baseType: !206, size: 64, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !176)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !107, file: !108, line: 95, baseType: !167, size: 32, offset: 1856)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !107, file: !108, line: 95, baseType: !167, size: 32, offset: 1888)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !107, file: !108, line: 96, baseType: !210, size: 64, offset: 1920)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !107, file: !108, line: 96, baseType: !210, size: 64, offset: 1984)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !107, file: !108, line: 97, baseType: !213, size: 64, offset: 2048)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !107, file: !108, line: 97, baseType: !215, size: 64, offset: 2112)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !107, file: !108, line: 98, baseType: !167, size: 32, offset: 2176)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !107, file: !108, line: 98, baseType: !167, size: 32, offset: 2208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !107, file: !108, line: 99, baseType: !210, size: 64, offset: 2240)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !107, file: !108, line: 99, baseType: !210, size: 64, offset: 2304)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !107, file: !108, line: 100, baseType: !221, size: 64, offset: 2368)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !170)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !107, file: !108, line: 100, baseType: !224, size: 64, offset: 2432)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !107, file: !108, line: 101, baseType: !167, size: 32, offset: 2496)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !107, file: !108, line: 101, baseType: !167, size: 32, offset: 2528)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !107, file: !108, line: 102, baseType: !210, size: 64, offset: 2560)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !107, file: !108, line: 102, baseType: !210, size: 64, offset: 2624)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !107, file: !108, line: 103, baseType: !230, size: 64, offset: 2688)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !222)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !107, file: !108, line: 103, baseType: !233, size: 64, offset: 2752)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !107, file: !108, line: 104, baseType: !162, size: 64, offset: 2816)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !107, file: !108, line: 105, baseType: !167, size: 32, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !107, file: !108, line: 106, baseType: !237, size: 128, offset: 2944)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, elements: !244)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !108, line: 64, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 61, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !240, file: !108, line: 62, baseType: !155, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !240, file: !108, line: 63, baseType: !204, size: 64, offset: 64)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !107, file: !108, line: 107, baseType: !247, size: 64, offset: 3072)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !244)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !107, file: !108, line: 108, baseType: !204, size: 64, offset: 3136)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !107, file: !108, line: 109, baseType: !250, size: 64, offset: 3200)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!121, !204}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !107, file: !108, line: 111, baseType: !167, size: 32, offset: 3264)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !107, file: !108, line: 112, baseType: !255, size: 320, offset: 3328)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 320, elements: !298)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!121, !259, !105, !204}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !262)
!262 = !{!263, !264, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !12, line: 100, baseType: !167, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !12, line: 101, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !276, !277, !278, !279, !281, !283, !284, !285}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !267, file: !12, line: 84, baseType: !194, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !267, file: !12, line: 85, baseType: !194, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !12, line: 86, baseType: !204, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !267, file: !12, line: 87, baseType: !186, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !267, file: !12, line: 88, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !267, file: !12, line: 89, baseType: !146, size: 8, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !267, file: !12, line: 90, baseType: !194, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !267, file: !12, line: 91, baseType: !102, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !267, file: !12, line: 92, baseType: !280, size: 32, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !12, line: 93, baseType: !282, size: 32, offset: 544)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !12, line: 94, baseType: !265, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !267, file: !12, line: 95, baseType: !194, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !267, file: !12, line: 96, baseType: !204, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !261, file: !12, line: 102, baseType: !194, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !261, file: !12, line: 102, baseType: !194, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !261, file: !12, line: 103, baseType: !194, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !261, file: !12, line: 104, baseType: !123, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !261, file: !12, line: 105, baseType: !280, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !261, file: !12, line: 105, baseType: !280, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !261, file: !12, line: 105, baseType: !280, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !261, file: !12, line: 106, baseType: !105, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !261, file: !12, line: 107, baseType: !295, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !107, file: !108, line: 113, baseType: !301, size: 320, offset: 3648)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 320, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!121, !105, !204}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !107, file: !108, line: 114, baseType: !306, size: 320, offset: 3968)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 320, elements: !298)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !107, file: !108, line: 115, baseType: !280, size: 32, offset: 4288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !108, line: 120, baseType: !295, size: 64, offset: 4352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !107, file: !108, line: 121, baseType: !280, size: 32, offset: 4416)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_NTL", file: !312, line: 122, baseType: !313)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/unconstrained/impls/ntl/ntlimpl.h", directory: "/home/users/ndemeye/xSDK")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 10, size: 2752, elements: !314)
!314 = !{!315, !320, !325, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !313, file: !312, line: 11, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !317, line: 16, baseType: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !317, line: 16, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_pre", scope: !313, file: !312, line: 12, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !322, line: 11, baseType: !323)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !322, line: 11, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !313, file: !312, line: 14, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !94, line: 21, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !94, line: 21, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Xold", scope: !313, file: !312, line: 15, baseType: !326, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Gold", scope: !313, file: !312, line: 16, baseType: !326, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nu1", scope: !313, file: !312, line: 33, baseType: !222, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "nu2", scope: !313, file: !312, line: 34, baseType: !222, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nu3", scope: !313, file: !312, line: 35, baseType: !222, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nu4", scope: !313, file: !312, line: 36, baseType: !222, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "omega1", scope: !313, file: !312, line: 38, baseType: !222, size: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "omega2", scope: !313, file: !312, line: 39, baseType: !222, size: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "omega3", scope: !313, file: !312, line: 40, baseType: !222, size: 64, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "omega4", scope: !313, file: !312, line: 41, baseType: !222, size: 64, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "omega5", scope: !313, file: !312, line: 42, baseType: !222, size: 64, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "eta1", scope: !313, file: !312, line: 60, baseType: !222, size: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "eta2", scope: !313, file: !312, line: 61, baseType: !222, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "eta3", scope: !313, file: !312, line: 62, baseType: !222, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "eta4", scope: !313, file: !312, line: 63, baseType: !222, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !313, file: !312, line: 65, baseType: !222, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "alpha2", scope: !313, file: !312, line: 66, baseType: !222, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "alpha3", scope: !313, file: !312, line: 67, baseType: !222, size: 64, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "alpha4", scope: !313, file: !312, line: 68, baseType: !222, size: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alpha5", scope: !313, file: !312, line: 69, baseType: !222, size: 64, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mu1", scope: !313, file: !312, line: 89, baseType: !222, size: 64, offset: 1472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mu2", scope: !313, file: !312, line: 90, baseType: !222, size: 64, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1", scope: !313, file: !312, line: 92, baseType: !222, size: 64, offset: 1600)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2", scope: !313, file: !312, line: 93, baseType: !222, size: 64, offset: 1664)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3", scope: !313, file: !312, line: 94, baseType: !222, size: 64, offset: 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4", scope: !313, file: !312, line: 95, baseType: !222, size: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !313, file: !312, line: 97, baseType: !222, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mu1_i", scope: !313, file: !312, line: 100, baseType: !222, size: 64, offset: 1920)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mu2_i", scope: !313, file: !312, line: 101, baseType: !222, size: 64, offset: 1984)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1_i", scope: !313, file: !312, line: 103, baseType: !222, size: 64, offset: 2048)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2_i", scope: !313, file: !312, line: 104, baseType: !222, size: 64, offset: 2112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3_i", scope: !313, file: !312, line: 105, baseType: !222, size: 64, offset: 2176)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4_i", scope: !313, file: !312, line: 106, baseType: !222, size: 64, offset: 2240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "theta_i", scope: !313, file: !312, line: 108, baseType: !222, size: 64, offset: 2304)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "min_radius", scope: !313, file: !312, line: 111, baseType: !222, size: 64, offset: 2368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_radius", scope: !313, file: !312, line: 112, baseType: !222, size: 64, offset: 2432)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !313, file: !312, line: 113, baseType: !222, size: 64, offset: 2496)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ntrust", scope: !313, file: !312, line: 115, baseType: !167, size: 32, offset: 2560)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "newt", scope: !313, file: !312, line: 116, baseType: !167, size: 32, offset: 2592)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs", scope: !313, file: !312, line: 117, baseType: !167, size: 32, offset: 2624)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "grad", scope: !313, file: !312, line: 118, baseType: !167, size: 32, offset: 2656)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "init_type", scope: !313, file: !312, line: 120, baseType: !167, size: 32, offset: 2688)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "update_type", scope: !313, file: !312, line: 121, baseType: !167, size: 32, offset: 2720)
!372 = !{!0, !373}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "NTL_UPDATE", scope: !2, file: !375, line: 16, type: !376, isLocal: true, isDefinition: true)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntl/ntl.c", directory: "/home/users/ndemeye/xSDK")
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 4096, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 64)
!379 = !{i32 7, !"Dwarf Version", i32 4}
!380 = !{i32 2, !"Debug Info Version", i32 3}
!381 = !{i32 1, !"wchar_size", i32 4}
!382 = !{i32 7, !"PIC Level", i32 2}
!383 = !{i32 7, !"uwtable", i32 1}
!384 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!385 = distinct !DISubprogram(name: "TaoCreate_NTL", scope: !375, file: !375, line: 756, type: !386, scopeLine: 757, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !609)
!386 = !DISubroutineType(types: !387)
!387 = !{!121, !388}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !391, line: 45, size: 14656, elements: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!392 = !{!393, !395, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !478, !484, !486, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !562, !563, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !604, !605, !606, !607, !608}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !390, file: !391, line: 46, baseType: !394, size: 4480)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !108, line: 122, baseType: !107)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !390, file: !391, line: 46, baseType: !396, size: 1536, offset: 4480)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 1536, elements: !163)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !391, line: 13, size: 1536, elements: !398)
!398 = !{!399, !403, !407, !411, !415, !416, !417, !418, !419, !420, !421, !425, !429, !430, !431, !432, !436, !440, !441, !445, !447, !448, !452, !456}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !397, file: !391, line: 15, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!121, !388, !326, !221, !204}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !397, file: !391, line: 16, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!121, !388, !326, !221, !326, !204}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !397, file: !391, line: 17, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!121, !388, !326, !326, !204}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !397, file: !391, line: 18, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!121, !388, !326, !316, !316, !204}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !397, file: !391, line: 19, baseType: !408, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !397, file: !391, line: 20, baseType: !412, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !397, file: !391, line: 21, baseType: !408, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !397, file: !391, line: 22, baseType: !408, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !397, file: !391, line: 23, baseType: !408, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !397, file: !391, line: 24, baseType: !412, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !397, file: !391, line: 25, baseType: !422, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!121, !388, !326, !316, !316, !316, !204}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !397, file: !391, line: 26, baseType: !426, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!121, !388, !326, !316, !204}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !397, file: !391, line: 27, baseType: !412, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !397, file: !391, line: 28, baseType: !412, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !397, file: !391, line: 29, baseType: !408, size: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !397, file: !391, line: 30, baseType: !433, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!121, !388, !167, !204}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !397, file: !391, line: 31, baseType: !437, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!121, !388, !204}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !397, file: !391, line: 32, baseType: !250, size: 64, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !397, file: !391, line: 35, baseType: !442, size: 64, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!121, !388, !326, !326}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !397, file: !391, line: 36, baseType: !446, size: 64, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !397, file: !391, line: 37, baseType: !446, size: 64, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !397, file: !391, line: 38, baseType: !449, size: 64, offset: 1344)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!121, !388, !131}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !397, file: !391, line: 39, baseType: !453, size: 64, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!121, !259, !388}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !397, file: !391, line: 40, baseType: !446, size: 64, offset: 1472)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !390, file: !391, line: 47, baseType: !204, size: 64, offset: 6016)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !390, file: !391, line: 48, baseType: !204, size: 64, offset: 6080)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !390, file: !391, line: 49, baseType: !204, size: 64, offset: 6144)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !390, file: !391, line: 50, baseType: !204, size: 64, offset: 6208)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !390, file: !391, line: 51, baseType: !204, size: 64, offset: 6272)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !390, file: !391, line: 52, baseType: !204, size: 64, offset: 6336)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !390, file: !391, line: 53, baseType: !204, size: 64, offset: 6400)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !390, file: !391, line: 54, baseType: !204, size: 64, offset: 6464)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !390, file: !391, line: 55, baseType: !204, size: 64, offset: 6528)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !390, file: !391, line: 56, baseType: !204, size: 64, offset: 6592)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !390, file: !391, line: 57, baseType: !204, size: 64, offset: 6656)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !390, file: !391, line: 58, baseType: !204, size: 64, offset: 6720)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !390, file: !391, line: 59, baseType: !204, size: 64, offset: 6784)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !390, file: !391, line: 60, baseType: !204, size: 64, offset: 6848)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !390, file: !391, line: 61, baseType: !204, size: 64, offset: 6912)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !390, file: !391, line: 62, baseType: !204, size: 64, offset: 6976)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !390, file: !391, line: 63, baseType: !204, size: 64, offset: 7040)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !390, file: !391, line: 65, baseType: !475, size: 640, offset: 7104)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 640, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 10)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !390, file: !391, line: 66, baseType: !479, size: 640, offset: 7744)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 640, elements: !476)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!121, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !390, file: !391, line: 67, baseType: !485, size: 640, offset: 8384)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 640, elements: !476)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !390, file: !391, line: 68, baseType: !167, size: 32, offset: 9024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !390, file: !391, line: 69, baseType: !204, size: 64, offset: 9088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !390, file: !391, line: 70, baseType: !489, size: 32, offset: 9152)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !390, file: !391, line: 72, baseType: !280, size: 32, offset: 9184)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 73, baseType: !204, size: 64, offset: 9216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !390, file: !391, line: 75, baseType: !326, size: 64, offset: 9280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !390, file: !391, line: 76, baseType: !326, size: 64, offset: 9344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !390, file: !391, line: 77, baseType: !326, size: 64, offset: 9408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !390, file: !391, line: 78, baseType: !326, size: 64, offset: 9472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !390, file: !391, line: 79, baseType: !326, size: 64, offset: 9536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !390, file: !391, line: 80, baseType: !326, size: 64, offset: 9600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !390, file: !391, line: 81, baseType: !326, size: 64, offset: 9664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !390, file: !391, line: 82, baseType: !326, size: 64, offset: 9728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !390, file: !391, line: 83, baseType: !326, size: 64, offset: 9792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !390, file: !391, line: 84, baseType: !316, size: 64, offset: 9856)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !390, file: !391, line: 85, baseType: !316, size: 64, offset: 9920)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !390, file: !391, line: 86, baseType: !316, size: 64, offset: 9984)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !390, file: !391, line: 87, baseType: !326, size: 64, offset: 10048)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !390, file: !391, line: 88, baseType: !326, size: 64, offset: 10112)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !390, file: !391, line: 89, baseType: !316, size: 64, offset: 10176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !390, file: !391, line: 90, baseType: !316, size: 64, offset: 10240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !390, file: !391, line: 91, baseType: !326, size: 64, offset: 10304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !390, file: !391, line: 92, baseType: !167, size: 32, offset: 10368)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !390, file: !391, line: 93, baseType: !213, size: 64, offset: 10432)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !390, file: !391, line: 94, baseType: !213, size: 64, offset: 10496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !390, file: !391, line: 95, baseType: !221, size: 64, offset: 10560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !390, file: !391, line: 96, baseType: !326, size: 64, offset: 10624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !390, file: !391, line: 97, baseType: !326, size: 64, offset: 10688)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !390, file: !391, line: 98, baseType: !326, size: 64, offset: 10752)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !390, file: !391, line: 99, baseType: !316, size: 64, offset: 10816)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !390, file: !391, line: 100, baseType: !316, size: 64, offset: 10880)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !390, file: !391, line: 101, baseType: !316, size: 64, offset: 10944)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !390, file: !391, line: 102, baseType: !316, size: 64, offset: 11008)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !390, file: !391, line: 103, baseType: !316, size: 64, offset: 11072)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !390, file: !391, line: 104, baseType: !316, size: 64, offset: 11136)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !390, file: !391, line: 105, baseType: !316, size: 64, offset: 11200)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !390, file: !391, line: 106, baseType: !316, size: 64, offset: 11264)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !390, file: !391, line: 107, baseType: !316, size: 64, offset: 11328)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !390, file: !391, line: 108, baseType: !316, size: 64, offset: 11392)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !390, file: !391, line: 109, baseType: !316, size: 64, offset: 11456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !390, file: !391, line: 110, baseType: !528, size: 64, offset: 11520)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !529, line: 11, baseType: !530)
!529 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !529, line: 11, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !390, file: !391, line: 111, baseType: !528, size: 64, offset: 11584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !390, file: !391, line: 112, baseType: !222, size: 64, offset: 11648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !390, file: !391, line: 113, baseType: !222, size: 64, offset: 11712)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !390, file: !391, line: 114, baseType: !222, size: 64, offset: 11776)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !390, file: !391, line: 115, baseType: !222, size: 64, offset: 11840)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !390, file: !391, line: 116, baseType: !222, size: 64, offset: 11904)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !390, file: !391, line: 117, baseType: !222, size: 64, offset: 11968)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !390, file: !391, line: 119, baseType: !167, size: 32, offset: 12032)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !390, file: !391, line: 120, baseType: !167, size: 32, offset: 12064)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !390, file: !391, line: 121, baseType: !167, size: 32, offset: 12096)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !390, file: !391, line: 122, baseType: !167, size: 32, offset: 12128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !390, file: !391, line: 123, baseType: !167, size: 32, offset: 12160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !390, file: !391, line: 124, baseType: !167, size: 32, offset: 12192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !390, file: !391, line: 125, baseType: !167, size: 32, offset: 12224)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !390, file: !391, line: 126, baseType: !167, size: 32, offset: 12256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !390, file: !391, line: 127, baseType: !167, size: 32, offset: 12288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !390, file: !391, line: 128, baseType: !167, size: 32, offset: 12320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !390, file: !391, line: 129, baseType: !167, size: 32, offset: 12352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !390, file: !391, line: 130, baseType: !167, size: 32, offset: 12384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !390, file: !391, line: 131, baseType: !167, size: 32, offset: 12416)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !390, file: !391, line: 132, baseType: !167, size: 32, offset: 12448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !390, file: !391, line: 133, baseType: !167, size: 32, offset: 12480)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !390, file: !391, line: 134, baseType: !167, size: 32, offset: 12512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !390, file: !391, line: 135, baseType: !167, size: 32, offset: 12544)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !390, file: !391, line: 137, baseType: !167, size: 32, offset: 12576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !390, file: !391, line: 138, baseType: !167, size: 32, offset: 12608)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !390, file: !391, line: 140, baseType: !559, size: 64, offset: 12672)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !79, line: 5, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !79, line: 5, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !390, file: !391, line: 141, baseType: !280, size: 32, offset: 12736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !390, file: !391, line: 142, baseType: !564, size: 64, offset: 12800)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !55, line: 22, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !55, line: 22, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !390, file: !391, line: 143, baseType: !222, size: 64, offset: 12864)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !390, file: !391, line: 144, baseType: !222, size: 64, offset: 12928)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !390, file: !391, line: 146, baseType: !222, size: 64, offset: 12992)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !390, file: !391, line: 147, baseType: !222, size: 64, offset: 13056)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !390, file: !391, line: 148, baseType: !222, size: 64, offset: 13120)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !390, file: !391, line: 149, baseType: !222, size: 64, offset: 13184)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !390, file: !391, line: 150, baseType: !222, size: 64, offset: 13248)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !390, file: !391, line: 151, baseType: !222, size: 64, offset: 13312)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !390, file: !391, line: 152, baseType: !222, size: 64, offset: 13376)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !390, file: !391, line: 153, baseType: !280, size: 32, offset: 13440)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !390, file: !391, line: 154, baseType: !280, size: 32, offset: 13472)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !390, file: !391, line: 155, baseType: !280, size: 32, offset: 13504)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !390, file: !391, line: 156, baseType: !280, size: 32, offset: 13536)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !390, file: !391, line: 157, baseType: !280, size: 32, offset: 13568)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !390, file: !391, line: 158, baseType: !280, size: 32, offset: 13600)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !390, file: !391, line: 159, baseType: !280, size: 32, offset: 13632)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !390, file: !391, line: 160, baseType: !280, size: 32, offset: 13664)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !390, file: !391, line: 161, baseType: !280, size: 32, offset: 13696)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !390, file: !391, line: 162, baseType: !280, size: 32, offset: 13728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !390, file: !391, line: 163, baseType: !280, size: 32, offset: 13760)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !390, file: !391, line: 164, baseType: !280, size: 32, offset: 13792)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !390, file: !391, line: 165, baseType: !280, size: 32, offset: 13824)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !390, file: !391, line: 166, baseType: !280, size: 32, offset: 13856)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !390, file: !391, line: 167, baseType: !280, size: 32, offset: 13888)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !390, file: !391, line: 168, baseType: !280, size: 32, offset: 13920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !390, file: !391, line: 169, baseType: !280, size: 32, offset: 13952)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !390, file: !391, line: 170, baseType: !280, size: 32, offset: 13984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !390, file: !391, line: 171, baseType: !280, size: 32, offset: 14016)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !390, file: !391, line: 172, baseType: !280, size: 32, offset: 14048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !390, file: !391, line: 173, baseType: !280, size: 32, offset: 14080)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !390, file: !391, line: 174, baseType: !280, size: 32, offset: 14112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !390, file: !391, line: 175, baseType: !280, size: 32, offset: 14144)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !390, file: !391, line: 177, baseType: !600, size: 32, offset: 14176)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !390, file: !391, line: 178, baseType: !167, size: 32, offset: 14208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !390, file: !391, line: 179, baseType: !221, size: 64, offset: 14272)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !390, file: !391, line: 180, baseType: !221, size: 64, offset: 14336)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !390, file: !391, line: 181, baseType: !221, size: 64, offset: 14400)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !390, file: !391, line: 182, baseType: !213, size: 64, offset: 14464)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !390, file: !391, line: 183, baseType: !167, size: 32, offset: 14528)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !390, file: !391, line: 184, baseType: !280, size: 32, offset: 14560)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !390, file: !391, line: 185, baseType: !280, size: 32, offset: 14592)
!609 = !{!610, !611, !612, !613, !614, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634}
!610 = !DILocalVariable(name: "tao", arg: 1, scope: !385, file: !375, line: 756, type: !388)
!611 = !DILocalVariable(name: "tl", scope: !385, file: !375, line: 758, type: !310)
!612 = !DILocalVariable(name: "ierr", scope: !385, file: !375, line: 759, type: !121)
!613 = !DILocalVariable(name: "morethuente_type", scope: !385, file: !375, line: 760, type: !144)
!614 = !DILocalVariable(name: "ierr__", scope: !615, file: !375, line: 763, type: !121)
!615 = distinct !DILexicalBlock(scope: !385, file: !375, line: 763, column: 31)
!616 = !DILocalVariable(name: "ierr__", scope: !617, file: !375, line: 830, type: !121)
!617 = distinct !DILexicalBlock(scope: !385, file: !375, line: 830, column: 74)
!618 = !DILocalVariable(name: "ierr__", scope: !619, file: !375, line: 831, type: !121)
!619 = distinct !DILexicalBlock(scope: !385, file: !375, line: 831, column: 88)
!620 = !DILocalVariable(name: "ierr__", scope: !621, file: !375, line: 832, type: !121)
!621 = distinct !DILexicalBlock(scope: !385, file: !375, line: 832, column: 66)
!622 = !DILocalVariable(name: "ierr__", scope: !623, file: !375, line: 833, type: !121)
!623 = distinct !DILexicalBlock(scope: !385, file: !375, line: 833, column: 60)
!624 = !DILocalVariable(name: "ierr__", scope: !625, file: !375, line: 834, type: !121)
!625 = distinct !DILexicalBlock(scope: !385, file: !375, line: 834, column: 73)
!626 = !DILocalVariable(name: "ierr__", scope: !627, file: !375, line: 835, type: !121)
!627 = distinct !DILexicalBlock(scope: !385, file: !375, line: 835, column: 56)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !375, line: 836, type: !121)
!629 = distinct !DILexicalBlock(scope: !385, file: !375, line: 836, column: 81)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !375, line: 837, type: !121)
!631 = distinct !DILexicalBlock(scope: !385, file: !375, line: 837, column: 56)
!632 = !DILocalVariable(name: "ierr__", scope: !633, file: !375, line: 838, type: !121)
!633 = distinct !DILexicalBlock(scope: !385, file: !375, line: 838, column: 54)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !375, line: 839, type: !121)
!635 = distinct !DILexicalBlock(scope: !385, file: !375, line: 839, column: 39)
!636 = !DILocation(line: 0, scope: !385)
!637 = !DILocation(line: 758, column: 3, scope: !385)
!638 = !DILocation(line: 762, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !375, line: 762, column: 3)
!640 = distinct !DILexicalBlock(scope: !641, file: !375, line: 762, column: 3)
!641 = distinct !DILexicalBlock(scope: !385, file: !375, line: 762, column: 3)
!642 = !{!643, !643, i64 0}
!643 = !{!"any pointer", !644, i64 0}
!644 = !{!"omnipotent char", !645, i64 0}
!645 = !{!"Simple C/C++ TBAA"}
!646 = !DILocation(line: 762, column: 3, scope: !640)
!647 = !DILocation(line: 762, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !375, line: 762, column: 3)
!649 = distinct !DILexicalBlock(scope: !639, file: !375, line: 762, column: 3)
!650 = !{!651, !652, i64 1536}
!651 = !{!"", !644, i64 0, !644, i64 512, !644, i64 1024, !644, i64 1280, !652, i64 1536, !652, i64 1540, !644, i64 1544}
!652 = !{!"int", !644, i64 0}
!653 = !DILocation(line: 762, column: 3, scope: !649)
!654 = !DILocation(line: 762, column: 3, scope: !655)
!655 = distinct !DILexicalBlock(scope: !648, file: !375, line: 762, column: 3)
!656 = !{!652, !652, i64 0}
!657 = !{!651, !652, i64 1540}
!658 = !DILocation(line: 763, column: 10, scope: !385)
!659 = !{!"branch_weights", i32 2146410443, i32 1073205}
!660 = !DILocation(line: 0, scope: !615)
!661 = !DILocation(line: 763, column: 31, scope: !615)
!662 = !{!"branch_weights", i32 2000, i32 1}
!663 = !DILocation(line: 763, column: 31, scope: !664)
