; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/lgmres/lgmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/lgmres/lgmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 155, baseType: !5, size: 32, elements: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!127 = !{!128, !129, !130, !131, !132}
!128 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141}
!135 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!136 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!137 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!138 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!139 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!140 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!141 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!142 = !{!143, !351, !161, !242, !182, !354, !317, !205, !648, !651, !232, !26, !654, !208, !352}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !146, line: 73, size: 4480, elements: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!147 = !{!148, !150, !203, !204, !206, !209, !210, !211, !212, !220, !221, !223, !227, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !245, !246, !247, !249, !250, !252, !254, !255, !256, !257, !258, !261, !263, !264, !265, !266, !267, !270, !272, !273, !274, !284, !286, !287, !291, !292, !341, !346, !348, !349, !350}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !145, file: !146, line: 74, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !145, file: !146, line: 75, baseType: !151, size: 448, offset: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 448, elements: !201)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !146, line: 53, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 45, size: 448, elements: !154)
!154 = !{!155, !165, !173, !178, !185, !189, !196}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !153, file: !146, line: 46, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !143, !160}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !162, line: 330, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !162, line: 330, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !153, file: !146, line: 47, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!159, !143, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !170, line: 16, baseType: !171)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !170, line: 16, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !153, file: !146, line: 48, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!159, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !153, file: !146, line: 49, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!159, !143, !182, !143}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !153, file: !146, line: 50, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!159, !143, !182, !177}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !153, file: !146, line: 51, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!159, !143, !182, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !153, file: !146, line: 52, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!159, !143, !182, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !145, file: !146, line: 76, baseType: !161, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !146, line: 77, baseType: !205, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !208)
!208 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !146, line: 79, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !216, line: 27, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !218, line: 43, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!219 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !145, file: !146, line: 80, baseType: !205, size: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !145, file: !146, line: 81, baseType: !222, size: 32, offset: 992)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !145, file: !146, line: 82, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !145, file: !146, line: 83, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !145, file: !146, line: 84, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !145, file: !146, line: 85, baseType: !232, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !145, file: !146, line: 86, baseType: !232, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !145, file: !146, line: 87, baseType: !232, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !145, file: !146, line: 88, baseType: !143, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !145, file: !146, line: 89, baseType: !213, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !146, line: 90, baseType: !232, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !145, file: !146, line: 91, baseType: !232, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !145, file: !146, line: 92, baseType: !205, size: 32, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !145, file: !146, line: 93, baseType: !242, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !145, file: !146, line: 94, baseType: !244, size: 64, offset: 1792)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !214)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !145, file: !146, line: 95, baseType: !205, size: 32, offset: 1856)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !145, file: !146, line: 95, baseType: !205, size: 32, offset: 1888)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !145, file: !146, line: 96, baseType: !248, size: 64, offset: 1920)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !145, file: !146, line: 96, baseType: !248, size: 64, offset: 1984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !145, file: !146, line: 97, baseType: !251, size: 64, offset: 2048)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !145, file: !146, line: 97, baseType: !253, size: 64, offset: 2112)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !145, file: !146, line: 98, baseType: !205, size: 32, offset: 2176)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !145, file: !146, line: 98, baseType: !205, size: 32, offset: 2208)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !145, file: !146, line: 99, baseType: !248, size: 64, offset: 2240)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !145, file: !146, line: 99, baseType: !248, size: 64, offset: 2304)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !145, file: !146, line: 100, baseType: !259, size: 64, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !145, file: !146, line: 100, baseType: !262, size: 64, offset: 2432)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !145, file: !146, line: 101, baseType: !205, size: 32, offset: 2496)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !145, file: !146, line: 101, baseType: !205, size: 32, offset: 2528)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !145, file: !146, line: 102, baseType: !248, size: 64, offset: 2560)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !145, file: !146, line: 102, baseType: !248, size: 64, offset: 2624)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !145, file: !146, line: 103, baseType: !268, size: 64, offset: 2688)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !260)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !145, file: !146, line: 103, baseType: !271, size: 64, offset: 2752)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !145, file: !146, line: 104, baseType: !200, size: 64, offset: 2816)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !145, file: !146, line: 105, baseType: !205, size: 32, offset: 2880)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !145, file: !146, line: 106, baseType: !275, size: 128, offset: 2944)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 128, elements: !282)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !146, line: 64, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 61, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !278, file: !146, line: 62, baseType: !193, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !278, file: !146, line: 63, baseType: !242, size: 64, offset: 64)
!282 = !{!283}
!283 = !DISubrange(count: 2)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !145, file: !146, line: 107, baseType: !285, size: 64, offset: 3072)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !282)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !145, file: !146, line: 108, baseType: !242, size: 64, offset: 3136)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !145, file: !146, line: 109, baseType: !288, size: 64, offset: 3200)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!159, !242}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !145, file: !146, line: 111, baseType: !205, size: 32, offset: 3264)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !145, file: !146, line: 112, baseType: !293, size: 320, offset: 3328)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !339)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!159, !297, !143, !242}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !300)
!300 = !{!301, !302, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !299, file: !10, line: 100, baseType: !205, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !10, line: 101, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !314, !315, !316, !320, !322, !324, !325, !326}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !305, file: !10, line: 84, baseType: !232, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !305, file: !10, line: 85, baseType: !232, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !10, line: 86, baseType: !242, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !305, file: !10, line: 87, baseType: !224, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !305, file: !10, line: 88, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !305, file: !10, line: 89, baseType: !184, size: 8, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !305, file: !10, line: 90, baseType: !232, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !305, file: !10, line: 91, baseType: !317, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !318, line: 46, baseType: !319)
!318 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!319 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !10, line: 92, baseType: !321, size: 32, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !10, line: 93, baseType: !323, size: 32, offset: 544)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !10, line: 94, baseType: !303, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !305, file: !10, line: 95, baseType: !232, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !305, file: !10, line: 96, baseType: !242, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !299, file: !10, line: 102, baseType: !232, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !299, file: !10, line: 102, baseType: !232, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !299, file: !10, line: 103, baseType: !232, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !299, file: !10, line: 104, baseType: !161, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !299, file: !10, line: 105, baseType: !321, size: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !299, file: !10, line: 105, baseType: !321, size: 32, offset: 416)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !299, file: !10, line: 105, baseType: !321, size: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !299, file: !10, line: 106, baseType: !143, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !299, file: !10, line: 107, baseType: !336, size: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!339 = !{!340}
!340 = !DISubrange(count: 5)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !145, file: !146, line: 113, baseType: !342, size: 320, offset: 3648)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 320, elements: !339)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!159, !143, !242}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !145, file: !146, line: 114, baseType: !347, size: 320, offset: 3968)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 320, elements: !339)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !145, file: !146, line: 115, baseType: !321, size: 32, offset: 4288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !145, file: !146, line: 120, baseType: !336, size: 64, offset: 4352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !145, file: !146, line: 121, baseType: !321, size: 32, offset: 4416)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !353, line: 1451, baseType: !193)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_LGMRES", file: !356, line: 43, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/lgmres/lgmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 12, size: 2112, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !619, !621, !622, !623, !624, !625, !626, !627, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !357, file: !356, line: 13, baseType: !268, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !357, file: !356, line: 13, baseType: !259, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !357, file: !356, line: 13, baseType: !260, size: 64, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 672)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !357, file: !356, line: 13, baseType: !372, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!159, !375, !205}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !378)
!378 = !{!379, !381, !434, !439, !440, !441, !442, !472, !473, !474, !475, !476, !478, !483, !484, !485, !486, !487, !488, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !512, !518, !519, !520, !521, !526, !527, !528, !529, !534, !535, !536, !537, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !589, !590, !591, !592, !593, !600, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !616, !617, !618}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !377, file: !102, line: 76, baseType: !380, size: 4480)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !146, line: 122, baseType: !145)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !377, file: !102, line: 76, baseType: !382, size: 896, offset: 4480)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 896, elements: !201)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !384)
!384 = !{!385, !393, !397, !401, !409, !410, !414, !415, !419, !423, !427, !428, !432, !433}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !383, file: !102, line: 19, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!159, !375, !389, !392}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !126, line: 21, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !126, line: 21, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !383, file: !102, line: 22, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!159, !375, !389, !389, !392}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !383, file: !102, line: 25, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!159, !375}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !383, file: !102, line: 26, baseType: !402, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!159, !375, !405, !405}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !406, line: 16, baseType: !407)
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !406, line: 16, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !383, file: !102, line: 27, baseType: !398, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !383, file: !102, line: 28, baseType: !411, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!159, !297, !375}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !383, file: !102, line: 29, baseType: !398, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !383, file: !102, line: 30, baseType: !416, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!159, !375, !259, !259}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !383, file: !102, line: 31, baseType: !420, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!159, !375, !205, !259, !259, !251}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !383, file: !102, line: 32, baseType: !424, size: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!159, !375, !321, !321, !251, !392, !259, !259}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !383, file: !102, line: 33, baseType: !398, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !383, file: !102, line: 34, baseType: !429, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!159, !375, !169}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !383, file: !102, line: 35, baseType: !398, size: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !383, file: !102, line: 36, baseType: !429, size: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !377, file: !102, line: 77, baseType: !435, size: 64, offset: 5376)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !436, line: 14, baseType: !437)
!436 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !436, line: 14, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !377, file: !102, line: 78, baseType: !321, size: 32, offset: 5440)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !377, file: !102, line: 79, baseType: !321, size: 32, offset: 5472)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !377, file: !102, line: 81, baseType: !205, size: 32, offset: 5504)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !377, file: !102, line: 82, baseType: !443, size: 64, offset: 5568)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !446)
!446 = !{!447, !448, !468, !469, !470, !471}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !445, file: !102, line: 55, baseType: !380, size: 4480)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !445, file: !102, line: 55, baseType: !449, size: 448, offset: 4480)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 448, elements: !201)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !451)
!451 = !{!452, !456, !457, !461, !462, !463, !467}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !450, file: !102, line: 42, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!159, !443, !389, !389}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !450, file: !102, line: 43, baseType: !453, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !450, file: !102, line: 44, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!159, !443}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !450, file: !102, line: 45, baseType: !458, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !450, file: !102, line: 46, baseType: !458, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !450, file: !102, line: 47, baseType: !464, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!159, !443, !169}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !450, file: !102, line: 48, baseType: !458, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !445, file: !102, line: 56, baseType: !375, size: 64, offset: 4928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !445, file: !102, line: 57, baseType: !405, size: 64, offset: 4992)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !445, file: !102, line: 58, baseType: !244, size: 64, offset: 5056)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !445, file: !102, line: 59, baseType: !242, size: 64, offset: 5120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !377, file: !102, line: 83, baseType: !321, size: 32, offset: 5632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !377, file: !102, line: 84, baseType: !321, size: 32, offset: 5664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !377, file: !102, line: 85, baseType: !321, size: 32, offset: 5696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !377, file: !102, line: 86, baseType: !321, size: 32, offset: 5728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !377, file: !102, line: 87, baseType: !477, size: 32, offset: 5760)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !377, file: !102, line: 88, baseType: !479, size: 384, offset: 5792)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 384, elements: !480)
!480 = !{!481, !482}
!481 = !DISubrange(count: 4)
!482 = !DISubrange(count: 3)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !377, file: !102, line: 89, baseType: !260, size: 64, offset: 6208)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !377, file: !102, line: 90, baseType: !260, size: 64, offset: 6272)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !377, file: !102, line: 91, baseType: !260, size: 64, offset: 6336)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !377, file: !102, line: 92, baseType: !260, size: 64, offset: 6400)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !377, file: !102, line: 93, baseType: !260, size: 64, offset: 6464)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !377, file: !102, line: 94, baseType: !260, size: 64, offset: 6528)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !377, file: !102, line: 95, baseType: !490, size: 32, offset: 6592)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !377, file: !102, line: 96, baseType: !321, size: 32, offset: 6624)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !377, file: !102, line: 98, baseType: !389, size: 64, offset: 6656)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !377, file: !102, line: 98, baseType: !389, size: 64, offset: 6720)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !377, file: !102, line: 102, baseType: !259, size: 64, offset: 6784)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !377, file: !102, line: 103, baseType: !259, size: 64, offset: 6848)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !377, file: !102, line: 104, baseType: !205, size: 32, offset: 6912)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !377, file: !102, line: 105, baseType: !205, size: 32, offset: 6944)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !377, file: !102, line: 106, baseType: !321, size: 32, offset: 6976)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !377, file: !102, line: 107, baseType: !259, size: 64, offset: 7040)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !377, file: !102, line: 108, baseType: !259, size: 64, offset: 7104)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !377, file: !102, line: 109, baseType: !205, size: 32, offset: 7168)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !377, file: !102, line: 110, baseType: !205, size: 32, offset: 7200)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !377, file: !102, line: 111, baseType: !321, size: 32, offset: 7232)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !377, file: !102, line: 113, baseType: !205, size: 32, offset: 7264)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !377, file: !102, line: 114, baseType: !321, size: 32, offset: 7296)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !377, file: !102, line: 117, baseType: !205, size: 32, offset: 7328)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !377, file: !102, line: 120, baseType: !508, size: 320, offset: 7360)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 320, elements: !339)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!159, !375, !205, !260, !242}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !377, file: !102, line: 121, baseType: !513, size: 320, offset: 7680)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !339)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!159, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !377, file: !102, line: 122, baseType: !347, size: 320, offset: 8000)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !377, file: !102, line: 123, baseType: !205, size: 32, offset: 8320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !377, file: !102, line: 124, baseType: !321, size: 32, offset: 8352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !377, file: !102, line: 126, baseType: !522, size: 320, offset: 8384)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !339)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!159, !375, !242}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !377, file: !102, line: 127, baseType: !513, size: 320, offset: 8704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !377, file: !102, line: 128, baseType: !347, size: 320, offset: 9024)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !377, file: !102, line: 129, baseType: !205, size: 32, offset: 9344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !377, file: !102, line: 131, baseType: !530, size: 64, offset: 9408)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!159, !375, !205, !260, !533, !242}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !377, file: !102, line: 132, baseType: !288, size: 64, offset: 9472)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !377, file: !102, line: 133, baseType: !242, size: 64, offset: 9536)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !377, file: !102, line: 135, baseType: !242, size: 64, offset: 9600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !377, file: !102, line: 137, baseType: !538, size: 64, offset: 9664)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !377, file: !102, line: 139, baseType: !242, size: 64, offset: 9728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9792)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9824)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9856)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9888)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9920)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9952)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 9984)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10016)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10048)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10080)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10176)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !377, file: !102, line: 142, baseType: !321, size: 32, offset: 10208)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10304)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10368)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10432)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10496)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10560)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10624)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10688)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10816)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10880)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 10944)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 11008)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !377, file: !102, line: 143, baseType: !169, size: 64, offset: 11072)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11136)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11168)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11200)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11232)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11264)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11296)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11328)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11360)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11392)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11424)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11456)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11488)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11520)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !377, file: !102, line: 144, baseType: !571, size: 32, offset: 11552)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !377, file: !102, line: 147, baseType: !205, size: 32, offset: 11584)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !377, file: !102, line: 148, baseType: !392, size: 64, offset: 11648)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !377, file: !102, line: 150, baseType: !588, size: 32, offset: 11712)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !377, file: !102, line: 151, baseType: !321, size: 32, offset: 11744)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !377, file: !102, line: 153, baseType: !205, size: 32, offset: 11776)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !377, file: !102, line: 154, baseType: !205, size: 32, offset: 11808)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !377, file: !102, line: 156, baseType: !321, size: 32, offset: 11840)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !377, file: !102, line: 161, baseType: !594, size: 192, offset: 11904)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !102, line: 157, size: 192, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !594, file: !102, line: 158, baseType: !405, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !594, file: !102, line: 158, baseType: !405, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !594, file: !102, line: 159, baseType: !321, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !594, file: !102, line: 160, baseType: !321, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !377, file: !102, line: 163, baseType: !601, size: 32, offset: 12096)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !377, file: !102, line: 165, baseType: !477, size: 32, offset: 12128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !377, file: !102, line: 166, baseType: !601, size: 32, offset: 12160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !377, file: !102, line: 171, baseType: !321, size: 32, offset: 12192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !377, file: !102, line: 172, baseType: !321, size: 32, offset: 12224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !377, file: !102, line: 173, baseType: !321, size: 32, offset: 12256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !377, file: !102, line: 174, baseType: !389, size: 64, offset: 12288)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !377, file: !102, line: 175, baseType: !389, size: 64, offset: 12352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !377, file: !102, line: 177, baseType: !205, size: 32, offset: 12416)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !377, file: !102, line: 178, baseType: !321, size: 32, offset: 12448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !377, file: !102, line: 180, baseType: !169, size: 64, offset: 12480)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !377, file: !102, line: 182, baseType: !613, size: 64, offset: 12544)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!159, !375, !389, !389, !242}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !377, file: !102, line: 183, baseType: !613, size: 64, offset: 12608)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !377, file: !102, line: 184, baseType: !242, size: 64, offset: 12672)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !377, file: !102, line: 184, baseType: !242, size: 64, offset: 12736)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !357, file: !356, line: 13, baseType: !620, size: 32, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !120)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !357, file: !356, line: 13, baseType: !392, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !357, file: !356, line: 13, baseType: !392, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 992)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 1056)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !357, file: !356, line: 13, baseType: !628, size: 64, offset: 1088)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !357, file: !356, line: 13, baseType: !251, size: 64, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 1248)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !357, file: !356, line: 13, baseType: !205, size: 32, offset: 1280)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !357, file: !356, line: 13, baseType: !268, size: 64, offset: 1344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !357, file: !356, line: 13, baseType: !389, size: 64, offset: 1408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !357, file: !356, line: 13, baseType: !260, size: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !357, file: !356, line: 13, baseType: !260, size: 64, offset: 1536)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "augvecs", scope: !357, file: !356, line: 16, baseType: !392, size: 64, offset: 1600)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "augvecs_user_work", scope: !357, file: !356, line: 17, baseType: !628, size: 64, offset: 1664)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "aug_vv_allocated", scope: !357, file: !356, line: 21, baseType: !205, size: 32, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "aug_vecs_allocated", scope: !357, file: !356, line: 23, baseType: !205, size: 32, offset: 1760)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "hwork", scope: !357, file: !356, line: 26, baseType: !268, size: 64, offset: 1792)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "augwork_alloc", scope: !357, file: !356, line: 28, baseType: !205, size: 32, offset: 1856)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "aug_dim", scope: !357, file: !356, line: 30, baseType: !205, size: 32, offset: 1888)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "aug_ct", scope: !357, file: !356, line: 32, baseType: !205, size: 32, offset: 1920)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "aug_order", scope: !357, file: !356, line: 34, baseType: !251, size: 64, offset: 1984)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "approx_constant", scope: !357, file: !356, line: 36, baseType: !321, size: 32, offset: 2048)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "matvecs", scope: !357, file: !356, line: 42, baseType: !205, size: 32, offset: 2080)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !162, line: 331, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !162, line: 331, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !162, line: 338, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !162, line: 338, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !133)
!655 = !{i32 7, !"Dwarf Version", i32 4}
!656 = !{i32 2, !"Debug Info Version", i32 3}
!657 = !{i32 1, !"wchar_size", i32 4}
!658 = !{i32 7, !"PIC Level", i32 2}
!659 = !{i32 7, !"uwtable", i32 1}
!660 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!661 = distinct !DISubprogram(name: "KSPLGMRESSetAugDim", scope: !662, file: !662, line: 11, type: !373, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !663)
!662 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/lgmres/lgmres.c", directory: "/home/users/ndemeye/xSDK")
!663 = !{!664, !665, !666, !667, !669, !670, !672, !676}
!664 = !DILocalVariable(name: "ksp", arg: 1, scope: !661, file: !662, line: 11, type: !375)
!665 = !DILocalVariable(name: "dim", arg: 2, scope: !661, file: !662, line: 11, type: !205)
!666 = !DILocalVariable(name: "ierr", scope: !661, file: !662, line: 13, type: !159)
!667 = !DILocalVariable(name: "_7_f", scope: !668, file: !662, line: 16, type: !372)
!668 = distinct !DILexicalBlock(scope: !661, file: !662, line: 16, column: 10)
!669 = !DILocalVariable(name: "_7_ierr", scope: !668, file: !662, line: 16, type: !159)
!670 = !DILocalVariable(name: "ierr__", scope: !671, file: !662, line: 16, type: !159)
!671 = distinct !DILexicalBlock(scope: !668, file: !662, line: 16, column: 10)
!672 = !DILocalVariable(name: "ierr__", scope: !673, file: !662, line: 16, type: !159)
!673 = distinct !DILexicalBlock(scope: !674, file: !662, line: 16, column: 10)
!674 = distinct !DILexicalBlock(scope: !675, file: !662, line: 16, column: 10)
!675 = distinct !DILexicalBlock(scope: !668, file: !662, line: 16, column: 10)
!676 = !DILocalVariable(name: "ierr__", scope: !677, file: !662, line: 16, type: !159)
!677 = distinct !DILexicalBlock(scope: !661, file: !662, line: 16, column: 80)
!678 = !DILocation(line: 0, scope: !661)
!679 = !DILocation(line: 15, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !662, line: 15, column: 3)
!681 = distinct !DILexicalBlock(scope: !682, file: !662, line: 15, column: 3)
!682 = distinct !DILexicalBlock(scope: !661, file: !662, line: 15, column: 3)
!683 = !{!684, !684, i64 0}
!684 = !{!"any pointer", !685, i64 0}
!685 = !{!"omnipotent char", !686, i64 0}
!686 = !{!"Simple C/C++ TBAA"}
!687 = !DILocation(line: 15, column: 3, scope: !681)
!688 = !DILocation(line: 15, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !662, line: 15, column: 3)
!690 = distinct !DILexicalBlock(scope: !680, file: !662, line: 15, column: 3)
!691 = !{!692, !693, i64 1536}
!692 = !{!"", !685, i64 0, !685, i64 512, !685, i64 1024, !685, i64 1280, !693, i64 1536, !693, i64 1540, !685, i64 1544}
!693 = !{!"int", !685, i64 0}
!694 = !DILocation(line: 15, column: 3, scope: !690)
!695 = !DILocation(line: 15, column: 3, scope: !696)
!696 = distinct !DILexicalBlock(scope: !689, file: !662, line: 15, column: 3)
!697 = !{!693, !693, i64 0}
!698 = !{!692, !693, i64 1540}
!699 = !DILocation(line: 16, column: 10, scope: !668)
!700 = !DILocation(line: 0, scope: !668)
