; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zstart.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zstart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_predefined_errhandler_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_op_t = type opaque
%struct.ompi_errhandler_t = type opaque
%struct._n_PetscOptions = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zstart.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !10, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 170, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 81, baseType: !5, size: 32, elements: !17)
!16 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!18 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!30 = !{!31, !33, !37, !38, !39, !42, !43, !44, !47, !50}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !34, line: 330, baseType: !35)
!34 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !34, line: 330, flags: DIFlagFwdDecl)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !34, line: 331, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !34, line: 331, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Errhandler", file: !34, line: 332, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_errhandler_t", file: !34, line: 332, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !11, line: 430, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !53, line: 73, size: 4480, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !57, !105, !106, !108, !111, !112, !113, !114, !122, !123, !125, !129, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !145, !146, !147, !149, !150, !152, !154, !155, !156, !157, !158, !161, !163, !164, !165, !166, !167, !170, !172, !173, !174, !184, !186, !187, !191, !192, !238, !243, !245, !246, !247}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !52, file: !53, line: 74, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !11, line: 32, baseType: !38)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !52, file: !53, line: 75, baseType: !58, size: 448, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 448, elements: !103)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !53, line: 53, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 45, size: 448, elements: !61)
!61 = !{!62, !68, !76, !81, !87, !91, !98}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !60, file: !53, line: 46, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !50, !67}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !11, line: 14, baseType: !38)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !60, file: !53, line: 47, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!66, !50, !72}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !73, line: 16, baseType: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !73, line: 16, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !60, file: !53, line: 48, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!66, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !60, file: !53, line: 49, baseType: !82, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!66, !50, !85, !50}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !60, file: !53, line: 50, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!66, !50, !85, !80}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !60, file: !53, line: 51, baseType: !92, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!66, !50, !85, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !60, file: !53, line: 52, baseType: !99, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!66, !50, !85, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !52, file: !53, line: 76, baseType: !33, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !53, line: 77, baseType: !107, size: 32, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !11, line: 102, baseType: !38)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !52, file: !53, line: 78, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !11, line: 360, baseType: !110)
!110 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !52, file: !53, line: 78, baseType: !109, size: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !52, file: !53, line: 78, baseType: !109, size: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !52, file: !53, line: 78, baseType: !109, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !52, file: !53, line: 79, baseType: !115, size: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !11, line: 442, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !11, line: 90, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !118, line: 27, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !120, line: 43, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !52, file: !53, line: 80, baseType: !107, size: 32, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !52, file: !53, line: 81, baseType: !124, size: 32, offset: 992)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !11, line: 49, baseType: !38)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !52, file: !53, line: 82, baseType: !126, size: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !11, line: 465, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !11, line: 465, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !52, file: !53, line: 83, baseType: !130, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !11, line: 496, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !11, line: 496, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !52, file: !53, line: 84, baseType: !31, size: 64, offset: 1152)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !52, file: !53, line: 85, baseType: !31, size: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !52, file: !53, line: 86, baseType: !31, size: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !52, file: !53, line: 87, baseType: !31, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !52, file: !53, line: 88, baseType: !50, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !52, file: !53, line: 89, baseType: !115, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 90, baseType: !31, size: 64, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !52, file: !53, line: 91, baseType: !31, size: 64, offset: 1600)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !52, file: !53, line: 92, baseType: !107, size: 32, offset: 1664)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !52, file: !53, line: 93, baseType: !37, size: 64, offset: 1728)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !53, line: 94, baseType: !144, size: 64, offset: 1792)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !11, line: 455, baseType: !116)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !52, file: !53, line: 95, baseType: !107, size: 32, offset: 1856)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !52, file: !53, line: 95, baseType: !107, size: 32, offset: 1888)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !52, file: !53, line: 96, baseType: !148, size: 64, offset: 1920)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !52, file: !53, line: 96, baseType: !148, size: 64, offset: 1984)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !52, file: !53, line: 97, baseType: !151, size: 64, offset: 2048)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !52, file: !53, line: 97, baseType: !153, size: 64, offset: 2112)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !52, file: !53, line: 98, baseType: !107, size: 32, offset: 2176)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !52, file: !53, line: 98, baseType: !107, size: 32, offset: 2208)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !52, file: !53, line: 99, baseType: !148, size: 64, offset: 2240)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !52, file: !53, line: 99, baseType: !148, size: 64, offset: 2304)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !52, file: !53, line: 100, baseType: !159, size: 64, offset: 2368)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !11, line: 189, baseType: !110)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !52, file: !53, line: 100, baseType: !162, size: 64, offset: 2432)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !52, file: !53, line: 101, baseType: !107, size: 32, offset: 2496)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !52, file: !53, line: 101, baseType: !107, size: 32, offset: 2528)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !52, file: !53, line: 102, baseType: !148, size: 64, offset: 2560)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !52, file: !53, line: 102, baseType: !148, size: 64, offset: 2624)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !52, file: !53, line: 103, baseType: !168, size: 64, offset: 2688)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !11, line: 305, baseType: !160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !52, file: !53, line: 103, baseType: !171, size: 64, offset: 2752)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !52, file: !53, line: 104, baseType: !102, size: 64, offset: 2816)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !52, file: !53, line: 105, baseType: !107, size: 32, offset: 2880)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !52, file: !53, line: 106, baseType: !175, size: 128, offset: 2944)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !182)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !53, line: 64, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 61, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !178, file: !53, line: 62, baseType: !95, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !178, file: !53, line: 63, baseType: !37, size: 64, offset: 64)
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !52, file: !53, line: 107, baseType: !185, size: 64, offset: 3072)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !182)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !52, file: !53, line: 108, baseType: !37, size: 64, offset: 3136)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !52, file: !53, line: 109, baseType: !188, size: 64, offset: 3200)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!66, !37}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !52, file: !53, line: 111, baseType: !107, size: 32, offset: 3264)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !52, file: !53, line: 112, baseType: !193, size: 320, offset: 3328)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 320, elements: !236)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!66, !197, !50, !37}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !16, line: 108, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !16, line: 99, size: 640, elements: !200)
!200 = !{!201, !202, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !199, file: !16, line: 100, baseType: !107, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !16, line: 101, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !16, line: 82, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !16, line: 83, size: 768, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !214, !215, !216, !217, !219, !221, !222, !223}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !205, file: !16, line: 84, baseType: !31, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !205, file: !16, line: 85, baseType: !31, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !205, file: !16, line: 86, baseType: !37, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !205, file: !16, line: 87, baseType: !126, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !205, file: !16, line: 88, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !205, file: !16, line: 89, baseType: !32, size: 8, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !205, file: !16, line: 90, baseType: !31, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !205, file: !16, line: 91, baseType: !47, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !205, file: !16, line: 92, baseType: !218, size: 32, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !11, line: 170, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !16, line: 93, baseType: !220, size: 32, offset: 544)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !16, line: 81, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !16, line: 94, baseType: !203, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !205, file: !16, line: 95, baseType: !31, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !205, file: !16, line: 96, baseType: !37, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !199, file: !16, line: 102, baseType: !31, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !199, file: !16, line: 102, baseType: !31, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !199, file: !16, line: 103, baseType: !31, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !199, file: !16, line: 104, baseType: !33, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !199, file: !16, line: 105, baseType: !218, size: 32, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !199, file: !16, line: 105, baseType: !218, size: 32, offset: 416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !199, file: !16, line: 105, baseType: !218, size: 32, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !199, file: !16, line: 106, baseType: !50, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !199, file: !16, line: 107, baseType: !233, size: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !16, line: 10, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !16, line: 10, flags: DIFlagFwdDecl)
!236 = !{!237}
!237 = !DISubrange(count: 5)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !52, file: !53, line: 113, baseType: !239, size: 320, offset: 3648)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 320, elements: !236)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!66, !50, !37}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !52, file: !53, line: 114, baseType: !244, size: 320, offset: 3968)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 320, elements: !236)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !52, file: !53, line: 115, baseType: !218, size: 32, offset: 4288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !52, file: !53, line: 120, baseType: !233, size: 64, offset: 4352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !52, file: !53, line: 121, baseType: !218, size: 32, offset: 4416)
!248 = !{i32 7, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{i32 7, !"PIC Level", i32 2}
!252 = !{i32 7, !"uwtable", i32 1}
!253 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!254 = distinct !DISubprogram(name: "PETScParseFortranArgs_Private", scope: !255, file: !255, line: 157, type: !256, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !260)
!255 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zstart.c", directory: "/home/users/ndemeye/xSDK")
!256 = !DISubroutineType(types: !257)
!257 = !{!66, !43, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !270, !276, !277, !279, !282, !283, !285, !289, !291, !294}
!261 = !DILocalVariable(name: "argc", arg: 1, scope: !254, file: !255, line: 157, type: !43)
!262 = !DILocalVariable(name: "argv", arg: 2, scope: !254, file: !255, line: 157, type: !258)
!263 = !DILocalVariable(name: "i", scope: !254, file: !255, line: 162, type: !38)
!264 = !DILocalVariable(name: "ierr", scope: !254, file: !255, line: 164, type: !66)
!265 = !DILocalVariable(name: "warg", scope: !254, file: !255, line: 165, type: !38)
!266 = !DILocalVariable(name: "rank", scope: !254, file: !255, line: 166, type: !124)
!267 = !DILocalVariable(name: "p", scope: !254, file: !255, line: 167, type: !31)
!268 = !DILocalVariable(name: "_7_errorcode", scope: !269, file: !255, line: 169, type: !66)
!269 = distinct !DILexicalBlock(scope: !254, file: !255, line: 169, column: 48)
!270 = !DILocalVariable(name: "_7_errorstring", scope: !271, file: !255, line: 169, type: !273)
!271 = distinct !DILexicalBlock(scope: !272, file: !255, line: 169, column: 48)
!272 = distinct !DILexicalBlock(scope: !269, file: !255, line: 169, column: 48)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 256)
!276 = !DILocalVariable(name: "_7_resultlen", scope: !271, file: !255, line: 169, type: !124)
!277 = !DILocalVariable(name: "_7_errorcode", scope: !278, file: !255, line: 178, type: !66)
!278 = distinct !DILexicalBlock(scope: !254, file: !255, line: 178, column: 55)
!279 = !DILocalVariable(name: "_7_errorstring", scope: !280, file: !255, line: 178, type: !273)
!280 = distinct !DILexicalBlock(scope: !281, file: !255, line: 178, column: 55)
!281 = distinct !DILexicalBlock(scope: !278, file: !255, line: 178, column: 55)
!282 = !DILocalVariable(name: "_7_resultlen", scope: !280, file: !255, line: 178, type: !124)
!283 = !DILocalVariable(name: "ierr__", scope: !284, file: !255, line: 181, type: !66)
!284 = distinct !DILexicalBlock(scope: !254, file: !255, line: 181, column: 103)
!285 = !DILocalVariable(name: "ierr__", scope: !286, file: !255, line: 185, type: !66)
!286 = distinct !DILexicalBlock(scope: !287, file: !255, line: 185, column: 63)
!287 = distinct !DILexicalBlock(scope: !288, file: !255, line: 184, column: 14)
!288 = distinct !DILexicalBlock(scope: !254, file: !255, line: 184, column: 7)
!289 = !DILocalVariable(name: "_7_errorcode", scope: !290, file: !255, line: 215, type: !66)
!290 = distinct !DILexicalBlock(scope: !254, file: !255, line: 215, column: 71)
!291 = !DILocalVariable(name: "_7_errorstring", scope: !292, file: !255, line: 215, type: !273)
!292 = distinct !DILexicalBlock(scope: !293, file: !255, line: 215, column: 71)
!293 = distinct !DILexicalBlock(scope: !290, file: !255, line: 215, column: 71)
!294 = !DILocalVariable(name: "_7_resultlen", scope: !292, file: !255, line: 215, type: !124)
