; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgsl/bcgsl.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgsl/bcgsl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque

!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!131 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!132 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!133 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!134 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!135 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!136 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!137 = !{!138, !176, !177, !377, !273, !380, !263, !195, !26, !216, !344, !5, !175, !144, !383, !149}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_BCGSL", file: !140, line: 30, baseType: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/bcgsl/bcgslimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 9, size: 1280, elements: !142)
!142 = !{!143, !145, !148, !150, !151, !155, !156, !157, !158, !160, !161, !164, !165, !166, !167, !168, !169, !170, !171, !173, !174}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ell", scope: !141, file: !140, line: 10, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !141, file: !140, line: 11, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !147)
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bConvex", scope: !141, file: !140, line: 12, baseType: !149, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pinv", scope: !141, file: !140, line: 13, baseType: !149, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vB", scope: !141, file: !140, line: 17, baseType: !152, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "vRt", scope: !141, file: !140, line: 18, baseType: !152, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vXr", scope: !141, file: !140, line: 19, baseType: !152, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vTm", scope: !141, file: !140, line: 20, baseType: !152, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vvR", scope: !141, file: !140, line: 21, baseType: !159, size: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "vvU", scope: !141, file: !140, line: 22, baseType: !159, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "vY0c", scope: !141, file: !140, line: 25, baseType: !162, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !146)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vYlc", scope: !141, file: !140, line: 25, baseType: !162, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vYtc", scope: !141, file: !140, line: 25, baseType: !162, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mZa", scope: !141, file: !140, line: 26, baseType: !162, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mZb", scope: !141, file: !140, line: 26, baseType: !162, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !141, file: !140, line: 27, baseType: !162, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !141, file: !140, line: 27, baseType: !162, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !141, file: !140, line: 27, baseType: !162, size: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !141, file: !140, line: 28, baseType: !172, size: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realwork", scope: !141, file: !140, line: 28, baseType: !172, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lwork", scope: !141, file: !140, line: 29, baseType: !175, size: 32, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !4, line: 140, baseType: !26)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !180, line: 73, size: 4480, elements: !181)
!180 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!181 = !{!182, !184, !237, !238, !239, !241, !242, !243, !244, !252, !253, !254, !258, !262, !264, !265, !266, !267, !268, !269, !270, !271, !272, !274, !276, !277, !278, !280, !281, !283, !285, !286, !287, !288, !289, !290, !292, !293, !294, !295, !296, !297, !299, !300, !301, !311, !313, !314, !318, !319, !367, !372, !374, !375, !376}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !179, file: !180, line: 74, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !179, file: !180, line: 75, baseType: !185, size: 448, offset: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 448, elements: !235)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !180, line: 53, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 45, size: 448, elements: !188)
!188 = !{!189, !199, !207, !212, !219, !223, !230}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !187, file: !180, line: 46, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !177, !194}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !196, line: 330, baseType: !197)
!196 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !196, line: 330, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !187, file: !180, line: 47, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!193, !177, !203}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !204, line: 16, baseType: !205)
!204 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !204, line: 16, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !187, file: !180, line: 48, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!193, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !187, file: !180, line: 49, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!193, !177, !216, !177}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !187, file: !180, line: 50, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!193, !177, !216, !211}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !187, file: !180, line: 51, baseType: !224, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!193, !177, !216, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !187, file: !180, line: 52, baseType: !231, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!193, !177, !216, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!235 = !{!236}
!236 = !DISubrange(count: 1)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !179, file: !180, line: 76, baseType: !195, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !180, line: 77, baseType: !144, size: 32, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !179, file: !180, line: 78, baseType: !240, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !147)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !179, file: !180, line: 78, baseType: !240, size: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !179, file: !180, line: 78, baseType: !240, size: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !179, file: !180, line: 78, baseType: !240, size: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !179, file: !180, line: 79, baseType: !245, size: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !248, line: 27, baseType: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !250, line: 43, baseType: !251)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!251 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !179, file: !180, line: 80, baseType: !144, size: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !179, file: !180, line: 81, baseType: !176, size: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !179, file: !180, line: 82, baseType: !255, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !179, file: !180, line: 83, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !179, file: !180, line: 84, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !179, file: !180, line: 85, baseType: !263, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !179, file: !180, line: 86, baseType: !263, size: 64, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !179, file: !180, line: 87, baseType: !263, size: 64, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !179, file: !180, line: 88, baseType: !177, size: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !179, file: !180, line: 89, baseType: !245, size: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 90, baseType: !263, size: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !179, file: !180, line: 91, baseType: !263, size: 64, offset: 1600)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !179, file: !180, line: 92, baseType: !144, size: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !179, file: !180, line: 93, baseType: !273, size: 64, offset: 1728)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !179, file: !180, line: 94, baseType: !275, size: 64, offset: 1792)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !246)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !179, file: !180, line: 95, baseType: !144, size: 32, offset: 1856)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !179, file: !180, line: 95, baseType: !144, size: 32, offset: 1888)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !179, file: !180, line: 96, baseType: !279, size: 64, offset: 1920)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !179, file: !180, line: 96, baseType: !279, size: 64, offset: 1984)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !179, file: !180, line: 97, baseType: !282, size: 64, offset: 2048)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !179, file: !180, line: 97, baseType: !284, size: 64, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !179, file: !180, line: 98, baseType: !144, size: 32, offset: 2176)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !179, file: !180, line: 98, baseType: !144, size: 32, offset: 2208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !179, file: !180, line: 99, baseType: !279, size: 64, offset: 2240)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !179, file: !180, line: 99, baseType: !279, size: 64, offset: 2304)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !179, file: !180, line: 100, baseType: !172, size: 64, offset: 2368)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !179, file: !180, line: 100, baseType: !291, size: 64, offset: 2432)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !179, file: !180, line: 101, baseType: !144, size: 32, offset: 2496)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !179, file: !180, line: 101, baseType: !144, size: 32, offset: 2528)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !179, file: !180, line: 102, baseType: !279, size: 64, offset: 2560)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !179, file: !180, line: 102, baseType: !279, size: 64, offset: 2624)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !179, file: !180, line: 103, baseType: !162, size: 64, offset: 2688)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !179, file: !180, line: 103, baseType: !298, size: 64, offset: 2752)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !179, file: !180, line: 104, baseType: !234, size: 64, offset: 2816)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !179, file: !180, line: 105, baseType: !144, size: 32, offset: 2880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !179, file: !180, line: 106, baseType: !302, size: 128, offset: 2944)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, elements: !309)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !180, line: 64, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 61, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !305, file: !180, line: 62, baseType: !227, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !305, file: !180, line: 63, baseType: !273, size: 64, offset: 64)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !179, file: !180, line: 107, baseType: !312, size: 64, offset: 3072)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !309)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !179, file: !180, line: 108, baseType: !273, size: 64, offset: 3136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !179, file: !180, line: 109, baseType: !315, size: 64, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!193, !273}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !179, file: !180, line: 111, baseType: !144, size: 32, offset: 3264)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !179, file: !180, line: 112, baseType: !320, size: 320, offset: 3328)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !365)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!193, !324, !177, !273}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !327)
!327 = !{!328, !329, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !326, file: !10, line: 100, baseType: !144, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !10, line: 101, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !341, !342, !343, !347, !348, !350, !351, !352}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !332, file: !10, line: 84, baseType: !263, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !332, file: !10, line: 85, baseType: !263, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !10, line: 86, baseType: !273, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !332, file: !10, line: 87, baseType: !255, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !332, file: !10, line: 88, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !332, file: !10, line: 89, baseType: !218, size: 8, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !332, file: !10, line: 90, baseType: !263, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !332, file: !10, line: 91, baseType: !344, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 46, baseType: !346)
!345 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !10, line: 92, baseType: !149, size: 32, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !10, line: 93, baseType: !349, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !10, line: 94, baseType: !330, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !332, file: !10, line: 95, baseType: !263, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !332, file: !10, line: 96, baseType: !273, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !326, file: !10, line: 102, baseType: !263, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !326, file: !10, line: 102, baseType: !263, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !326, file: !10, line: 103, baseType: !263, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !326, file: !10, line: 104, baseType: !195, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !326, file: !10, line: 105, baseType: !149, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !326, file: !10, line: 105, baseType: !149, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !326, file: !10, line: 105, baseType: !149, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !326, file: !10, line: 106, baseType: !177, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !326, file: !10, line: 107, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!365 = !{!366}
!366 = !DISubrange(count: 5)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !179, file: !180, line: 113, baseType: !368, size: 320, offset: 3648)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 320, elements: !365)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!193, !177, !273}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !179, file: !180, line: 114, baseType: !373, size: 320, offset: 3968)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 320, elements: !365)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !179, file: !180, line: 115, baseType: !149, size: 32, offset: 4288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !179, file: !180, line: 120, baseType: !362, size: 64, offset: 4352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !179, file: !180, line: 121, baseType: !149, size: 32, offset: 4416)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !196, line: 331, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !196, line: 331, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !196, line: 338, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !196, line: 338, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !128)
!384 = !{i32 7, !"Dwarf Version", i32 4}
!385 = !{i32 2, !"Debug Info Version", i32 3}
!386 = !{i32 1, !"wchar_size", i32 4}
!387 = !{i32 7, !"PIC Level", i32 2}
!388 = !{i32 7, !"uwtable", i32 1}
!389 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!390 = distinct !DISubprogram(name: "KSPBCGSLSetXRes", scope: !391, file: !391, line: 331, type: !392, scopeLine: 332, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !634)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgsl/bcgsl.c", directory: "/home/users/ndemeye/xSDK")
!392 = !DISubroutineType(types: !393)
!393 = !{!193, !394, !146}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !397)
!397 = !{!398, !400, !449, !454, !455, !456, !457, !487, !488, !489, !490, !491, !493, !498, !499, !500, !501, !502, !503, !504, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !527, !533, !534, !535, !536, !541, !542, !543, !544, !549, !550, !551, !552, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !604, !605, !606, !607, !608, !615, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !631, !632, !633}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !396, file: !102, line: 76, baseType: !399, size: 4480)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !180, line: 122, baseType: !179)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !396, file: !102, line: 76, baseType: !401, size: 896, offset: 4480)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 896, elements: !235)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !403)
!403 = !{!404, !408, !412, !416, !424, !425, !429, !430, !434, !438, !442, !443, !447, !448}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !402, file: !102, line: 19, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!193, !394, !152, !159}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !402, file: !102, line: 22, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!193, !394, !152, !152, !159}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !402, file: !102, line: 25, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!193, !394}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !402, file: !102, line: 26, baseType: !417, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!193, !394, !420, !420}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !421, line: 16, baseType: !422)
!421 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !421, line: 16, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !402, file: !102, line: 27, baseType: !413, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !402, file: !102, line: 28, baseType: !426, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!193, !324, !394}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !402, file: !102, line: 29, baseType: !413, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !402, file: !102, line: 30, baseType: !431, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!193, !394, !172, !172}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !402, file: !102, line: 31, baseType: !435, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!193, !394, !144, !172, !172, !282}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !402, file: !102, line: 32, baseType: !439, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!193, !394, !149, !149, !282, !159, !172, !172}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !402, file: !102, line: 33, baseType: !413, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !402, file: !102, line: 34, baseType: !444, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!193, !394, !203}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !402, file: !102, line: 35, baseType: !413, size: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !402, file: !102, line: 36, baseType: !444, size: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !396, file: !102, line: 77, baseType: !450, size: 64, offset: 5376)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !451, line: 14, baseType: !452)
!451 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !451, line: 14, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !396, file: !102, line: 78, baseType: !149, size: 32, offset: 5440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !396, file: !102, line: 79, baseType: !149, size: 32, offset: 5472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !396, file: !102, line: 81, baseType: !144, size: 32, offset: 5504)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !396, file: !102, line: 82, baseType: !458, size: 64, offset: 5568)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !461)
!461 = !{!462, !463, !483, !484, !485, !486}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !460, file: !102, line: 55, baseType: !399, size: 4480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !460, file: !102, line: 55, baseType: !464, size: 448, offset: 4480)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 448, elements: !235)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !466)
!466 = !{!467, !471, !472, !476, !477, !478, !482}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !465, file: !102, line: 42, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!193, !458, !152, !152}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !465, file: !102, line: 43, baseType: !468, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !465, file: !102, line: 44, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!193, !458}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !465, file: !102, line: 45, baseType: !473, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !465, file: !102, line: 46, baseType: !473, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !465, file: !102, line: 47, baseType: !479, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!193, !458, !203}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !465, file: !102, line: 48, baseType: !473, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !460, file: !102, line: 56, baseType: !394, size: 64, offset: 4928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !460, file: !102, line: 57, baseType: !420, size: 64, offset: 4992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !460, file: !102, line: 58, baseType: !275, size: 64, offset: 5056)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !102, line: 59, baseType: !273, size: 64, offset: 5120)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !396, file: !102, line: 83, baseType: !149, size: 32, offset: 5632)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !396, file: !102, line: 84, baseType: !149, size: 32, offset: 5664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !396, file: !102, line: 85, baseType: !149, size: 32, offset: 5696)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !396, file: !102, line: 86, baseType: !149, size: 32, offset: 5728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !396, file: !102, line: 87, baseType: !492, size: 32, offset: 5760)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !396, file: !102, line: 88, baseType: !494, size: 384, offset: 5792)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 384, elements: !495)
!495 = !{!496, !497}
!496 = !DISubrange(count: 4)
!497 = !DISubrange(count: 3)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !396, file: !102, line: 89, baseType: !146, size: 64, offset: 6208)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !396, file: !102, line: 90, baseType: !146, size: 64, offset: 6272)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !396, file: !102, line: 91, baseType: !146, size: 64, offset: 6336)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !396, file: !102, line: 92, baseType: !146, size: 64, offset: 6400)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !396, file: !102, line: 93, baseType: !146, size: 64, offset: 6464)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !396, file: !102, line: 94, baseType: !146, size: 64, offset: 6528)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !396, file: !102, line: 95, baseType: !505, size: 32, offset: 6592)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !396, file: !102, line: 96, baseType: !149, size: 32, offset: 6624)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !396, file: !102, line: 98, baseType: !152, size: 64, offset: 6656)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !396, file: !102, line: 98, baseType: !152, size: 64, offset: 6720)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !396, file: !102, line: 102, baseType: !172, size: 64, offset: 6784)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !396, file: !102, line: 103, baseType: !172, size: 64, offset: 6848)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !396, file: !102, line: 104, baseType: !144, size: 32, offset: 6912)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !396, file: !102, line: 105, baseType: !144, size: 32, offset: 6944)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !396, file: !102, line: 106, baseType: !149, size: 32, offset: 6976)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !396, file: !102, line: 107, baseType: !172, size: 64, offset: 7040)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !396, file: !102, line: 108, baseType: !172, size: 64, offset: 7104)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !396, file: !102, line: 109, baseType: !144, size: 32, offset: 7168)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !396, file: !102, line: 110, baseType: !144, size: 32, offset: 7200)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !396, file: !102, line: 111, baseType: !149, size: 32, offset: 7232)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !396, file: !102, line: 113, baseType: !144, size: 32, offset: 7264)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !396, file: !102, line: 114, baseType: !149, size: 32, offset: 7296)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !396, file: !102, line: 117, baseType: !144, size: 32, offset: 7328)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !396, file: !102, line: 120, baseType: !523, size: 320, offset: 7360)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !365)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!193, !394, !144, !146, !273}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !396, file: !102, line: 121, baseType: !528, size: 320, offset: 7680)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !365)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!193, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !396, file: !102, line: 122, baseType: !373, size: 320, offset: 8000)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !396, file: !102, line: 123, baseType: !144, size: 32, offset: 8320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !396, file: !102, line: 124, baseType: !149, size: 32, offset: 8352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !396, file: !102, line: 126, baseType: !537, size: 320, offset: 8384)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !365)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!193, !394, !273}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !396, file: !102, line: 127, baseType: !528, size: 320, offset: 8704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !396, file: !102, line: 128, baseType: !373, size: 320, offset: 9024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !396, file: !102, line: 129, baseType: !144, size: 32, offset: 9344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !396, file: !102, line: 131, baseType: !545, size: 64, offset: 9408)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!193, !394, !144, !146, !548, !273}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !396, file: !102, line: 132, baseType: !315, size: 64, offset: 9472)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !396, file: !102, line: 133, baseType: !273, size: 64, offset: 9536)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !396, file: !102, line: 135, baseType: !273, size: 64, offset: 9600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !396, file: !102, line: 137, baseType: !553, size: 64, offset: 9664)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !102, line: 139, baseType: !273, size: 64, offset: 9728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9792)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9824)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9856)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9888)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9920)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9952)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 9984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10016)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10048)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10080)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10112)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !396, file: !102, line: 142, baseType: !149, size: 32, offset: 10208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10304)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10368)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10432)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10560)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10624)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10688)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10752)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10816)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10880)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 10944)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 11008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !396, file: !102, line: 143, baseType: !203, size: 64, offset: 11072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11136)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11168)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11200)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11232)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11264)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11296)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11328)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11360)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11392)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11424)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11488)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11520)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !396, file: !102, line: 144, baseType: !586, size: 32, offset: 11552)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !396, file: !102, line: 147, baseType: !144, size: 32, offset: 11584)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !396, file: !102, line: 148, baseType: !159, size: 64, offset: 11648)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !396, file: !102, line: 150, baseType: !603, size: 32, offset: 11712)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !396, file: !102, line: 151, baseType: !149, size: 32, offset: 11744)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !396, file: !102, line: 153, baseType: !144, size: 32, offset: 11776)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !396, file: !102, line: 154, baseType: !144, size: 32, offset: 11808)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !396, file: !102, line: 156, baseType: !149, size: 32, offset: 11840)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !396, file: !102, line: 161, baseType: !609, size: 192, offset: 11904)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !396, file: !102, line: 157, size: 192, elements: !610)
!610 = !{!611, !612, !613, !614}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !609, file: !102, line: 158, baseType: !420, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !609, file: !102, line: 158, baseType: !420, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !609, file: !102, line: 159, baseType: !149, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !609, file: !102, line: 160, baseType: !149, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !396, file: !102, line: 163, baseType: !616, size: 32, offset: 12096)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !396, file: !102, line: 165, baseType: !492, size: 32, offset: 12128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !396, file: !102, line: 166, baseType: !616, size: 32, offset: 12160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !396, file: !102, line: 171, baseType: !149, size: 32, offset: 12192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !396, file: !102, line: 172, baseType: !149, size: 32, offset: 12224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !396, file: !102, line: 173, baseType: !149, size: 32, offset: 12256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !396, file: !102, line: 174, baseType: !152, size: 64, offset: 12288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !396, file: !102, line: 175, baseType: !152, size: 64, offset: 12352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !396, file: !102, line: 177, baseType: !144, size: 32, offset: 12416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !396, file: !102, line: 178, baseType: !149, size: 32, offset: 12448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !396, file: !102, line: 180, baseType: !203, size: 64, offset: 12480)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !396, file: !102, line: 182, baseType: !628, size: 64, offset: 12544)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!193, !394, !152, !152, !273}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !396, file: !102, line: 183, baseType: !628, size: 64, offset: 12608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !396, file: !102, line: 184, baseType: !273, size: 64, offset: 12672)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !396, file: !102, line: 184, baseType: !273, size: 64, offset: 12736)
!634 = !{!635, !636, !637, !638, !639, !641, !642, !645, !646, !648, !652, !653, !655, !661, !662, !664, !667, !668, !670, !673, !674, !680, !682}
!635 = !DILocalVariable(name: "ksp", arg: 1, scope: !390, file: !391, line: 331, type: !394)
!636 = !DILocalVariable(name: "delta", arg: 2, scope: !390, file: !391, line: 331, type: !146)
!637 = !DILocalVariable(name: "bcgsl", scope: !390, file: !391, line: 333, type: !138)
!638 = !DILocalVariable(name: "ierr", scope: !390, file: !391, line: 334, type: !193)
!639 = !DILocalVariable(name: "_7_ierr", scope: !640, file: !391, line: 337, type: !193)
!640 = distinct !DILexicalBlock(scope: !390, file: !391, line: 337, column: 3)
!641 = !DILocalVariable(name: "b0", scope: !640, file: !391, line: 337, type: !146)
!642 = !DILocalVariable(name: "b1", scope: !640, file: !391, line: 337, type: !643)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 192, elements: !644)
!644 = !{!497}
!645 = !DILocalVariable(name: "b2", scope: !640, file: !391, line: 337, type: !643)
!646 = !DILocalVariable(name: "_4_ierr", scope: !647, file: !391, line: 337, type: !193)
!647 = distinct !DILexicalBlock(scope: !640, file: !391, line: 337, column: 3)
!648 = !DILocalVariable(name: "a_b1", scope: !647, file: !391, line: 337, type: !649)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 6)
!652 = !DILocalVariable(name: "a_b2", scope: !647, file: !391, line: 337, type: !649)
!653 = !DILocalVariable(name: "_7_errorcode", scope: !654, file: !391, line: 337, type: !193)
!654 = distinct !DILexicalBlock(scope: !647, file: !391, line: 337, column: 3)
!655 = !DILocalVariable(name: "_7_errorstring", scope: !656, file: !391, line: 337, type: !658)
!656 = distinct !DILexicalBlock(scope: !657, file: !391, line: 337, column: 3)
!657 = distinct !DILexicalBlock(scope: !654, file: !391, line: 337, column: 3)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 256)
!661 = !DILocalVariable(name: "_7_resultlen", scope: !656, file: !391, line: 337, type: !176)
!662 = !DILocalVariable(name: "_7_errorcode", scope: !663, file: !391, line: 337, type: !193)
!663 = distinct !DILexicalBlock(scope: !647, file: !391, line: 337, column: 3)
!664 = !DILocalVariable(name: "_7_errorstring", scope: !665, file: !391, line: 337, type: !658)
!665 = distinct !DILexicalBlock(scope: !666, file: !391, line: 337, column: 3)
!666 = distinct !DILexicalBlock(scope: !663, file: !391, line: 337, column: 3)
!667 = !DILocalVariable(name: "_7_resultlen", scope: !665, file: !391, line: 337, type: !176)
!668 = !DILocalVariable(name: "_7_errorcode", scope: !669, file: !391, line: 337, type: !193)
!669 = distinct !DILexicalBlock(scope: !640, file: !391, line: 337, column: 3)
!670 = !DILocalVariable(name: "_7_errorstring", scope: !671, file: !391, line: 337, type: !658)
!671 = distinct !DILexicalBlock(scope: !672, file: !391, line: 337, column: 3)
!672 = distinct !DILexicalBlock(scope: !669, file: !391, line: 337, column: 3)
!673 = !DILocalVariable(name: "_7_resultlen", scope: !671, file: !391, line: 337, type: !176)
!674 = !DILocalVariable(name: "ierr__", scope: !675, file: !391, line: 340, type: !193)
!675 = distinct !DILexicalBlock(scope: !676, file: !391, line: 340, column: 63)
!676 = distinct !DILexicalBlock(scope: !677, file: !391, line: 339, column: 71)
!677 = distinct !DILexicalBlock(scope: !678, file: !391, line: 339, column: 9)
!678 = distinct !DILexicalBlock(scope: !679, file: !391, line: 338, column: 24)
!679 = distinct !DILexicalBlock(scope: !390, file: !391, line: 338, column: 7)
!680 = !DILocalVariable(name: "ierr__", scope: !681, file: !391, line: 341, type: !193)
!681 = distinct !DILexicalBlock(scope: !676, file: !391, line: 341, column: 60)
