; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/ftn-custom/zdrawregf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/ftn-custom/zdrawregf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscDraw = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!156 = !DILocation(line: 32, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !153, file: !54, line: 32, column: 3)
!158 = !DILocation(line: 32, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !153, file: !54, line: 32, column: 3)
!160 = distinct !{!160, !158, !158, !88}
!161 = !DILocation(line: 32, column: 3, scope: !162)
!162 = distinct !DILexicalBlock(scope: !159, file: !54, line: 32, column: 3)
!163 = !DILocation(line: 32, column: 3, scope: !164)
!164 = distinct !DILexicalBlock(scope: !159, file: !54, line: 32, column: 3)
!165 = !DILocation(line: 33, column: 40, scope: !119)
!166 = !DILocation(line: 33, column: 27, scope: !119)
!167 = !DILocation(line: 33, column: 60, scope: !119)
!168 = !DILocation(line: 33, column: 63, scope: !119)
!169 = !DILocation(line: 33, column: 66, scope: !119)
!170 = !DILocation(line: 33, column: 69, scope: !119)
!171 = !DILocation(line: 33, column: 72, scope: !119)
!172 = !DILocation(line: 33, column: 75, scope: !119)
!173 = !DILocation(line: 33, column: 11, scope: !119)
!174 = !DILocation(line: 33, column: 9, scope: !119)
!175 = !DILocation(line: 33, column: 89, scope: !176)
!176 = distinct !DILexicalBlock(scope: !119, file: !54, line: 33, column: 89)
!177 = !DILocation(line: 33, column: 89, scope: !119)
!178 = !DILocation(line: 34, column: 3, scope: !179)
!179 = distinct !DILexicalBlock(scope: !119, file: !54, line: 34, column: 3)
!180 = !DILocation(line: 34, column: 3, scope: !119)
!181 = !DILocation(line: 35, column: 3, scope: !182)
!182 = distinct !DILexicalBlock(scope: !119, file: !54, line: 35, column: 3)
!183 = !DILocation(line: 35, column: 3, scope: !119)
!184 = !DILocation(line: 36, column: 1, scope: !119)
!185 = !DISubprogram(name: "PetscDrawCreate", scope: !116, file: !116, line: 18, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !111)
!186 = !DISubroutineType(types: !187)
!187 = !{!36, !45, !109, !109, !36, !36, !36, !36, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!189 = !DISubprogram(name: "MPI_Comm_f2c", scope: !44, file: !44, line: 1292, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !111)
!190 = !DISubroutineType(types: !191)
!191 = !{!45, !36}
!192 = distinct !DISubprogram(name: "petscdrawsetoptionsprefix_", scope: !54, file: !54, line: 38, type: !55, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DILocalVariable(name: "ctx", arg: 1, scope: !192, file: !54, line: 38, type: !57)
!195 = !DILocalVariable(name: "text", arg: 2, scope: !192, file: !54, line: 38, type: !62)
!196 = !DILocalVariable(name: "ierr", arg: 3, scope: !192, file: !54, line: 39, type: !64)
!197 = !DILocalVariable(name: "len", arg: 4, scope: !192, file: !54, line: 39, type: !31)
!198 = !DILocalVariable(name: "t", scope: !192, file: !54, line: 41, type: !62)
!199 = !DILocation(line: 0, scope: !192)
!200 = !DILocation(line: 41, column: 3, scope: !192)
!201 = !DILocation(line: 42, column: 3, scope: !202)
!202 = distinct !DILexicalBlock(scope: !203, file: !54, line: 42, column: 3)
!203 = distinct !DILexicalBlock(scope: !192, file: !54, line: 42, column: 3)
!204 = !DILocation(line: 42, column: 3, scope: !203)
!205 = !DILocation(line: 42, column: 3, scope: !206)
!206 = distinct !DILexicalBlock(scope: !202, file: !54, line: 42, column: 3)
!207 = !DILocation(line: 42, column: 3, scope: !208)
!208 = distinct !DILexicalBlock(scope: !202, file: !54, line: 42, column: 3)
!209 = distinct !{!209, !207, !207, !88}
!210 = !DILocation(line: 42, column: 3, scope: !211)
!211 = distinct !DILexicalBlock(scope: !208, file: !54, line: 42, column: 3)
!212 = !DILocation(line: 42, column: 3, scope: !213)
!213 = distinct !DILexicalBlock(scope: !208, file: !54, line: 42, column: 3)
!214 = !DILocation(line: 43, column: 42, scope: !192)
!215 = !DILocation(line: 43, column: 37, scope: !192)
!216 = !DILocation(line: 43, column: 11, scope: !192)
!217 = !DILocation(line: 43, column: 9, scope: !192)
!218 = !DILocation(line: 43, column: 49, scope: !219)
!219 = distinct !DILexicalBlock(scope: !192, file: !54, line: 43, column: 49)
!220 = !DILocation(line: 43, column: 49, scope: !192)
!221 = !DILocation(line: 44, column: 3, scope: !222)
!222 = distinct !DILexicalBlock(scope: !192, file: !54, line: 44, column: 3)
!223 = !DILocation(line: 45, column: 1, scope: !192)
!224 = !DISubprogram(name: "PetscDrawSetOptionsPrefix", scope: !116, file: !116, line: 19, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !111)
!225 = distinct !DISubprogram(name: "petscdrawviewfromoptions_", scope: !54, file: !54, line: 47, type: !226, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !419)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !57, !228, !62, !64, !31}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !231, line: 73, size: 4480, elements: !232)
!231 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!232 = !{!233, !235, !276, !277, !279, !282, !283, !284, !285, !293, !294, !296, !300, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !316, !317, !318, !320, !321, !323, !325, !326, !327, !328, !329, !332, !334, !335, !336, !337, !338, !341, !343, !344, !345, !355, !357, !358, !362, !363, !409, !414, !416, !417, !418}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !230, file: !231, line: 74, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !36)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !230, file: !231, line: 75, baseType: !236, size: 448, offset: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 448, elements: !274)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !231, line: 53, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 45, size: 448, elements: !239)
!239 = !{!240, !244, !252, !257, !261, !265, !269}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !238, file: !231, line: 46, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!65, !228, !122}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !238, file: !231, line: 47, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!65, !228, !248}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !249, line: 16, baseType: !250)
!249 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !249, line: 16, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !238, file: !231, line: 48, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!65, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !238, file: !231, line: 49, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!65, !228, !109, !228}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !238, file: !231, line: 50, baseType: !262, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!65, !228, !109, !256}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !238, file: !231, line: 51, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!65, !228, !109, !40}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !238, file: !231, line: 52, baseType: !270, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!65, !228, !109, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!274 = !{!275}
!275 = !DISubrange(count: 1)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !230, file: !231, line: 76, baseType: !43, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !231, line: 77, baseType: !278, size: 32, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !36)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !230, file: !231, line: 78, baseType: !280, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !281)
!281 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !230, file: !231, line: 78, baseType: !280, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !230, file: !231, line: 78, baseType: !280, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !230, file: !231, line: 78, baseType: !280, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !231, line: 79, baseType: !286, size: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !289, line: 27, baseType: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !291, line: 43, baseType: !292)
!291 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!292 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !230, file: !231, line: 80, baseType: !278, size: 32, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !230, file: !231, line: 81, baseType: !295, size: 32, offset: 992)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !36)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !230, file: !231, line: 82, baseType: !297, size: 64, offset: 1024)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !230, file: !231, line: 83, baseType: !301, size: 64, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !230, file: !231, line: 84, baseType: !62, size: 64, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !230, file: !231, line: 85, baseType: !62, size: 64, offset: 1216)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !230, file: !231, line: 86, baseType: !62, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !230, file: !231, line: 87, baseType: !62, size: 64, offset: 1344)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !230, file: !231, line: 88, baseType: !228, size: 64, offset: 1408)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !230, file: !231, line: 89, baseType: !286, size: 64, offset: 1472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !231, line: 90, baseType: !62, size: 64, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !230, file: !231, line: 91, baseType: !62, size: 64, offset: 1600)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !230, file: !231, line: 92, baseType: !278, size: 32, offset: 1664)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !230, file: !231, line: 93, baseType: !34, size: 64, offset: 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !231, line: 94, baseType: !315, size: 64, offset: 1792)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !287)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !230, file: !231, line: 95, baseType: !278, size: 32, offset: 1856)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !230, file: !231, line: 95, baseType: !278, size: 32, offset: 1888)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !230, file: !231, line: 96, baseType: !319, size: 64, offset: 1920)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !230, file: !231, line: 96, baseType: !319, size: 64, offset: 1984)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !230, file: !231, line: 97, baseType: !322, size: 64, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !230, file: !231, line: 97, baseType: !324, size: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !230, file: !231, line: 98, baseType: !278, size: 32, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !230, file: !231, line: 98, baseType: !278, size: 32, offset: 2208)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !230, file: !231, line: 99, baseType: !319, size: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !230, file: !231, line: 99, baseType: !319, size: 64, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !230, file: !231, line: 100, baseType: !330, size: 64, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !281)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !230, file: !231, line: 100, baseType: !333, size: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !230, file: !231, line: 101, baseType: !278, size: 32, offset: 2496)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !230, file: !231, line: 101, baseType: !278, size: 32, offset: 2528)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !230, file: !231, line: 102, baseType: !319, size: 64, offset: 2560)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !230, file: !231, line: 102, baseType: !319, size: 64, offset: 2624)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !230, file: !231, line: 103, baseType: !339, size: 64, offset: 2688)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !331)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !230, file: !231, line: 103, baseType: !342, size: 64, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !230, file: !231, line: 104, baseType: !273, size: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !230, file: !231, line: 105, baseType: !278, size: 32, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !230, file: !231, line: 106, baseType: !346, size: 128, offset: 2944)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 128, elements: !353)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !231, line: 64, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 61, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !349, file: !231, line: 62, baseType: !40, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !349, file: !231, line: 63, baseType: !34, size: 64, offset: 64)
!353 = !{!354}
!354 = !DISubrange(count: 2)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !230, file: !231, line: 107, baseType: !356, size: 64, offset: 3072)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 64, elements: !353)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !230, file: !231, line: 108, baseType: !34, size: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !230, file: !231, line: 109, baseType: !359, size: 64, offset: 3200)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!65, !34}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !230, file: !231, line: 111, baseType: !278, size: 32, offset: 3264)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !230, file: !231, line: 112, baseType: !364, size: 320, offset: 3328)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 320, elements: !407)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!65, !368, !228, !34}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !371)
!371 = !{!372, !373, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !370, file: !10, line: 100, baseType: !278, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !10, line: 101, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !385, !386, !387, !388, !390, !392, !393, !394}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !376, file: !10, line: 84, baseType: !62, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !376, file: !10, line: 85, baseType: !62, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !10, line: 86, baseType: !34, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !376, file: !10, line: 87, baseType: !297, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !376, file: !10, line: 88, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !376, file: !10, line: 89, baseType: !63, size: 8, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !376, file: !10, line: 90, baseType: !62, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !376, file: !10, line: 91, baseType: !31, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !376, file: !10, line: 92, baseType: !389, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !10, line: 93, baseType: !391, size: 32, offset: 544)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !10, line: 94, baseType: !374, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !376, file: !10, line: 95, baseType: !62, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !376, file: !10, line: 96, baseType: !34, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !370, file: !10, line: 102, baseType: !62, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !370, file: !10, line: 102, baseType: !62, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !370, file: !10, line: 103, baseType: !62, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !370, file: !10, line: 104, baseType: !43, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !370, file: !10, line: 105, baseType: !389, size: 32, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !370, file: !10, line: 105, baseType: !389, size: 32, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !370, file: !10, line: 105, baseType: !389, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !370, file: !10, line: 106, baseType: !228, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !370, file: !10, line: 107, baseType: !404, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!407 = !{!408}
!408 = !DISubrange(count: 5)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !230, file: !231, line: 113, baseType: !410, size: 320, offset: 3648)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 320, elements: !407)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!65, !228, !34}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !230, file: !231, line: 114, baseType: !415, size: 320, offset: 3968)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !407)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !230, file: !231, line: 115, baseType: !389, size: 32, offset: 4288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !230, file: !231, line: 120, baseType: !404, size: 64, offset: 4352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !230, file: !231, line: 121, baseType: !389, size: 32, offset: 4416)
!419 = !{!420, !421, !422, !423, !424, !425}
!420 = !DILocalVariable(name: "draw", arg: 1, scope: !225, file: !54, line: 47, type: !57)
!421 = !DILocalVariable(name: "obj", arg: 2, scope: !225, file: !54, line: 47, type: !228)
!422 = !DILocalVariable(name: "type", arg: 3, scope: !225, file: !54, line: 47, type: !62)
!423 = !DILocalVariable(name: "ierr", arg: 4, scope: !225, file: !54, line: 47, type: !64)
!424 = !DILocalVariable(name: "len", arg: 5, scope: !225, file: !54, line: 47, type: !31)
!425 = !DILocalVariable(name: "t", scope: !225, file: !54, line: 49, type: !62)
!426 = !DILocation(line: 0, scope: !225)
!427 = !DILocation(line: 49, column: 3, scope: !225)
!428 = !DILocation(line: 51, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !54, line: 51, column: 3)
!430 = distinct !DILexicalBlock(scope: !225, file: !54, line: 51, column: 3)
!431 = !DILocation(line: 51, column: 3, scope: !430)
!432 = !DILocation(line: 51, column: 3, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !54, line: 51, column: 3)
!434 = !DILocation(line: 51, column: 3, scope: !435)
!435 = distinct !DILexicalBlock(scope: !429, file: !54, line: 51, column: 3)
!436 = distinct !{!436, !434, !434, !88}
!437 = !DILocation(line: 51, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !54, line: 51, column: 3)
!439 = !DILocation(line: 51, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !435, file: !54, line: 51, column: 3)
!441 = !DILocation(line: 52, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !225, file: !54, line: 52, column: 3)
!443 = !DILocation(line: 52, column: 3, scope: !225)
!444 = !DILocation(line: 52, column: 3, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !54, line: 52, column: 3)
!446 = !DILocation(line: 52, column: 3, scope: !447)
!447 = distinct !DILexicalBlock(scope: !445, file: !54, line: 52, column: 3)
!448 = !DILocation(line: 53, column: 36, scope: !225)
!449 = !DILocation(line: 53, column: 46, scope: !225)
!450 = !DILocation(line: 53, column: 11, scope: !225)
!451 = !DILocation(line: 53, column: 9, scope: !225)
!452 = !DILocation(line: 53, column: 53, scope: !453)
!453 = distinct !DILexicalBlock(scope: !225, file: !54, line: 53, column: 53)
!454 = !DILocation(line: 53, column: 53, scope: !225)
!455 = !DILocation(line: 54, column: 3, scope: !456)
!456 = distinct !DILexicalBlock(scope: !225, file: !54, line: 54, column: 3)
!457 = !DILocation(line: 55, column: 1, scope: !225)
!458 = !DISubprogram(name: "PetscError", scope: !25, file: !25, line: 668, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !111)
!459 = !DISubroutineType(types: !460)
!460 = !{!65, !45, !36, !109, !109, !36, !24, !109, null}
!461 = !DISubprogram(name: "PetscDrawViewFromOptions", scope: !116, file: !116, line: 25, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !111)
!462 = !DISubroutineType(types: !463)
!463 = !{!36, !60, !229, !109}
