; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/inode2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/inode2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 119, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!297 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!302 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 663, baseType: !5, size: 32, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !343, !344}
!342 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!345 = !{!346, !423, !426, !505, !447, !1436, !352, !495}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqAIJ", file: !348, line: 125, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 114, size: 2816, elements: !350)
!350 = !{!351, !353, !355, !356, !357, !358, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !378, !379, !380, !381, !382, !383, !384, !391, !393, !398, !399, !400, !401, !1369, !1410, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !349, file: !348, line: 115, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 416)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 480)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !349, file: !348, line: 115, baseType: !370, size: 192, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !371, line: 407, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 402, size: 192, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !372, file: !371, line: 403, baseType: !352, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !372, file: !371, line: 404, baseType: !354, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !372, file: !371, line: 405, baseType: !359, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !372, file: !371, line: 406, baseType: !359, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !349, file: !348, line: 115, baseType: !359, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !349, file: !348, line: 115, baseType: !354, size: 32, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 1120)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !349, file: !348, line: 115, baseType: !385, size: 64, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !387, line: 799, baseType: !388)
!387 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !390)
!390 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !349, file: !348, line: 115, baseType: !392, size: 64, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !349, file: !348, line: 115, baseType: !394, size: 64, offset: 1280)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !395, line: 11, baseType: !396)
!395 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !395, line: 11, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !349, file: !348, line: 115, baseType: !394, size: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !349, file: !348, line: 115, baseType: !394, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !349, file: !348, line: 115, baseType: !352, size: 32, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !349, file: !348, line: 115, baseType: !402, size: 64, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !371, line: 436, size: 23424, elements: !405)
!405 = !{!406, !609, !1112, !1132, !1133, !1134, !1136, !1137, !1138, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1265, !1266, !1282, !1283, !1284, !1285, !1286, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1321, !1341, !1342, !1344, !1345, !1346, !1347, !1348, !1349, !1367, !1368}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !404, file: !371, line: 437, baseType: !407, size: 4480)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !408, line: 122, baseType: !409)
!408 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !408, line: 73, size: 4480, elements: !410)
!410 = !{!411, !413, !468, !469, !470, !472, !473, !474, !475, !483, !484, !486, !490, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !506, !508, !509, !510, !512, !513, !514, !516, !517, !518, !519, !520, !522, !524, !525, !526, !527, !528, !529, !531, !532, !533, !543, !545, !546, !550, !551, !599, !604, !606, !607, !608}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !409, file: !408, line: 74, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !409, file: !408, line: 75, baseType: !414, size: 448, offset: 64)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 448, elements: !466)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !408, line: 53, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 45, size: 448, elements: !417)
!417 = !{!418, !430, !438, !443, !450, !454, !461}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !416, file: !408, line: 46, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !423, !425}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !427, line: 330, baseType: !428)
!427 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !427, line: 330, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !416, file: !408, line: 47, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!422, !423, !434}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !435, line: 16, baseType: !436)
!435 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !435, line: 16, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !416, file: !408, line: 48, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!422, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !416, file: !408, line: 49, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!422, !423, !447, !423}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !416, file: !408, line: 50, baseType: !451, size: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!422, !423, !447, !442}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !416, file: !408, line: 51, baseType: !455, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!422, !423, !447, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !416, file: !408, line: 52, baseType: !462, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!422, !423, !447, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!466 = !{!467}
!467 = !DISubrange(count: 1)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !409, file: !408, line: 76, baseType: !426, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !408, line: 77, baseType: !354, size: 32, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !409, file: !408, line: 78, baseType: !471, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !390)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !409, file: !408, line: 78, baseType: !471, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !409, file: !408, line: 78, baseType: !471, size: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !409, file: !408, line: 78, baseType: !471, size: 64, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !409, file: !408, line: 79, baseType: !476, size: 64, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !479, line: 27, baseType: !480)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !481, line: 43, baseType: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!482 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !409, file: !408, line: 80, baseType: !354, size: 32, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !409, file: !408, line: 81, baseType: !485, size: 32, offset: 992)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !409, file: !408, line: 82, baseType: !487, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !409, file: !408, line: 83, baseType: !491, size: 64, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !409, file: !408, line: 84, baseType: !495, size: 64, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !409, file: !408, line: 85, baseType: !495, size: 64, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !409, file: !408, line: 86, baseType: !495, size: 64, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !409, file: !408, line: 87, baseType: !495, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !409, file: !408, line: 88, baseType: !423, size: 64, offset: 1408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !409, file: !408, line: 89, baseType: !476, size: 64, offset: 1472)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !409, file: !408, line: 90, baseType: !495, size: 64, offset: 1536)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !409, file: !408, line: 91, baseType: !495, size: 64, offset: 1600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !409, file: !408, line: 92, baseType: !354, size: 32, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !409, file: !408, line: 93, baseType: !505, size: 64, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !409, file: !408, line: 94, baseType: !507, size: 64, offset: 1792)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !477)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !409, file: !408, line: 95, baseType: !354, size: 32, offset: 1856)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !409, file: !408, line: 95, baseType: !354, size: 32, offset: 1888)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !409, file: !408, line: 96, baseType: !511, size: 64, offset: 1920)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !409, file: !408, line: 96, baseType: !511, size: 64, offset: 1984)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !409, file: !408, line: 97, baseType: !359, size: 64, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !409, file: !408, line: 97, baseType: !515, size: 64, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !409, file: !408, line: 98, baseType: !354, size: 32, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !409, file: !408, line: 98, baseType: !354, size: 32, offset: 2208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !409, file: !408, line: 99, baseType: !511, size: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !409, file: !408, line: 99, baseType: !511, size: 64, offset: 2304)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !409, file: !408, line: 100, baseType: !521, size: 64, offset: 2368)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !409, file: !408, line: 100, baseType: !523, size: 64, offset: 2432)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !409, file: !408, line: 101, baseType: !354, size: 32, offset: 2496)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !409, file: !408, line: 101, baseType: !354, size: 32, offset: 2528)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !409, file: !408, line: 102, baseType: !511, size: 64, offset: 2560)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !409, file: !408, line: 102, baseType: !511, size: 64, offset: 2624)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !409, file: !408, line: 103, baseType: !392, size: 64, offset: 2688)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !409, file: !408, line: 103, baseType: !530, size: 64, offset: 2752)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !409, file: !408, line: 104, baseType: !465, size: 64, offset: 2816)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !409, file: !408, line: 105, baseType: !354, size: 32, offset: 2880)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !409, file: !408, line: 106, baseType: !534, size: 128, offset: 2944)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 128, elements: !541)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !408, line: 64, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 61, size: 128, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !537, file: !408, line: 62, baseType: !458, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !537, file: !408, line: 63, baseType: !505, size: 64, offset: 64)
!541 = !{!542}
!542 = !DISubrange(count: 2)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !409, file: !408, line: 107, baseType: !544, size: 64, offset: 3072)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !541)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !409, file: !408, line: 108, baseType: !505, size: 64, offset: 3136)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !409, file: !408, line: 109, baseType: !547, size: 64, offset: 3200)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!422, !505}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !409, file: !408, line: 111, baseType: !354, size: 32, offset: 3264)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !409, file: !408, line: 112, baseType: !552, size: 320, offset: 3328)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 320, elements: !597)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!422, !556, !423, !505}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !559)
!559 = !{!560, !561, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !558, file: !10, line: 100, baseType: !354, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !10, line: 101, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !573, !574, !575, !579, !580, !582, !583, !584}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !564, file: !10, line: 84, baseType: !495, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !564, file: !10, line: 85, baseType: !495, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !10, line: 86, baseType: !505, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !564, file: !10, line: 87, baseType: !487, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !564, file: !10, line: 88, baseType: !571, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !564, file: !10, line: 89, baseType: !449, size: 8, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !564, file: !10, line: 90, baseType: !495, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !564, file: !10, line: 91, baseType: !576, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !577, line: 46, baseType: !578)
!577 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!578 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !564, file: !10, line: 92, baseType: !352, size: 32, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !10, line: 93, baseType: !581, size: 32, offset: 544)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !10, line: 94, baseType: !562, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !564, file: !10, line: 95, baseType: !495, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !564, file: !10, line: 96, baseType: !505, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !558, file: !10, line: 102, baseType: !495, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !558, file: !10, line: 102, baseType: !495, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !558, file: !10, line: 103, baseType: !495, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !558, file: !10, line: 104, baseType: !426, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !558, file: !10, line: 105, baseType: !352, size: 32, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !558, file: !10, line: 105, baseType: !352, size: 32, offset: 416)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !558, file: !10, line: 105, baseType: !352, size: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !558, file: !10, line: 106, baseType: !423, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !558, file: !10, line: 107, baseType: !594, size: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!597 = !{!598}
!598 = !DISubrange(count: 5)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !409, file: !408, line: 113, baseType: !600, size: 320, offset: 3648)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 320, elements: !597)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!422, !423, !505}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !409, file: !408, line: 114, baseType: !605, size: 320, offset: 3968)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 320, elements: !597)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !409, file: !408, line: 115, baseType: !352, size: 32, offset: 4288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !409, file: !408, line: 120, baseType: !594, size: 64, offset: 4352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !409, file: !408, line: 121, baseType: !352, size: 32, offset: 4416)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !404, file: !371, line: 437, baseType: !610, size: 9472, offset: 4480)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 9472, elements: !466)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !371, line: 32, size: 9472, elements: !612)
!612 = !{!613, !622, !626, !627, !634, !638, !639, !640, !641, !642, !643, !644, !664, !668, !673, !679, !698, !703, !707, !708, !713, !718, !719, !724, !728, !732, !736, !740, !744, !745, !746, !747, !748, !752, !753, !758, !759, !760, !761, !762, !767, !774, !779, !783, !787, !791, !795, !796, !800, !801, !808, !813, !814, !815, !816, !878, !886, !887, !891, !892, !896, !897, !901, !906, !907, !911, !915, !922, !923, !924, !925, !926, !927, !932, !933, !937, !941, !945, !946, !947, !951, !961, !962, !966, !967, !971, !972, !976, !977, !982, !983, !987, !991, !992, !993, !994, !995, !996, !997, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1021, !1025, !1026, !1027, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1041, !1042, !1043, !1048, !1052, !1053, !1057, !1058, !1059, !1060, !1086, !1090, !1091, !1092, !1093, !1094, !1098, !1099, !1100, !1101, !1102, !1106, !1110, !1111}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !611, file: !371, line: 34, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!422, !402, !354, !617, !354, !617, !619, !621}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !611, file: !371, line: 35, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!422, !402, !354, !359, !515, !530}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !611, file: !371, line: 36, baseType: !623, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !611, file: !371, line: 37, baseType: !628, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!422, !402, !631, !631}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !611, file: !371, line: 38, baseType: !635, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!422, !402, !631, !631, !631}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !611, file: !371, line: 40, baseType: !628, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !611, file: !371, line: 41, baseType: !635, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !611, file: !371, line: 42, baseType: !628, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !611, file: !371, line: 43, baseType: !635, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !611, file: !371, line: 44, baseType: !628, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !611, file: !371, line: 46, baseType: !635, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !611, file: !371, line: 47, baseType: !645, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!422, !402, !394, !394, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !651, file: !36, line: 1227, baseType: !389, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !651, file: !36, line: 1228, baseType: !389, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !651, file: !36, line: 1229, baseType: !389, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !651, file: !36, line: 1230, baseType: !389, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !651, file: !36, line: 1231, baseType: !389, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !651, file: !36, line: 1232, baseType: !389, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !651, file: !36, line: 1233, baseType: !389, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !651, file: !36, line: 1234, baseType: !389, size: 64, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !651, file: !36, line: 1236, baseType: !389, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !651, file: !36, line: 1237, baseType: !389, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !651, file: !36, line: 1238, baseType: !389, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !611, file: !371, line: 48, baseType: !665, size: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!422, !402, !394, !648}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !611, file: !371, line: 49, baseType: !669, size: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!422, !402, !631, !389, !672, !389, !354, !354, !631}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !611, file: !371, line: 50, baseType: !674, size: 64, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!422, !402, !677, !678}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !611, file: !371, line: 52, baseType: !680, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!422, !402, !683, !684}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !686, file: !36, line: 593, baseType: !471, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !686, file: !36, line: 594, baseType: !471, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !686, file: !36, line: 594, baseType: !471, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !686, file: !36, line: 594, baseType: !471, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !686, file: !36, line: 595, baseType: !471, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !686, file: !36, line: 596, baseType: !471, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !686, file: !36, line: 597, baseType: !471, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !686, file: !36, line: 598, baseType: !471, size: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !686, file: !36, line: 598, baseType: !471, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !686, file: !36, line: 599, baseType: !471, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !611, file: !371, line: 53, baseType: !699, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!422, !402, !402, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !611, file: !371, line: 54, baseType: !704, size: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!422, !402, !631}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !611, file: !371, line: 55, baseType: !628, size: 64, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !611, file: !371, line: 56, baseType: !709, size: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!422, !402, !712, !521}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !611, file: !371, line: 58, baseType: !714, size: 64, offset: 1280)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!422, !402, !717}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !611, file: !371, line: 59, baseType: !714, size: 64, offset: 1344)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !611, file: !371, line: 60, baseType: !720, size: 64, offset: 1408)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!422, !402, !723, !352}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !611, file: !371, line: 61, baseType: !725, size: 64, offset: 1472)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!422, !402}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !611, file: !371, line: 63, baseType: !729, size: 64, offset: 1536)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!422, !402, !354, !617, !388, !631, !631}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !611, file: !371, line: 64, baseType: !733, size: 64, offset: 1600)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!422, !402, !402, !394, !394, !648}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !611, file: !371, line: 65, baseType: !737, size: 64, offset: 1664)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!422, !402, !402, !648}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !611, file: !371, line: 66, baseType: !741, size: 64, offset: 1728)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!422, !402, !402, !394, !648}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !611, file: !371, line: 67, baseType: !737, size: 64, offset: 1792)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !611, file: !371, line: 69, baseType: !725, size: 64, offset: 1856)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !611, file: !371, line: 70, baseType: !733, size: 64, offset: 1920)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !611, file: !371, line: 71, baseType: !741, size: 64, offset: 1984)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !611, file: !371, line: 72, baseType: !749, size: 64, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!422, !402, !678}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !611, file: !371, line: 73, baseType: !725, size: 64, offset: 2112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !611, file: !371, line: 75, baseType: !754, size: 64, offset: 2176)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!422, !402, !757, !678}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !611, file: !371, line: 76, baseType: !628, size: 64, offset: 2240)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !611, file: !371, line: 77, baseType: !628, size: 64, offset: 2304)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !611, file: !371, line: 78, baseType: !645, size: 64, offset: 2368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !611, file: !371, line: 79, baseType: !665, size: 64, offset: 2432)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !611, file: !371, line: 81, baseType: !763, size: 64, offset: 2496)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!422, !402, !388, !402, !766}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !611, file: !371, line: 82, baseType: !768, size: 64, offset: 2560)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!422, !402, !354, !771, !771, !677, !773}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !611, file: !371, line: 83, baseType: !775, size: 64, offset: 2624)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!422, !402, !354, !778, !354}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !611, file: !371, line: 84, baseType: !780, size: 64, offset: 2688)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!422, !402, !354, !617, !354, !617, !392}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !611, file: !371, line: 85, baseType: !784, size: 64, offset: 2752)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!422, !402, !402, !766}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !611, file: !371, line: 87, baseType: !788, size: 64, offset: 2816)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!422, !402, !631, !359}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !611, file: !371, line: 88, baseType: !792, size: 64, offset: 2880)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!422, !402, !388}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !611, file: !371, line: 89, baseType: !792, size: 64, offset: 2944)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !611, file: !371, line: 90, baseType: !797, size: 64, offset: 3008)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!422, !402, !631, !621}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !611, file: !371, line: 91, baseType: !729, size: 64, offset: 3072)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !611, file: !371, line: 93, baseType: !802, size: 64, offset: 3136)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!422, !402, !805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !611, file: !371, line: 94, baseType: !809, size: 64, offset: 3200)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!422, !402, !354, !352, !352, !359, !812, !812, !702}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !611, file: !371, line: 95, baseType: !809, size: 64, offset: 3264)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !611, file: !371, line: 96, baseType: !809, size: 64, offset: 3328)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !611, file: !371, line: 97, baseType: !809, size: 64, offset: 3392)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !611, file: !371, line: 99, baseType: !817, size: 64, offset: 3456)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!422, !402, !820, !823}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !395, line: 51, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !395, line: 51, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !371, line: 609, size: 6208, elements: !826)
!826 = !{!827, !828, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !847, !854, !855, !856, !857, !858, !859, !860, !861, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !825, file: !371, line: 610, baseType: !407, size: 4480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !825, file: !371, line: 610, baseType: !829, size: 32, offset: 4480)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !466)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !825, file: !371, line: 611, baseType: !354, size: 32, offset: 4512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !825, file: !371, line: 611, baseType: !354, size: 32, offset: 4544)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !825, file: !371, line: 611, baseType: !354, size: 32, offset: 4576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !825, file: !371, line: 612, baseType: !354, size: 32, offset: 4608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !825, file: !371, line: 613, baseType: !354, size: 32, offset: 4640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !825, file: !371, line: 614, baseType: !359, size: 64, offset: 4672)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !825, file: !371, line: 615, baseType: !515, size: 64, offset: 4736)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !825, file: !371, line: 616, baseType: !778, size: 64, offset: 4800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !825, file: !371, line: 617, baseType: !359, size: 64, offset: 4864)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !825, file: !371, line: 618, baseType: !840, size: 64, offset: 4928)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !371, line: 602, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 598, size: 128, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !842, file: !371, line: 599, baseType: !354, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !842, file: !371, line: 600, baseType: !354, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !842, file: !371, line: 601, baseType: !392, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !825, file: !371, line: 619, baseType: !848, size: 64, offset: 4992)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !371, line: 607, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 604, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !850, file: !371, line: 605, baseType: !354, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !850, file: !371, line: 606, baseType: !392, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !825, file: !371, line: 620, baseType: !392, size: 64, offset: 5056)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !825, file: !371, line: 621, baseType: !389, size: 64, offset: 5120)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !825, file: !371, line: 622, baseType: !389, size: 64, offset: 5184)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !825, file: !371, line: 623, baseType: !631, size: 64, offset: 5248)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !825, file: !371, line: 623, baseType: !631, size: 64, offset: 5312)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !825, file: !371, line: 623, baseType: !631, size: 64, offset: 5376)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !825, file: !371, line: 624, baseType: !352, size: 32, offset: 5440)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !825, file: !371, line: 625, baseType: !862, size: 64, offset: 5504)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!422}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !825, file: !371, line: 626, baseType: !505, size: 64, offset: 5568)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !825, file: !371, line: 627, baseType: !631, size: 64, offset: 5632)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !825, file: !371, line: 628, baseType: !354, size: 32, offset: 5696)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !825, file: !371, line: 629, baseType: !447, size: 64, offset: 5760)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !825, file: !371, line: 630, baseType: !870, size: 32, offset: 5824)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !825, file: !371, line: 631, baseType: !354, size: 32, offset: 5856)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !825, file: !371, line: 631, baseType: !354, size: 32, offset: 5888)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !825, file: !371, line: 632, baseType: !352, size: 32, offset: 5920)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !825, file: !371, line: 633, baseType: !352, size: 32, offset: 5952)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !825, file: !371, line: 634, baseType: !458, size: 64, offset: 6016)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !825, file: !371, line: 634, baseType: !505, size: 64, offset: 6080)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !825, file: !371, line: 635, baseType: !476, size: 64, offset: 6144)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !611, file: !371, line: 100, baseType: !879, size: 64, offset: 3520)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!422, !402, !354, !354, !882, !885}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !884)
!884 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !611, file: !371, line: 101, baseType: !725, size: 64, offset: 3584)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !611, file: !371, line: 102, baseType: !888, size: 64, offset: 3648)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!422, !402, !394, !394, !678}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !611, file: !371, line: 103, baseType: !614, size: 64, offset: 3712)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !611, file: !371, line: 105, baseType: !893, size: 64, offset: 3776)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!422, !402, !394, !394, !677, !678}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !611, file: !371, line: 106, baseType: !725, size: 64, offset: 3840)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !611, file: !371, line: 107, baseType: !898, size: 64, offset: 3904)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!422, !402, !434}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !611, file: !371, line: 108, baseType: !902, size: 64, offset: 3968)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!422, !402, !905, !677, !678}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !447)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !611, file: !371, line: 109, baseType: !862, size: 64, offset: 4032)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !611, file: !371, line: 111, baseType: !908, size: 64, offset: 4096)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!422, !402, !402, !402, !389, !402}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !611, file: !371, line: 112, baseType: !912, size: 64, offset: 4160)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!422, !402, !402, !402, !402}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !611, file: !371, line: 113, baseType: !916, size: 64, offset: 4224)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!422, !402, !919, !919}
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !395, line: 30, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !395, line: 30, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !611, file: !371, line: 114, baseType: !614, size: 64, offset: 4288)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !611, file: !371, line: 115, baseType: !729, size: 64, offset: 4352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !611, file: !371, line: 117, baseType: !788, size: 64, offset: 4416)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !611, file: !371, line: 118, baseType: !788, size: 64, offset: 4480)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !611, file: !371, line: 119, baseType: !902, size: 64, offset: 4544)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !611, file: !371, line: 120, baseType: !928, size: 64, offset: 4608)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!422, !402, !931, !702}
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !611, file: !371, line: 121, baseType: !862, size: 64, offset: 4672)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !611, file: !371, line: 123, baseType: !934, size: 64, offset: 4736)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!422, !402, !354, !505}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !611, file: !371, line: 124, baseType: !938, size: 64, offset: 4800)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!422, !402, !823, !631, !505}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !611, file: !371, line: 125, baseType: !942, size: 64, offset: 4864)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!422, !556, !402}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !611, file: !371, line: 126, baseType: !628, size: 64, offset: 4928)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !611, file: !371, line: 127, baseType: !628, size: 64, offset: 4992)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !611, file: !371, line: 129, baseType: !948, size: 64, offset: 5056)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!422, !402, !778}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !611, file: !371, line: 130, baseType: !952, size: 64, offset: 5120)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!422, !402, !955, !955}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !957, file: !60, line: 653, baseType: !354, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !957, file: !60, line: 653, baseType: !631, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !611, file: !371, line: 131, baseType: !952, size: 64, offset: 5184)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !611, file: !371, line: 132, baseType: !963, size: 64, offset: 5248)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!422, !402, !359, !359, !359}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !611, file: !371, line: 133, baseType: !898, size: 64, offset: 5312)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !611, file: !371, line: 135, baseType: !968, size: 64, offset: 5376)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!422, !402, !389, !702}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !611, file: !371, line: 136, baseType: !968, size: 64, offset: 5440)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !611, file: !371, line: 137, baseType: !973, size: 64, offset: 5504)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!422, !402, !702}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !611, file: !371, line: 138, baseType: !614, size: 64, offset: 5568)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !611, file: !371, line: 139, baseType: !978, size: 64, offset: 5632)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!422, !402, !981, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !611, file: !371, line: 141, baseType: !862, size: 64, offset: 5696)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !611, file: !371, line: 142, baseType: !984, size: 64, offset: 5760)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!422, !402, !402, !389, !402}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !611, file: !371, line: 143, baseType: !988, size: 64, offset: 5824)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!422, !402, !402, !402}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !611, file: !371, line: 144, baseType: !862, size: 64, offset: 5888)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !611, file: !371, line: 145, baseType: !984, size: 64, offset: 5952)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !611, file: !371, line: 147, baseType: !988, size: 64, offset: 6016)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !611, file: !371, line: 148, baseType: !862, size: 64, offset: 6080)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !611, file: !371, line: 149, baseType: !984, size: 64, offset: 6144)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !611, file: !371, line: 150, baseType: !988, size: 64, offset: 6208)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !611, file: !371, line: 151, baseType: !998, size: 64, offset: 6272)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!422, !402, !352}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !611, file: !371, line: 153, baseType: !725, size: 64, offset: 6336)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !611, file: !371, line: 154, baseType: !725, size: 64, offset: 6400)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !611, file: !371, line: 155, baseType: !725, size: 64, offset: 6464)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !611, file: !371, line: 156, baseType: !725, size: 64, offset: 6528)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !611, file: !371, line: 157, baseType: !898, size: 64, offset: 6592)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !611, file: !371, line: 159, baseType: !1007, size: 64, offset: 6656)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!422, !402, !354, !619}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !611, file: !371, line: 160, baseType: !725, size: 64, offset: 6720)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !611, file: !371, line: 161, baseType: !725, size: 64, offset: 6784)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !611, file: !371, line: 162, baseType: !725, size: 64, offset: 6848)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !611, file: !371, line: 163, baseType: !725, size: 64, offset: 6912)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !611, file: !371, line: 165, baseType: !988, size: 64, offset: 6976)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !611, file: !371, line: 166, baseType: !988, size: 64, offset: 7040)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !611, file: !371, line: 167, baseType: !788, size: 64, offset: 7104)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !611, file: !371, line: 168, baseType: !1018, size: 64, offset: 7168)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!422, !402, !631, !354}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !611, file: !371, line: 169, baseType: !1022, size: 64, offset: 7232)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!422, !402, !702, !359}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !611, file: !371, line: 171, baseType: !749, size: 64, offset: 7296)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !611, file: !371, line: 172, baseType: !725, size: 64, offset: 7360)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !611, file: !371, line: 173, baseType: !1028, size: 64, offset: 7424)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!422, !402, !359, !812}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !611, file: !371, line: 174, baseType: !888, size: 64, offset: 7488)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !611, file: !371, line: 175, baseType: !888, size: 64, offset: 7552)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !611, file: !371, line: 177, baseType: !628, size: 64, offset: 7616)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !611, file: !371, line: 178, baseType: !674, size: 64, offset: 7680)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !611, file: !371, line: 179, baseType: !628, size: 64, offset: 7744)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !611, file: !371, line: 180, baseType: !635, size: 64, offset: 7808)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !611, file: !371, line: 181, baseType: !1038, size: 64, offset: 7872)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!422, !402, !426, !677, !678}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !611, file: !371, line: 183, baseType: !948, size: 64, offset: 7936)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !611, file: !371, line: 184, baseType: !709, size: 64, offset: 8000)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !611, file: !371, line: 185, baseType: !1044, size: 64, offset: 8064)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!422, !402, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !611, file: !371, line: 186, baseType: !1049, size: 64, offset: 8128)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!422, !402, !354, !617, !392}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !611, file: !371, line: 187, baseType: !768, size: 64, offset: 8192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !611, file: !371, line: 189, baseType: !1054, size: 64, offset: 8256)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!422, !402, !354, !354, !359, !619}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !611, file: !371, line: 190, baseType: !862, size: 64, offset: 8320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !611, file: !371, line: 191, baseType: !984, size: 64, offset: 8384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !611, file: !371, line: 192, baseType: !988, size: 64, offset: 8448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !611, file: !371, line: 193, baseType: !1061, size: 64, offset: 8512)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!422, !402, !820, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !371, line: 660, size: 5312, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1066, file: !371, line: 661, baseType: !407, size: 4480)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1066, file: !371, line: 661, baseType: !829, size: 32, offset: 4480)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1066, file: !371, line: 662, baseType: !354, size: 32, offset: 4512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1066, file: !371, line: 662, baseType: !354, size: 32, offset: 4544)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1066, file: !371, line: 662, baseType: !354, size: 32, offset: 4576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1066, file: !371, line: 663, baseType: !354, size: 32, offset: 4608)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1066, file: !371, line: 664, baseType: !354, size: 32, offset: 4640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1066, file: !371, line: 665, baseType: !359, size: 64, offset: 4672)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1066, file: !371, line: 666, baseType: !359, size: 64, offset: 4736)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1066, file: !371, line: 667, baseType: !354, size: 32, offset: 4800)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1066, file: !371, line: 668, baseType: !870, size: 32, offset: 4832)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1066, file: !371, line: 670, baseType: !359, size: 64, offset: 4864)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1066, file: !371, line: 670, baseType: !359, size: 64, offset: 4928)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1066, file: !371, line: 671, baseType: !359, size: 64, offset: 4992)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1066, file: !371, line: 672, baseType: !359, size: 64, offset: 5056)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1066, file: !371, line: 673, baseType: !359, size: 64, offset: 5120)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1066, file: !371, line: 674, baseType: !354, size: 32, offset: 5184)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1066, file: !371, line: 675, baseType: !359, size: 64, offset: 5248)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !611, file: !371, line: 195, baseType: !1087, size: 64, offset: 8576)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!422, !1064, !402, !402}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !611, file: !371, line: 196, baseType: !1087, size: 64, offset: 8640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !611, file: !371, line: 197, baseType: !862, size: 64, offset: 8704)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !611, file: !371, line: 198, baseType: !984, size: 64, offset: 8768)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !611, file: !371, line: 199, baseType: !988, size: 64, offset: 8832)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !611, file: !371, line: 201, baseType: !1095, size: 64, offset: 8896)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!422, !402, !354, !354}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !611, file: !371, line: 202, baseType: !763, size: 64, offset: 8960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !611, file: !371, line: 203, baseType: !635, size: 64, offset: 9024)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !611, file: !371, line: 204, baseType: !817, size: 64, offset: 9088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !611, file: !371, line: 205, baseType: !948, size: 64, offset: 9152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !611, file: !371, line: 206, baseType: !1103, size: 64, offset: 9216)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!422, !426, !402, !354, !677, !678}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !611, file: !371, line: 208, baseType: !1107, size: 64, offset: 9280)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!422, !354, !773}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !611, file: !371, line: 209, baseType: !988, size: 64, offset: 9344)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !611, file: !371, line: 210, baseType: !780, size: 64, offset: 9408)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !404, file: !371, line: 438, baseType: !1113, size: 64, offset: 13952)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !395, line: 60, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1115, file: !114, line: 241, baseType: !426, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !114, line: 242, baseType: !485, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1115, file: !114, line: 243, baseType: !354, size: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1115, file: !114, line: 243, baseType: !354, size: 32, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1115, file: !114, line: 244, baseType: !354, size: 32, offset: 160)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1115, file: !114, line: 244, baseType: !354, size: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1115, file: !114, line: 245, baseType: !359, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1115, file: !114, line: 246, baseType: !352, size: 32, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1115, file: !114, line: 247, baseType: !354, size: 32, offset: 352)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1115, file: !114, line: 251, baseType: !354, size: 32, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1115, file: !114, line: 252, baseType: !919, size: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1115, file: !114, line: 253, baseType: !352, size: 32, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1115, file: !114, line: 254, baseType: !354, size: 32, offset: 544)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1115, file: !114, line: 254, baseType: !354, size: 32, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1115, file: !114, line: 255, baseType: !354, size: 32, offset: 608)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !404, file: !371, line: 438, baseType: !1113, size: 64, offset: 14016)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !371, line: 439, baseType: !505, size: 64, offset: 14080)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !404, file: !371, line: 440, baseType: !1135, size: 32, offset: 14144)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !404, file: !371, line: 441, baseType: !352, size: 32, offset: 14176)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !404, file: !371, line: 442, baseType: !352, size: 32, offset: 14208)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !404, file: !371, line: 443, baseType: !1139, size: 448, offset: 14272)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 448, elements: !1141)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !447)
!1141 = !{!1142}
!1142 = !DISubrange(count: 7)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !404, file: !371, line: 444, baseType: !352, size: 32, offset: 14720)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !404, file: !371, line: 445, baseType: !352, size: 32, offset: 14752)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !404, file: !371, line: 446, baseType: !354, size: 32, offset: 14784)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !404, file: !371, line: 447, baseType: !507, size: 64, offset: 14848)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !404, file: !371, line: 448, baseType: !507, size: 64, offset: 14912)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !404, file: !371, line: 449, baseType: !685, size: 640, offset: 14976)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !404, file: !371, line: 450, baseType: !621, size: 32, offset: 15616)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !404, file: !371, line: 451, baseType: !1151, size: 2880, offset: 15680)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !371, line: 318, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !371, line: 319, size: 2880, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160, !1173, !1174, !1179, !1184, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1199, !1200, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1232, !1233, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1258, !1262, !1263}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1152, file: !371, line: 320, baseType: !354, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1152, file: !371, line: 321, baseType: !354, size: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1152, file: !371, line: 322, baseType: !354, size: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1152, file: !371, line: 323, baseType: !354, size: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1152, file: !371, line: 324, baseType: !354, size: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1152, file: !371, line: 325, baseType: !354, size: 32, offset: 160)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1152, file: !371, line: 326, baseType: !1161, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !371, line: 293, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !371, line: 295, size: 448, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1163, file: !371, line: 296, baseType: !1161, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1163, file: !371, line: 297, baseType: !392, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1163, file: !371, line: 297, baseType: !392, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1163, file: !371, line: 298, baseType: !359, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1163, file: !371, line: 298, baseType: !359, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1163, file: !371, line: 299, baseType: !354, size: 32, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1163, file: !371, line: 300, baseType: !354, size: 32, offset: 352)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1163, file: !371, line: 301, baseType: !354, size: 32, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1152, file: !371, line: 326, baseType: !1161, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1152, file: !371, line: 328, baseType: !1175, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!422, !402, !1178, !359}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1152, file: !371, line: 329, baseType: !1180, size: 64, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!422, !1178, !1183, !515, !515, !530, !359}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1152, file: !371, line: 330, baseType: !1185, size: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!422, !1178}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1152, file: !371, line: 331, baseType: !1185, size: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1152, file: !371, line: 334, baseType: !426, size: 64, offset: 576)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !371, line: 335, baseType: !485, size: 32, offset: 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1152, file: !371, line: 335, baseType: !485, size: 32, offset: 672)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1152, file: !371, line: 336, baseType: !485, size: 32, offset: 704)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1152, file: !371, line: 336, baseType: !485, size: 32, offset: 736)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1152, file: !371, line: 337, baseType: !1195, size: 64, offset: 768)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !427, line: 339, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !427, line: 339, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1152, file: !371, line: 338, baseType: !1195, size: 64, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1152, file: !371, line: 339, baseType: !1201, size: 64, offset: 896)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !427, line: 341, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !427, line: 351, size: 192, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1203, file: !427, line: 354, baseType: !72, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1203, file: !427, line: 355, baseType: !72, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1203, file: !427, line: 356, baseType: !72, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1203, file: !427, line: 361, baseType: !72, size: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1203, file: !427, line: 362, baseType: !576, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1152, file: !371, line: 340, baseType: !354, size: 32, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1152, file: !371, line: 340, baseType: !354, size: 32, offset: 992)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1152, file: !371, line: 341, baseType: !392, size: 64, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1152, file: !371, line: 342, baseType: !359, size: 64, offset: 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1152, file: !371, line: 343, baseType: !530, size: 64, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1152, file: !371, line: 344, baseType: !515, size: 64, offset: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1152, file: !371, line: 345, baseType: !354, size: 32, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1152, file: !371, line: 346, baseType: !1183, size: 64, offset: 1344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1152, file: !371, line: 347, baseType: !352, size: 32, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1152, file: !371, line: 348, baseType: !354, size: 32, offset: 1440)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1152, file: !371, line: 351, baseType: !352, size: 32, offset: 1472)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1152, file: !371, line: 352, baseType: !352, size: 32, offset: 1504)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1152, file: !371, line: 353, baseType: !485, size: 32, offset: 1536)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1152, file: !371, line: 354, baseType: !485, size: 32, offset: 1568)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1152, file: !371, line: 355, baseType: !1183, size: 64, offset: 1600)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1152, file: !371, line: 356, baseType: !1183, size: 64, offset: 1664)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1152, file: !371, line: 357, baseType: !1227, size: 64, offset: 1728)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !371, line: 310, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 308, size: 32, elements: !1230)
!1230 = !{!1231}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1229, file: !371, line: 309, baseType: !354, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1152, file: !371, line: 357, baseType: !1227, size: 64, offset: 1792)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1152, file: !371, line: 358, baseType: !1234, size: 64, offset: 1856)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !371, line: 316, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 312, size: 128, elements: !1237)
!1237 = !{!1238, !1239, !1240}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1236, file: !371, line: 313, baseType: !505, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1236, file: !371, line: 314, baseType: !354, size: 32, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1236, file: !371, line: 315, baseType: !449, size: 8, offset: 96)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1152, file: !371, line: 359, baseType: !1234, size: 64, offset: 1920)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1152, file: !371, line: 360, baseType: !1234, size: 64, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1152, file: !371, line: 361, baseType: !354, size: 32, offset: 2048)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1152, file: !371, line: 362, baseType: !485, size: 32, offset: 2080)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1152, file: !371, line: 363, baseType: !354, size: 32, offset: 2112)
