; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiptap.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiptap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!317 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 663, baseType: !5, size: 32, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !343, !344}
!342 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 149, baseType: !5, size: 32, elements: !346)
!346 = !{!347, !348}
!347 = !DIEnumerator(name: "IS_GTOLM_MASK", value: 0, isUnsigned: true)
!348 = !DIEnumerator(name: "IS_GTOLM_DROP", value: 1, isUnsigned: true)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!356 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!374 = !{!375, !379, !380, !417, !437, !1403, !1514, !565, !485, !72, !392, !393, !1253, !461, !1542, !432, !387, !567, !467, !1545, !1551, !1558, !386, !390, !1561, !1563, !439}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !376, line: 330, baseType: !377)
!376 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !376, line: 330, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_APMPI", file: !382, line: 32, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 15, size: 1472, elements: !384)
!384 = !{!385, !388, !389, !394, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1383, !1384, !1385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "startsj_s", scope: !383, file: !382, line: 16, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "startsj_r", scope: !383, file: !382, line: 16, baseType: !386, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bufa", scope: !383, file: !382, line: 17, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "P_loc", scope: !383, file: !382, line: 18, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !398, line: 436, size: 23424, elements: !399)
!398 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!399 = !{!400, !599, !1106, !1126, !1127, !1128, !1130, !1131, !1132, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1259, !1260, !1276, !1277, !1278, !1279, !1280, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1315, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1361, !1362}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !397, file: !398, line: 437, baseType: !401, size: 4480)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !402, line: 122, baseType: !403)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !402, line: 73, size: 4480, elements: !404)
!404 = !{!405, !407, !458, !459, !460, !462, !463, !464, !465, !473, !474, !476, !480, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !497, !498, !499, !501, !502, !503, !505, !506, !507, !508, !509, !511, !513, !514, !515, !516, !517, !518, !520, !521, !522, !532, !534, !535, !539, !540, !589, !594, !596, !597, !598}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !403, file: !402, line: 74, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !403, file: !402, line: 75, baseType: !408, size: 448, offset: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 448, elements: !456)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !402, line: 53, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 45, size: 448, elements: !411)
!411 = !{!412, !420, !428, !433, !440, !444, !451}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !410, file: !402, line: 46, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!416, !417, !419}
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !410, file: !402, line: 47, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!416, !417, !424}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !425, line: 16, baseType: !426)
!425 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !425, line: 16, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !410, file: !402, line: 48, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!416, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !410, file: !402, line: 49, baseType: !434, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!416, !417, !437, !417}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !410, file: !402, line: 50, baseType: !441, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!416, !417, !437, !432}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !410, file: !402, line: 51, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!416, !417, !437, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !410, file: !402, line: 52, baseType: !452, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!416, !417, !437, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!456 = !{!457}
!457 = !DISubrange(count: 1)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !403, file: !402, line: 76, baseType: !375, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !402, line: 77, baseType: !387, size: 32, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !403, file: !402, line: 78, baseType: !461, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !403, file: !402, line: 78, baseType: !461, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !403, file: !402, line: 78, baseType: !461, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !403, file: !402, line: 78, baseType: !461, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !403, file: !402, line: 79, baseType: !466, size: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !469, line: 27, baseType: !470)
!469 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !471, line: 43, baseType: !472)
!471 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!472 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !403, file: !402, line: 80, baseType: !387, size: 32, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !403, file: !402, line: 81, baseType: !475, size: 32, offset: 992)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !403, file: !402, line: 82, baseType: !477, size: 64, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !403, file: !402, line: 83, baseType: !481, size: 64, offset: 1088)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !403, file: !402, line: 84, baseType: !485, size: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !403, file: !402, line: 85, baseType: !485, size: 64, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !403, file: !402, line: 86, baseType: !485, size: 64, offset: 1280)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !403, file: !402, line: 87, baseType: !485, size: 64, offset: 1344)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !403, file: !402, line: 88, baseType: !417, size: 64, offset: 1408)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !403, file: !402, line: 89, baseType: !466, size: 64, offset: 1472)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !402, line: 90, baseType: !485, size: 64, offset: 1536)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !403, file: !402, line: 91, baseType: !485, size: 64, offset: 1600)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !403, file: !402, line: 92, baseType: !387, size: 32, offset: 1664)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !403, file: !402, line: 93, baseType: !379, size: 64, offset: 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !403, file: !402, line: 94, baseType: !496, size: 64, offset: 1792)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !467)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !403, file: !402, line: 95, baseType: !387, size: 32, offset: 1856)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !403, file: !402, line: 95, baseType: !387, size: 32, offset: 1888)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !403, file: !402, line: 96, baseType: !500, size: 64, offset: 1920)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !403, file: !402, line: 96, baseType: !500, size: 64, offset: 1984)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !403, file: !402, line: 97, baseType: !386, size: 64, offset: 2048)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !403, file: !402, line: 97, baseType: !504, size: 64, offset: 2112)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !403, file: !402, line: 98, baseType: !387, size: 32, offset: 2176)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !403, file: !402, line: 98, baseType: !387, size: 32, offset: 2208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !403, file: !402, line: 99, baseType: !500, size: 64, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !403, file: !402, line: 99, baseType: !500, size: 64, offset: 2304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !403, file: !402, line: 100, baseType: !510, size: 64, offset: 2368)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !403, file: !402, line: 100, baseType: !512, size: 64, offset: 2432)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !403, file: !402, line: 101, baseType: !387, size: 32, offset: 2496)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !403, file: !402, line: 101, baseType: !387, size: 32, offset: 2528)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !403, file: !402, line: 102, baseType: !500, size: 64, offset: 2560)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !403, file: !402, line: 102, baseType: !500, size: 64, offset: 2624)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !403, file: !402, line: 103, baseType: !390, size: 64, offset: 2688)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !403, file: !402, line: 103, baseType: !519, size: 64, offset: 2752)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !403, file: !402, line: 104, baseType: !455, size: 64, offset: 2816)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !403, file: !402, line: 105, baseType: !387, size: 32, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !403, file: !402, line: 106, baseType: !523, size: 128, offset: 2944)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 128, elements: !530)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !402, line: 64, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 61, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !526, file: !402, line: 62, baseType: !448, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !526, file: !402, line: 63, baseType: !379, size: 64, offset: 64)
!530 = !{!531}
!531 = !DISubrange(count: 2)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !403, file: !402, line: 107, baseType: !533, size: 64, offset: 3072)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, elements: !530)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !403, file: !402, line: 108, baseType: !379, size: 64, offset: 3136)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !403, file: !402, line: 109, baseType: !536, size: 64, offset: 3200)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!416, !379}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !403, file: !402, line: 111, baseType: !387, size: 32, offset: 3264)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !403, file: !402, line: 112, baseType: !541, size: 320, offset: 3328)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !587)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!416, !545, !417, !379}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !548)
!548 = !{!549, !550, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !547, file: !10, line: 100, baseType: !387, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !10, line: 101, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !562, !563, !564, !568, !570, !572, !573, !574}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !553, file: !10, line: 84, baseType: !485, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !553, file: !10, line: 85, baseType: !485, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !10, line: 86, baseType: !379, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !553, file: !10, line: 87, baseType: !477, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !553, file: !10, line: 88, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !553, file: !10, line: 89, baseType: !439, size: 8, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !553, file: !10, line: 90, baseType: !485, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !553, file: !10, line: 91, baseType: !565, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !566, line: 46, baseType: !567)
!566 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!567 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !553, file: !10, line: 92, baseType: !569, size: 32, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !10, line: 93, baseType: !571, size: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !10, line: 94, baseType: !551, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !553, file: !10, line: 95, baseType: !485, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !553, file: !10, line: 96, baseType: !379, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !547, file: !10, line: 102, baseType: !485, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !547, file: !10, line: 102, baseType: !485, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !547, file: !10, line: 103, baseType: !485, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !547, file: !10, line: 104, baseType: !375, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 416)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !547, file: !10, line: 106, baseType: !417, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !547, file: !10, line: 107, baseType: !584, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!587 = !{!588}
!588 = !DISubrange(count: 5)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !403, file: !402, line: 113, baseType: !590, size: 320, offset: 3648)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 320, elements: !587)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!416, !417, !379}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !403, file: !402, line: 114, baseType: !595, size: 320, offset: 3968)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 320, elements: !587)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !403, file: !402, line: 115, baseType: !569, size: 32, offset: 4288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !403, file: !402, line: 120, baseType: !584, size: 64, offset: 4352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !403, file: !402, line: 121, baseType: !569, size: 32, offset: 4416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !397, file: !398, line: 437, baseType: !600, size: 9472, offset: 4480)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 9472, elements: !456)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !398, line: 32, size: 9472, elements: !602)
!602 = !{!603, !612, !616, !617, !624, !628, !629, !630, !631, !632, !633, !634, !658, !662, !667, !673, !692, !697, !701, !702, !707, !712, !713, !718, !722, !726, !730, !734, !738, !739, !740, !741, !742, !746, !747, !752, !753, !754, !755, !756, !761, !768, !773, !777, !781, !785, !789, !790, !794, !795, !802, !807, !808, !809, !810, !872, !880, !881, !885, !886, !890, !891, !895, !900, !901, !905, !909, !916, !917, !918, !919, !920, !921, !926, !927, !931, !935, !939, !940, !941, !945, !955, !956, !960, !961, !965, !966, !970, !971, !976, !977, !981, !985, !986, !987, !988, !989, !990, !991, !995, !996, !997, !998, !999, !1000, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1015, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1035, !1036, !1037, !1042, !1046, !1047, !1051, !1052, !1053, !1054, !1080, !1084, !1085, !1086, !1087, !1088, !1092, !1093, !1094, !1095, !1096, !1100, !1104, !1105}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !601, file: !398, line: 34, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!416, !395, !387, !607, !387, !607, !609, !611}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !601, file: !398, line: 35, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!416, !395, !387, !386, !504, !519}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !601, file: !398, line: 36, baseType: !613, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !601, file: !398, line: 37, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!416, !395, !621, !621}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !601, file: !398, line: 38, baseType: !625, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!416, !395, !621, !621, !621}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !601, file: !398, line: 40, baseType: !618, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !601, file: !398, line: 41, baseType: !625, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !601, file: !398, line: 42, baseType: !618, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !601, file: !398, line: 43, baseType: !625, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !601, file: !398, line: 44, baseType: !618, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !601, file: !398, line: 46, baseType: !625, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !601, file: !398, line: 47, baseType: !635, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!416, !395, !638, !638, !642}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !639, line: 11, baseType: !640)
!639 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !639, line: 11, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !645, file: !36, line: 1227, baseType: !392, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !645, file: !36, line: 1228, baseType: !392, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !645, file: !36, line: 1229, baseType: !392, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !645, file: !36, line: 1230, baseType: !392, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !645, file: !36, line: 1231, baseType: !392, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !645, file: !36, line: 1232, baseType: !392, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !645, file: !36, line: 1233, baseType: !392, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !645, file: !36, line: 1234, baseType: !392, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !645, file: !36, line: 1236, baseType: !392, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !645, file: !36, line: 1237, baseType: !392, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !645, file: !36, line: 1238, baseType: !392, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !601, file: !398, line: 48, baseType: !659, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!416, !395, !638, !642}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !601, file: !398, line: 49, baseType: !663, size: 64, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!416, !395, !621, !392, !666, !392, !387, !387, !621}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !601, file: !398, line: 50, baseType: !668, size: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!416, !395, !671, !672}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !601, file: !398, line: 52, baseType: !674, size: 64, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!416, !395, !677, !678}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !680, file: !36, line: 593, baseType: !461, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !680, file: !36, line: 594, baseType: !461, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !680, file: !36, line: 594, baseType: !461, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !680, file: !36, line: 594, baseType: !461, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !680, file: !36, line: 595, baseType: !461, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !680, file: !36, line: 596, baseType: !461, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !680, file: !36, line: 597, baseType: !461, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !680, file: !36, line: 598, baseType: !461, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !680, file: !36, line: 598, baseType: !461, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !680, file: !36, line: 599, baseType: !461, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !601, file: !398, line: 53, baseType: !693, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!416, !395, !395, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !601, file: !398, line: 54, baseType: !698, size: 64, offset: 1088)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!416, !395, !621}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !601, file: !398, line: 55, baseType: !618, size: 64, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !601, file: !398, line: 56, baseType: !703, size: 64, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!416, !395, !706, !510}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !601, file: !398, line: 58, baseType: !708, size: 64, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!416, !395, !711}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !601, file: !398, line: 59, baseType: !708, size: 64, offset: 1344)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !601, file: !398, line: 60, baseType: !714, size: 64, offset: 1408)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!416, !395, !717, !569}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !601, file: !398, line: 61, baseType: !719, size: 64, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!416, !395}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !601, file: !398, line: 63, baseType: !723, size: 64, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!416, !395, !387, !607, !391, !621, !621}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !601, file: !398, line: 64, baseType: !727, size: 64, offset: 1600)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!416, !395, !395, !638, !638, !642}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !601, file: !398, line: 65, baseType: !731, size: 64, offset: 1664)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!416, !395, !395, !642}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !601, file: !398, line: 66, baseType: !735, size: 64, offset: 1728)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!416, !395, !395, !638, !642}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !601, file: !398, line: 67, baseType: !731, size: 64, offset: 1792)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !601, file: !398, line: 69, baseType: !719, size: 64, offset: 1856)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !601, file: !398, line: 70, baseType: !727, size: 64, offset: 1920)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !601, file: !398, line: 71, baseType: !735, size: 64, offset: 1984)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !601, file: !398, line: 72, baseType: !743, size: 64, offset: 2048)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!416, !395, !672}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !601, file: !398, line: 73, baseType: !719, size: 64, offset: 2112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !601, file: !398, line: 75, baseType: !748, size: 64, offset: 2176)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!416, !395, !751, !672}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !601, file: !398, line: 76, baseType: !618, size: 64, offset: 2240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !601, file: !398, line: 77, baseType: !618, size: 64, offset: 2304)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !601, file: !398, line: 78, baseType: !635, size: 64, offset: 2368)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !601, file: !398, line: 79, baseType: !659, size: 64, offset: 2432)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !601, file: !398, line: 81, baseType: !757, size: 64, offset: 2496)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!416, !395, !391, !395, !760}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !601, file: !398, line: 82, baseType: !762, size: 64, offset: 2560)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!416, !395, !387, !765, !765, !671, !767}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !601, file: !398, line: 83, baseType: !769, size: 64, offset: 2624)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!416, !395, !387, !772, !387}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !601, file: !398, line: 84, baseType: !774, size: 64, offset: 2688)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!416, !395, !387, !607, !387, !607, !390}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !601, file: !398, line: 85, baseType: !778, size: 64, offset: 2752)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!416, !395, !395, !760}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !601, file: !398, line: 87, baseType: !782, size: 64, offset: 2816)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!416, !395, !621, !386}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !601, file: !398, line: 88, baseType: !786, size: 64, offset: 2880)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!416, !395, !391}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !601, file: !398, line: 89, baseType: !786, size: 64, offset: 2944)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !601, file: !398, line: 90, baseType: !791, size: 64, offset: 3008)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!416, !395, !621, !611}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !601, file: !398, line: 91, baseType: !723, size: 64, offset: 3072)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !601, file: !398, line: 93, baseType: !796, size: 64, offset: 3136)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!416, !395, !799}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !601, file: !398, line: 94, baseType: !803, size: 64, offset: 3200)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!416, !395, !387, !569, !569, !386, !806, !806, !696}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !601, file: !398, line: 95, baseType: !803, size: 64, offset: 3264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !601, file: !398, line: 96, baseType: !803, size: 64, offset: 3328)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !601, file: !398, line: 97, baseType: !803, size: 64, offset: 3392)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !601, file: !398, line: 99, baseType: !811, size: 64, offset: 3456)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!416, !395, !814, !817}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !639, line: 51, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !639, line: 51, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !398, line: 609, size: 6208, elements: !820)
!820 = !{!821, !822, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !841, !848, !849, !850, !851, !852, !853, !854, !855, !859, !860, !861, !862, !863, !865, !866, !867, !868, !869, !870, !871}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !819, file: !398, line: 610, baseType: !401, size: 4480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !819, file: !398, line: 610, baseType: !823, size: 32, offset: 4480)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !456)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !819, file: !398, line: 611, baseType: !387, size: 32, offset: 4512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !819, file: !398, line: 611, baseType: !387, size: 32, offset: 4544)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !819, file: !398, line: 611, baseType: !387, size: 32, offset: 4576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !819, file: !398, line: 612, baseType: !387, size: 32, offset: 4608)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !819, file: !398, line: 613, baseType: !387, size: 32, offset: 4640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !819, file: !398, line: 614, baseType: !386, size: 64, offset: 4672)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !819, file: !398, line: 615, baseType: !504, size: 64, offset: 4736)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !819, file: !398, line: 616, baseType: !772, size: 64, offset: 4800)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !819, file: !398, line: 617, baseType: !386, size: 64, offset: 4864)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !819, file: !398, line: 618, baseType: !834, size: 64, offset: 4928)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !398, line: 602, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 598, size: 128, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !836, file: !398, line: 599, baseType: !387, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !836, file: !398, line: 600, baseType: !387, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !836, file: !398, line: 601, baseType: !390, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !819, file: !398, line: 619, baseType: !842, size: 64, offset: 4992)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !398, line: 607, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 604, size: 128, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !844, file: !398, line: 605, baseType: !387, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !844, file: !398, line: 606, baseType: !390, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !819, file: !398, line: 620, baseType: !390, size: 64, offset: 5056)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !819, file: !398, line: 621, baseType: !392, size: 64, offset: 5120)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !819, file: !398, line: 622, baseType: !392, size: 64, offset: 5184)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !819, file: !398, line: 623, baseType: !621, size: 64, offset: 5248)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !819, file: !398, line: 623, baseType: !621, size: 64, offset: 5312)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !819, file: !398, line: 623, baseType: !621, size: 64, offset: 5376)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !819, file: !398, line: 624, baseType: !569, size: 32, offset: 5440)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !819, file: !398, line: 625, baseType: !856, size: 64, offset: 5504)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!416}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !819, file: !398, line: 626, baseType: !379, size: 64, offset: 5568)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !819, file: !398, line: 627, baseType: !621, size: 64, offset: 5632)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !819, file: !398, line: 628, baseType: !387, size: 32, offset: 5696)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !819, file: !398, line: 629, baseType: !437, size: 64, offset: 5760)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !819, file: !398, line: 630, baseType: !864, size: 32, offset: 5824)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !819, file: !398, line: 631, baseType: !387, size: 32, offset: 5856)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !819, file: !398, line: 631, baseType: !387, size: 32, offset: 5888)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !819, file: !398, line: 632, baseType: !569, size: 32, offset: 5920)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !819, file: !398, line: 633, baseType: !569, size: 32, offset: 5952)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !819, file: !398, line: 634, baseType: !448, size: 64, offset: 6016)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !819, file: !398, line: 634, baseType: !379, size: 64, offset: 6080)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !819, file: !398, line: 635, baseType: !466, size: 64, offset: 6144)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !601, file: !398, line: 100, baseType: !873, size: 64, offset: 3520)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!416, !395, !387, !387, !876, !879}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !878)
!878 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !601, file: !398, line: 101, baseType: !719, size: 64, offset: 3584)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !601, file: !398, line: 102, baseType: !882, size: 64, offset: 3648)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!416, !395, !638, !638, !672}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !601, file: !398, line: 103, baseType: !604, size: 64, offset: 3712)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !601, file: !398, line: 105, baseType: !887, size: 64, offset: 3776)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!416, !395, !638, !638, !671, !672}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !601, file: !398, line: 106, baseType: !719, size: 64, offset: 3840)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !601, file: !398, line: 107, baseType: !892, size: 64, offset: 3904)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!416, !395, !424}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !601, file: !398, line: 108, baseType: !896, size: 64, offset: 3968)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!416, !395, !899, !671, !672}
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !437)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !601, file: !398, line: 109, baseType: !856, size: 64, offset: 4032)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !601, file: !398, line: 111, baseType: !902, size: 64, offset: 4096)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!416, !395, !395, !395, !392, !395}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !601, file: !398, line: 112, baseType: !906, size: 64, offset: 4160)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!416, !395, !395, !395, !395}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !601, file: !398, line: 113, baseType: !910, size: 64, offset: 4224)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!416, !395, !913, !913}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !639, line: 30, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !639, line: 30, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !601, file: !398, line: 114, baseType: !604, size: 64, offset: 4288)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !601, file: !398, line: 115, baseType: !723, size: 64, offset: 4352)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !601, file: !398, line: 117, baseType: !782, size: 64, offset: 4416)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !601, file: !398, line: 118, baseType: !782, size: 64, offset: 4480)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !601, file: !398, line: 119, baseType: !896, size: 64, offset: 4544)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !601, file: !398, line: 120, baseType: !922, size: 64, offset: 4608)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!416, !395, !925, !696}
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !601, file: !398, line: 121, baseType: !856, size: 64, offset: 4672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !601, file: !398, line: 123, baseType: !928, size: 64, offset: 4736)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!416, !395, !387, !379}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !601, file: !398, line: 124, baseType: !932, size: 64, offset: 4800)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!416, !395, !817, !621, !379}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !601, file: !398, line: 125, baseType: !936, size: 64, offset: 4864)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!416, !545, !395}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !601, file: !398, line: 126, baseType: !618, size: 64, offset: 4928)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !601, file: !398, line: 127, baseType: !618, size: 64, offset: 4992)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !601, file: !398, line: 129, baseType: !942, size: 64, offset: 5056)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!416, !395, !772}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !601, file: !398, line: 130, baseType: !946, size: 64, offset: 5120)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!416, !395, !949, !949}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !951, file: !60, line: 653, baseType: !387, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !951, file: !60, line: 653, baseType: !621, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !601, file: !398, line: 131, baseType: !946, size: 64, offset: 5184)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !601, file: !398, line: 132, baseType: !957, size: 64, offset: 5248)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!416, !395, !386, !386, !386}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !601, file: !398, line: 133, baseType: !892, size: 64, offset: 5312)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !601, file: !398, line: 135, baseType: !962, size: 64, offset: 5376)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!416, !395, !392, !696}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !601, file: !398, line: 136, baseType: !962, size: 64, offset: 5440)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !601, file: !398, line: 137, baseType: !967, size: 64, offset: 5504)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!416, !395, !696}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !601, file: !398, line: 138, baseType: !604, size: 64, offset: 5568)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !601, file: !398, line: 139, baseType: !972, size: 64, offset: 5632)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!416, !395, !975, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !601, file: !398, line: 141, baseType: !856, size: 64, offset: 5696)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !601, file: !398, line: 142, baseType: !978, size: 64, offset: 5760)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!416, !395, !395, !392, !395}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !601, file: !398, line: 143, baseType: !982, size: 64, offset: 5824)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!416, !395, !395, !395}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !601, file: !398, line: 144, baseType: !856, size: 64, offset: 5888)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !601, file: !398, line: 145, baseType: !978, size: 64, offset: 5952)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !601, file: !398, line: 147, baseType: !982, size: 64, offset: 6016)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !601, file: !398, line: 148, baseType: !856, size: 64, offset: 6080)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !601, file: !398, line: 149, baseType: !978, size: 64, offset: 6144)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !601, file: !398, line: 150, baseType: !982, size: 64, offset: 6208)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !601, file: !398, line: 151, baseType: !992, size: 64, offset: 6272)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!416, !395, !569}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !601, file: !398, line: 153, baseType: !719, size: 64, offset: 6336)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !601, file: !398, line: 154, baseType: !719, size: 64, offset: 6400)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !601, file: !398, line: 155, baseType: !719, size: 64, offset: 6464)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !601, file: !398, line: 156, baseType: !719, size: 64, offset: 6528)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !601, file: !398, line: 157, baseType: !892, size: 64, offset: 6592)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !601, file: !398, line: 159, baseType: !1001, size: 64, offset: 6656)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!416, !395, !387, !609}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !601, file: !398, line: 160, baseType: !719, size: 64, offset: 6720)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !601, file: !398, line: 161, baseType: !719, size: 64, offset: 6784)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !601, file: !398, line: 162, baseType: !719, size: 64, offset: 6848)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !601, file: !398, line: 163, baseType: !719, size: 64, offset: 6912)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !601, file: !398, line: 165, baseType: !982, size: 64, offset: 6976)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !601, file: !398, line: 166, baseType: !982, size: 64, offset: 7040)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !601, file: !398, line: 167, baseType: !782, size: 64, offset: 7104)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !601, file: !398, line: 168, baseType: !1012, size: 64, offset: 7168)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!416, !395, !621, !387}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !601, file: !398, line: 169, baseType: !1016, size: 64, offset: 7232)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!416, !395, !696, !386}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !601, file: !398, line: 171, baseType: !743, size: 64, offset: 7296)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !601, file: !398, line: 172, baseType: !719, size: 64, offset: 7360)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !601, file: !398, line: 173, baseType: !1022, size: 64, offset: 7424)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!416, !395, !386, !806}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !601, file: !398, line: 174, baseType: !882, size: 64, offset: 7488)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !601, file: !398, line: 175, baseType: !882, size: 64, offset: 7552)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !601, file: !398, line: 177, baseType: !618, size: 64, offset: 7616)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !601, file: !398, line: 178, baseType: !668, size: 64, offset: 7680)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !601, file: !398, line: 179, baseType: !618, size: 64, offset: 7744)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !601, file: !398, line: 180, baseType: !625, size: 64, offset: 7808)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !601, file: !398, line: 181, baseType: !1032, size: 64, offset: 7872)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!416, !395, !375, !671, !672}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !601, file: !398, line: 183, baseType: !942, size: 64, offset: 7936)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !601, file: !398, line: 184, baseType: !703, size: 64, offset: 8000)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !601, file: !398, line: 185, baseType: !1038, size: 64, offset: 8064)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!416, !395, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !601, file: !398, line: 186, baseType: !1043, size: 64, offset: 8128)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!416, !395, !387, !607, !390}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !601, file: !398, line: 187, baseType: !762, size: 64, offset: 8192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !601, file: !398, line: 189, baseType: !1048, size: 64, offset: 8256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!416, !395, !387, !387, !386, !609}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !601, file: !398, line: 190, baseType: !856, size: 64, offset: 8320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !601, file: !398, line: 191, baseType: !978, size: 64, offset: 8384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !601, file: !398, line: 192, baseType: !982, size: 64, offset: 8448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !601, file: !398, line: 193, baseType: !1055, size: 64, offset: 8512)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!416, !395, !814, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !398, line: 660, size: 5312, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1060, file: !398, line: 661, baseType: !401, size: 4480)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1060, file: !398, line: 661, baseType: !823, size: 32, offset: 4480)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1060, file: !398, line: 662, baseType: !387, size: 32, offset: 4512)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1060, file: !398, line: 662, baseType: !387, size: 32, offset: 4544)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1060, file: !398, line: 662, baseType: !387, size: 32, offset: 4576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1060, file: !398, line: 663, baseType: !387, size: 32, offset: 4608)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1060, file: !398, line: 664, baseType: !387, size: 32, offset: 4640)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1060, file: !398, line: 665, baseType: !386, size: 64, offset: 4672)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1060, file: !398, line: 666, baseType: !386, size: 64, offset: 4736)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1060, file: !398, line: 667, baseType: !387, size: 32, offset: 4800)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1060, file: !398, line: 668, baseType: !864, size: 32, offset: 4832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1060, file: !398, line: 670, baseType: !386, size: 64, offset: 4864)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1060, file: !398, line: 670, baseType: !386, size: 64, offset: 4928)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1060, file: !398, line: 671, baseType: !386, size: 64, offset: 4992)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1060, file: !398, line: 672, baseType: !386, size: 64, offset: 5056)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1060, file: !398, line: 673, baseType: !386, size: 64, offset: 5120)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1060, file: !398, line: 674, baseType: !387, size: 32, offset: 5184)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1060, file: !398, line: 675, baseType: !386, size: 64, offset: 5248)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !601, file: !398, line: 195, baseType: !1081, size: 64, offset: 8576)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!416, !1058, !395, !395}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !601, file: !398, line: 196, baseType: !1081, size: 64, offset: 8640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !601, file: !398, line: 197, baseType: !856, size: 64, offset: 8704)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !601, file: !398, line: 198, baseType: !978, size: 64, offset: 8768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !601, file: !398, line: 199, baseType: !982, size: 64, offset: 8832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !601, file: !398, line: 201, baseType: !1089, size: 64, offset: 8896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!416, !395, !387, !387}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !601, file: !398, line: 202, baseType: !757, size: 64, offset: 8960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !601, file: !398, line: 203, baseType: !625, size: 64, offset: 9024)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !601, file: !398, line: 204, baseType: !811, size: 64, offset: 9088)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !601, file: !398, line: 205, baseType: !942, size: 64, offset: 9152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !601, file: !398, line: 206, baseType: !1097, size: 64, offset: 9216)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!416, !375, !395, !387, !671, !672}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !601, file: !398, line: 208, baseType: !1101, size: 64, offset: 9280)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!416, !387, !767}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !601, file: !398, line: 209, baseType: !982, size: 64, offset: 9344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !601, file: !398, line: 210, baseType: !774, size: 64, offset: 9408)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !397, file: !398, line: 438, baseType: !1107, size: 64, offset: 13952)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !639, line: 60, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1109, file: !114, line: 241, baseType: !375, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !114, line: 242, baseType: !475, size: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1109, file: !114, line: 243, baseType: !387, size: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1109, file: !114, line: 243, baseType: !387, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1109, file: !114, line: 244, baseType: !387, size: 32, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1109, file: !114, line: 244, baseType: !387, size: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1109, file: !114, line: 245, baseType: !386, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1109, file: !114, line: 246, baseType: !569, size: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1109, file: !114, line: 247, baseType: !387, size: 32, offset: 352)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1109, file: !114, line: 251, baseType: !387, size: 32, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1109, file: !114, line: 252, baseType: !913, size: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1109, file: !114, line: 253, baseType: !569, size: 32, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1109, file: !114, line: 254, baseType: !387, size: 32, offset: 544)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1109, file: !114, line: 254, baseType: !387, size: 32, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1109, file: !114, line: 255, baseType: !387, size: 32, offset: 608)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !397, file: !398, line: 438, baseType: !1107, size: 64, offset: 14016)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !398, line: 439, baseType: !379, size: 64, offset: 14080)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !397, file: !398, line: 440, baseType: !1129, size: 32, offset: 14144)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !397, file: !398, line: 441, baseType: !569, size: 32, offset: 14176)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !397, file: !398, line: 442, baseType: !569, size: 32, offset: 14208)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !397, file: !398, line: 443, baseType: !1133, size: 448, offset: 14272)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 448, elements: !1135)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !437)
!1135 = !{!1136}
!1136 = !DISubrange(count: 7)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !397, file: !398, line: 444, baseType: !569, size: 32, offset: 14720)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !397, file: !398, line: 445, baseType: !569, size: 32, offset: 14752)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !397, file: !398, line: 446, baseType: !387, size: 32, offset: 14784)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !397, file: !398, line: 447, baseType: !496, size: 64, offset: 14848)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !397, file: !398, line: 448, baseType: !496, size: 64, offset: 14912)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !397, file: !398, line: 449, baseType: !679, size: 640, offset: 14976)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !397, file: !398, line: 450, baseType: !611, size: 32, offset: 15616)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !397, file: !398, line: 451, baseType: !1145, size: 2880, offset: 15680)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !398, line: 318, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !398, line: 319, size: 2880, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1167, !1168, !1173, !1178, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1193, !1194, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1226, !1227, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1256, !1257}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1146, file: !398, line: 320, baseType: !387, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1146, file: !398, line: 321, baseType: !387, size: 32, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1146, file: !398, line: 322, baseType: !387, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1146, file: !398, line: 323, baseType: !387, size: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1146, file: !398, line: 324, baseType: !387, size: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1146, file: !398, line: 325, baseType: !387, size: 32, offset: 160)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1146, file: !398, line: 326, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !398, line: 293, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !398, line: 295, size: 448, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1157, file: !398, line: 296, baseType: !1155, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1157, file: !398, line: 297, baseType: !390, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1157, file: !398, line: 297, baseType: !390, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1157, file: !398, line: 298, baseType: !386, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1157, file: !398, line: 298, baseType: !386, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1157, file: !398, line: 299, baseType: !387, size: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1157, file: !398, line: 300, baseType: !387, size: 32, offset: 352)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1157, file: !398, line: 301, baseType: !387, size: 32, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1146, file: !398, line: 326, baseType: !1155, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1146, file: !398, line: 328, baseType: !1169, size: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!416, !395, !1172, !386}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1146, file: !398, line: 329, baseType: !1174, size: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!416, !1172, !1177, !504, !504, !519, !386}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1146, file: !398, line: 330, baseType: !1179, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!416, !1172}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1146, file: !398, line: 331, baseType: !1179, size: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1146, file: !398, line: 334, baseType: !375, size: 64, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !398, line: 335, baseType: !475, size: 32, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1146, file: !398, line: 335, baseType: !475, size: 32, offset: 672)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1146, file: !398, line: 336, baseType: !475, size: 32, offset: 704)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1146, file: !398, line: 336, baseType: !475, size: 32, offset: 736)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1146, file: !398, line: 337, baseType: !1189, size: 64, offset: 768)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !376, line: 339, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !376, line: 339, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1146, file: !398, line: 338, baseType: !1189, size: 64, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1146, file: !398, line: 339, baseType: !1195, size: 64, offset: 896)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !376, line: 341, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !376, line: 351, size: 192, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1197, file: !376, line: 354, baseType: !72, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1197, file: !376, line: 355, baseType: !72, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1197, file: !376, line: 356, baseType: !72, size: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1197, file: !376, line: 361, baseType: !72, size: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1197, file: !376, line: 362, baseType: !565, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1146, file: !398, line: 340, baseType: !387, size: 32, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1146, file: !398, line: 340, baseType: !387, size: 32, offset: 992)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1146, file: !398, line: 341, baseType: !390, size: 64, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1146, file: !398, line: 342, baseType: !386, size: 64, offset: 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1146, file: !398, line: 343, baseType: !519, size: 64, offset: 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1146, file: !398, line: 344, baseType: !504, size: 64, offset: 1216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1146, file: !398, line: 345, baseType: !387, size: 32, offset: 1280)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1146, file: !398, line: 346, baseType: !1177, size: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1146, file: !398, line: 347, baseType: !569, size: 32, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1146, file: !398, line: 348, baseType: !387, size: 32, offset: 1440)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1146, file: !398, line: 351, baseType: !569, size: 32, offset: 1472)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1146, file: !398, line: 352, baseType: !569, size: 32, offset: 1504)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1146, file: !398, line: 353, baseType: !475, size: 32, offset: 1536)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1146, file: !398, line: 354, baseType: !475, size: 32, offset: 1568)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1146, file: !398, line: 355, baseType: !1177, size: 64, offset: 1600)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1146, file: !398, line: 356, baseType: !1177, size: 64, offset: 1664)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1146, file: !398, line: 357, baseType: !1221, size: 64, offset: 1728)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !398, line: 310, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 308, size: 32, elements: !1224)
!1224 = !{!1225}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1223, file: !398, line: 309, baseType: !387, size: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1146, file: !398, line: 357, baseType: !1221, size: 64, offset: 1792)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1146, file: !398, line: 358, baseType: !1228, size: 64, offset: 1856)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !398, line: 316, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 312, size: 128, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1230, file: !398, line: 313, baseType: !379, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1230, file: !398, line: 314, baseType: !387, size: 32, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1230, file: !398, line: 315, baseType: !439, size: 8, offset: 96)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1146, file: !398, line: 359, baseType: !1228, size: 64, offset: 1920)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1146, file: !398, line: 360, baseType: !1228, size: 64, offset: 1984)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1146, file: !398, line: 361, baseType: !387, size: 32, offset: 2048)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1146, file: !398, line: 362, baseType: !475, size: 32, offset: 2080)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1146, file: !398, line: 363, baseType: !387, size: 32, offset: 2112)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1146, file: !398, line: 364, baseType: !1177, size: 64, offset: 2176)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1146, file: !398, line: 365, baseType: !1195, size: 64, offset: 2240)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1146, file: !398, line: 366, baseType: !475, size: 32, offset: 2304)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1146, file: !398, line: 367, baseType: !475, size: 32, offset: 2336)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1146, file: !398, line: 368, baseType: !1189, size: 64, offset: 2368)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1146, file: !398, line: 369, baseType: !1189, size: 64, offset: 2432)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1146, file: !398, line: 370, baseType: !1247, size: 64, offset: 2496)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1146, file: !398, line: 371, baseType: !1247, size: 64, offset: 2560)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1146, file: !398, line: 372, baseType: !1247, size: 64, offset: 2624)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1146, file: !398, line: 373, baseType: !1253, size: 64, offset: 2688)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !376, line: 331, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !376, line: 331, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1146, file: !398, line: 374, baseType: !565, size: 64, offset: 2752)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1146, file: !398, line: 375, baseType: !1258, size: 64, offset: 2816)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !397, file: !398, line: 451, baseType: !1145, size: 2880, offset: 18560)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !397, file: !398, line: 452, baseType: !1261, size: 64, offset: 21440)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !398, line: 681, size: 4864, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268, !1269, !1270, !1271, !1275}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1263, file: !398, line: 682, baseType: !401, size: 4480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1263, file: !398, line: 682, baseType: !823, size: 32, offset: 4480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1263, file: !398, line: 683, baseType: !569, size: 32, offset: 4512)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1263, file: !398, line: 684, baseType: !387, size: 32, offset: 4544)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1263, file: !398, line: 685, baseType: !975, size: 64, offset: 4608)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1263, file: !398, line: 686, baseType: !390, size: 64, offset: 4672)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1263, file: !398, line: 687, baseType: !1272, size: 64, offset: 4736)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!416, !1261, !621, !379}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1263, file: !398, line: 688, baseType: !379, size: 64, offset: 4800)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !397, file: !398, line: 453, baseType: !1261, size: 64, offset: 21504)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !397, file: !398, line: 454, baseType: !1261, size: 64, offset: 21568)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !397, file: !398, line: 455, baseType: !387, size: 32, offset: 21632)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !397, file: !398, line: 456, baseType: !569, size: 32, offset: 21664)
