; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/gr1.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/gr1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!96 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 119, baseType: !5, size: 32, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!108 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!150 = !{!151, !306, !268, !303, !349, !219, !452, !224, !158, !1215, !1218, !348}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_DA", file: !153, line: 75, baseType: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmdaimpl.h", directory: "/home/users/ndemeye/xSDK")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 11, size: 4544, elements: !155)
!155 = !{!156, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !189, !190, !192, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !217, !222, !225, !226, !228, !229, !230, !235, !236, !239, !244, !245, !247, !248, !249, !250, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !271, !272, !273, !274, !275, !276, !277, !278, !1209, !1210, !1211, !1212, !1213, !1214}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !154, file: !153, line: 12, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !158)
!158 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !154, file: !153, line: 12, baseType: !157, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !154, file: !153, line: 12, baseType: !157, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !154, file: !153, line: 13, baseType: !157, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !154, file: !153, line: 13, baseType: !157, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !154, file: !153, line: 13, baseType: !157, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !154, file: !153, line: 14, baseType: !157, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !154, file: !153, line: 15, baseType: !157, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "xs", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "xe", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ys", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ye", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 352)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "zs", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ze", scope: !154, file: !153, line: 16, baseType: !157, size: 32, offset: 416)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Xs", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Xe", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Ys", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ye", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 544)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Zs", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ze", scope: !154, file: !153, line: 17, baseType: !157, size: 32, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !153, line: 19, baseType: !157, size: 32, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !154, file: !153, line: 20, baseType: !180, size: 32, offset: 672)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "by", scope: !154, file: !153, line: 20, baseType: !180, size: 32, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bz", scope: !154, file: !153, line: 20, baseType: !180, size: 32, offset: 736)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !154, file: !153, line: 21, baseType: !184, size: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !185, line: 59, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !185, line: 15, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !185, line: 15, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !154, file: !153, line: 21, baseType: !184, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_type", scope: !154, file: !153, line: 22, baseType: !191, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDAStencilType", file: !67, line: 14, baseType: !66)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "interptype", scope: !154, file: !153, line: 23, baseType: !193, size: 32, offset: 928)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDAInterpolationType", file: !67, line: 24, baseType: !71)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nlocal", scope: !154, file: !153, line: 25, baseType: !157, size: 32, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Nlocal", scope: !154, file: !153, line: 25, baseType: !157, size: 32, offset: 992)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "xol", scope: !154, file: !153, line: 27, baseType: !157, size: 32, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "yol", scope: !154, file: !153, line: 27, baseType: !157, size: 32, offset: 1056)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "zol", scope: !154, file: !153, line: 27, baseType: !157, size: 32, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xo", scope: !154, file: !153, line: 28, baseType: !157, size: 32, offset: 1120)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "yo", scope: !154, file: !153, line: 28, baseType: !157, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "zo", scope: !154, file: !153, line: 28, baseType: !157, size: 32, offset: 1184)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Mo", scope: !154, file: !153, line: 29, baseType: !157, size: 32, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "No", scope: !154, file: !153, line: 29, baseType: !157, size: 32, offset: 1248)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Po", scope: !154, file: !153, line: 29, baseType: !157, size: 32, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Nsub", scope: !154, file: !153, line: 30, baseType: !157, size: 32, offset: 1312)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nonxs", scope: !154, file: !153, line: 31, baseType: !157, size: 32, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nonys", scope: !154, file: !153, line: 31, baseType: !157, size: 32, offset: 1376)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nonzs", scope: !154, file: !153, line: 31, baseType: !157, size: 32, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nonxm", scope: !154, file: !153, line: 32, baseType: !157, size: 32, offset: 1440)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nonym", scope: !154, file: !153, line: 32, baseType: !157, size: 32, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nonzm", scope: !154, file: !153, line: 32, baseType: !157, size: 32, offset: 1504)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ao", scope: !154, file: !153, line: 34, baseType: !213, size: 64, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AO", file: !214, line: 17, baseType: !215)
!214 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscao.h", directory: "/home/users/ndemeye/xSDK")
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_AO", file: !214, line: 17, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "aotype", scope: !154, file: !153, line: 35, baseType: !218, size: 64, offset: 1600)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AOType", file: !214, line: 27, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fieldname", scope: !154, file: !153, line: 37, baseType: !223, size: 64, offset: 1664)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatename", scope: !154, file: !153, line: 38, baseType: !223, size: 64, offset: 1728)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lx", scope: !154, file: !153, line: 40, baseType: !227, size: 64, offset: 1792)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ly", scope: !154, file: !153, line: 40, baseType: !227, size: 64, offset: 1856)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !154, file: !153, line: 40, baseType: !227, size: 64, offset: 1920)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "natural", scope: !154, file: !153, line: 41, baseType: !231, size: 64, offset: 1984)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !232, line: 21, baseType: !233)
!232 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !232, line: 21, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gton", scope: !154, file: !153, line: 42, baseType: !184, size: 64, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !154, file: !153, line: 43, baseType: !237, size: 64, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !158)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "localcoloring", scope: !154, file: !153, line: 45, baseType: !240, size: 64, offset: 2176)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !241, line: 51, baseType: !242)
!241 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !241, line: 51, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghostedcoloring", scope: !154, file: !153, line: 46, baseType: !240, size: 64, offset: 2240)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "elementtype", scope: !154, file: !153, line: 48, baseType: !246, size: 32, offset: 2304)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDAElementType", file: !67, line: 35, baseType: !75)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ne", scope: !154, file: !153, line: 49, baseType: !157, size: 32, offset: 2336)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nen", scope: !154, file: !153, line: 50, baseType: !157, size: 32, offset: 2368)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !154, file: !153, line: 51, baseType: !227, size: 64, offset: 2432)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ecorners", scope: !154, file: !153, line: 52, baseType: !251, size: 64, offset: 2496)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !241, line: 11, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !241, line: 11, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "refine_x", scope: !154, file: !153, line: 54, baseType: !157, size: 32, offset: 2560)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "refine_y", scope: !154, file: !153, line: 54, baseType: !157, size: 32, offset: 2592)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "refine_z", scope: !154, file: !153, line: 54, baseType: !157, size: 32, offset: 2624)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen_x", scope: !154, file: !153, line: 55, baseType: !157, size: 32, offset: 2656)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen_y", scope: !154, file: !153, line: 55, baseType: !157, size: 32, offset: 2688)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen_z", scope: !154, file: !153, line: 55, baseType: !157, size: 32, offset: 2720)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "refine_x_hier_n", scope: !154, file: !153, line: 57, baseType: !157, size: 32, offset: 2752)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "refine_x_hier", scope: !154, file: !153, line: 57, baseType: !227, size: 64, offset: 2816)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "refine_y_hier_n", scope: !154, file: !153, line: 57, baseType: !157, size: 32, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "refine_y_hier", scope: !154, file: !153, line: 57, baseType: !227, size: 64, offset: 2944)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "refine_z_hier_n", scope: !154, file: !153, line: 57, baseType: !157, size: 32, offset: 3008)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "refine_z_hier", scope: !154, file: !153, line: 57, baseType: !227, size: 64, offset: 3072)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "arrayin", scope: !154, file: !153, line: 60, baseType: !267, size: 128, offset: 3136)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!269 = !{!270}
!270 = !DISubrange(count: 2)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "arrayout", scope: !154, file: !153, line: 60, baseType: !267, size: 128, offset: 3264)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arrayghostedin", scope: !154, file: !153, line: 61, baseType: !267, size: 128, offset: 3392)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arrayghostedout", scope: !154, file: !153, line: 61, baseType: !267, size: 128, offset: 3520)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "startin", scope: !154, file: !153, line: 62, baseType: !267, size: 128, offset: 3648)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "startout", scope: !154, file: !153, line: 62, baseType: !267, size: 128, offset: 3776)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "startghostedin", scope: !154, file: !153, line: 63, baseType: !267, size: 128, offset: 3904)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "startghostedout", scope: !154, file: !153, line: 63, baseType: !267, size: 128, offset: 4032)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lf", scope: !154, file: !153, line: 65, baseType: !279, size: 64, offset: 4160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !283, !231, !231, !268}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !158)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !286)
!286 = !{!287, !486, !705, !709, !710, !711, !712, !722, !723, !731, !732, !740, !741, !742, !743, !747, !748, !752, !754, !756, !757, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !785, !797, !809, !821, !830, !831, !854, !855, !856, !857, !858, !859, !861, !952, !953, !973, !974, !975, !976, !977, !978, !982, !983, !987, !988, !989, !990, !991, !992, !993, !994, !995, !997, !1009, !1010, !1011, !1020, !1108, !1109, !1197, !1198, !1199, !1200, !1202, !1204, !1205, !1206, !1207, !1208}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !285, file: !47, line: 203, baseType: !288, size: 4480)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !289, line: 122, baseType: !290)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !289, line: 73, size: 4480, elements: !291)
!291 = !{!292, !294, !345, !346, !347, !350, !351, !352, !353, !361, !362, !363, !367, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !383, !384, !385, !387, !388, !389, !391, !392, !393, !394, !395, !398, !400, !401, !402, !403, !404, !407, !409, !410, !411, !419, !421, !422, !426, !427, !476, !481, !483, !484, !485}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !290, file: !289, line: 74, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !158)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !290, file: !289, line: 75, baseType: !295, size: 448, offset: 64)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 448, elements: !343)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !289, line: 53, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 45, size: 448, elements: !298)
!298 = !{!299, !310, !318, !323, !327, !331, !338}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !297, file: !289, line: 46, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!282, !303, !305}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !307, line: 330, baseType: !308)
!307 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !307, line: 330, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !297, file: !289, line: 47, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!282, !303, !314}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !315, line: 16, baseType: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !315, line: 16, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !297, file: !289, line: 48, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!282, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !297, file: !289, line: 49, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!282, !303, !219, !303}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !297, file: !289, line: 50, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!282, !303, !219, !322}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !297, file: !289, line: 51, baseType: !332, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!282, !303, !219, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !297, file: !289, line: 52, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!282, !303, !219, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!343 = !{!344}
!344 = !DISubrange(count: 1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !290, file: !289, line: 76, baseType: !306, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !289, line: 77, baseType: !157, size: 32, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !290, file: !289, line: 78, baseType: !348, size: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !349)
!349 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !290, file: !289, line: 78, baseType: !348, size: 64, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !290, file: !289, line: 78, baseType: !348, size: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !290, file: !289, line: 78, baseType: !348, size: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !289, line: 79, baseType: !354, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !357, line: 27, baseType: !358)
!357 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !359, line: 43, baseType: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!360 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !290, file: !289, line: 80, baseType: !157, size: 32, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !290, file: !289, line: 81, baseType: !238, size: 32, offset: 992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !290, file: !289, line: 82, baseType: !364, size: 64, offset: 1024)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !290, file: !289, line: 83, baseType: !368, size: 64, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !290, file: !289, line: 84, baseType: !224, size: 64, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !290, file: !289, line: 85, baseType: !224, size: 64, offset: 1216)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !290, file: !289, line: 86, baseType: !224, size: 64, offset: 1280)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !290, file: !289, line: 87, baseType: !224, size: 64, offset: 1344)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !290, file: !289, line: 88, baseType: !303, size: 64, offset: 1408)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !290, file: !289, line: 89, baseType: !354, size: 64, offset: 1472)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !289, line: 90, baseType: !224, size: 64, offset: 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !290, file: !289, line: 91, baseType: !224, size: 64, offset: 1600)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !290, file: !289, line: 92, baseType: !157, size: 32, offset: 1664)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !290, file: !289, line: 93, baseType: !268, size: 64, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !290, file: !289, line: 94, baseType: !382, size: 64, offset: 1792)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !355)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !290, file: !289, line: 95, baseType: !157, size: 32, offset: 1856)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !290, file: !289, line: 95, baseType: !157, size: 32, offset: 1888)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !290, file: !289, line: 96, baseType: !386, size: 64, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !290, file: !289, line: 96, baseType: !386, size: 64, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !290, file: !289, line: 97, baseType: !227, size: 64, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !290, file: !289, line: 97, baseType: !390, size: 64, offset: 2112)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !290, file: !289, line: 98, baseType: !157, size: 32, offset: 2176)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !290, file: !289, line: 98, baseType: !157, size: 32, offset: 2208)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !290, file: !289, line: 99, baseType: !386, size: 64, offset: 2240)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !290, file: !289, line: 99, baseType: !386, size: 64, offset: 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !290, file: !289, line: 100, baseType: !396, size: 64, offset: 2368)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !349)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !290, file: !289, line: 100, baseType: !399, size: 64, offset: 2432)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !290, file: !289, line: 101, baseType: !157, size: 32, offset: 2496)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !290, file: !289, line: 101, baseType: !157, size: 32, offset: 2528)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !290, file: !289, line: 102, baseType: !386, size: 64, offset: 2560)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !290, file: !289, line: 102, baseType: !386, size: 64, offset: 2624)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !290, file: !289, line: 103, baseType: !405, size: 64, offset: 2688)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !397)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !290, file: !289, line: 103, baseType: !408, size: 64, offset: 2752)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !290, file: !289, line: 104, baseType: !342, size: 64, offset: 2816)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !290, file: !289, line: 105, baseType: !157, size: 32, offset: 2880)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !290, file: !289, line: 106, baseType: !412, size: 128, offset: 2944)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 128, elements: !269)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !289, line: 64, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 61, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !415, file: !289, line: 62, baseType: !335, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !415, file: !289, line: 63, baseType: !268, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !290, file: !289, line: 107, baseType: !420, size: 64, offset: 3072)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !269)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !290, file: !289, line: 108, baseType: !268, size: 64, offset: 3136)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !290, file: !289, line: 109, baseType: !423, size: 64, offset: 3200)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!282, !268}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !290, file: !289, line: 111, baseType: !157, size: 32, offset: 3264)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !290, file: !289, line: 112, baseType: !428, size: 320, offset: 3328)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 320, elements: !474)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!282, !432, !303, !268}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !435)
!435 = !{!436, !437, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !434, file: !10, line: 100, baseType: !157, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !434, file: !10, line: 101, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !449, !450, !451, !455, !457, !459, !460, !461}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !440, file: !10, line: 84, baseType: !224, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !440, file: !10, line: 85, baseType: !224, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !10, line: 86, baseType: !268, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !440, file: !10, line: 87, baseType: !364, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !440, file: !10, line: 88, baseType: !447, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !440, file: !10, line: 89, baseType: !221, size: 8, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !440, file: !10, line: 90, baseType: !224, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !440, file: !10, line: 91, baseType: !452, size: 64, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !453, line: 46, baseType: !454)
!453 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!454 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !440, file: !10, line: 92, baseType: !456, size: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !10, line: 93, baseType: !458, size: 32, offset: 544)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !10, line: 94, baseType: !438, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !440, file: !10, line: 95, baseType: !224, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !440, file: !10, line: 96, baseType: !268, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !434, file: !10, line: 102, baseType: !224, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !434, file: !10, line: 102, baseType: !224, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !434, file: !10, line: 103, baseType: !224, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !434, file: !10, line: 104, baseType: !306, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !434, file: !10, line: 105, baseType: !456, size: 32, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !434, file: !10, line: 105, baseType: !456, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !434, file: !10, line: 105, baseType: !456, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !434, file: !10, line: 106, baseType: !303, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !434, file: !10, line: 107, baseType: !471, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!474 = !{!475}
!475 = !DISubrange(count: 5)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !290, file: !289, line: 113, baseType: !477, size: 320, offset: 3648)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !474)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!282, !303, !268}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !290, file: !289, line: 114, baseType: !482, size: 320, offset: 3968)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !474)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !290, file: !289, line: 115, baseType: !456, size: 32, offset: 4288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !290, file: !289, line: 120, baseType: !471, size: 64, offset: 4352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !290, file: !289, line: 121, baseType: !456, size: 32, offset: 4416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !285, file: !47, line: 203, baseType: !487, size: 3456, offset: 4480)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 3456, elements: !343)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !489)
!489 = !{!490, !494, !495, !500, !504, !508, !509, !510, !515, !516, !517, !524, !525, !533, !539, !548, !552, !556, !557, !562, !563, !567, !568, !572, !573, !581, !585, !590, !591, !592, !593, !594, !595, !596, !600, !606, !610, !615, !619, !625, !629, !634, !641, !645, !646, !651, !662, !666, !676, !680, !688, !692, !700, !701}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !488, file: !47, line: 31, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!282, !283, !314}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !488, file: !47, line: 32, baseType: !491, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !488, file: !47, line: 33, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!282, !283, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !488, file: !47, line: 34, baseType: !501, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!282, !432, !283}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !488, file: !47, line: 35, baseType: !505, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!282, !283}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !488, file: !47, line: 36, baseType: !505, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !488, file: !47, line: 37, baseType: !505, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !488, file: !47, line: 38, baseType: !511, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!282, !283, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !488, file: !47, line: 39, baseType: !511, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !488, file: !47, line: 40, baseType: !505, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !488, file: !47, line: 41, baseType: !518, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!282, !283, !227, !521, !522}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !488, file: !47, line: 42, baseType: !496, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !488, file: !47, line: 43, baseType: !526, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!282, !283, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !488, file: !47, line: 45, baseType: !534, size: 64, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!282, !283, !537, !538}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !488, file: !47, line: 46, baseType: !540, size: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!282, !283, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !545, line: 16, baseType: !546)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !545, line: 16, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !488, file: !47, line: 47, baseType: !549, size: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!282, !283, !283, !543, !514}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !488, file: !47, line: 48, baseType: !553, size: 64, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!282, !283, !283, !543}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !488, file: !47, line: 49, baseType: !553, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !488, file: !47, line: 50, baseType: !558, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!282, !283, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !488, file: !47, line: 51, baseType: !553, size: 64, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !488, file: !47, line: 53, baseType: !564, size: 64, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!282, !283, !306, !499}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !488, file: !47, line: 54, baseType: !564, size: 64, offset: 1344)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !488, file: !47, line: 55, baseType: !569, size: 64, offset: 1408)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!282, !283, !157, !499}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !488, file: !47, line: 56, baseType: !569, size: 64, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !488, file: !47, line: 57, baseType: !574, size: 64, offset: 1536)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!282, !283, !577, !499}
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !578, line: 12, baseType: !579)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !578, line: 12, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !488, file: !47, line: 58, baseType: !582, size: 64, offset: 1600)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!282, !283, !231, !577, !499}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !488, file: !47, line: 60, baseType: !586, size: 64, offset: 1664)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!282, !283, !231, !589, !231}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !488, file: !47, line: 61, baseType: !586, size: 64, offset: 1728)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !488, file: !47, line: 62, baseType: !586, size: 64, offset: 1792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !488, file: !47, line: 63, baseType: !586, size: 64, offset: 1856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !488, file: !47, line: 64, baseType: !586, size: 64, offset: 1920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !488, file: !47, line: 65, baseType: !586, size: 64, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !488, file: !47, line: 67, baseType: !505, size: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !488, file: !47, line: 69, baseType: !597, size: 64, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!282, !283, !231, !231}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !488, file: !47, line: 71, baseType: !601, size: 64, offset: 2176)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!282, !283, !157, !604, !523, !499}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !488, file: !47, line: 72, baseType: !607, size: 64, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!282, !499, !157, !522, !499}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !488, file: !47, line: 73, baseType: !611, size: 64, offset: 2304)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!282, !283, !227, !521, !522, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !488, file: !47, line: 74, baseType: !616, size: 64, offset: 2368)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!282, !283, !227, !521, !522, !522, !614}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !488, file: !47, line: 75, baseType: !620, size: 64, offset: 2432)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!282, !283, !157, !499, !623, !623, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !488, file: !47, line: 77, baseType: !626, size: 64, offset: 2496)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!282, !283, !157, !227, !227}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !488, file: !47, line: 78, baseType: !630, size: 64, offset: 2560)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!282, !283, !231, !633, !186}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !488, file: !47, line: 79, baseType: !635, size: 64, offset: 2624)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!282, !283, !227, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !488, file: !47, line: 80, baseType: !642, size: 64, offset: 2688)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!282, !283, !396, !396}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !488, file: !47, line: 81, baseType: !642, size: 64, offset: 2752)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !488, file: !47, line: 82, baseType: !647, size: 64, offset: 2816)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!282, !283, !231, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !488, file: !47, line: 84, baseType: !652, size: 64, offset: 2880)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!282, !283, !397, !655, !661, !589, !231}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!282, !157, !397, !659, !157, !405, !268}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !488, file: !47, line: 85, baseType: !663, size: 64, offset: 2944)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!282, !283, !397, !577, !157, !604, !157, !604, !655, !661, !589, !231}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !488, file: !47, line: 86, baseType: !667, size: 64, offset: 3008)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!282, !283, !397, !231, !670, !589, !231}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !157, !157, !157, !604, !604, !674, !674, !674, !604, !604, !674, !674, !674, !397, !659, !157, !674, !405}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !488, file: !47, line: 87, baseType: !677, size: 64, offset: 3072)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!282, !283, !397, !577, !157, !604, !157, !604, !231, !670, !589, !231}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !488, file: !47, line: 88, baseType: !681, size: 64, offset: 3136)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!282, !283, !397, !577, !157, !604, !157, !604, !231, !684, !589, !231}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !157, !157, !157, !604, !604, !674, !674, !674, !604, !604, !674, !674, !674, !397, !659, !659, !157, !674, !405}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !488, file: !47, line: 89, baseType: !689, size: 64, offset: 3200)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!282, !283, !397, !655, !661, !231, !396}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !488, file: !47, line: 90, baseType: !693, size: 64, offset: 3264)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!282, !283, !397, !696, !661, !231, !659, !396}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!282, !157, !397, !659, !659, !157, !405, !268}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !488, file: !47, line: 91, baseType: !689, size: 64, offset: 3328)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !488, file: !47, line: 93, baseType: !702, size: 64, offset: 3392)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!282, !283, !283, !561, !561}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !285, file: !47, line: 204, baseType: !706, size: 6400, offset: 7936)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 6400, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 100)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !285, file: !47, line: 204, baseType: !706, size: 6400, offset: 14336)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !285, file: !47, line: 205, baseType: !706, size: 6400, offset: 20736)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !285, file: !47, line: 205, baseType: !706, size: 6400, offset: 27136)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !285, file: !47, line: 206, baseType: !713, size: 64, offset: 33536)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !716)
!716 = !{!717, !718, !719, !721}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !715, file: !47, line: 143, baseType: !231, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !47, line: 144, baseType: !224, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !715, file: !47, line: 145, baseType: !720, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !47, line: 146, baseType: !713, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !285, file: !47, line: 207, baseType: !713, size: 64, offset: 33600)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !285, file: !47, line: 208, baseType: !724, size: 64, offset: 33664)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !726, file: !47, line: 151, baseType: !452, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !726, file: !47, line: 152, baseType: !268, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !47, line: 153, baseType: !724, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !285, file: !47, line: 208, baseType: !724, size: 64, offset: 33728)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !285, file: !47, line: 209, baseType: !733, size: 64, offset: 33792)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !735, file: !47, line: 159, baseType: !577, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !735, file: !47, line: 160, baseType: !456, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !47, line: 161, baseType: !734, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !285, file: !47, line: 210, baseType: !577, size: 64, offset: 33856)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !285, file: !47, line: 211, baseType: !577, size: 64, offset: 33920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !285, file: !47, line: 212, baseType: !268, size: 64, offset: 33984)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !285, file: !47, line: 213, baseType: !744, size: 64, offset: 34048)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!282, !661}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !285, file: !47, line: 214, baseType: !537, size: 32, offset: 34112)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !285, file: !47, line: 215, baseType: !749, size: 64, offset: 34176)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !545, line: 1378, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !545, line: 1378, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !285, file: !47, line: 216, baseType: !753, size: 64, offset: 34240)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !232, line: 83, baseType: !219)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !285, file: !47, line: 217, baseType: !755, size: 64, offset: 34304)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !545, line: 25, baseType: !219)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !285, file: !47, line: 218, baseType: !157, size: 32, offset: 34368)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !285, file: !47, line: 219, baseType: !758, size: 64, offset: 34432)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !241, line: 30, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !241, line: 30, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !285, file: !47, line: 220, baseType: !456, size: 32, offset: 34496)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !285, file: !47, line: 221, baseType: !456, size: 32, offset: 34528)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !285, file: !47, line: 222, baseType: !157, size: 32, offset: 34560)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !285, file: !47, line: 222, baseType: !157, size: 32, offset: 34592)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !285, file: !47, line: 223, baseType: !456, size: 32, offset: 34624)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !285, file: !47, line: 224, baseType: !456, size: 32, offset: 34656)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !47, line: 225, baseType: !268, size: 64, offset: 34688)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !285, file: !47, line: 227, baseType: !283, size: 64, offset: 34752)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !285, file: !47, line: 228, baseType: !283, size: 64, offset: 34816)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !285, file: !47, line: 229, baseType: !771, size: 64, offset: 34880)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !774)
!774 = !{!775, !779, !783, !784}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !773, file: !47, line: 102, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!282, !283, !283, !268}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !773, file: !47, line: 103, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!282, !283, !544, !231, !544, !283, !268}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !773, file: !47, line: 104, baseType: !268, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !773, file: !47, line: 105, baseType: !771, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !285, file: !47, line: 230, baseType: !786, size: 64, offset: 34944)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !789)
!789 = !{!790, !791, !795, !796}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !788, file: !47, line: 110, baseType: !776, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !788, file: !47, line: 111, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!282, !283, !544, !283, !268}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !788, file: !47, line: 112, baseType: !268, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !47, line: 113, baseType: !786, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !285, file: !47, line: 231, baseType: !798, size: 64, offset: 35008)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !801)
!801 = !{!802, !803, !807, !808}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !800, file: !47, line: 118, baseType: !776, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !800, file: !47, line: 119, baseType: !804, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!282, !283, !184, !184, !283, !268}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !800, file: !47, line: 120, baseType: !268, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !47, line: 121, baseType: !798, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !285, file: !47, line: 232, baseType: !810, size: 64, offset: 35072)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !813)
!813 = !{!814, !818, !819, !820}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !812, file: !47, line: 126, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!282, !283, !231, !589, !231, !268}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !812, file: !47, line: 127, baseType: !815, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !812, file: !47, line: 128, baseType: !268, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !47, line: 129, baseType: !810, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !285, file: !47, line: 233, baseType: !822, size: 64, offset: 35136)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !824, file: !47, line: 134, baseType: !815, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !824, file: !47, line: 135, baseType: !815, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !824, file: !47, line: 136, baseType: !268, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !47, line: 137, baseType: !822, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !285, file: !47, line: 235, baseType: !157, size: 32, offset: 35200)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !285, file: !47, line: 237, baseType: !832, size: 64, offset: 35264)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !836)
!836 = !{!837, !841, !842, !843, !844, !846, !853}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !835, file: !47, line: 27, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !839, line: 166, baseType: !840)
!839 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !839, line: 139, baseType: !5)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !835, file: !47, line: 27, baseType: !838, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !835, file: !47, line: 27, baseType: !838, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !835, file: !47, line: 27, baseType: !838, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !835, file: !47, line: 27, baseType: !845, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !835, file: !47, line: 27, baseType: !847, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !849, file: !47, line: 19, baseType: !577, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !849, file: !47, line: 20, baseType: !157, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !835, file: !47, line: 27, baseType: !514, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !285, file: !47, line: 239, baseType: !186, size: 64, offset: 35328)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !285, file: !47, line: 240, baseType: !186, size: 64, offset: 35392)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !285, file: !47, line: 241, baseType: !186, size: 64, offset: 35456)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !285, file: !47, line: 242, baseType: !186, size: 64, offset: 35520)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !285, file: !47, line: 243, baseType: !456, size: 32, offset: 35584)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !285, file: !47, line: 245, baseType: !860, size: 64, offset: 35616)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, elements: !269)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !285, file: !47, line: 246, baseType: !862, size: 64, offset: 35712)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !863, line: 18, baseType: !864)
!863 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !866, line: 29, size: 5760, elements: !867)
!866 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!867 = !{!868, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !915, !916, !917}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !865, file: !866, line: 30, baseType: !288, size: 4480)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !865, file: !866, line: 30, baseType: !870, size: 32, offset: 4480)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 32, elements: !343)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !865, file: !866, line: 31, baseType: !157, size: 32, offset: 4512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !865, file: !866, line: 31, baseType: !157, size: 32, offset: 4544)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !865, file: !866, line: 32, baseType: !251, size: 64, offset: 4608)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !865, file: !866, line: 33, baseType: !456, size: 32, offset: 4672)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !865, file: !866, line: 34, baseType: !456, size: 32, offset: 4704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !865, file: !866, line: 35, baseType: !227, size: 64, offset: 4736)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !865, file: !866, line: 36, baseType: !227, size: 64, offset: 4800)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !865, file: !866, line: 37, baseType: !157, size: 32, offset: 4864)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !865, file: !866, line: 38, baseType: !862, size: 64, offset: 4928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !865, file: !866, line: 39, baseType: !227, size: 64, offset: 4992)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !865, file: !866, line: 40, baseType: !456, size: 32, offset: 5056)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !865, file: !866, line: 42, baseType: !157, size: 32, offset: 5088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !865, file: !866, line: 43, baseType: !223, size: 64, offset: 5120)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !865, file: !866, line: 44, baseType: !227, size: 64, offset: 5184)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !865, file: !866, line: 45, baseType: !886, size: 64, offset: 5248)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !865, file: !866, line: 46, baseType: !456, size: 32, offset: 5312)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !865, file: !866, line: 47, baseType: !521, size: 64, offset: 5376)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !865, file: !866, line: 49, baseType: !303, size: 64, offset: 5440)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !865, file: !866, line: 50, baseType: !891, size: 64, offset: 5504)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !866, line: 27, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !866, line: 27, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !866, line: 27, size: 320, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !908}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !894, file: !866, line: 27, baseType: !838, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !894, file: !866, line: 27, baseType: !838, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !894, file: !866, line: 27, baseType: !838, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !894, file: !866, line: 27, baseType: !838, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !894, file: !866, line: 27, baseType: !845, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !894, file: !866, line: 27, baseType: !902, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !866, line: 10, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !866, line: 8, size: 64, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !904, file: !866, line: 9, baseType: !157, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !904, file: !866, line: 9, baseType: !157, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !894, file: !866, line: 27, baseType: !909, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !866, line: 14, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !866, line: 12, size: 128, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !911, file: !866, line: 13, baseType: !227, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !911, file: !866, line: 13, baseType: !227, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !865, file: !866, line: 51, baseType: !862, size: 64, offset: 5568)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !865, file: !866, line: 52, baseType: !251, size: 64, offset: 5632)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !865, file: !866, line: 53, baseType: !918, size: 64, offset: 5696)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !863, line: 33, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !866, line: 72, size: 4864, elements: !921)
!921 = !{!922, !923, !941, !942, !951}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !920, file: !866, line: 73, baseType: !288, size: 4480)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !920, file: !866, line: 73, baseType: !924, size: 192, offset: 4480)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 192, elements: !343)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !866, line: 56, size: 192, elements: !926)
!926 = !{!927, !933, !937}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !925, file: !866, line: 57, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!282, !918, !862, !157, !604, !931, !932}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !925, file: !866, line: 58, baseType: !934, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!282, !918}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !925, file: !866, line: 59, baseType: !938, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!282, !918, !314}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !920, file: !866, line: 74, baseType: !268, size: 64, offset: 4672)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !920, file: !866, line: 75, baseType: !943, size: 64, offset: 4736)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !866, line: 62, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !866, line: 64, size: 256, elements: !946)
!946 = !{!947, !948, !949, !950}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !945, file: !866, line: 66, baseType: !943, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !945, file: !866, line: 67, baseType: !931, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !945, file: !866, line: 68, baseType: !932, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !945, file: !866, line: 69, baseType: !157, size: 32, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !920, file: !866, line: 76, baseType: !943, size: 64, offset: 4800)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !285, file: !47, line: 247, baseType: !862, size: 64, offset: 35776)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !285, file: !47, line: 248, baseType: !954, size: 64, offset: 35840)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !241, line: 60, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !956, file: !25, line: 241, baseType: !306, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !956, file: !25, line: 242, baseType: !238, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !956, file: !25, line: 243, baseType: !157, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !956, file: !25, line: 243, baseType: !157, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !956, file: !25, line: 244, baseType: !157, size: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !956, file: !25, line: 244, baseType: !157, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !956, file: !25, line: 245, baseType: !227, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !956, file: !25, line: 246, baseType: !456, size: 32, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !956, file: !25, line: 247, baseType: !157, size: 32, offset: 352)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !956, file: !25, line: 251, baseType: !157, size: 32, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !956, file: !25, line: 252, baseType: !758, size: 64, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !956, file: !25, line: 253, baseType: !456, size: 32, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !956, file: !25, line: 254, baseType: !157, size: 32, offset: 544)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !956, file: !25, line: 254, baseType: !157, size: 32, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !956, file: !25, line: 255, baseType: !157, size: 32, offset: 608)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !285, file: !47, line: 250, baseType: !862, size: 64, offset: 35904)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !285, file: !47, line: 251, baseType: !544, size: 64, offset: 35968)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !285, file: !47, line: 253, baseType: !283, size: 64, offset: 36032)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !285, file: !47, line: 254, baseType: !231, size: 64, offset: 36096)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !285, file: !47, line: 255, baseType: !268, size: 64, offset: 36160)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !285, file: !47, line: 256, baseType: !979, size: 64, offset: 36224)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!282, !283, !268}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !285, file: !47, line: 257, baseType: !979, size: 64, offset: 36288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !285, file: !47, line: 258, baseType: !984, size: 64, offset: 36352)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!282, !283, !659, !456, !932, !268}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !285, file: !47, line: 260, baseType: !157, size: 32, offset: 36416)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !285, file: !47, line: 261, baseType: !283, size: 64, offset: 36480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !285, file: !47, line: 262, baseType: !231, size: 64, offset: 36544)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !285, file: !47, line: 263, baseType: !231, size: 64, offset: 36608)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !285, file: !47, line: 264, baseType: !456, size: 32, offset: 36672)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !285, file: !47, line: 265, baseType: !530, size: 64, offset: 36736)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !285, file: !47, line: 266, baseType: !396, size: 64, offset: 36800)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !285, file: !47, line: 266, baseType: !396, size: 64, offset: 36864)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !285, file: !47, line: 267, baseType: !996, size: 64, offset: 36928)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !285, file: !47, line: 269, baseType: !998, size: 640, offset: 36992)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 640, elements: !1007)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!282, !283, !157, !157, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !545, line: 1723, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !545, line: 1723, flags: DIFlagFwdDecl)
!1007 = !{!1008}
!1008 = !DISubrange(count: 10)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !285, file: !47, line: 270, baseType: !998, size: 640, offset: 37632)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !285, file: !47, line: 272, baseType: !157, size: 32, offset: 38272)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !285, file: !47, line: 273, baseType: !1012, size: 64, offset: 38336)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1014, file: !47, line: 174, baseType: !303, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1014, file: !47, line: 175, baseType: !577, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !1014, file: !47, line: 176, baseType: !860, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !1014, file: !47, line: 177, baseType: !456, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !285, file: !47, line: 274, baseType: !1021, size: 64, offset: 38400)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !1024)
!1024 = !{!1025, !1106, !1107}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !1023, file: !47, line: 168, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !1027, line: 11, baseType: !1028)
!1027 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !1027, line: 13, size: 832, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1097, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !1027, line: 14, baseType: !219, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1029, file: !1027, line: 15, baseType: !577, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !1029, file: !1027, line: 16, baseType: !219, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !1029, file: !1027, line: 17, baseType: !157, size: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1029, file: !1027, line: 18, baseType: !227, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !1029, file: !1027, line: 19, baseType: !1037, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !1038, line: 22, baseType: !1039)
!1038 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !1027, line: 81, size: 4992, elements: !1041)
!1041 = !{!1042, !1043, !1057, !1058, !1059, !1068}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1040, file: !1027, line: 82, baseType: !288, size: 4480)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1040, file: !1027, line: 82, baseType: !1044, size: 256, offset: 4480)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 256, elements: !343)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !1027, line: 74, size: 256, elements: !1046)
!1046 = !{!1047, !1051, !1052, !1056}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1045, file: !1027, line: 75, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!282, !1037}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1045, file: !1027, line: 76, baseType: !1048, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1045, file: !1027, line: 77, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!282, !1037, !314}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1045, file: !1027, line: 78, baseType: !1048, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1040, file: !1027, line: 83, baseType: !268, size: 64, offset: 4736)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1040, file: !1027, line: 85, baseType: !157, size: 32, offset: 4800)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !1040, file: !1027, line: 86, baseType: !1060, size: 64, offset: 4864)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !1027, line: 41, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 36, size: 256, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !1027, line: 37, baseType: !452, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1062, file: !1027, line: 38, baseType: !452, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !1062, file: !1027, line: 39, baseType: !452, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1062, file: !1027, line: 40, baseType: !224, size: 64, offset: 192)
