; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssls.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssls.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 155, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70}
!62 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!71 = !{!72, !121, !125, !126, !129}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_SSLS", file: !74, line: 94, baseType: !75)
!74 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/complementarity/impls/ssls/ssls.h", directory: "/home/users/ndemeye/xSDK")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 55, size: 1984, elements: !76)
!76 = !{!77, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !113, !114, !115, !120}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !75, file: !74, line: 56, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !53, line: 21, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !53, line: 21, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dpsi", scope: !75, file: !74, line: 57, baseType: !78, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "da", scope: !75, file: !74, line: 59, baseType: !78, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !75, file: !74, line: 60, baseType: !78, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !75, file: !74, line: 61, baseType: !78, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dxfree", scope: !75, file: !74, line: 62, baseType: !78, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !75, file: !74, line: 64, baseType: !78, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !75, file: !74, line: 65, baseType: !78, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !75, file: !74, line: 67, baseType: !78, size: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !75, file: !74, line: 67, baseType: !78, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !75, file: !74, line: 67, baseType: !78, size: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !75, file: !74, line: 67, baseType: !78, size: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "merit", scope: !75, file: !74, line: 69, baseType: !93, size: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !94)
!94 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "merit_eqn", scope: !75, file: !74, line: 70, baseType: !93, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "merit_mu", scope: !75, file: !74, line: 71, baseType: !93, size: 64, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !75, file: !74, line: 73, baseType: !93, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !75, file: !74, line: 74, baseType: !93, size: 64, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !75, file: !74, line: 76, baseType: !93, size: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !75, file: !74, line: 77, baseType: !93, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !75, file: !74, line: 79, baseType: !93, size: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mu_init", scope: !75, file: !74, line: 82, baseType: !93, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !75, file: !74, line: 83, baseType: !93, size: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dmu", scope: !75, file: !74, line: 84, baseType: !93, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mucon", scope: !75, file: !74, line: 85, baseType: !93, size: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "d_mucon", scope: !75, file: !74, line: 86, baseType: !93, size: 64, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "g_mucon", scope: !75, file: !74, line: 87, baseType: !93, size: 64, offset: 1600)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "J_sub", scope: !75, file: !74, line: 89, baseType: !109, size: 64, offset: 1664)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !110, line: 16, baseType: !111)
!110 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !110, line: 16, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Jpre_sub", scope: !75, file: !74, line: 89, baseType: !109, size: 64, offset: 1728)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !75, file: !74, line: 90, baseType: !78, size: 64, offset: 1792)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !75, file: !74, line: 92, baseType: !116, size: 64, offset: 1856)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !117, line: 11, baseType: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !117, line: 11, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !75, file: !74, line: 93, baseType: !116, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !122, line: 330, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !122, line: 330, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !132, line: 45, size: 14656, elements: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!133 = !{!134, !334, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !425, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !500, !501, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !540, !541, !542, !543, !544, !545, !546, !547}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !131, file: !132, line: 46, baseType: !135, size: 4480)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !136, line: 122, baseType: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !136, line: 73, size: 4480, elements: !138)
!138 = !{!139, !141, !189, !190, !192, !194, !195, !196, !197, !205, !206, !208, !212, !216, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !229, !230, !231, !233, !234, !236, !238, !239, !240, !241, !242, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !267, !269, !270, !274, !275, !324, !329, !331, !332, !333}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !137, file: !136, line: 74, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !137, file: !136, line: 75, baseType: !142, size: 448, offset: 64)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 448, elements: !187)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !136, line: 53, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 45, size: 448, elements: !145)
!145 = !{!146, !154, !162, !167, !171, !175, !182}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !144, file: !136, line: 46, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !151, !153}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !144, file: !136, line: 47, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!150, !151, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !159, line: 16, baseType: !160)
!159 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !159, line: 16, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !144, file: !136, line: 48, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!150, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !144, file: !136, line: 49, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!150, !151, !126, !151}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !144, file: !136, line: 50, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!150, !151, !126, !166}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !144, file: !136, line: 51, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!150, !151, !126, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !144, file: !136, line: 52, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!150, !151, !126, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !137, file: !136, line: 76, baseType: !121, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !136, line: 77, baseType: !191, size: 32, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !137, file: !136, line: 78, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !94)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !137, file: !136, line: 78, baseType: !193, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !137, file: !136, line: 78, baseType: !193, size: 64, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !137, file: !136, line: 78, baseType: !193, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !136, line: 79, baseType: !198, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !201, line: 27, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !203, line: 43, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!204 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !137, file: !136, line: 80, baseType: !191, size: 32, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !137, file: !136, line: 81, baseType: !207, size: 32, offset: 992)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !137, file: !136, line: 82, baseType: !209, size: 64, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !137, file: !136, line: 83, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !137, file: !136, line: 84, baseType: !217, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !137, file: !136, line: 85, baseType: !217, size: 64, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !137, file: !136, line: 86, baseType: !217, size: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !137, file: !136, line: 87, baseType: !217, size: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !137, file: !136, line: 88, baseType: !151, size: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !137, file: !136, line: 89, baseType: !198, size: 64, offset: 1472)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !136, line: 90, baseType: !217, size: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !137, file: !136, line: 91, baseType: !217, size: 64, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !137, file: !136, line: 92, baseType: !191, size: 32, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !137, file: !136, line: 93, baseType: !125, size: 64, offset: 1728)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !137, file: !136, line: 94, baseType: !228, size: 64, offset: 1792)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !199)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !137, file: !136, line: 95, baseType: !191, size: 32, offset: 1856)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !137, file: !136, line: 95, baseType: !191, size: 32, offset: 1888)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !137, file: !136, line: 96, baseType: !232, size: 64, offset: 1920)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !137, file: !136, line: 96, baseType: !232, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !137, file: !136, line: 97, baseType: !235, size: 64, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !137, file: !136, line: 97, baseType: !237, size: 64, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !137, file: !136, line: 98, baseType: !191, size: 32, offset: 2176)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !137, file: !136, line: 98, baseType: !191, size: 32, offset: 2208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !137, file: !136, line: 99, baseType: !232, size: 64, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !137, file: !136, line: 99, baseType: !232, size: 64, offset: 2304)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !137, file: !136, line: 100, baseType: !243, size: 64, offset: 2368)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !137, file: !136, line: 100, baseType: !245, size: 64, offset: 2432)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !137, file: !136, line: 101, baseType: !191, size: 32, offset: 2496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !137, file: !136, line: 101, baseType: !191, size: 32, offset: 2528)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !137, file: !136, line: 102, baseType: !232, size: 64, offset: 2560)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !137, file: !136, line: 102, baseType: !232, size: 64, offset: 2624)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !137, file: !136, line: 103, baseType: !251, size: 64, offset: 2688)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !93)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !137, file: !136, line: 103, baseType: !254, size: 64, offset: 2752)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !137, file: !136, line: 104, baseType: !186, size: 64, offset: 2816)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !137, file: !136, line: 105, baseType: !191, size: 32, offset: 2880)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !137, file: !136, line: 106, baseType: !258, size: 128, offset: 2944)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !265)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !136, line: 64, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 61, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !261, file: !136, line: 62, baseType: !179, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !261, file: !136, line: 63, baseType: !125, size: 64, offset: 64)
!265 = !{!266}
!266 = !DISubrange(count: 2)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !137, file: !136, line: 107, baseType: !268, size: 64, offset: 3072)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, elements: !265)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !137, file: !136, line: 108, baseType: !125, size: 64, offset: 3136)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !137, file: !136, line: 109, baseType: !271, size: 64, offset: 3200)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!150, !125}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !137, file: !136, line: 111, baseType: !191, size: 32, offset: 3264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !137, file: !136, line: 112, baseType: !276, size: 320, offset: 3328)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !322)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!150, !280, !151, !125}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !283)
!283 = !{!284, !285, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !282, file: !10, line: 100, baseType: !191, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !10, line: 101, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !297, !298, !299, !303, !305, !307, !308, !309}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !288, file: !10, line: 84, baseType: !217, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !288, file: !10, line: 85, baseType: !217, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !10, line: 86, baseType: !125, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !288, file: !10, line: 87, baseType: !209, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !288, file: !10, line: 88, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !288, file: !10, line: 89, baseType: !128, size: 8, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !288, file: !10, line: 90, baseType: !217, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !288, file: !10, line: 91, baseType: !300, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !301, line: 46, baseType: !302)
!301 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!302 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !288, file: !10, line: 92, baseType: !304, size: 32, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !10, line: 93, baseType: !306, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 94, baseType: !286, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !288, file: !10, line: 95, baseType: !217, size: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !288, file: !10, line: 96, baseType: !125, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !282, file: !10, line: 102, baseType: !217, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !282, file: !10, line: 102, baseType: !217, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !282, file: !10, line: 103, baseType: !217, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !282, file: !10, line: 104, baseType: !121, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !282, file: !10, line: 106, baseType: !151, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !282, file: !10, line: 107, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!322 = !{!323}
!323 = !DISubrange(count: 5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !137, file: !136, line: 113, baseType: !325, size: 320, offset: 3648)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, elements: !322)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!150, !151, !125}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !137, file: !136, line: 114, baseType: !330, size: 320, offset: 3968)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 320, elements: !322)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !137, file: !136, line: 115, baseType: !304, size: 32, offset: 4288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !137, file: !136, line: 120, baseType: !319, size: 64, offset: 4352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !137, file: !136, line: 121, baseType: !304, size: 32, offset: 4416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !131, file: !132, line: 46, baseType: !335, size: 1536, offset: 4480)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 1536, elements: !187)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !132, line: 13, size: 1536, elements: !337)
!337 = !{!338, !342, !346, !350, !354, !355, !356, !357, !358, !359, !360, !364, !368, !369, !370, !371, !375, !379, !380, !384, !388, !389, !393, !397}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !336, file: !132, line: 15, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!150, !129, !78, !243, !125}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !336, file: !132, line: 16, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!150, !129, !78, !243, !78, !125}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !336, file: !132, line: 17, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!150, !129, !78, !78, !125}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !336, file: !132, line: 18, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!150, !129, !78, !109, !109, !125}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !336, file: !132, line: 19, baseType: !347, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !336, file: !132, line: 20, baseType: !351, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !336, file: !132, line: 21, baseType: !347, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !336, file: !132, line: 22, baseType: !347, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !336, file: !132, line: 23, baseType: !347, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !336, file: !132, line: 24, baseType: !351, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !336, file: !132, line: 25, baseType: !361, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!150, !129, !78, !109, !109, !109, !125}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !336, file: !132, line: 26, baseType: !365, size: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!150, !129, !78, !109, !125}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !336, file: !132, line: 27, baseType: !351, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !336, file: !132, line: 28, baseType: !351, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !336, file: !132, line: 29, baseType: !347, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !336, file: !132, line: 30, baseType: !372, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!150, !129, !191, !125}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !336, file: !132, line: 31, baseType: !376, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!150, !129, !125}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !336, file: !132, line: 32, baseType: !271, size: 64, offset: 1088)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !336, file: !132, line: 35, baseType: !381, size: 64, offset: 1152)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!150, !129, !78, !78}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !336, file: !132, line: 36, baseType: !385, size: 64, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!150, !129}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !336, file: !132, line: 37, baseType: !385, size: 64, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !132, line: 38, baseType: !390, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!150, !129, !158}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !336, file: !132, line: 39, baseType: !394, size: 64, offset: 1408)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!150, !280, !129}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !132, line: 40, baseType: !385, size: 64, offset: 1472)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !131, file: !132, line: 47, baseType: !125, size: 64, offset: 6016)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !131, file: !132, line: 48, baseType: !125, size: 64, offset: 6080)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !131, file: !132, line: 49, baseType: !125, size: 64, offset: 6144)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !131, file: !132, line: 50, baseType: !125, size: 64, offset: 6208)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !131, file: !132, line: 51, baseType: !125, size: 64, offset: 6272)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !131, file: !132, line: 52, baseType: !125, size: 64, offset: 6336)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !131, file: !132, line: 53, baseType: !125, size: 64, offset: 6400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !131, file: !132, line: 54, baseType: !125, size: 64, offset: 6464)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !131, file: !132, line: 55, baseType: !125, size: 64, offset: 6528)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !131, file: !132, line: 56, baseType: !125, size: 64, offset: 6592)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !131, file: !132, line: 57, baseType: !125, size: 64, offset: 6656)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !131, file: !132, line: 58, baseType: !125, size: 64, offset: 6720)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !131, file: !132, line: 59, baseType: !125, size: 64, offset: 6784)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !131, file: !132, line: 60, baseType: !125, size: 64, offset: 6848)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !131, file: !132, line: 61, baseType: !125, size: 64, offset: 6912)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !131, file: !132, line: 62, baseType: !125, size: 64, offset: 6976)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !131, file: !132, line: 63, baseType: !125, size: 64, offset: 7040)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !131, file: !132, line: 65, baseType: !416, size: 640, offset: 7104)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 640, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 10)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !131, file: !132, line: 66, baseType: !420, size: 640, offset: 7744)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 640, elements: !417)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!150, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !131, file: !132, line: 67, baseType: !426, size: 640, offset: 8384)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 640, elements: !417)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !131, file: !132, line: 68, baseType: !191, size: 32, offset: 9024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !131, file: !132, line: 69, baseType: !125, size: 64, offset: 9088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !131, file: !132, line: 70, baseType: !430, size: 32, offset: 9152)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !131, file: !132, line: 72, baseType: !304, size: 32, offset: 9184)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !132, line: 73, baseType: !125, size: 64, offset: 9216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !131, file: !132, line: 75, baseType: !78, size: 64, offset: 9280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !131, file: !132, line: 76, baseType: !78, size: 64, offset: 9344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !131, file: !132, line: 77, baseType: !78, size: 64, offset: 9408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !131, file: !132, line: 78, baseType: !78, size: 64, offset: 9472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !131, file: !132, line: 79, baseType: !78, size: 64, offset: 9536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !131, file: !132, line: 80, baseType: !78, size: 64, offset: 9600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !131, file: !132, line: 81, baseType: !78, size: 64, offset: 9664)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !131, file: !132, line: 82, baseType: !78, size: 64, offset: 9728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !131, file: !132, line: 83, baseType: !78, size: 64, offset: 9792)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !131, file: !132, line: 84, baseType: !109, size: 64, offset: 9856)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !131, file: !132, line: 85, baseType: !109, size: 64, offset: 9920)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !131, file: !132, line: 86, baseType: !109, size: 64, offset: 9984)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !131, file: !132, line: 87, baseType: !78, size: 64, offset: 10048)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !131, file: !132, line: 88, baseType: !78, size: 64, offset: 10112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !131, file: !132, line: 89, baseType: !109, size: 64, offset: 10176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !131, file: !132, line: 90, baseType: !109, size: 64, offset: 10240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !131, file: !132, line: 91, baseType: !78, size: 64, offset: 10304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !131, file: !132, line: 92, baseType: !191, size: 32, offset: 10368)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !131, file: !132, line: 93, baseType: !235, size: 64, offset: 10432)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !131, file: !132, line: 94, baseType: !235, size: 64, offset: 10496)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !131, file: !132, line: 95, baseType: !243, size: 64, offset: 10560)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !131, file: !132, line: 96, baseType: !78, size: 64, offset: 10624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !131, file: !132, line: 97, baseType: !78, size: 64, offset: 10688)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !131, file: !132, line: 98, baseType: !78, size: 64, offset: 10752)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !131, file: !132, line: 99, baseType: !109, size: 64, offset: 10816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !131, file: !132, line: 100, baseType: !109, size: 64, offset: 10880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !131, file: !132, line: 101, baseType: !109, size: 64, offset: 10944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !131, file: !132, line: 102, baseType: !109, size: 64, offset: 11008)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !131, file: !132, line: 103, baseType: !109, size: 64, offset: 11072)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !131, file: !132, line: 104, baseType: !109, size: 64, offset: 11136)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !131, file: !132, line: 105, baseType: !109, size: 64, offset: 11200)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !131, file: !132, line: 106, baseType: !109, size: 64, offset: 11264)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !131, file: !132, line: 107, baseType: !109, size: 64, offset: 11328)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !131, file: !132, line: 108, baseType: !109, size: 64, offset: 11392)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !131, file: !132, line: 109, baseType: !109, size: 64, offset: 11456)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !131, file: !132, line: 110, baseType: !116, size: 64, offset: 11520)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !131, file: !132, line: 111, baseType: !116, size: 64, offset: 11584)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !131, file: !132, line: 112, baseType: !93, size: 64, offset: 11648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !131, file: !132, line: 113, baseType: !93, size: 64, offset: 11712)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !131, file: !132, line: 114, baseType: !93, size: 64, offset: 11776)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !131, file: !132, line: 115, baseType: !93, size: 64, offset: 11840)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !131, file: !132, line: 116, baseType: !93, size: 64, offset: 11904)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !131, file: !132, line: 117, baseType: !93, size: 64, offset: 11968)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !131, file: !132, line: 119, baseType: !191, size: 32, offset: 12032)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !131, file: !132, line: 120, baseType: !191, size: 32, offset: 12064)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !131, file: !132, line: 121, baseType: !191, size: 32, offset: 12096)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !131, file: !132, line: 122, baseType: !191, size: 32, offset: 12128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !131, file: !132, line: 123, baseType: !191, size: 32, offset: 12160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !131, file: !132, line: 124, baseType: !191, size: 32, offset: 12192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !131, file: !132, line: 125, baseType: !191, size: 32, offset: 12224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !131, file: !132, line: 126, baseType: !191, size: 32, offset: 12256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !131, file: !132, line: 127, baseType: !191, size: 32, offset: 12288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !131, file: !132, line: 128, baseType: !191, size: 32, offset: 12320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !131, file: !132, line: 129, baseType: !191, size: 32, offset: 12352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !131, file: !132, line: 130, baseType: !191, size: 32, offset: 12384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !131, file: !132, line: 131, baseType: !191, size: 32, offset: 12416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !131, file: !132, line: 132, baseType: !191, size: 32, offset: 12448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !131, file: !132, line: 133, baseType: !191, size: 32, offset: 12480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !131, file: !132, line: 134, baseType: !191, size: 32, offset: 12512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !131, file: !132, line: 135, baseType: !191, size: 32, offset: 12544)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !131, file: !132, line: 137, baseType: !191, size: 32, offset: 12576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !131, file: !132, line: 138, baseType: !191, size: 32, offset: 12608)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !131, file: !132, line: 140, baseType: !496, size: 64, offset: 12672)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !497, line: 5, baseType: !498)
!497 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !497, line: 5, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !131, file: !132, line: 141, baseType: !304, size: 32, offset: 12736)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !131, file: !132, line: 142, baseType: !502, size: 64, offset: 12800)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !503, line: 22, baseType: !504)
!503 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !503, line: 22, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !131, file: !132, line: 143, baseType: !93, size: 64, offset: 12864)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !131, file: !132, line: 144, baseType: !93, size: 64, offset: 12928)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !131, file: !132, line: 146, baseType: !93, size: 64, offset: 12992)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !131, file: !132, line: 147, baseType: !93, size: 64, offset: 13056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !131, file: !132, line: 148, baseType: !93, size: 64, offset: 13120)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !131, file: !132, line: 149, baseType: !93, size: 64, offset: 13184)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !131, file: !132, line: 150, baseType: !93, size: 64, offset: 13248)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !131, file: !132, line: 151, baseType: !93, size: 64, offset: 13312)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !131, file: !132, line: 152, baseType: !93, size: 64, offset: 13376)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !131, file: !132, line: 153, baseType: !304, size: 32, offset: 13440)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !131, file: !132, line: 154, baseType: !304, size: 32, offset: 13472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !131, file: !132, line: 155, baseType: !304, size: 32, offset: 13504)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !131, file: !132, line: 156, baseType: !304, size: 32, offset: 13536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !131, file: !132, line: 157, baseType: !304, size: 32, offset: 13568)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !131, file: !132, line: 158, baseType: !304, size: 32, offset: 13600)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !131, file: !132, line: 159, baseType: !304, size: 32, offset: 13632)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !131, file: !132, line: 160, baseType: !304, size: 32, offset: 13664)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !131, file: !132, line: 161, baseType: !304, size: 32, offset: 13696)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !131, file: !132, line: 162, baseType: !304, size: 32, offset: 13728)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !131, file: !132, line: 163, baseType: !304, size: 32, offset: 13760)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !131, file: !132, line: 164, baseType: !304, size: 32, offset: 13792)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !131, file: !132, line: 165, baseType: !304, size: 32, offset: 13824)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !131, file: !132, line: 166, baseType: !304, size: 32, offset: 13856)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !131, file: !132, line: 167, baseType: !304, size: 32, offset: 13888)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !131, file: !132, line: 168, baseType: !304, size: 32, offset: 13920)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !131, file: !132, line: 169, baseType: !304, size: 32, offset: 13952)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !131, file: !132, line: 170, baseType: !304, size: 32, offset: 13984)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !131, file: !132, line: 171, baseType: !304, size: 32, offset: 14016)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !131, file: !132, line: 172, baseType: !304, size: 32, offset: 14048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !131, file: !132, line: 173, baseType: !304, size: 32, offset: 14080)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !131, file: !132, line: 174, baseType: !304, size: 32, offset: 14112)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !131, file: !132, line: 175, baseType: !304, size: 32, offset: 14144)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !131, file: !132, line: 177, baseType: !539, size: 32, offset: 14176)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !131, file: !132, line: 178, baseType: !191, size: 32, offset: 14208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !131, file: !132, line: 179, baseType: !243, size: 64, offset: 14272)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !131, file: !132, line: 180, baseType: !243, size: 64, offset: 14336)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !131, file: !132, line: 181, baseType: !243, size: 64, offset: 14400)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !131, file: !132, line: 182, baseType: !235, size: 64, offset: 14464)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !131, file: !132, line: 183, baseType: !191, size: 32, offset: 14528)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !131, file: !132, line: 184, baseType: !304, size: 32, offset: 14560)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !131, file: !132, line: 185, baseType: !304, size: 32, offset: 14592)
!548 = !{i32 7, !"Dwarf Version", i32 4}
!549 = !{i32 2, !"Debug Info Version", i32 3}
!550 = !{i32 1, !"wchar_size", i32 4}
!551 = !{i32 7, !"PIC Level", i32 2}
!552 = !{i32 7, !"uwtable", i32 1}
!553 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!554 = distinct !DISubprogram(name: "TaoSetFromOptions_SSLS", scope: !555, file: !555, line: 4, type: !395, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !556)
!555 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssls.c", directory: "/home/users/ndemeye/xSDK")
!556 = !{!557, !558, !559, !560, !561, !563, !565, !567, !569, !571}
!557 = !DILocalVariable(name: "PetscOptionsObject", arg: 1, scope: !554, file: !555, line: 4, type: !280)
!558 = !DILocalVariable(name: "tao", arg: 2, scope: !554, file: !555, line: 4, type: !129)
!559 = !DILocalVariable(name: "ssls", scope: !554, file: !555, line: 6, type: !72)
!560 = !DILocalVariable(name: "ierr", scope: !554, file: !555, line: 7, type: !150)
!561 = !DILocalVariable(name: "ierr__", scope: !562, file: !555, line: 10, type: !150)
!562 = distinct !DILexicalBlock(scope: !554, file: !555, line: 10, column: 114)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !555, line: 11, type: !150)
!564 = distinct !DILexicalBlock(scope: !554, file: !555, line: 11, column: 103)
!565 = !DILocalVariable(name: "ierr__", scope: !566, file: !555, line: 12, type: !150)
!566 = distinct !DILexicalBlock(scope: !554, file: !555, line: 12, column: 94)
!567 = !DILocalVariable(name: "ierr__", scope: !568, file: !555, line: 13, type: !150)
!568 = distinct !DILexicalBlock(scope: !554, file: !555, line: 13, column: 55)
!569 = !DILocalVariable(name: "ierr__", scope: !570, file: !555, line: 14, type: !150)
!570 = distinct !DILexicalBlock(scope: !554, file: !555, line: 14, column: 38)
!571 = !DILocalVariable(name: "ierr__", scope: !572, file: !555, line: 15, type: !150)
!572 = distinct !DILexicalBlock(scope: !554, file: !555, line: 15, column: 29)
!573 = !DILocation(line: 0, scope: !554)
!574 = !DILocation(line: 6, column: 43, scope: !554)
!575 = !{!576, !581, i64 1152}
