; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexrefine.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexrefine.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!95 = !DIEnumerator(name: "DM_REFINER_REGULAR", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "DM_REFINER_TO_BOX", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "DM_REFINER_TO_SIMPLEX", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "DM_REFINER_ALFELD2D", value: 3, isUnsigned: true)
!99 = !DIEnumerator(name: "DM_REFINER_ALFELD3D", value: 4, isUnsigned: true)
!100 = !DIEnumerator(name: "DM_REFINER_POWELL_SABIN", value: 5, isUnsigned: true)
!101 = !DIEnumerator(name: "DM_REFINER_BOUNDARYLAYER", value: 6, isUnsigned: true)
!102 = !DIEnumerator(name: "DM_REFINER_SBR", value: 7, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 85, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfetypes.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "PETSCFE_JACOBIAN", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSCFE_JACOBIAN_PRE", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSCFE_JACOBIAN_DYN", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!111 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 99, baseType: !136, size: 32, elements: !137)
!135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplex.h", directory: "/home/users/ndemeye/xSDK")
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_INVALID", value: -1)
!139 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_NONE", value: 0)
!140 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_PARTIAL", value: 1)
!141 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_MIXED", value: 2)
!142 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_FULL", value: 3)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 110, baseType: !136, size: 32, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DIEnumerator(name: "DM_ADAPT_DETERMINE", value: -1)
!146 = !DIEnumerator(name: "DM_ADAPT_KEEP", value: 0)
!147 = !DIEnumerator(name: "DM_ADAPT_REFINE", value: 1)
!148 = !DIEnumerator(name: "DM_ADAPT_COARSEN", value: 2)
!149 = !DIEnumerator(name: "DM_ADAPT_COARSEN_LAST", value: 3)
!150 = !DIEnumerator(name: "DM_ADAPT_RESERVED_COUNT", value: 4)
!151 = !{!152, !156, !157, !160, !326, !360, !215, !361, !362, !242, !136, !363, !269, !1211, !1226, !1229, !704, !1232}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !153, line: 330, baseType: !154)
!153 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !153, line: 330, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !163, line: 73, size: 4480, elements: !164)
!163 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!164 = !{!165, !167, !213, !214, !216, !219, !220, !221, !222, !230, !231, !233, !237, !241, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256, !258, !259, !261, !263, !264, !265, !266, !267, !270, !272, !273, !274, !275, !276, !279, !281, !282, !283, !293, !295, !296, !300, !301, !350, !355, !357, !358, !359}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !162, file: !163, line: 74, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !136)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !162, file: !163, line: 75, baseType: !168, size: 448, offset: 64)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 448, elements: !211)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !163, line: 53, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 45, size: 448, elements: !171)
!171 = !{!172, !178, !186, !191, !195, !199, !206}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !170, file: !163, line: 46, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !160, !177}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !136)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !170, file: !163, line: 47, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!176, !160, !182}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !183, line: 16, baseType: !184)
!183 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !183, line: 16, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !170, file: !163, line: 48, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!176, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !170, file: !163, line: 49, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!176, !160, !157, !160}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !170, file: !163, line: 50, baseType: !196, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!176, !160, !157, !190}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !170, file: !163, line: 51, baseType: !200, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!176, !160, !157, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !170, file: !163, line: 52, baseType: !207, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!176, !160, !157, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!211 = !{!212}
!212 = !DISubrange(count: 1)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !162, file: !163, line: 76, baseType: !152, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !163, line: 77, baseType: !215, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !162, file: !163, line: 78, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !218)
!218 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !162, file: !163, line: 78, baseType: !217, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !162, file: !163, line: 78, baseType: !217, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !162, file: !163, line: 78, baseType: !217, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !163, line: 79, baseType: !223, size: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !226, line: 27, baseType: !227)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !228, line: 43, baseType: !229)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!229 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !162, file: !163, line: 80, baseType: !215, size: 32, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !162, file: !163, line: 81, baseType: !232, size: 32, offset: 992)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !136)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !162, file: !163, line: 82, baseType: !234, size: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !162, file: !163, line: 83, baseType: !238, size: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !162, file: !163, line: 84, baseType: !242, size: 64, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !162, file: !163, line: 85, baseType: !242, size: 64, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !162, file: !163, line: 86, baseType: !242, size: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !162, file: !163, line: 87, baseType: !242, size: 64, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !163, line: 88, baseType: !160, size: 64, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !162, file: !163, line: 89, baseType: !223, size: 64, offset: 1472)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !163, line: 90, baseType: !242, size: 64, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !162, file: !163, line: 91, baseType: !242, size: 64, offset: 1600)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !162, file: !163, line: 92, baseType: !215, size: 32, offset: 1664)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !162, file: !163, line: 93, baseType: !156, size: 64, offset: 1728)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !163, line: 94, baseType: !253, size: 64, offset: 1792)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !162, file: !163, line: 95, baseType: !215, size: 32, offset: 1856)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !162, file: !163, line: 95, baseType: !215, size: 32, offset: 1888)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !162, file: !163, line: 96, baseType: !257, size: 64, offset: 1920)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !162, file: !163, line: 96, baseType: !257, size: 64, offset: 1984)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !162, file: !163, line: 97, baseType: !260, size: 64, offset: 2048)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !162, file: !163, line: 97, baseType: !262, size: 64, offset: 2112)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !162, file: !163, line: 98, baseType: !215, size: 32, offset: 2176)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !162, file: !163, line: 98, baseType: !215, size: 32, offset: 2208)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !162, file: !163, line: 99, baseType: !257, size: 64, offset: 2240)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !162, file: !163, line: 99, baseType: !257, size: 64, offset: 2304)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !162, file: !163, line: 100, baseType: !268, size: 64, offset: 2368)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !218)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !162, file: !163, line: 100, baseType: !271, size: 64, offset: 2432)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !162, file: !163, line: 101, baseType: !215, size: 32, offset: 2496)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !162, file: !163, line: 101, baseType: !215, size: 32, offset: 2528)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !162, file: !163, line: 102, baseType: !257, size: 64, offset: 2560)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !162, file: !163, line: 102, baseType: !257, size: 64, offset: 2624)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !162, file: !163, line: 103, baseType: !277, size: 64, offset: 2688)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !269)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !162, file: !163, line: 103, baseType: !280, size: 64, offset: 2752)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !162, file: !163, line: 104, baseType: !210, size: 64, offset: 2816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !162, file: !163, line: 105, baseType: !215, size: 32, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !162, file: !163, line: 106, baseType: !284, size: 128, offset: 2944)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !291)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !163, line: 64, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 61, size: 128, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !287, file: !163, line: 62, baseType: !203, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !287, file: !163, line: 63, baseType: !156, size: 64, offset: 64)
!291 = !{!292}
!292 = !DISubrange(count: 2)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !162, file: !163, line: 107, baseType: !294, size: 64, offset: 3072)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !291)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !162, file: !163, line: 108, baseType: !156, size: 64, offset: 3136)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !162, file: !163, line: 109, baseType: !297, size: 64, offset: 3200)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!176, !156}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !162, file: !163, line: 111, baseType: !215, size: 32, offset: 3264)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !162, file: !163, line: 112, baseType: !302, size: 320, offset: 3328)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 320, elements: !348)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!176, !306, !160, !156}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !37, line: 108, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !37, line: 99, size: 640, elements: !309)
!309 = !{!310, !311, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !308, file: !37, line: 100, baseType: !215, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !37, line: 101, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !37, line: 82, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !37, line: 83, size: 768, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !323, !324, !325, !329, !331, !333, !334, !335}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !314, file: !37, line: 84, baseType: !242, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !314, file: !37, line: 85, baseType: !242, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !37, line: 86, baseType: !156, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !314, file: !37, line: 87, baseType: !234, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !314, file: !37, line: 88, baseType: !321, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !314, file: !37, line: 89, baseType: !159, size: 8, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !314, file: !37, line: 90, baseType: !242, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !314, file: !37, line: 91, baseType: !326, size: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !327, line: 46, baseType: !328)
!327 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!328 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !37, line: 92, baseType: !330, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !314, file: !37, line: 93, baseType: !332, size: 32, offset: 544)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !37, line: 81, baseType: !36)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !37, line: 94, baseType: !312, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !314, file: !37, line: 95, baseType: !242, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !314, file: !37, line: 96, baseType: !156, size: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !37, line: 102, baseType: !242, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !308, file: !37, line: 102, baseType: !242, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !308, file: !37, line: 103, baseType: !242, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !308, file: !37, line: 104, baseType: !152, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !308, file: !37, line: 105, baseType: !330, size: 32, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !308, file: !37, line: 105, baseType: !330, size: 32, offset: 416)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !308, file: !37, line: 105, baseType: !330, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !308, file: !37, line: 106, baseType: !160, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !37, line: 107, baseType: !345, size: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !37, line: 10, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !37, line: 10, flags: DIFlagFwdDecl)
!348 = !{!349}
!349 = !DISubrange(count: 5)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !162, file: !163, line: 113, baseType: !351, size: 320, offset: 3648)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 320, elements: !348)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!176, !160, !156}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !162, file: !163, line: 114, baseType: !356, size: 320, offset: 3968)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 320, elements: !348)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !162, file: !163, line: 115, baseType: !330, size: 32, offset: 4288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !162, file: !163, line: 120, baseType: !345, size: 64, offset: 4352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !162, file: !163, line: 121, baseType: !330, size: 32, offset: 4416)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPolytopeType", file: !12, line: 148, baseType: !11)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !163, line: 130, baseType: !187)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !163, line: 131, baseType: !179)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Plex", file: !365, line: 213, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmpleximpl.h", directory: "/home/users/ndemeye/xSDK")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 124, size: 3712, elements: !367)
!367 = !{!368, !369, !475, !476, !477, !478, !479, !480, !481, !482, !483, !489, !490, !492, !493, !494, !496, !497, !498, !499, !504, !505, !506, !511, !512, !513, !514, !515, !516, !517, !518, !519, !1157, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1171, !1172, !1173, !1177, !1178, !1179, !1180, !1181, !1185, !1186, !1187, !1205, !1206, !1207, !1208, !1209, !1210}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !366, file: !365, line: 125, baseType: !215, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "coneSection", scope: !366, file: !365, line: 127, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !371, line: 18, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !374, line: 29, size: 5760, elements: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!375 = !{!376, !378, !380, !381, !382, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !398, !399, !401, !402, !404, !405, !434, !435, !436}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !373, file: !374, line: 30, baseType: !377, size: 4480)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !163, line: 122, baseType: !162)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !373, file: !374, line: 30, baseType: !379, size: 32, offset: 4480)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !211)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !373, file: !374, line: 31, baseType: !215, size: 32, offset: 4512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !373, file: !374, line: 31, baseType: !215, size: 32, offset: 4544)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !373, file: !374, line: 32, baseType: !383, size: 64, offset: 4608)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !384, line: 11, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !384, line: 11, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !373, file: !374, line: 33, baseType: !330, size: 32, offset: 4672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !373, file: !374, line: 34, baseType: !330, size: 32, offset: 4704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !373, file: !374, line: 35, baseType: !260, size: 64, offset: 4736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !373, file: !374, line: 36, baseType: !260, size: 64, offset: 4800)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !373, file: !374, line: 37, baseType: !215, size: 32, offset: 4864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !373, file: !374, line: 38, baseType: !370, size: 64, offset: 4928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !373, file: !374, line: 39, baseType: !260, size: 64, offset: 4992)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !373, file: !374, line: 40, baseType: !330, size: 32, offset: 5056)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !373, file: !374, line: 42, baseType: !215, size: 32, offset: 5088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !373, file: !374, line: 43, baseType: !397, size: 64, offset: 5120)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !373, file: !374, line: 44, baseType: !260, size: 64, offset: 5184)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !373, file: !374, line: 45, baseType: !400, size: 64, offset: 5248)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !373, file: !374, line: 46, baseType: !330, size: 32, offset: 5312)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !373, file: !374, line: 47, baseType: !403, size: 64, offset: 5376)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !373, file: !374, line: 49, baseType: !160, size: 64, offset: 5440)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !373, file: !374, line: 50, baseType: !406, size: 64, offset: 5504)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !374, line: 27, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !374, line: 27, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !374, line: 27, size: 320, elements: !410)
!410 = !{!411, !415, !416, !417, !418, !420, !427}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !409, file: !374, line: 27, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !413, line: 166, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !413, line: 139, baseType: !7)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !374, line: 27, baseType: !412, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !409, file: !374, line: 27, baseType: !412, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !409, file: !374, line: 27, baseType: !412, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !409, file: !374, line: 27, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !409, file: !374, line: 27, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !374, line: 10, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !374, line: 8, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !423, file: !374, line: 9, baseType: !215, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !374, line: 9, baseType: !215, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !409, file: !374, line: 27, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !374, line: 14, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 12, size: 128, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !430, file: !374, line: 13, baseType: !260, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !430, file: !374, line: 13, baseType: !260, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !373, file: !374, line: 51, baseType: !370, size: 64, offset: 5568)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !373, file: !374, line: 52, baseType: !383, size: 64, offset: 5632)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !373, file: !374, line: 53, baseType: !437, size: 64, offset: 5696)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !371, line: 33, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !374, line: 72, size: 4864, elements: !440)
!440 = !{!441, !442, !464, !465, !474}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !439, file: !374, line: 73, baseType: !377, size: 4480)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !439, file: !374, line: 73, baseType: !443, size: 192, offset: 4480)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 192, elements: !211)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !374, line: 56, size: 192, elements: !445)
!445 = !{!446, !456, !460}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !444, file: !374, line: 57, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!176, !437, !370, !215, !450, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !444, file: !374, line: 58, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!176, !437}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !444, file: !374, line: 59, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!176, !437, !182}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !439, file: !374, line: 74, baseType: !156, size: 64, offset: 4672)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !439, file: !374, line: 75, baseType: !466, size: 64, offset: 4736)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !374, line: 62, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !374, line: 64, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !374, line: 66, baseType: !466, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !468, file: !374, line: 67, baseType: !452, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !468, file: !374, line: 68, baseType: !453, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !468, file: !374, line: 69, baseType: !215, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !439, file: !374, line: 76, baseType: !466, size: 64, offset: 4800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "maxConeSize", scope: !366, file: !365, line: 128, baseType: !215, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cones", scope: !366, file: !365, line: 129, baseType: !260, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "coneOrientations", scope: !366, file: !365, line: 130, baseType: !260, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "supportSection", scope: !366, file: !365, line: 131, baseType: !370, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "maxSupportSize", scope: !366, file: !365, line: 132, baseType: !215, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "supports", scope: !366, file: !365, line: 133, baseType: !260, size: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "refinementUniform", scope: !366, file: !365, line: 134, baseType: !330, size: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "refinementLimit", scope: !366, file: !365, line: 135, baseType: !269, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "refinementFunc", scope: !366, file: !365, line: 136, baseType: !484, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!176, !487, !268}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !366, file: !365, line: 137, baseType: !215, size: 32, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "interpolated", scope: !366, file: !365, line: 138, baseType: !491, size: 32, offset: 736)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexInterpolatedFlag", file: !135, line: 105, baseType: !134)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "interpolatedCollective", scope: !366, file: !365, line: 139, baseType: !491, size: 32, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "facesTmp", scope: !366, file: !365, line: 141, baseType: !260, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cellRefiner", scope: !366, file: !365, line: 144, baseType: !495, size: 32, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexCellRefinerType", file: !93, line: 30, baseType: !92)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "regularRefinement", scope: !366, file: !365, line: 145, baseType: !330, size: 32, offset: 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tetgenOpts", scope: !366, file: !365, line: 148, baseType: !242, size: 64, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "triangleOpts", scope: !366, file: !365, line: 149, baseType: !242, size: 64, offset: 1024)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "partitioner", scope: !366, file: !365, line: 150, baseType: !500, size: 64, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !501, line: 13, baseType: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !501, line: 13, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "partitionBalance", scope: !366, file: !365, line: 151, baseType: !330, size: 32, offset: 1152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "remeshBd", scope: !366, file: !365, line: 152, baseType: !330, size: 32, offset: 1184)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "subpointMap", scope: !366, file: !365, line: 155, baseType: !507, size: 64, offset: 1216)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !508, line: 12, baseType: !509)
!508 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !508, line: 12, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "subpointIS", scope: !366, file: !365, line: 156, baseType: !383, size: 64, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "subpointState", scope: !366, file: !365, line: 157, baseType: !253, size: 64, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "depthState", scope: !366, file: !365, line: 160, baseType: !253, size: 64, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeState", scope: !366, file: !365, line: 161, baseType: !253, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "globalVertexNumbers", scope: !366, file: !365, line: 162, baseType: !383, size: 64, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "globalCellNumbers", scope: !366, file: !365, line: 163, baseType: !383, size: 64, offset: 1600)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "anchorSection", scope: !366, file: !365, line: 166, baseType: !370, size: 64, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "anchorIS", scope: !366, file: !365, line: 167, baseType: !383, size: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "createanchors", scope: !366, file: !365, line: 168, baseType: !520, size: 64, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!176, !523}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !12, line: 14, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !73, line: 202, size: 40000, elements: !526)
!526 = !{!527, !528, !746, !750, !751, !752, !753, !763, !764, !772, !773, !781, !782, !783, !784, !788, !789, !793, !795, !797, !798, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !826, !838, !850, !862, !871, !872, !891, !892, !893, !894, !895, !896, !898, !899, !900, !920, !921, !922, !923, !924, !925, !929, !930, !934, !935, !936, !937, !938, !939, !940, !941, !942, !945, !957, !958, !959, !968, !1056, !1057, !1145, !1146, !1147, !1148, !1150, !1152, !1153, !1154, !1155, !1156}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !525, file: !73, line: 203, baseType: !377, size: 4480)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !525, file: !73, line: 203, baseType: !529, size: 3456, offset: 4480)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 3456, elements: !211)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !73, line: 30, size: 3456, elements: !531)
!531 = !{!532, !536, !537, !542, !546, !547, !548, !549, !558, !559, !560, !566, !567, !575, !584, !593, !597, !601, !602, !607, !608, !612, !613, !617, !618, !622, !626, !631, !632, !633, !634, !635, !636, !637, !641, !645, !649, !654, !658, !669, !673, !678, !685, !689, !690, !696, !705, !709, !717, !721, !729, !733, !741, !742}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !530, file: !73, line: 31, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!176, !523, !182}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !530, file: !73, line: 32, baseType: !533, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !530, file: !73, line: 33, baseType: !538, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!176, !523, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !530, file: !73, line: 34, baseType: !543, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!176, !306, !523}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !530, file: !73, line: 35, baseType: !520, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !530, file: !73, line: 36, baseType: !520, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !530, file: !73, line: 37, baseType: !520, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !530, file: !73, line: 38, baseType: !550, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!176, !523, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !555, line: 21, baseType: !556)
!555 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !555, line: 21, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !530, file: !73, line: 39, baseType: !550, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !530, file: !73, line: 40, baseType: !520, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !530, file: !73, line: 41, baseType: !561, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!176, !523, !260, !403, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !530, file: !73, line: 42, baseType: !538, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !530, file: !73, line: 43, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!176, !523, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !12, line: 165, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !12, line: 165, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !530, file: !73, line: 45, baseType: !576, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!176, !523, !579, !580}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !52, line: 213, baseType: !51)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !384, line: 51, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !384, line: 51, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !530, file: !73, line: 46, baseType: !585, size: 64, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!176, !523, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !590, line: 16, baseType: !591)
!590 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !590, line: 16, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !530, file: !73, line: 47, baseType: !594, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!176, !523, !523, !588, !553}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !530, file: !73, line: 48, baseType: !598, size: 64, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!176, !523, !523, !588}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !530, file: !73, line: 49, baseType: !598, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !530, file: !73, line: 50, baseType: !603, size: 64, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!176, !523, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !530, file: !73, line: 51, baseType: !598, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !530, file: !73, line: 53, baseType: !609, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!176, !523, !152, !541}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !530, file: !73, line: 54, baseType: !609, size: 64, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !530, file: !73, line: 55, baseType: !614, size: 64, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!176, !523, !215, !541}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !530, file: !73, line: 56, baseType: !614, size: 64, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !530, file: !73, line: 57, baseType: !619, size: 64, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!176, !523, !507, !541}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !530, file: !73, line: 58, baseType: !623, size: 64, offset: 1600)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!176, !523, !554, !507, !541}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !530, file: !73, line: 60, baseType: !627, size: 64, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!176, !523, !554, !630, !554}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !56)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !530, file: !73, line: 61, baseType: !627, size: 64, offset: 1728)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !530, file: !73, line: 62, baseType: !627, size: 64, offset: 1792)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !530, file: !73, line: 63, baseType: !627, size: 64, offset: 1856)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !530, file: !73, line: 64, baseType: !627, size: 64, offset: 1920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !530, file: !73, line: 65, baseType: !627, size: 64, offset: 1984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !530, file: !73, line: 67, baseType: !520, size: 64, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !530, file: !73, line: 69, baseType: !638, size: 64, offset: 2112)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!176, !523, !554, !554}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !530, file: !73, line: 71, baseType: !642, size: 64, offset: 2176)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!176, !523, !215, !450, !565, !541}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !530, file: !73, line: 72, baseType: !646, size: 64, offset: 2240)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!176, !541, !215, !564, !541}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !530, file: !73, line: 73, baseType: !650, size: 64, offset: 2304)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!176, !523, !260, !403, !564, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !530, file: !73, line: 74, baseType: !655, size: 64, offset: 2368)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!176, !523, !260, !403, !564, !564, !653}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !530, file: !73, line: 75, baseType: !659, size: 64, offset: 2432)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!176, !523, !215, !541, !662, !662, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !665, line: 59, baseType: !666)
!665 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !665, line: 15, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !665, line: 15, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !530, file: !73, line: 77, baseType: !670, size: 64, offset: 2496)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!176, !523, !215, !260, !260}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !530, file: !73, line: 78, baseType: !674, size: 64, offset: 2560)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!176, !523, !554, !677, !666}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !12, line: 74, baseType: !67)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !530, file: !73, line: 79, baseType: !679, size: 64, offset: 2624)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!176, !523, !260, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !530, file: !73, line: 80, baseType: !686, size: 64, offset: 2688)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!176, !523, !268, !268}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !530, file: !73, line: 81, baseType: !686, size: 64, offset: 2752)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !530, file: !73, line: 82, baseType: !691, size: 64, offset: 2816)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!176, !523, !554, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !530, file: !73, line: 84, baseType: !697, size: 64, offset: 2880)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!176, !523, !269, !700, !704, !630, !554}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!176, !215, !269, !487, !215, !277, !156}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !530, file: !73, line: 85, baseType: !706, size: 64, offset: 2944)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!176, !523, !269, !507, !215, !450, !215, !450, !700, !704, !630, !554}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !530, file: !73, line: 86, baseType: !710, size: 64, offset: 3008)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!176, !523, !269, !554, !713, !630, !554}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !215, !215, !215, !450, !450, !454, !454, !454, !450, !450, !454, !454, !454, !269, !487, !215, !454, !277}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !530, file: !73, line: 87, baseType: !718, size: 64, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!176, !523, !269, !507, !215, !450, !215, !450, !554, !713, !630, !554}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !530, file: !73, line: 88, baseType: !722, size: 64, offset: 3136)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!176, !523, !269, !507, !215, !450, !215, !450, !554, !725, !630, !554}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !215, !215, !215, !450, !450, !454, !454, !454, !450, !450, !454, !454, !454, !269, !487, !487, !215, !454, !277}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !530, file: !73, line: 89, baseType: !730, size: 64, offset: 3200)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!176, !523, !269, !700, !704, !554, !268}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !530, file: !73, line: 90, baseType: !734, size: 64, offset: 3264)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!176, !523, !269, !737, !704, !554, !487, !268}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!176, !215, !269, !487, !487, !215, !277, !156}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !530, file: !73, line: 91, baseType: !730, size: 64, offset: 3328)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !530, file: !73, line: 93, baseType: !743, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!176, !523, !523, !606, !606}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !525, file: !73, line: 204, baseType: !747, size: 6400, offset: 7936)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 6400, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 100)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !525, file: !73, line: 204, baseType: !747, size: 6400, offset: 14336)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !525, file: !73, line: 205, baseType: !747, size: 6400, offset: 20736)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !525, file: !73, line: 205, baseType: !747, size: 6400, offset: 27136)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !525, file: !73, line: 206, baseType: !754, size: 64, offset: 33536)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !73, line: 141, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !73, line: 142, size: 256, elements: !757)
!757 = !{!758, !759, !760, !762}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !756, file: !73, line: 143, baseType: !554, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !73, line: 144, baseType: !242, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !756, file: !73, line: 145, baseType: !761, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !73, line: 140, baseType: !72)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !73, line: 146, baseType: !754, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !525, file: !73, line: 207, baseType: !754, size: 64, offset: 33600)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !525, file: !73, line: 208, baseType: !765, size: 64, offset: 33664)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !73, line: 149, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !73, line: 150, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !767, file: !73, line: 151, baseType: !326, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !767, file: !73, line: 152, baseType: !156, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !73, line: 153, baseType: !765, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !525, file: !73, line: 208, baseType: !765, size: 64, offset: 33728)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !525, file: !73, line: 209, baseType: !774, size: 64, offset: 33792)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !73, line: 163, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !73, line: 158, size: 192, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !776, file: !73, line: 159, baseType: !507, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !776, file: !73, line: 160, baseType: !330, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !73, line: 161, baseType: !775, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !525, file: !73, line: 210, baseType: !507, size: 64, offset: 33856)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !525, file: !73, line: 211, baseType: !507, size: 64, offset: 33920)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !525, file: !73, line: 212, baseType: !156, size: 64, offset: 33984)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !525, file: !73, line: 213, baseType: !785, size: 64, offset: 34048)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!176, !704}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !525, file: !73, line: 214, baseType: !579, size: 32, offset: 34112)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !525, file: !73, line: 215, baseType: !790, size: 64, offset: 34176)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !590, line: 1378, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !590, line: 1378, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !525, file: !73, line: 216, baseType: !794, size: 64, offset: 34240)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !555, line: 83, baseType: !157)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !525, file: !73, line: 217, baseType: !796, size: 64, offset: 34304)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !590, line: 25, baseType: !157)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !525, file: !73, line: 218, baseType: !215, size: 32, offset: 34368)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !525, file: !73, line: 219, baseType: !799, size: 64, offset: 34432)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !384, line: 30, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !384, line: 30, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !525, file: !73, line: 220, baseType: !330, size: 32, offset: 34496)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !525, file: !73, line: 221, baseType: !330, size: 32, offset: 34528)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !525, file: !73, line: 222, baseType: !215, size: 32, offset: 34560)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !525, file: !73, line: 222, baseType: !215, size: 32, offset: 34592)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !525, file: !73, line: 223, baseType: !330, size: 32, offset: 34624)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !525, file: !73, line: 224, baseType: !330, size: 32, offset: 34656)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !73, line: 225, baseType: !156, size: 64, offset: 34688)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !525, file: !73, line: 227, baseType: !523, size: 64, offset: 34752)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !525, file: !73, line: 228, baseType: !523, size: 64, offset: 34816)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !525, file: !73, line: 229, baseType: !812, size: 64, offset: 34880)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !73, line: 100, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !73, line: 101, size: 256, elements: !815)
!815 = !{!816, !820, !824, !825}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !814, file: !73, line: 102, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!176, !523, !523, !156}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !814, file: !73, line: 103, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!176, !523, !589, !554, !589, !523, !156}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !814, file: !73, line: 104, baseType: !156, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !73, line: 105, baseType: !812, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !525, file: !73, line: 230, baseType: !827, size: 64, offset: 34944)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !73, line: 108, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !73, line: 109, size: 256, elements: !830)
!830 = !{!831, !832, !836, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !829, file: !73, line: 110, baseType: !817, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !829, file: !73, line: 111, baseType: !833, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!176, !523, !589, !523, !156}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !829, file: !73, line: 112, baseType: !156, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !73, line: 113, baseType: !827, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !525, file: !73, line: 231, baseType: !839, size: 64, offset: 35008)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !73, line: 116, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !73, line: 117, size: 256, elements: !842)
!842 = !{!843, !844, !848, !849}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !841, file: !73, line: 118, baseType: !817, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !841, file: !73, line: 119, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!176, !523, !664, !664, !523, !156}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !841, file: !73, line: 120, baseType: !156, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !73, line: 121, baseType: !839, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !525, file: !73, line: 232, baseType: !851, size: 64, offset: 35072)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !73, line: 124, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !73, line: 125, size: 256, elements: !854)
!854 = !{!855, !859, !860, !861}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !853, file: !73, line: 126, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!176, !523, !554, !630, !554, !156}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !853, file: !73, line: 127, baseType: !856, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !853, file: !73, line: 128, baseType: !156, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !73, line: 129, baseType: !851, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !525, file: !73, line: 233, baseType: !863, size: 64, offset: 35136)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !73, line: 132, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !73, line: 133, size: 256, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !865, file: !73, line: 134, baseType: !856, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !865, file: !73, line: 135, baseType: !856, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !865, file: !73, line: 136, baseType: !156, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !865, file: !73, line: 137, baseType: !863, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !525, file: !73, line: 235, baseType: !215, size: 32, offset: 35200)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !525, file: !73, line: 237, baseType: !873, size: 64, offset: 35264)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !73, line: 27, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !73, line: 27, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !73, line: 27, size: 320, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !890}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !876, file: !73, line: 27, baseType: !412, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !876, file: !73, line: 27, baseType: !412, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !876, file: !73, line: 27, baseType: !412, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !876, file: !73, line: 27, baseType: !412, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !876, file: !73, line: 27, baseType: !419, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !876, file: !73, line: 27, baseType: !884, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !73, line: 21, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !73, line: 17, size: 128, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !886, file: !73, line: 19, baseType: !507, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !886, file: !73, line: 20, baseType: !215, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !876, file: !73, line: 27, baseType: !553, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !525, file: !73, line: 239, baseType: !666, size: 64, offset: 35328)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !525, file: !73, line: 240, baseType: !666, size: 64, offset: 35392)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !525, file: !73, line: 241, baseType: !666, size: 64, offset: 35456)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !525, file: !73, line: 242, baseType: !666, size: 64, offset: 35520)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !525, file: !73, line: 243, baseType: !330, size: 32, offset: 35584)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !525, file: !73, line: 245, baseType: !897, size: 64, offset: 35616)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !291)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !525, file: !73, line: 246, baseType: !370, size: 64, offset: 35712)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !525, file: !73, line: 247, baseType: !370, size: 64, offset: 35776)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !525, file: !73, line: 248, baseType: !901, size: 64, offset: 35840)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !384, line: 60, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !52, line: 240, size: 640, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !903, file: !52, line: 241, baseType: !152, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !903, file: !52, line: 242, baseType: !232, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !903, file: !52, line: 243, baseType: !215, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !903, file: !52, line: 243, baseType: !215, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !903, file: !52, line: 244, baseType: !215, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !903, file: !52, line: 244, baseType: !215, size: 32, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !903, file: !52, line: 245, baseType: !260, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !903, file: !52, line: 246, baseType: !330, size: 32, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !903, file: !52, line: 247, baseType: !215, size: 32, offset: 352)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !903, file: !52, line: 251, baseType: !215, size: 32, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !903, file: !52, line: 252, baseType: !799, size: 64, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !903, file: !52, line: 253, baseType: !330, size: 32, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !903, file: !52, line: 254, baseType: !215, size: 32, offset: 544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !903, file: !52, line: 254, baseType: !215, size: 32, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !903, file: !52, line: 255, baseType: !215, size: 32, offset: 608)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !525, file: !73, line: 250, baseType: !370, size: 64, offset: 35904)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !525, file: !73, line: 251, baseType: !589, size: 64, offset: 35968)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !525, file: !73, line: 253, baseType: !523, size: 64, offset: 36032)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !525, file: !73, line: 254, baseType: !554, size: 64, offset: 36096)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !525, file: !73, line: 255, baseType: !156, size: 64, offset: 36160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !525, file: !73, line: 256, baseType: !926, size: 64, offset: 36224)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!176, !523, !156}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !525, file: !73, line: 257, baseType: !926, size: 64, offset: 36288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !525, file: !73, line: 258, baseType: !931, size: 64, offset: 36352)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!176, !523, !487, !330, !453, !156}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !525, file: !73, line: 260, baseType: !215, size: 32, offset: 36416)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !525, file: !73, line: 261, baseType: !523, size: 64, offset: 36480)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !525, file: !73, line: 262, baseType: !554, size: 64, offset: 36544)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !525, file: !73, line: 263, baseType: !554, size: 64, offset: 36608)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !525, file: !73, line: 264, baseType: !330, size: 32, offset: 36672)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !525, file: !73, line: 265, baseType: !572, size: 64, offset: 36736)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !525, file: !73, line: 266, baseType: !268, size: 64, offset: 36800)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !525, file: !73, line: 266, baseType: !268, size: 64, offset: 36864)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !525, file: !73, line: 267, baseType: !943, size: 64, offset: 36928)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !12, line: 42, baseType: !77)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !525, file: !73, line: 269, baseType: !946, size: 640, offset: 36992)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 640, elements: !955)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !73, line: 15, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!176, !523, !215, !215, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !590, line: 1723, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !590, line: 1723, flags: DIFlagFwdDecl)
!955 = !{!956}
!956 = !DISubrange(count: 10)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !525, file: !73, line: 270, baseType: !946, size: 640, offset: 37632)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !525, file: !73, line: 272, baseType: !215, size: 32, offset: 38272)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !525, file: !73, line: 273, baseType: !960, size: 64, offset: 38336)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !73, line: 178, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !73, line: 173, size: 256, elements: !963)
!963 = !{!964, !965, !966, !967}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !962, file: !73, line: 174, baseType: !160, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !962, file: !73, line: 175, baseType: !507, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !962, file: !73, line: 176, baseType: !897, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !962, file: !73, line: 177, baseType: !330, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !525, file: !73, line: 274, baseType: !969, size: 64, offset: 38400)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !73, line: 165, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !73, line: 167, size: 192, elements: !972)
!972 = !{!973, !1054, !1055}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !971, file: !73, line: 168, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !975, line: 11, baseType: !976)
!975 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !975, line: 13, size: 832, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !1045, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !975, line: 14, baseType: !157, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !977, file: !975, line: 15, baseType: !507, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !977, file: !975, line: 16, baseType: !157, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !977, file: !975, line: 17, baseType: !215, size: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !977, file: !975, line: 18, baseType: !260, size: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !977, file: !975, line: 19, baseType: !985, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !986, line: 22, baseType: !987)
!986 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !975, line: 81, size: 4992, elements: !989)
!989 = !{!990, !991, !1005, !1006, !1007, !1016}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !988, file: !975, line: 82, baseType: !377, size: 4480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !988, file: !975, line: 82, baseType: !992, size: 256, offset: 4480)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 256, elements: !211)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !975, line: 74, size: 256, elements: !994)
!994 = !{!995, !999, !1000, !1004}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !993, file: !975, line: 75, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!176, !985}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !993, file: !975, line: 76, baseType: !996, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !993, file: !975, line: 77, baseType: !1001, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!176, !985, !182}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !993, file: !975, line: 78, baseType: !996, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !988, file: !975, line: 83, baseType: !156, size: 64, offset: 4736)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !988, file: !975, line: 85, baseType: !215, size: 32, offset: 4800)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !988, file: !975, line: 86, baseType: !1008, size: 64, offset: 4864)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !975, line: 41, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !975, line: 36, size: 256, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !975, line: 37, baseType: !326, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1010, file: !975, line: 38, baseType: !326, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !1010, file: !975, line: 39, baseType: !326, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1010, file: !975, line: 40, baseType: !242, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !988, file: !975, line: 87, baseType: !1017, size: 64, offset: 4928)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !975, line: 54, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !975, line: 54, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !975, line: 54, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1037}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1021, file: !975, line: 54, baseType: !412, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1021, file: !975, line: 54, baseType: !412, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1021, file: !975, line: 54, baseType: !412, size: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1021, file: !975, line: 54, baseType: !412, size: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1021, file: !975, line: 54, baseType: !419, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1021, file: !975, line: 54, baseType: !1029, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !986, line: 41, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !986, line: 35, size: 192, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1031, file: !986, line: 37, baseType: !507, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1031, file: !986, line: 38, baseType: !215, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1031, file: !986, line: 39, baseType: !215, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1031, file: !986, line: 40, baseType: !215, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1021, file: !975, line: 54, baseType: !1038, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !975, line: 34, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !975, line: 30, size: 96, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1040, file: !975, line: 31, baseType: !215, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1040, file: !975, line: 32, baseType: !215, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1040, file: !975, line: 33, baseType: !215, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !977, file: !975, line: 20, baseType: !1046, size: 32, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !12, line: 60, baseType: !84)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !977, file: !975, line: 21, baseType: !215, size: 32, offset: 416)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !977, file: !975, line: 22, baseType: !215, size: 32, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !977, file: !975, line: 23, baseType: !260, size: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !977, file: !975, line: 24, baseType: !203, size: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !977, file: !975, line: 25, baseType: !203, size: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !977, file: !975, line: 26, baseType: !156, size: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !975, line: 27, baseType: !974, size: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !971, file: !73, line: 169, baseType: !507, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !73, line: 170, baseType: !969, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !525, file: !73, line: 275, baseType: !215, size: 32, offset: 38464)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !525, file: !73, line: 276, baseType: !1058, size: 64, offset: 38528)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !73, line: 184, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !73, line: 180, size: 192, elements: !1061)
!1061 = !{!1062, !1143, !1144}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1060, file: !73, line: 181, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !986, line: 13, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !975, line: 98, size: 7232, elements: !1066)
!1066 = !{!1067, !1068, !1082, !1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1099, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1065, file: !975, line: 99, baseType: !377, size: 4480)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1065, file: !975, line: 99, baseType: !1069, size: 256, offset: 4480)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 256, elements: !211)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !975, line: 91, size: 256, elements: !1071)
!1071 = !{!1072, !1076, !1077, !1081}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1070, file: !975, line: 92, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!176, !1063}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1070, file: !975, line: 93, baseType: !1073, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1070, file: !975, line: 94, baseType: !1078, size: 64, offset: 128)
