; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/blockmat/seq/blockmat.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/blockmat/seq/blockmat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 663, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 119, baseType: !7, size: 32, elements: !304)
!303 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!305 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!347 = !{!348, !412, !492, !433, !409, !1427, !566, !1428, !482, !1430, !1416, !458, !520}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_BlockMat", file: !350, line: 15, baseType: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/blockmat/seq/blockmat.c", directory: "/home/users/ndemeye/xSDK")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 9, size: 2560, elements: !352)
!352 = !{!353, !355, !357, !358, !359, !360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !380, !381, !382, !383, !384, !385, !386, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !351, file: !350, line: 10, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 416)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 480)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 544)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !351, file: !350, line: 10, baseType: !372, size: 192, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !373, line: 407, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 402, size: 192, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !374, file: !373, line: 403, baseType: !354, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !374, file: !373, line: 404, baseType: !356, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !374, file: !373, line: 405, baseType: !361, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !374, file: !373, line: 406, baseType: !361, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !351, file: !350, line: 10, baseType: !361, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !351, file: !350, line: 10, baseType: !356, size: 32, offset: 1088)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !351, file: !350, line: 10, baseType: !354, size: 32, offset: 1120)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !351, file: !350, line: 10, baseType: !387, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !373, line: 436, size: 23424, elements: !391)
!391 = !{!392, !599, !1105, !1125, !1126, !1127, !1129, !1130, !1131, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1258, !1259, !1275, !1276, !1277, !1278, !1279, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1314, !1334, !1335, !1337, !1338, !1339, !1340, !1341, !1342, !1360, !1361}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !390, file: !373, line: 437, baseType: !393, size: 4480)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !394, line: 122, baseType: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !394, line: 73, size: 4480, elements: !396)
!396 = !{!397, !399, !454, !455, !456, !459, !460, !461, !462, !470, !471, !473, !477, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !495, !496, !497, !499, !500, !501, !503, !504, !505, !506, !507, !510, !512, !513, !514, !515, !516, !519, !521, !522, !523, !533, !535, !536, !540, !541, !589, !594, !596, !597, !598}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !395, file: !394, line: 74, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !395, file: !394, line: 75, baseType: !400, size: 448, offset: 64)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 448, elements: !452)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !394, line: 53, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 45, size: 448, elements: !403)
!403 = !{!404, !416, !424, !429, !436, !440, !447}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !402, file: !394, line: 46, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !409, !411}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !413, line: 330, baseType: !414)
!413 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !413, line: 330, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !402, file: !394, line: 47, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!408, !409, !420}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !421, line: 16, baseType: !422)
!421 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !421, line: 16, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !402, file: !394, line: 48, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!408, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !402, file: !394, line: 49, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!408, !409, !433, !409}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !402, file: !394, line: 50, baseType: !437, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!408, !409, !433, !428}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !402, file: !394, line: 51, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!408, !409, !433, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !402, file: !394, line: 52, baseType: !448, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!408, !409, !433, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!452 = !{!453}
!453 = !DISubrange(count: 1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !395, file: !394, line: 76, baseType: !412, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !394, line: 77, baseType: !356, size: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !395, file: !394, line: 78, baseType: !457, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !458)
!458 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !395, file: !394, line: 78, baseType: !457, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !395, file: !394, line: 78, baseType: !457, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !395, file: !394, line: 78, baseType: !457, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !395, file: !394, line: 79, baseType: !463, size: 64, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !466, line: 27, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !468, line: 43, baseType: !469)
!468 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!469 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !395, file: !394, line: 80, baseType: !356, size: 32, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !395, file: !394, line: 81, baseType: !472, size: 32, offset: 992)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !395, file: !394, line: 82, baseType: !474, size: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !395, file: !394, line: 83, baseType: !478, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !395, file: !394, line: 84, baseType: !482, size: 64, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !395, file: !394, line: 85, baseType: !482, size: 64, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !395, file: !394, line: 86, baseType: !482, size: 64, offset: 1280)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !395, file: !394, line: 87, baseType: !482, size: 64, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !395, file: !394, line: 88, baseType: !409, size: 64, offset: 1408)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !395, file: !394, line: 89, baseType: !463, size: 64, offset: 1472)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !394, line: 90, baseType: !482, size: 64, offset: 1536)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !395, file: !394, line: 91, baseType: !482, size: 64, offset: 1600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !395, file: !394, line: 92, baseType: !356, size: 32, offset: 1664)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !395, file: !394, line: 93, baseType: !492, size: 64, offset: 1728)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !395, file: !394, line: 94, baseType: !494, size: 64, offset: 1792)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !464)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !395, file: !394, line: 95, baseType: !356, size: 32, offset: 1856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !395, file: !394, line: 95, baseType: !356, size: 32, offset: 1888)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !395, file: !394, line: 96, baseType: !498, size: 64, offset: 1920)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !395, file: !394, line: 96, baseType: !498, size: 64, offset: 1984)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !395, file: !394, line: 97, baseType: !361, size: 64, offset: 2048)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !395, file: !394, line: 97, baseType: !502, size: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !395, file: !394, line: 98, baseType: !356, size: 32, offset: 2176)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !395, file: !394, line: 98, baseType: !356, size: 32, offset: 2208)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !395, file: !394, line: 99, baseType: !498, size: 64, offset: 2240)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !395, file: !394, line: 99, baseType: !498, size: 64, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !395, file: !394, line: 100, baseType: !508, size: 64, offset: 2368)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !458)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !395, file: !394, line: 100, baseType: !511, size: 64, offset: 2432)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !395, file: !394, line: 101, baseType: !356, size: 32, offset: 2496)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !395, file: !394, line: 101, baseType: !356, size: 32, offset: 2528)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !395, file: !394, line: 102, baseType: !498, size: 64, offset: 2560)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !395, file: !394, line: 102, baseType: !498, size: 64, offset: 2624)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !395, file: !394, line: 103, baseType: !517, size: 64, offset: 2688)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !509)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !395, file: !394, line: 103, baseType: !520, size: 64, offset: 2752)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !395, file: !394, line: 104, baseType: !451, size: 64, offset: 2816)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !395, file: !394, line: 105, baseType: !356, size: 32, offset: 2880)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !395, file: !394, line: 106, baseType: !524, size: 128, offset: 2944)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 128, elements: !531)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !394, line: 64, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 61, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !527, file: !394, line: 62, baseType: !444, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !527, file: !394, line: 63, baseType: !492, size: 64, offset: 64)
!531 = !{!532}
!532 = !DISubrange(count: 2)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !395, file: !394, line: 107, baseType: !534, size: 64, offset: 3072)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 64, elements: !531)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !395, file: !394, line: 108, baseType: !492, size: 64, offset: 3136)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !395, file: !394, line: 109, baseType: !537, size: 64, offset: 3200)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!408, !492}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !395, file: !394, line: 111, baseType: !356, size: 32, offset: 3264)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !395, file: !394, line: 112, baseType: !542, size: 320, offset: 3328)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 320, elements: !587)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!408, !546, !409, !492}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !549)
!549 = !{!550, !551, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !548, file: !12, line: 100, baseType: !356, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !12, line: 101, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !563, !564, !565, !569, !570, !572, !573, !574}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !554, file: !12, line: 84, baseType: !482, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !554, file: !12, line: 85, baseType: !482, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !12, line: 86, baseType: !492, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !554, file: !12, line: 87, baseType: !474, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !554, file: !12, line: 88, baseType: !561, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !554, file: !12, line: 89, baseType: !435, size: 8, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !554, file: !12, line: 90, baseType: !482, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !554, file: !12, line: 91, baseType: !566, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !567, line: 46, baseType: !568)
!567 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!568 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !554, file: !12, line: 92, baseType: !354, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !554, file: !12, line: 93, baseType: !571, size: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !12, line: 94, baseType: !552, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !554, file: !12, line: 95, baseType: !482, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !554, file: !12, line: 96, baseType: !492, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !548, file: !12, line: 102, baseType: !482, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !548, file: !12, line: 102, baseType: !482, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !548, file: !12, line: 103, baseType: !482, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !548, file: !12, line: 104, baseType: !412, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !548, file: !12, line: 105, baseType: !354, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !548, file: !12, line: 105, baseType: !354, size: 32, offset: 416)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !548, file: !12, line: 105, baseType: !354, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !548, file: !12, line: 106, baseType: !409, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !548, file: !12, line: 107, baseType: !584, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!587 = !{!588}
!588 = !DISubrange(count: 5)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !395, file: !394, line: 113, baseType: !590, size: 320, offset: 3648)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 320, elements: !587)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!408, !409, !492}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !395, file: !394, line: 114, baseType: !595, size: 320, offset: 3968)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 320, elements: !587)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !395, file: !394, line: 115, baseType: !354, size: 32, offset: 4288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !395, file: !394, line: 120, baseType: !584, size: 64, offset: 4352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !395, file: !394, line: 121, baseType: !354, size: 32, offset: 4416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !390, file: !373, line: 437, baseType: !600, size: 9472, offset: 4480)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 9472, elements: !452)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !373, line: 32, size: 9472, elements: !602)
!602 = !{!603, !612, !616, !617, !624, !628, !629, !630, !631, !632, !633, !634, !658, !662, !667, !672, !691, !696, !700, !701, !706, !711, !712, !717, !721, !725, !729, !733, !737, !738, !739, !740, !741, !745, !746, !751, !752, !753, !754, !755, !760, !767, !772, !776, !780, !784, !788, !789, !793, !794, !801, !806, !807, !808, !809, !871, !879, !880, !884, !885, !889, !890, !894, !899, !900, !904, !908, !915, !916, !917, !918, !919, !920, !925, !926, !930, !934, !938, !939, !940, !944, !954, !955, !959, !960, !964, !965, !969, !970, !975, !976, !980, !984, !985, !986, !987, !988, !989, !990, !994, !995, !996, !997, !998, !999, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1014, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1041, !1045, !1046, !1050, !1051, !1052, !1053, !1079, !1083, !1084, !1085, !1086, !1087, !1091, !1092, !1093, !1094, !1095, !1099, !1103, !1104}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !601, file: !373, line: 34, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!408, !388, !356, !607, !356, !607, !609, !611}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !601, file: !373, line: 35, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!408, !388, !356, !361, !502, !520}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !601, file: !373, line: 36, baseType: !613, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !601, file: !373, line: 37, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!408, !388, !621, !621}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !601, file: !373, line: 38, baseType: !625, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!408, !388, !621, !621, !621}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !601, file: !373, line: 40, baseType: !618, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !601, file: !373, line: 41, baseType: !625, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !601, file: !373, line: 42, baseType: !618, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !601, file: !373, line: 43, baseType: !625, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !601, file: !373, line: 44, baseType: !618, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !601, file: !373, line: 46, baseType: !625, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !601, file: !373, line: 47, baseType: !635, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!408, !388, !638, !638, !642}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !639, line: 11, baseType: !640)
!639 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !639, line: 11, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !645, file: !38, line: 1227, baseType: !509, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !645, file: !38, line: 1228, baseType: !509, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !645, file: !38, line: 1229, baseType: !509, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !645, file: !38, line: 1230, baseType: !509, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !645, file: !38, line: 1231, baseType: !509, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !645, file: !38, line: 1232, baseType: !509, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !645, file: !38, line: 1233, baseType: !509, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !645, file: !38, line: 1234, baseType: !509, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !645, file: !38, line: 1236, baseType: !509, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !645, file: !38, line: 1237, baseType: !509, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !645, file: !38, line: 1238, baseType: !509, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !601, file: !373, line: 48, baseType: !659, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!408, !388, !638, !642}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !601, file: !373, line: 49, baseType: !663, size: 64, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!408, !388, !621, !509, !666, !509, !356, !356, !621}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !601, file: !373, line: 50, baseType: !668, size: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!408, !388, !671, !387}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !601, file: !373, line: 52, baseType: !673, size: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!408, !388, !676, !677}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !679, file: !38, line: 593, baseType: !457, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !679, file: !38, line: 594, baseType: !457, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !679, file: !38, line: 594, baseType: !457, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !679, file: !38, line: 594, baseType: !457, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !679, file: !38, line: 595, baseType: !457, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !679, file: !38, line: 596, baseType: !457, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !679, file: !38, line: 597, baseType: !457, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !679, file: !38, line: 598, baseType: !457, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !679, file: !38, line: 598, baseType: !457, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !679, file: !38, line: 599, baseType: !457, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !601, file: !373, line: 53, baseType: !692, size: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!408, !388, !388, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !601, file: !373, line: 54, baseType: !697, size: 64, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!408, !388, !621}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !601, file: !373, line: 55, baseType: !618, size: 64, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !601, file: !373, line: 56, baseType: !702, size: 64, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!408, !388, !705, !508}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !601, file: !373, line: 58, baseType: !707, size: 64, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!408, !388, !710}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !601, file: !373, line: 59, baseType: !707, size: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !601, file: !373, line: 60, baseType: !713, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!408, !388, !716, !354}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !601, file: !373, line: 61, baseType: !718, size: 64, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!408, !388}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !601, file: !373, line: 63, baseType: !722, size: 64, offset: 1536)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!408, !388, !356, !607, !518, !621, !621}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !601, file: !373, line: 64, baseType: !726, size: 64, offset: 1600)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!408, !388, !388, !638, !638, !642}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !601, file: !373, line: 65, baseType: !730, size: 64, offset: 1664)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!408, !388, !388, !642}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !601, file: !373, line: 66, baseType: !734, size: 64, offset: 1728)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!408, !388, !388, !638, !642}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !601, file: !373, line: 67, baseType: !730, size: 64, offset: 1792)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !601, file: !373, line: 69, baseType: !718, size: 64, offset: 1856)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !601, file: !373, line: 70, baseType: !726, size: 64, offset: 1920)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !601, file: !373, line: 71, baseType: !734, size: 64, offset: 1984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !601, file: !373, line: 72, baseType: !742, size: 64, offset: 2048)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!408, !388, !387}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !601, file: !373, line: 73, baseType: !718, size: 64, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !601, file: !373, line: 75, baseType: !747, size: 64, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!408, !388, !750, !387}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !601, file: !373, line: 76, baseType: !618, size: 64, offset: 2240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !601, file: !373, line: 77, baseType: !618, size: 64, offset: 2304)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !601, file: !373, line: 78, baseType: !635, size: 64, offset: 2368)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !601, file: !373, line: 79, baseType: !659, size: 64, offset: 2432)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !601, file: !373, line: 81, baseType: !756, size: 64, offset: 2496)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!408, !388, !518, !388, !759}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !601, file: !373, line: 82, baseType: !761, size: 64, offset: 2560)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!408, !388, !356, !764, !764, !671, !766}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !601, file: !373, line: 83, baseType: !768, size: 64, offset: 2624)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!408, !388, !356, !771, !356}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !601, file: !373, line: 84, baseType: !773, size: 64, offset: 2688)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!408, !388, !356, !607, !356, !607, !517}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !601, file: !373, line: 85, baseType: !777, size: 64, offset: 2752)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!408, !388, !388, !759}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !601, file: !373, line: 87, baseType: !781, size: 64, offset: 2816)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!408, !388, !621, !361}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !601, file: !373, line: 88, baseType: !785, size: 64, offset: 2880)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!408, !388, !518}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !601, file: !373, line: 89, baseType: !785, size: 64, offset: 2944)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !601, file: !373, line: 90, baseType: !790, size: 64, offset: 3008)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!408, !388, !621, !611}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !601, file: !373, line: 91, baseType: !722, size: 64, offset: 3072)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !601, file: !373, line: 93, baseType: !795, size: 64, offset: 3136)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!408, !388, !798}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !601, file: !373, line: 94, baseType: !802, size: 64, offset: 3200)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!408, !388, !356, !354, !354, !361, !805, !805, !695}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !601, file: !373, line: 95, baseType: !802, size: 64, offset: 3264)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !601, file: !373, line: 96, baseType: !802, size: 64, offset: 3328)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !601, file: !373, line: 97, baseType: !802, size: 64, offset: 3392)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !601, file: !373, line: 99, baseType: !810, size: 64, offset: 3456)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!408, !388, !813, !816}
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !639, line: 51, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !639, line: 51, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !373, line: 609, size: 6208, elements: !819)
!819 = !{!820, !821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !840, !847, !848, !849, !850, !851, !852, !853, !854, !858, !859, !860, !861, !862, !864, !865, !866, !867, !868, !869, !870}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !818, file: !373, line: 610, baseType: !393, size: 4480)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !818, file: !373, line: 610, baseType: !822, size: 32, offset: 4480)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !452)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !818, file: !373, line: 611, baseType: !356, size: 32, offset: 4512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !818, file: !373, line: 611, baseType: !356, size: 32, offset: 4544)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !818, file: !373, line: 611, baseType: !356, size: 32, offset: 4576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !818, file: !373, line: 612, baseType: !356, size: 32, offset: 4608)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !818, file: !373, line: 613, baseType: !356, size: 32, offset: 4640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !818, file: !373, line: 614, baseType: !361, size: 64, offset: 4672)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !818, file: !373, line: 615, baseType: !502, size: 64, offset: 4736)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !818, file: !373, line: 616, baseType: !771, size: 64, offset: 4800)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !818, file: !373, line: 617, baseType: !361, size: 64, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !818, file: !373, line: 618, baseType: !833, size: 64, offset: 4928)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !373, line: 602, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 598, size: 128, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !835, file: !373, line: 599, baseType: !356, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !835, file: !373, line: 600, baseType: !356, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !835, file: !373, line: 601, baseType: !517, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !818, file: !373, line: 619, baseType: !841, size: 64, offset: 4992)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !373, line: 607, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 604, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !843, file: !373, line: 605, baseType: !356, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !843, file: !373, line: 606, baseType: !517, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !818, file: !373, line: 620, baseType: !517, size: 64, offset: 5056)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !818, file: !373, line: 621, baseType: !509, size: 64, offset: 5120)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !818, file: !373, line: 622, baseType: !509, size: 64, offset: 5184)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !818, file: !373, line: 623, baseType: !621, size: 64, offset: 5248)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !818, file: !373, line: 623, baseType: !621, size: 64, offset: 5312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !818, file: !373, line: 623, baseType: !621, size: 64, offset: 5376)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !818, file: !373, line: 624, baseType: !354, size: 32, offset: 5440)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !818, file: !373, line: 625, baseType: !855, size: 64, offset: 5504)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!408}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !818, file: !373, line: 626, baseType: !492, size: 64, offset: 5568)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !818, file: !373, line: 627, baseType: !621, size: 64, offset: 5632)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !818, file: !373, line: 628, baseType: !356, size: 32, offset: 5696)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !818, file: !373, line: 629, baseType: !433, size: 64, offset: 5760)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !818, file: !373, line: 630, baseType: !863, size: 32, offset: 5824)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !818, file: !373, line: 631, baseType: !356, size: 32, offset: 5856)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !818, file: !373, line: 631, baseType: !356, size: 32, offset: 5888)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !818, file: !373, line: 632, baseType: !354, size: 32, offset: 5920)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !818, file: !373, line: 633, baseType: !354, size: 32, offset: 5952)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !818, file: !373, line: 634, baseType: !444, size: 64, offset: 6016)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !818, file: !373, line: 634, baseType: !492, size: 64, offset: 6080)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !818, file: !373, line: 635, baseType: !463, size: 64, offset: 6144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !601, file: !373, line: 100, baseType: !872, size: 64, offset: 3520)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!408, !388, !356, !356, !875, !878}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !877)
!877 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !601, file: !373, line: 101, baseType: !718, size: 64, offset: 3584)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !601, file: !373, line: 102, baseType: !881, size: 64, offset: 3648)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!408, !388, !638, !638, !387}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !601, file: !373, line: 103, baseType: !604, size: 64, offset: 3712)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !601, file: !373, line: 105, baseType: !886, size: 64, offset: 3776)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!408, !388, !638, !638, !671, !387}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !601, file: !373, line: 106, baseType: !718, size: 64, offset: 3840)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !601, file: !373, line: 107, baseType: !891, size: 64, offset: 3904)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!408, !388, !420}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !601, file: !373, line: 108, baseType: !895, size: 64, offset: 3968)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!408, !388, !898, !671, !387}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !433)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !601, file: !373, line: 109, baseType: !855, size: 64, offset: 4032)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !601, file: !373, line: 111, baseType: !901, size: 64, offset: 4096)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!408, !388, !388, !388, !509, !388}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !601, file: !373, line: 112, baseType: !905, size: 64, offset: 4160)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!408, !388, !388, !388, !388}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !601, file: !373, line: 113, baseType: !909, size: 64, offset: 4224)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!408, !388, !912, !912}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !639, line: 30, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !639, line: 30, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !601, file: !373, line: 114, baseType: !604, size: 64, offset: 4288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !601, file: !373, line: 115, baseType: !722, size: 64, offset: 4352)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !601, file: !373, line: 117, baseType: !781, size: 64, offset: 4416)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !601, file: !373, line: 118, baseType: !781, size: 64, offset: 4480)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !601, file: !373, line: 119, baseType: !895, size: 64, offset: 4544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !601, file: !373, line: 120, baseType: !921, size: 64, offset: 4608)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!408, !388, !924, !695}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !601, file: !373, line: 121, baseType: !855, size: 64, offset: 4672)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !601, file: !373, line: 123, baseType: !927, size: 64, offset: 4736)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!408, !388, !356, !492}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !601, file: !373, line: 124, baseType: !931, size: 64, offset: 4800)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!408, !388, !816, !621, !492}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !601, file: !373, line: 125, baseType: !935, size: 64, offset: 4864)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!408, !546, !388}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !601, file: !373, line: 126, baseType: !618, size: 64, offset: 4928)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !601, file: !373, line: 127, baseType: !618, size: 64, offset: 4992)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !601, file: !373, line: 129, baseType: !941, size: 64, offset: 5056)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!408, !388, !771}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !601, file: !373, line: 130, baseType: !945, size: 64, offset: 5120)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!408, !388, !948, !948}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !950, file: !62, line: 653, baseType: !356, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !950, file: !62, line: 653, baseType: !621, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !601, file: !373, line: 131, baseType: !945, size: 64, offset: 5184)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !601, file: !373, line: 132, baseType: !956, size: 64, offset: 5248)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!408, !388, !361, !361, !361}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !601, file: !373, line: 133, baseType: !891, size: 64, offset: 5312)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !601, file: !373, line: 135, baseType: !961, size: 64, offset: 5376)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!408, !388, !509, !695}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !601, file: !373, line: 136, baseType: !961, size: 64, offset: 5440)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !601, file: !373, line: 137, baseType: !966, size: 64, offset: 5504)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!408, !388, !695}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !601, file: !373, line: 138, baseType: !604, size: 64, offset: 5568)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !601, file: !373, line: 139, baseType: !971, size: 64, offset: 5632)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!408, !388, !974, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !601, file: !373, line: 141, baseType: !855, size: 64, offset: 5696)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !601, file: !373, line: 142, baseType: !977, size: 64, offset: 5760)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!408, !388, !388, !509, !388}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !601, file: !373, line: 143, baseType: !981, size: 64, offset: 5824)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!408, !388, !388, !388}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !601, file: !373, line: 144, baseType: !855, size: 64, offset: 5888)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !601, file: !373, line: 145, baseType: !977, size: 64, offset: 5952)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !601, file: !373, line: 147, baseType: !981, size: 64, offset: 6016)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !601, file: !373, line: 148, baseType: !855, size: 64, offset: 6080)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !601, file: !373, line: 149, baseType: !977, size: 64, offset: 6144)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !601, file: !373, line: 150, baseType: !981, size: 64, offset: 6208)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !601, file: !373, line: 151, baseType: !991, size: 64, offset: 6272)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!408, !388, !354}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !601, file: !373, line: 153, baseType: !718, size: 64, offset: 6336)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !601, file: !373, line: 154, baseType: !718, size: 64, offset: 6400)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !601, file: !373, line: 155, baseType: !718, size: 64, offset: 6464)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !601, file: !373, line: 156, baseType: !718, size: 64, offset: 6528)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !601, file: !373, line: 157, baseType: !891, size: 64, offset: 6592)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !601, file: !373, line: 159, baseType: !1000, size: 64, offset: 6656)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!408, !388, !356, !609}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !601, file: !373, line: 160, baseType: !718, size: 64, offset: 6720)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !601, file: !373, line: 161, baseType: !718, size: 64, offset: 6784)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !601, file: !373, line: 162, baseType: !718, size: 64, offset: 6848)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !601, file: !373, line: 163, baseType: !718, size: 64, offset: 6912)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !601, file: !373, line: 165, baseType: !981, size: 64, offset: 6976)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !601, file: !373, line: 166, baseType: !981, size: 64, offset: 7040)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !601, file: !373, line: 167, baseType: !781, size: 64, offset: 7104)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !601, file: !373, line: 168, baseType: !1011, size: 64, offset: 7168)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!408, !388, !621, !356}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !601, file: !373, line: 169, baseType: !1015, size: 64, offset: 7232)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!408, !388, !695, !361}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !601, file: !373, line: 171, baseType: !742, size: 64, offset: 7296)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !601, file: !373, line: 172, baseType: !718, size: 64, offset: 7360)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !601, file: !373, line: 173, baseType: !1021, size: 64, offset: 7424)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!408, !388, !361, !805}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !601, file: !373, line: 174, baseType: !881, size: 64, offset: 7488)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !601, file: !373, line: 175, baseType: !881, size: 64, offset: 7552)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !601, file: !373, line: 177, baseType: !618, size: 64, offset: 7616)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !601, file: !373, line: 178, baseType: !668, size: 64, offset: 7680)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !601, file: !373, line: 179, baseType: !618, size: 64, offset: 7744)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !601, file: !373, line: 180, baseType: !625, size: 64, offset: 7808)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !601, file: !373, line: 181, baseType: !1031, size: 64, offset: 7872)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!408, !388, !412, !671, !387}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !601, file: !373, line: 183, baseType: !941, size: 64, offset: 7936)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !601, file: !373, line: 184, baseType: !702, size: 64, offset: 8000)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !601, file: !373, line: 185, baseType: !1037, size: 64, offset: 8064)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!408, !388, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !601, file: !373, line: 186, baseType: !1042, size: 64, offset: 8128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!408, !388, !356, !607, !517}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !601, file: !373, line: 187, baseType: !761, size: 64, offset: 8192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !601, file: !373, line: 189, baseType: !1047, size: 64, offset: 8256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!408, !388, !356, !356, !361, !609}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !601, file: !373, line: 190, baseType: !855, size: 64, offset: 8320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !601, file: !373, line: 191, baseType: !977, size: 64, offset: 8384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !601, file: !373, line: 192, baseType: !981, size: 64, offset: 8448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !601, file: !373, line: 193, baseType: !1054, size: 64, offset: 8512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!408, !388, !813, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !373, line: 660, size: 5312, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1059, file: !373, line: 661, baseType: !393, size: 4480)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1059, file: !373, line: 661, baseType: !822, size: 32, offset: 4480)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1059, file: !373, line: 662, baseType: !356, size: 32, offset: 4512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1059, file: !373, line: 662, baseType: !356, size: 32, offset: 4544)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1059, file: !373, line: 662, baseType: !356, size: 32, offset: 4576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1059, file: !373, line: 663, baseType: !356, size: 32, offset: 4608)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1059, file: !373, line: 664, baseType: !356, size: 32, offset: 4640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1059, file: !373, line: 665, baseType: !361, size: 64, offset: 4672)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1059, file: !373, line: 666, baseType: !361, size: 64, offset: 4736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1059, file: !373, line: 667, baseType: !356, size: 32, offset: 4800)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1059, file: !373, line: 668, baseType: !863, size: 32, offset: 4832)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1059, file: !373, line: 670, baseType: !361, size: 64, offset: 4864)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1059, file: !373, line: 670, baseType: !361, size: 64, offset: 4928)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1059, file: !373, line: 671, baseType: !361, size: 64, offset: 4992)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1059, file: !373, line: 672, baseType: !361, size: 64, offset: 5056)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1059, file: !373, line: 673, baseType: !361, size: 64, offset: 5120)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1059, file: !373, line: 674, baseType: !356, size: 32, offset: 5184)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1059, file: !373, line: 675, baseType: !361, size: 64, offset: 5248)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !601, file: !373, line: 195, baseType: !1080, size: 64, offset: 8576)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!408, !1057, !388, !388}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !601, file: !373, line: 196, baseType: !1080, size: 64, offset: 8640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !601, file: !373, line: 197, baseType: !855, size: 64, offset: 8704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !601, file: !373, line: 198, baseType: !977, size: 64, offset: 8768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !601, file: !373, line: 199, baseType: !981, size: 64, offset: 8832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !601, file: !373, line: 201, baseType: !1088, size: 64, offset: 8896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!408, !388, !356, !356}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !601, file: !373, line: 202, baseType: !756, size: 64, offset: 8960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !601, file: !373, line: 203, baseType: !625, size: 64, offset: 9024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !601, file: !373, line: 204, baseType: !810, size: 64, offset: 9088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !601, file: !373, line: 205, baseType: !941, size: 64, offset: 9152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !601, file: !373, line: 206, baseType: !1096, size: 64, offset: 9216)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!408, !412, !388, !356, !671, !387}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !601, file: !373, line: 208, baseType: !1100, size: 64, offset: 9280)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!408, !356, !766}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !601, file: !373, line: 209, baseType: !981, size: 64, offset: 9344)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !601, file: !373, line: 210, baseType: !773, size: 64, offset: 9408)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !390, file: !373, line: 438, baseType: !1106, size: 64, offset: 13952)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !639, line: 60, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1108, file: !116, line: 241, baseType: !412, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !116, line: 242, baseType: !472, size: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1108, file: !116, line: 243, baseType: !356, size: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1108, file: !116, line: 243, baseType: !356, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1108, file: !116, line: 244, baseType: !356, size: 32, offset: 160)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1108, file: !116, line: 244, baseType: !356, size: 32, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1108, file: !116, line: 245, baseType: !361, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1108, file: !116, line: 246, baseType: !354, size: 32, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1108, file: !116, line: 247, baseType: !356, size: 32, offset: 352)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1108, file: !116, line: 251, baseType: !356, size: 32, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1108, file: !116, line: 252, baseType: !912, size: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1108, file: !116, line: 253, baseType: !354, size: 32, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1108, file: !116, line: 254, baseType: !356, size: 32, offset: 544)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1108, file: !116, line: 254, baseType: !356, size: 32, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1108, file: !116, line: 255, baseType: !356, size: 32, offset: 608)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !390, file: !373, line: 438, baseType: !1106, size: 64, offset: 14016)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !373, line: 439, baseType: !492, size: 64, offset: 14080)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !390, file: !373, line: 440, baseType: !1128, size: 32, offset: 14144)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !390, file: !373, line: 441, baseType: !354, size: 32, offset: 14176)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !390, file: !373, line: 442, baseType: !354, size: 32, offset: 14208)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !390, file: !373, line: 443, baseType: !1132, size: 448, offset: 14272)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 448, elements: !1134)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !433)
!1134 = !{!1135}
!1135 = !DISubrange(count: 7)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !390, file: !373, line: 444, baseType: !354, size: 32, offset: 14720)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !390, file: !373, line: 445, baseType: !354, size: 32, offset: 14752)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !390, file: !373, line: 446, baseType: !356, size: 32, offset: 14784)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !390, file: !373, line: 447, baseType: !494, size: 64, offset: 14848)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !390, file: !373, line: 448, baseType: !494, size: 64, offset: 14912)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !390, file: !373, line: 449, baseType: !678, size: 640, offset: 14976)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !390, file: !373, line: 450, baseType: !611, size: 32, offset: 15616)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !390, file: !373, line: 451, baseType: !1144, size: 2880, offset: 15680)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !373, line: 318, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !373, line: 319, size: 2880, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1166, !1167, !1172, !1177, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1192, !1193, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1225, !1226, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1249, !1250, !1251, !1255, !1256}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1145, file: !373, line: 320, baseType: !356, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1145, file: !373, line: 321, baseType: !356, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1145, file: !373, line: 322, baseType: !356, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1145, file: !373, line: 323, baseType: !356, size: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1145, file: !373, line: 324, baseType: !356, size: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1145, file: !373, line: 325, baseType: !356, size: 32, offset: 160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1145, file: !373, line: 326, baseType: !1154, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !373, line: 293, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !373, line: 295, size: 448, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1156, file: !373, line: 296, baseType: !1154, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1156, file: !373, line: 297, baseType: !517, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1156, file: !373, line: 297, baseType: !517, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1156, file: !373, line: 298, baseType: !361, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1156, file: !373, line: 298, baseType: !361, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1156, file: !373, line: 299, baseType: !356, size: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1156, file: !373, line: 300, baseType: !356, size: 32, offset: 352)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1156, file: !373, line: 301, baseType: !356, size: 32, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1145, file: !373, line: 326, baseType: !1154, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1145, file: !373, line: 328, baseType: !1168, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!408, !388, !1171, !361}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1145, file: !373, line: 329, baseType: !1173, size: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!408, !1171, !1176, !502, !502, !520, !361}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1145, file: !373, line: 330, baseType: !1178, size: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!408, !1171}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1145, file: !373, line: 331, baseType: !1178, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1145, file: !373, line: 334, baseType: !412, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !373, line: 335, baseType: !472, size: 32, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1145, file: !373, line: 335, baseType: !472, size: 32, offset: 672)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1145, file: !373, line: 336, baseType: !472, size: 32, offset: 704)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1145, file: !373, line: 336, baseType: !472, size: 32, offset: 736)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1145, file: !373, line: 337, baseType: !1188, size: 64, offset: 768)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !413, line: 339, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !413, line: 339, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1145, file: !373, line: 338, baseType: !1188, size: 64, offset: 832)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1145, file: !373, line: 339, baseType: !1194, size: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !413, line: 341, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !413, line: 351, size: 192, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1196, file: !413, line: 354, baseType: !74, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1196, file: !413, line: 355, baseType: !74, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1196, file: !413, line: 356, baseType: !74, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1196, file: !413, line: 361, baseType: !74, size: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1196, file: !413, line: 362, baseType: !566, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1145, file: !373, line: 340, baseType: !356, size: 32, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1145, file: !373, line: 340, baseType: !356, size: 32, offset: 992)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1145, file: !373, line: 341, baseType: !517, size: 64, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1145, file: !373, line: 342, baseType: !361, size: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1145, file: !373, line: 343, baseType: !520, size: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1145, file: !373, line: 344, baseType: !502, size: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1145, file: !373, line: 345, baseType: !356, size: 32, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1145, file: !373, line: 346, baseType: !1176, size: 64, offset: 1344)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1145, file: !373, line: 347, baseType: !354, size: 32, offset: 1408)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1145, file: !373, line: 348, baseType: !356, size: 32, offset: 1440)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1145, file: !373, line: 351, baseType: !354, size: 32, offset: 1472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1145, file: !373, line: 352, baseType: !354, size: 32, offset: 1504)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1145, file: !373, line: 353, baseType: !472, size: 32, offset: 1536)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1145, file: !373, line: 354, baseType: !472, size: 32, offset: 1568)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1145, file: !373, line: 355, baseType: !1176, size: 64, offset: 1600)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1145, file: !373, line: 356, baseType: !1176, size: 64, offset: 1664)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1145, file: !373, line: 357, baseType: !1220, size: 64, offset: 1728)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !373, line: 310, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 308, size: 32, elements: !1223)
!1223 = !{!1224}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1222, file: !373, line: 309, baseType: !356, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1145, file: !373, line: 357, baseType: !1220, size: 64, offset: 1792)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1145, file: !373, line: 358, baseType: !1227, size: 64, offset: 1856)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !373, line: 316, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 312, size: 128, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1229, file: !373, line: 313, baseType: !492, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1229, file: !373, line: 314, baseType: !356, size: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1229, file: !373, line: 315, baseType: !435, size: 8, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1145, file: !373, line: 359, baseType: !1227, size: 64, offset: 1920)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1145, file: !373, line: 360, baseType: !1227, size: 64, offset: 1984)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1145, file: !373, line: 361, baseType: !356, size: 32, offset: 2048)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1145, file: !373, line: 362, baseType: !472, size: 32, offset: 2080)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1145, file: !373, line: 363, baseType: !356, size: 32, offset: 2112)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1145, file: !373, line: 364, baseType: !1176, size: 64, offset: 2176)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1145, file: !373, line: 365, baseType: !1194, size: 64, offset: 2240)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1145, file: !373, line: 366, baseType: !472, size: 32, offset: 2304)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1145, file: !373, line: 367, baseType: !472, size: 32, offset: 2336)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1145, file: !373, line: 368, baseType: !1188, size: 64, offset: 2368)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1145, file: !373, line: 369, baseType: !1188, size: 64, offset: 2432)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1145, file: !373, line: 370, baseType: !1246, size: 64, offset: 2496)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
