; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/pf/interface/pf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/pf/interface/pf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 119, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 624, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!104 = !{!105, !108, !109, !145, !279, !313, !314, !231, !195, !116, !315, !317}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !98, line: 330, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !98, line: 330, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !112, line: 73, size: 4480, elements: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!113 = !{!114, !117, !166, !167, !169, !172, !173, !174, !175, !183, !184, !186, !190, !194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !207, !208, !209, !211, !212, !214, !216, !217, !218, !219, !220, !223, !225, !226, !227, !228, !229, !232, !234, !235, !236, !246, !248, !249, !253, !254, !303, !308, !310, !311, !312}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !111, file: !112, line: 74, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !116)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !111, file: !112, line: 75, baseType: !118, size: 448, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 448, elements: !164)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !112, line: 53, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 45, size: 448, elements: !121)
!121 = !{!122, !128, !136, !141, !148, !152, !159}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !120, file: !112, line: 46, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !109, !127}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !116)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !120, file: !112, line: 47, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!126, !109, !132}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !133, line: 16, baseType: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !133, line: 16, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !120, file: !112, line: 48, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!126, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !120, file: !112, line: 49, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!126, !109, !145, !109}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !120, file: !112, line: 50, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!126, !109, !145, !140}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !120, file: !112, line: 51, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!126, !109, !145, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !120, file: !112, line: 52, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!126, !109, !145, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !111, file: !112, line: 76, baseType: !105, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !112, line: 77, baseType: !168, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !116)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !171)
!171 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !112, line: 79, baseType: !176, size: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !179, line: 27, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !181, line: 43, baseType: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!182 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !111, file: !112, line: 80, baseType: !168, size: 32, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !112, line: 81, baseType: !185, size: 32, offset: 992)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !116)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !111, file: !112, line: 82, baseType: !187, size: 64, offset: 1024)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !111, file: !112, line: 83, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !111, file: !112, line: 84, baseType: !195, size: 64, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !111, file: !112, line: 85, baseType: !195, size: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !111, file: !112, line: 86, baseType: !195, size: 64, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !111, file: !112, line: 87, baseType: !195, size: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !112, line: 88, baseType: !109, size: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !111, file: !112, line: 89, baseType: !176, size: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !112, line: 90, baseType: !195, size: 64, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !111, file: !112, line: 91, baseType: !195, size: 64, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !111, file: !112, line: 92, baseType: !168, size: 32, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !111, file: !112, line: 93, baseType: !108, size: 64, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !111, file: !112, line: 94, baseType: !206, size: 64, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !177)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !111, file: !112, line: 95, baseType: !168, size: 32, offset: 1856)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !111, file: !112, line: 95, baseType: !168, size: 32, offset: 1888)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !111, file: !112, line: 96, baseType: !210, size: 64, offset: 1920)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !111, file: !112, line: 96, baseType: !210, size: 64, offset: 1984)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !111, file: !112, line: 97, baseType: !213, size: 64, offset: 2048)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !111, file: !112, line: 97, baseType: !215, size: 64, offset: 2112)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !111, file: !112, line: 98, baseType: !168, size: 32, offset: 2176)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !111, file: !112, line: 98, baseType: !168, size: 32, offset: 2208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !111, file: !112, line: 99, baseType: !210, size: 64, offset: 2240)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !111, file: !112, line: 99, baseType: !210, size: 64, offset: 2304)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !111, file: !112, line: 100, baseType: !221, size: 64, offset: 2368)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !171)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !111, file: !112, line: 100, baseType: !224, size: 64, offset: 2432)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !111, file: !112, line: 101, baseType: !168, size: 32, offset: 2496)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !111, file: !112, line: 101, baseType: !168, size: 32, offset: 2528)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !111, file: !112, line: 102, baseType: !210, size: 64, offset: 2560)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !111, file: !112, line: 102, baseType: !210, size: 64, offset: 2624)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !111, file: !112, line: 103, baseType: !230, size: 64, offset: 2688)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !222)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !111, file: !112, line: 103, baseType: !233, size: 64, offset: 2752)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !111, file: !112, line: 104, baseType: !163, size: 64, offset: 2816)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !111, file: !112, line: 105, baseType: !168, size: 32, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !111, file: !112, line: 106, baseType: !237, size: 128, offset: 2944)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, elements: !244)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !112, line: 64, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 61, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !240, file: !112, line: 62, baseType: !156, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !240, file: !112, line: 63, baseType: !108, size: 64, offset: 64)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !111, file: !112, line: 107, baseType: !247, size: 64, offset: 3072)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !244)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !111, file: !112, line: 108, baseType: !108, size: 64, offset: 3136)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !111, file: !112, line: 109, baseType: !250, size: 64, offset: 3200)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!126, !108}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !111, file: !112, line: 111, baseType: !168, size: 32, offset: 3264)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !111, file: !112, line: 112, baseType: !255, size: 320, offset: 3328)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 320, elements: !301)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!126, !259, !109, !108}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !262)
!262 = !{!263, !264, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !12, line: 100, baseType: !168, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !12, line: 101, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !276, !277, !278, !282, !284, !286, !287, !288}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !267, file: !12, line: 84, baseType: !195, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !267, file: !12, line: 85, baseType: !195, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !12, line: 86, baseType: !108, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !267, file: !12, line: 87, baseType: !187, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !267, file: !12, line: 88, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !267, file: !12, line: 89, baseType: !147, size: 8, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !267, file: !12, line: 90, baseType: !195, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !267, file: !12, line: 91, baseType: !279, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !280, line: 46, baseType: !281)
!280 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!281 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !267, file: !12, line: 92, baseType: !283, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !12, line: 93, baseType: !285, size: 32, offset: 544)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !12, line: 94, baseType: !265, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !267, file: !12, line: 95, baseType: !195, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !267, file: !12, line: 96, baseType: !108, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !261, file: !12, line: 102, baseType: !195, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !261, file: !12, line: 102, baseType: !195, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !261, file: !12, line: 103, baseType: !195, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !261, file: !12, line: 104, baseType: !105, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !261, file: !12, line: 106, baseType: !109, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !261, file: !12, line: 107, baseType: !298, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!301 = !{!302}
!302 = !DISubrange(count: 5)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !111, file: !112, line: 113, baseType: !304, size: 320, offset: 3648)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 320, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!126, !109, !108}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !111, file: !112, line: 114, baseType: !309, size: 320, offset: 3968)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, elements: !301)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !111, file: !112, line: 115, baseType: !283, size: 32, offset: 4288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !111, file: !112, line: 120, baseType: !298, size: 64, offset: 4352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !111, file: !112, line: 121, baseType: !283, size: 32, offset: 4416)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !112, line: 130, baseType: !137)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !112, line: 131, baseType: !129)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !316, line: 1451, baseType: !156)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!318 = !{!0, !319, !322, !324}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "PFList", scope: !2, file: !321, line: 7, type: !187, isLocal: false, isDefinition: true)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/pf/interface/pf.c", directory: "/home/users/ndemeye/xSDK")
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "PFRegisterAllCalled", scope: !2, file: !321, line: 8, type: !283, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "PFPackageInitialized", scope: !2, file: !321, line: 446, type: !283, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!327 = !{i32 7, !"Dwarf Version", i32 4}
!328 = !{i32 2, !"Debug Info Version", i32 3}
!329 = !{i32 1, !"wchar_size", i32 4}
!330 = !{i32 7, !"PIC Level", i32 2}
!331 = !{i32 7, !"uwtable", i32 1}
!332 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!333 = distinct !DISubprogram(name: "PFSet", scope: !321, file: !321, line: 27, type: !334, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !374)
!334 = !DISubroutineType(types: !335)
!335 = !{!126, !336, !349, !355, !364, !250, !108}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PF", file: !337, line: 36, baseType: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpf.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PF", file: !340, line: 21, size: 4928, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/pf/pfimpl.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !344, !371, !372, !373}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !339, file: !340, line: 22, baseType: !343, size: 4480)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !112, line: 122, baseType: !111)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !339, file: !340, line: 22, baseType: !345, size: 320, offset: 4480)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 320, elements: !164)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PFOps", file: !340, line: 13, size: 320, elements: !347)
!347 = !{!348, !354, !362, !363, !367}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !346, file: !340, line: 14, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!126, !108, !168, !352, !230}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "applyvec", scope: !346, file: !340, line: 15, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!126, !108, !358, !358}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !359, line: 21, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !359, line: 21, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !340, line: 16, baseType: !250, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !340, line: 17, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!126, !108, !132}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !346, file: !340, line: 18, baseType: !368, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!126, !259, !336}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dimin", scope: !339, file: !340, line: 23, baseType: !168, size: 32, offset: 4800)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dimout", scope: !339, file: !340, line: 23, baseType: !168, size: 32, offset: 4832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !340, line: 24, baseType: !108, size: 64, offset: 4864)
!374 = !{!375, !376, !377, !378, !379, !380}
!375 = !DILocalVariable(name: "pf", arg: 1, scope: !333, file: !321, line: 27, type: !336)
!376 = !DILocalVariable(name: "apply", arg: 2, scope: !333, file: !321, line: 27, type: !349)
!377 = !DILocalVariable(name: "applyvec", arg: 3, scope: !333, file: !321, line: 27, type: !355)
!378 = !DILocalVariable(name: "view", arg: 4, scope: !333, file: !321, line: 27, type: !364)
!379 = !DILocalVariable(name: "destroy", arg: 5, scope: !333, file: !321, line: 27, type: !250)
!380 = !DILocalVariable(name: "ctx", arg: 6, scope: !333, file: !321, line: 27, type: !108)
!381 = !DILocation(line: 0, scope: !333)
!382 = !DILocation(line: 29, column: 3, scope: !383)
!383 = distinct !DILexicalBlock(scope: !384, file: !321, line: 29, column: 3)
!384 = distinct !DILexicalBlock(scope: !385, file: !321, line: 29, column: 3)
!385 = distinct !DILexicalBlock(scope: !333, file: !321, line: 29, column: 3)
!386 = !{!387, !387, i64 0}
!387 = !{!"any pointer", !388, i64 0}
!388 = !{!"omnipotent char", !389, i64 0}
!389 = !{!"Simple C/C++ TBAA"}
!390 = !DILocation(line: 29, column: 3, scope: !384)
!391 = !DILocation(line: 29, column: 3, scope: !392)
!392 = distinct !DILexicalBlock(scope: !393, file: !321, line: 29, column: 3)
!393 = distinct !DILexicalBlock(scope: !383, file: !321, line: 29, column: 3)
!394 = !{!395, !396, i64 1536}
!395 = !{!"", !388, i64 0, !388, i64 512, !388, i64 1024, !388, i64 1280, !396, i64 1536, !396, i64 1540, !388, i64 1544}
!396 = !{!"int", !388, i64 0}
!397 = !DILocation(line: 29, column: 3, scope: !393)
!398 = !DILocation(line: 29, column: 3, scope: !399)
!399 = distinct !DILexicalBlock(scope: !392, file: !321, line: 29, column: 3)
!400 = !{!396, !396, i64 0}
!401 = !{!395, !396, i64 1540}
!402 = !DILocation(line: 30, column: 3, scope: !403)
!403 = distinct !DILexicalBlock(scope: !404, file: !321, line: 30, column: 3)
!404 = distinct !DILexicalBlock(scope: !333, file: !321, line: 30, column: 3)
!405 = !DILocation(line: 30, column: 3, scope: !404)
!406 = !DILocation(line: 30, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !404, file: !321, line: 30, column: 3)
!408 = !DILocation(line: 30, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !404, file: !321, line: 30, column: 3)
!410 = !{!411, !396, i64 0}
!411 = !{!"_p_PetscObject", !396, i64 0, !388, i64 8, !387, i64 64, !396, i64 72, !412, i64 80, !412, i64 88, !412, i64 96, !412, i64 104, !413, i64 112, !396, i64 120, !396, i64 124, !387, i64 128, !387, i64 136, !387, i64 144, !387, i64 152, !387, i64 160, !387, i64 168, !387, i64 176, !413, i64 184, !387, i64 192, !387, i64 200, !396, i64 208, !387, i64 216, !413, i64 224, !396, i64 232, !396, i64 236, !387, i64 240, !387, i64 248, !387, i64 256, !387, i64 264, !396, i64 272, !396, i64 276, !387, i64 280, !387, i64 288, !387, i64 296, !387, i64 304, !396, i64 312, !396, i64 316, !387, i64 320, !387, i64 328, !387, i64 336, !387, i64 344, !387, i64 352, !396, i64 360, !388, i64 368, !388, i64 384, !387, i64 392, !387, i64 400, !396, i64 408, !388, i64 416, !388, i64 456, !388, i64 496, !388, i64 536, !387, i64 544, !388, i64 552}
!412 = !{!"double", !388, i64 0}
!413 = !{!"long", !388, i64 0}
!414 = !DILocation(line: 30, column: 3, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !321, line: 30, column: 3)
!416 = distinct !DILexicalBlock(scope: !409, file: !321, line: 30, column: 3)
!417 = !DILocation(line: 30, column: 3, scope: !416)
!418 = !DILocation(line: 31, column: 7, scope: !333)
!419 = !DILocation(line: 31, column: 21, scope: !333)
!420 = !{!421, !387, i64 608}
!421 = !{!"_p_PF", !411, i64 0, !388, i64 560, !396, i64 600, !396, i64 604, !387, i64 608}
!422 = !DILocation(line: 32, column: 12, scope: !333)
!423 = !DILocation(line: 32, column: 21, scope: !333)
!424 = !{!425, !387, i64 16}
