; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/kaij/kaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/kaij/kaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!371 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!377 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!378 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!379 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!380 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!381 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!382 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!383 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!384 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!385 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!386 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!387 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!388 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 30, baseType: !5, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!396 = !{!397, !415, !496, !605, !1654, !436, !486, !91, !571, !1676, !462, !1715, !1815, !1817}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !400, line: 73, size: 4480, elements: !401)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!401 = !{!402, !404, !457, !458, !460, !463, !464, !465, !466, !474, !475, !477, !481, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !497, !499, !500, !501, !503, !504, !506, !508, !509, !510, !511, !512, !515, !517, !518, !519, !520, !521, !524, !526, !527, !528, !538, !540, !541, !545, !546, !595, !600, !602, !603, !604}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !399, file: !400, line: 74, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !399, file: !400, line: 75, baseType: !405, size: 448, offset: 64)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 448, elements: !455)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !400, line: 53, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 45, size: 448, elements: !408)
!408 = !{!409, !419, !427, !432, !439, !443, !450}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !407, file: !400, line: 46, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !397, !414}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !416, line: 330, baseType: !417)
!416 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !416, line: 330, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !407, file: !400, line: 47, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!413, !397, !423}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !424, line: 16, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !424, line: 16, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !407, file: !400, line: 48, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!413, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !407, file: !400, line: 49, baseType: !433, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!413, !397, !436, !397}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !407, file: !400, line: 50, baseType: !440, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!413, !397, !436, !431}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !407, file: !400, line: 51, baseType: !444, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!413, !397, !436, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !407, file: !400, line: 52, baseType: !451, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!413, !397, !436, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!455 = !{!456}
!456 = !DISubrange(count: 1)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !399, file: !400, line: 76, baseType: !415, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !400, line: 77, baseType: !459, size: 32, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !399, file: !400, line: 78, baseType: !461, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !462)
!462 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !399, file: !400, line: 78, baseType: !461, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !399, file: !400, line: 78, baseType: !461, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !399, file: !400, line: 78, baseType: !461, size: 64, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !399, file: !400, line: 79, baseType: !467, size: 64, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !470, line: 27, baseType: !471)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !472, line: 43, baseType: !473)
!472 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!473 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !399, file: !400, line: 80, baseType: !459, size: 32, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !399, file: !400, line: 81, baseType: !476, size: 32, offset: 992)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !399, file: !400, line: 82, baseType: !478, size: 64, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !399, file: !400, line: 83, baseType: !482, size: 64, offset: 1088)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !399, file: !400, line: 84, baseType: !486, size: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !399, file: !400, line: 85, baseType: !486, size: 64, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !399, file: !400, line: 86, baseType: !486, size: 64, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !399, file: !400, line: 87, baseType: !486, size: 64, offset: 1344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !399, file: !400, line: 88, baseType: !397, size: 64, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !399, file: !400, line: 89, baseType: !467, size: 64, offset: 1472)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 90, baseType: !486, size: 64, offset: 1536)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !399, file: !400, line: 91, baseType: !486, size: 64, offset: 1600)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !399, file: !400, line: 92, baseType: !459, size: 32, offset: 1664)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !399, file: !400, line: 93, baseType: !496, size: 64, offset: 1728)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !399, file: !400, line: 94, baseType: !498, size: 64, offset: 1792)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !468)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !399, file: !400, line: 95, baseType: !459, size: 32, offset: 1856)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !399, file: !400, line: 95, baseType: !459, size: 32, offset: 1888)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !399, file: !400, line: 96, baseType: !502, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !399, file: !400, line: 96, baseType: !502, size: 64, offset: 1984)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !399, file: !400, line: 97, baseType: !505, size: 64, offset: 2048)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !399, file: !400, line: 97, baseType: !507, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !399, file: !400, line: 98, baseType: !459, size: 32, offset: 2176)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !399, file: !400, line: 98, baseType: !459, size: 32, offset: 2208)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !399, file: !400, line: 99, baseType: !502, size: 64, offset: 2240)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !399, file: !400, line: 99, baseType: !502, size: 64, offset: 2304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !399, file: !400, line: 100, baseType: !513, size: 64, offset: 2368)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !462)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !399, file: !400, line: 100, baseType: !516, size: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !399, file: !400, line: 101, baseType: !459, size: 32, offset: 2496)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !399, file: !400, line: 101, baseType: !459, size: 32, offset: 2528)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !399, file: !400, line: 102, baseType: !502, size: 64, offset: 2560)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !399, file: !400, line: 102, baseType: !502, size: 64, offset: 2624)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !399, file: !400, line: 103, baseType: !522, size: 64, offset: 2688)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !514)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !399, file: !400, line: 103, baseType: !525, size: 64, offset: 2752)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !399, file: !400, line: 104, baseType: !454, size: 64, offset: 2816)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !399, file: !400, line: 105, baseType: !459, size: 32, offset: 2880)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !399, file: !400, line: 106, baseType: !529, size: 128, offset: 2944)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 128, elements: !536)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !400, line: 64, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 61, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !532, file: !400, line: 62, baseType: !447, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !532, file: !400, line: 63, baseType: !496, size: 64, offset: 64)
!536 = !{!537}
!537 = !DISubrange(count: 2)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !399, file: !400, line: 107, baseType: !539, size: 64, offset: 3072)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 64, elements: !536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !399, file: !400, line: 108, baseType: !496, size: 64, offset: 3136)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !399, file: !400, line: 109, baseType: !542, size: 64, offset: 3200)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!413, !496}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !399, file: !400, line: 111, baseType: !459, size: 32, offset: 3264)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !399, file: !400, line: 112, baseType: !547, size: 320, offset: 3328)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 320, elements: !593)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!413, !551, !397, !496}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !554)
!554 = !{!555, !556, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !553, file: !10, line: 100, baseType: !459, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !10, line: 101, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !568, !569, !570, !574, !576, !578, !579, !580}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !559, file: !10, line: 84, baseType: !486, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !559, file: !10, line: 85, baseType: !486, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !10, line: 86, baseType: !496, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !559, file: !10, line: 87, baseType: !478, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !559, file: !10, line: 88, baseType: !566, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !559, file: !10, line: 89, baseType: !438, size: 8, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !559, file: !10, line: 90, baseType: !486, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !559, file: !10, line: 91, baseType: !571, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !572, line: 46, baseType: !573)
!572 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!573 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !559, file: !10, line: 92, baseType: !575, size: 32, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !559, file: !10, line: 93, baseType: !577, size: 32, offset: 544)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !10, line: 94, baseType: !557, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !559, file: !10, line: 95, baseType: !486, size: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !559, file: !10, line: 96, baseType: !496, size: 64, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !553, file: !10, line: 102, baseType: !486, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !553, file: !10, line: 102, baseType: !486, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !553, file: !10, line: 103, baseType: !486, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !553, file: !10, line: 104, baseType: !415, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !553, file: !10, line: 105, baseType: !575, size: 32, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !553, file: !10, line: 105, baseType: !575, size: 32, offset: 416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !553, file: !10, line: 105, baseType: !575, size: 32, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !553, file: !10, line: 106, baseType: !397, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !553, file: !10, line: 107, baseType: !590, size: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!593 = !{!594}
!594 = !DISubrange(count: 5)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !399, file: !400, line: 113, baseType: !596, size: 320, offset: 3648)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 320, elements: !593)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!413, !397, !496}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !399, file: !400, line: 114, baseType: !601, size: 320, offset: 3968)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 320, elements: !593)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !399, file: !400, line: 115, baseType: !575, size: 32, offset: 4288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !399, file: !400, line: 120, baseType: !590, size: 64, offset: 4352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !399, file: !400, line: 121, baseType: !575, size: 32, offset: 4416)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIKAIJ", file: !607, line: 28, baseType: !608)
!607 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/kaij/kaij.h", directory: "/home/users/ndemeye/xSDK")
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !607, line: 22, size: 1088, elements: !609)
!609 = !{!610, !611, !612, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1645, !1646, !1647, !1653}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !608, file: !607, line: 23, baseType: !459, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !608, file: !607, line: 23, baseType: !459, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "AIJ", scope: !608, file: !607, line: 23, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !616, line: 436, size: 23424, elements: !617)
!616 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!617 = !{!618, !620, !1405, !1406, !1407, !1408, !1410, !1411, !1412, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1526, !1527, !1543, !1544, !1545, !1546, !1547, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1582, !1602, !1603, !1605, !1606, !1607, !1608, !1609, !1610, !1628, !1629}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !615, file: !616, line: 437, baseType: !619, size: 4480)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !400, line: 122, baseType: !399)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !615, file: !616, line: 437, baseType: !621, size: 9472, offset: 4480)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 9472, elements: !455)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !616, line: 32, size: 9472, elements: !623)
!623 = !{!624, !633, !637, !638, !937, !941, !942, !943, !944, !945, !946, !947, !967, !971, !976, !982, !1001, !1006, !1010, !1011, !1015, !1020, !1021, !1026, !1030, !1034, !1038, !1042, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1060, !1061, !1062, !1063, !1064, !1069, !1076, !1080, !1084, !1088, !1092, !1096, !1097, !1101, !1102, !1106, !1111, !1112, !1113, !1114, !1176, !1184, !1185, !1189, !1190, !1194, !1195, !1199, !1204, !1205, !1209, !1213, !1217, !1218, !1219, !1220, !1221, !1222, !1227, !1228, !1232, !1236, !1240, !1241, !1242, !1246, !1256, !1257, !1261, !1262, !1266, !1267, !1271, !1272, !1276, !1277, !1281, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1315, !1319, !1320, !1321, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1335, !1336, !1337, !1341, !1345, !1346, !1350, !1351, !1352, !1353, !1379, !1383, !1384, !1385, !1386, !1387, !1391, !1392, !1393, !1394, !1395, !1399, !1403, !1404}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !622, file: !616, line: 34, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!413, !613, !459, !628, !459, !628, !630, !632}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !622, file: !616, line: 35, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!413, !613, !459, !505, !507, !525}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !622, file: !616, line: 36, baseType: !634, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !622, file: !616, line: 37, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!413, !613, !642, !642}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !645, line: 142, size: 12800, elements: !646)
!645 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!646 = !{!647, !648, !863, !883, !884, !885, !931, !932, !933, !934, !936}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !644, file: !645, line: 143, baseType: !619, size: 4480)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !644, file: !645, line: 143, baseType: !649, size: 5248, offset: 4480)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 5248, elements: !455)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !645, line: 23, size: 5248, elements: !651)
!651 = !{!652, !657, !662, !666, !670, !676, !681, !682, !683, !687, !691, !692, !693, !697, !701, !705, !706, !710, !714, !718, !719, !723, !727, !728, !732, !736, !737, !738, !742, !743, !750, !755, !756, !757, !761, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !782, !783, !784, !788, !792, !793, !794, !795, !799, !800, !801, !802, !803, !804, !805, !809, !810, !814, !821, !822, !827, !828, !832, !833, !834, !835, !836, !837, !838, !839, !843, !844, !845, !851, !855, !856, !857}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !650, file: !645, line: 24, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!413, !642, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !650, file: !645, line: 25, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!413, !642, !459, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !650, file: !645, line: 26, baseType: !663, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!413, !459, !656}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !650, file: !645, line: 27, baseType: !667, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!413, !642, !642, !522}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !650, file: !645, line: 28, baseType: !671, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!413, !642, !459, !674, !522}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !650, file: !645, line: 29, baseType: !677, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!413, !642, !680, !513}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !650, file: !645, line: 30, baseType: !667, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !650, file: !645, line: 31, baseType: !671, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !650, file: !645, line: 32, baseType: !684, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!413, !642, !523}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !650, file: !645, line: 33, baseType: !688, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!413, !642, !642}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !650, file: !645, line: 34, baseType: !684, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !650, file: !645, line: 35, baseType: !688, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !650, file: !645, line: 36, baseType: !694, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!413, !642, !523, !642}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !650, file: !645, line: 37, baseType: !698, size: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!413, !642, !523, !523, !642}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !650, file: !645, line: 38, baseType: !702, size: 64, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!413, !642, !459, !630, !656}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !650, file: !645, line: 39, baseType: !694, size: 64, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !650, file: !645, line: 40, baseType: !707, size: 64, offset: 1024)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!413, !642, !523, !642, !642}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !650, file: !645, line: 41, baseType: !711, size: 64, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!413, !642, !523, !523, !523, !642, !642}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !650, file: !645, line: 42, baseType: !715, size: 64, offset: 1152)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!413, !642, !642, !642}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !650, file: !645, line: 43, baseType: !715, size: 64, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !650, file: !645, line: 44, baseType: !720, size: 64, offset: 1280)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!413, !642, !459, !628, !630, !632}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !650, file: !645, line: 45, baseType: !724, size: 64, offset: 1344)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!413, !642}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !650, file: !645, line: 46, baseType: !724, size: 64, offset: 1408)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !650, file: !645, line: 47, baseType: !729, size: 64, offset: 1472)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!413, !642, !525}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !650, file: !645, line: 48, baseType: !733, size: 64, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!413, !642, !505}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !650, file: !645, line: 49, baseType: !733, size: 64, offset: 1600)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !650, file: !645, line: 50, baseType: !729, size: 64, offset: 1664)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !650, file: !645, line: 51, baseType: !739, size: 64, offset: 1728)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!413, !642, !505, !513}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !650, file: !645, line: 52, baseType: !739, size: 64, offset: 1792)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !650, file: !645, line: 53, baseType: !744, size: 64, offset: 1856)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!413, !642, !747}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !650, file: !645, line: 54, baseType: !751, size: 64, offset: 1920)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!413, !642, !754, !575}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !650, file: !645, line: 55, baseType: !720, size: 64, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !650, file: !645, line: 56, baseType: !724, size: 64, offset: 2048)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !650, file: !645, line: 57, baseType: !758, size: 64, offset: 2112)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!413, !642, !423}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !650, file: !645, line: 58, baseType: !762, size: 64, offset: 2176)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!413, !642, !630}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !650, file: !645, line: 59, baseType: !762, size: 64, offset: 2240)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !650, file: !645, line: 60, baseType: !667, size: 64, offset: 2304)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !650, file: !645, line: 61, baseType: !667, size: 64, offset: 2368)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !650, file: !645, line: 62, baseType: !677, size: 64, offset: 2432)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !650, file: !645, line: 63, baseType: !671, size: 64, offset: 2496)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !650, file: !645, line: 64, baseType: !671, size: 64, offset: 2560)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !650, file: !645, line: 65, baseType: !758, size: 64, offset: 2624)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !650, file: !645, line: 66, baseType: !724, size: 64, offset: 2688)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !650, file: !645, line: 67, baseType: !724, size: 64, offset: 2752)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !650, file: !645, line: 68, baseType: !775, size: 64, offset: 2816)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!413, !642, !778}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !779, line: 30, baseType: !780)
!779 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !779, line: 30, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !650, file: !645, line: 69, baseType: !720, size: 64, offset: 2880)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !650, file: !645, line: 70, baseType: !724, size: 64, offset: 2944)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !650, file: !645, line: 71, baseType: !785, size: 64, offset: 3008)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!413, !551, !642}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !650, file: !645, line: 72, baseType: !789, size: 64, offset: 3072)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!413, !642, !642, !513}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !650, file: !645, line: 73, baseType: !715, size: 64, offset: 3136)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !650, file: !645, line: 74, baseType: !715, size: 64, offset: 3200)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !650, file: !645, line: 75, baseType: !715, size: 64, offset: 3264)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !650, file: !645, line: 76, baseType: !796, size: 64, offset: 3328)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!413, !642, !459, !628, !522}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !650, file: !645, line: 77, baseType: !724, size: 64, offset: 3392)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !650, file: !645, line: 78, baseType: !724, size: 64, offset: 3456)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !650, file: !645, line: 79, baseType: !724, size: 64, offset: 3520)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !650, file: !645, line: 80, baseType: !724, size: 64, offset: 3584)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !650, file: !645, line: 81, baseType: !684, size: 64, offset: 3648)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !650, file: !645, line: 82, baseType: !724, size: 64, offset: 3712)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !650, file: !645, line: 83, baseType: !806, size: 64, offset: 3776)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!413, !642, !459, !642, !632}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !650, file: !645, line: 84, baseType: !806, size: 64, offset: 3840)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !650, file: !645, line: 85, baseType: !811, size: 64, offset: 3904)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!413, !642, !642, !522, !522}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !650, file: !645, line: 86, baseType: !815, size: 64, offset: 3968)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!413, !642, !818, !656}
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !779, line: 11, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !779, line: 11, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !650, file: !645, line: 87, baseType: !815, size: 64, offset: 4032)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !650, file: !645, line: 88, baseType: !823, size: 64, offset: 4096)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!413, !642, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !650, file: !645, line: 89, baseType: !823, size: 64, offset: 4160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !650, file: !645, line: 90, baseType: !829, size: 64, offset: 4224)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!413, !642, !459, !628, !628, !642, !632}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !650, file: !645, line: 91, baseType: !829, size: 64, offset: 4288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !650, file: !645, line: 92, baseType: !758, size: 64, offset: 4352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !650, file: !645, line: 93, baseType: !758, size: 64, offset: 4416)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !650, file: !645, line: 94, baseType: !688, size: 64, offset: 4480)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !650, file: !645, line: 95, baseType: !688, size: 64, offset: 4544)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !650, file: !645, line: 96, baseType: !688, size: 64, offset: 4608)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !650, file: !645, line: 97, baseType: !688, size: 64, offset: 4672)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !650, file: !645, line: 98, baseType: !840, size: 64, offset: 4736)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!413, !642, !575}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !650, file: !645, line: 99, baseType: !729, size: 64, offset: 4800)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !650, file: !645, line: 100, baseType: !729, size: 64, offset: 4864)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !650, file: !645, line: 101, baseType: !846, size: 64, offset: 4928)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!413, !642, !525, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !650, file: !645, line: 102, baseType: !852, size: 64, offset: 4992)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!413, !642, !826, !849}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !650, file: !645, line: 103, baseType: !729, size: 64, offset: 5056)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !650, file: !645, line: 104, baseType: !823, size: 64, offset: 5120)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !650, file: !645, line: 105, baseType: !858, size: 64, offset: 5184)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!413, !459, !674, !656, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !644, file: !645, line: 144, baseType: !864, size: 64, offset: 9728)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !779, line: 60, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !866, file: !133, line: 241, baseType: !415, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !866, file: !133, line: 242, baseType: !476, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !866, file: !133, line: 243, baseType: !459, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !866, file: !133, line: 243, baseType: !459, size: 32, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !866, file: !133, line: 244, baseType: !459, size: 32, offset: 160)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !866, file: !133, line: 244, baseType: !459, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !866, file: !133, line: 245, baseType: !505, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !866, file: !133, line: 246, baseType: !575, size: 32, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !866, file: !133, line: 247, baseType: !459, size: 32, offset: 352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !866, file: !133, line: 251, baseType: !459, size: 32, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !866, file: !133, line: 252, baseType: !778, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !866, file: !133, line: 253, baseType: !575, size: 32, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !866, file: !133, line: 254, baseType: !459, size: 32, offset: 544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !866, file: !133, line: 254, baseType: !459, size: 32, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !866, file: !133, line: 255, baseType: !459, size: 32, offset: 608)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !645, line: 145, baseType: !496, size: 64, offset: 9792)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !644, file: !645, line: 146, baseType: !575, size: 32, offset: 9856)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !644, file: !645, line: 147, baseType: !886, size: 1344, offset: 9920)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !645, line: 140, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 114, size: 1344, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !907, !908, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !887, file: !645, line: 115, baseType: !459, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !887, file: !645, line: 116, baseType: !459, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !887, file: !645, line: 117, baseType: !459, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !887, file: !645, line: 118, baseType: !459, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !887, file: !645, line: 119, baseType: !459, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !887, file: !645, line: 120, baseType: !459, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !887, file: !645, line: 121, baseType: !505, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !887, file: !645, line: 122, baseType: !522, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !887, file: !645, line: 124, baseType: !415, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !887, file: !645, line: 125, baseType: !476, size: 32, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !887, file: !645, line: 125, baseType: !476, size: 32, offset: 416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !887, file: !645, line: 126, baseType: !476, size: 32, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !887, file: !645, line: 126, baseType: !476, size: 32, offset: 480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !887, file: !645, line: 127, baseType: !903, size: 64, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !416, line: 339, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !416, line: 339, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !887, file: !645, line: 128, baseType: !903, size: 64, offset: 576)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !887, file: !645, line: 129, baseType: !909, size: 64, offset: 640)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !416, line: 341, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !416, line: 351, size: 192, elements: !912)
!912 = !{!913, !914, !915, !916, !917}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !911, file: !416, line: 354, baseType: !91, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !911, file: !416, line: 355, baseType: !91, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !911, file: !416, line: 356, baseType: !91, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !911, file: !416, line: 361, baseType: !91, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !911, file: !416, line: 362, baseType: !571, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !887, file: !645, line: 130, baseType: !459, size: 32, offset: 704)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !887, file: !645, line: 130, baseType: !459, size: 32, offset: 736)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !887, file: !645, line: 131, baseType: !522, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !887, file: !645, line: 131, baseType: !522, size: 64, offset: 832)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !887, file: !645, line: 132, baseType: !505, size: 64, offset: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !887, file: !645, line: 132, baseType: !505, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !887, file: !645, line: 133, baseType: !459, size: 32, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !887, file: !645, line: 134, baseType: !505, size: 64, offset: 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !887, file: !645, line: 135, baseType: !459, size: 32, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !887, file: !645, line: 136, baseType: !575, size: 32, offset: 1184)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !887, file: !645, line: 137, baseType: !575, size: 32, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !887, file: !645, line: 138, baseType: !632, size: 32, offset: 1248)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !887, file: !645, line: 139, baseType: !505, size: 64, offset: 1280)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !644, file: !645, line: 147, baseType: !886, size: 1344, offset: 11264)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !644, file: !645, line: 148, baseType: !575, size: 32, offset: 12608)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !644, file: !645, line: 149, baseType: !459, size: 32, offset: 12640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !644, file: !645, line: 150, baseType: !935, size: 32, offset: 12672)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !644, file: !645, line: 157, baseType: !486, size: 64, offset: 12736)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !622, file: !616, line: 38, baseType: !938, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!413, !613, !642, !642, !642}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !622, file: !616, line: 40, baseType: !639, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !622, file: !616, line: 41, baseType: !938, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !622, file: !616, line: 42, baseType: !639, size: 64, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !622, file: !616, line: 43, baseType: !938, size: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !622, file: !616, line: 44, baseType: !639, size: 64, offset: 576)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !622, file: !616, line: 46, baseType: !938, size: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !622, file: !616, line: 47, baseType: !948, size: 64, offset: 704)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!413, !613, !818, !818, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !954, file: !63, line: 1227, baseType: !514, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !954, file: !63, line: 1228, baseType: !514, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !954, file: !63, line: 1229, baseType: !514, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !954, file: !63, line: 1230, baseType: !514, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !954, file: !63, line: 1231, baseType: !514, size: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !954, file: !63, line: 1232, baseType: !514, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !954, file: !63, line: 1233, baseType: !514, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !954, file: !63, line: 1234, baseType: !514, size: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !954, file: !63, line: 1236, baseType: !514, size: 64, offset: 512)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !954, file: !63, line: 1237, baseType: !514, size: 64, offset: 576)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !954, file: !63, line: 1238, baseType: !514, size: 64, offset: 640)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !622, file: !616, line: 48, baseType: !968, size: 64, offset: 768)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!413, !613, !818, !951}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !622, file: !616, line: 49, baseType: !972, size: 64, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!413, !613, !642, !514, !975, !514, !459, !459, !642}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !622, file: !616, line: 50, baseType: !977, size: 64, offset: 896)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!413, !613, !980, !981}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !622, file: !616, line: 52, baseType: !983, size: 64, offset: 960)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!413, !613, !986, !987}
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !989, file: !63, line: 593, baseType: !461, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !989, file: !63, line: 594, baseType: !461, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !989, file: !63, line: 594, baseType: !461, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !989, file: !63, line: 594, baseType: !461, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !989, file: !63, line: 595, baseType: !461, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !989, file: !63, line: 596, baseType: !461, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !989, file: !63, line: 597, baseType: !461, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !989, file: !63, line: 598, baseType: !461, size: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !989, file: !63, line: 598, baseType: !461, size: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !989, file: !63, line: 599, baseType: !461, size: 64, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !622, file: !616, line: 53, baseType: !1002, size: 64, offset: 1024)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!413, !613, !613, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !622, file: !616, line: 54, baseType: !1007, size: 64, offset: 1088)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!413, !613, !642}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !622, file: !616, line: 55, baseType: !639, size: 64, offset: 1152)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !622, file: !616, line: 56, baseType: !1012, size: 64, offset: 1216)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!413, !613, !680, !513}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !622, file: !616, line: 58, baseType: !1016, size: 64, offset: 1280)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!413, !613, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !622, file: !616, line: 59, baseType: !1016, size: 64, offset: 1344)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !622, file: !616, line: 60, baseType: !1022, size: 64, offset: 1408)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!413, !613, !1025, !575}
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !622, file: !616, line: 61, baseType: !1027, size: 64, offset: 1472)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!413, !613}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !622, file: !616, line: 63, baseType: !1031, size: 64, offset: 1536)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!413, !613, !459, !628, !523, !642, !642}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !622, file: !616, line: 64, baseType: !1035, size: 64, offset: 1600)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!413, !613, !613, !818, !818, !951}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !622, file: !616, line: 65, baseType: !1039, size: 64, offset: 1664)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!413, !613, !613, !951}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !622, file: !616, line: 66, baseType: !1043, size: 64, offset: 1728)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!413, !613, !613, !818, !951}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !622, file: !616, line: 67, baseType: !1039, size: 64, offset: 1792)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !622, file: !616, line: 69, baseType: !1027, size: 64, offset: 1856)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !622, file: !616, line: 70, baseType: !1035, size: 64, offset: 1920)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !622, file: !616, line: 71, baseType: !1043, size: 64, offset: 1984)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !622, file: !616, line: 72, baseType: !1051, size: 64, offset: 2048)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!413, !613, !981}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !622, file: !616, line: 73, baseType: !1027, size: 64, offset: 2112)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !622, file: !616, line: 75, baseType: !1056, size: 64, offset: 2176)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!413, !613, !1059, !981}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !622, file: !616, line: 76, baseType: !639, size: 64, offset: 2240)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !622, file: !616, line: 77, baseType: !639, size: 64, offset: 2304)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !622, file: !616, line: 78, baseType: !948, size: 64, offset: 2368)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !622, file: !616, line: 79, baseType: !968, size: 64, offset: 2432)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !622, file: !616, line: 81, baseType: !1065, size: 64, offset: 2496)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!413, !613, !523, !613, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !622, file: !616, line: 82, baseType: !1070, size: 64, offset: 2560)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!413, !613, !459, !1073, !1073, !980, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !622, file: !616, line: 83, baseType: !1077, size: 64, offset: 2624)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!413, !613, !459, !862, !459}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !622, file: !616, line: 84, baseType: !1081, size: 64, offset: 2688)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!413, !613, !459, !628, !459, !628, !522}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !622, file: !616, line: 85, baseType: !1085, size: 64, offset: 2752)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!413, !613, !613, !1068}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !622, file: !616, line: 87, baseType: !1089, size: 64, offset: 2816)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!413, !613, !642, !505}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !622, file: !616, line: 88, baseType: !1093, size: 64, offset: 2880)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!413, !613, !523}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !622, file: !616, line: 89, baseType: !1093, size: 64, offset: 2944)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !622, file: !616, line: 90, baseType: !1098, size: 64, offset: 3008)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!413, !613, !642, !632}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !622, file: !616, line: 91, baseType: !1031, size: 64, offset: 3072)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !622, file: !616, line: 93, baseType: !1103, size: 64, offset: 3136)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!413, !613, !747}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !622, file: !616, line: 94, baseType: !1107, size: 64, offset: 3200)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!413, !613, !459, !575, !575, !505, !1110, !1110, !1005}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !622, file: !616, line: 95, baseType: !1107, size: 64, offset: 3264)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !622, file: !616, line: 96, baseType: !1107, size: 64, offset: 3328)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !622, file: !616, line: 97, baseType: !1107, size: 64, offset: 3392)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !622, file: !616, line: 99, baseType: !1115, size: 64, offset: 3456)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!413, !613, !1118, !1121}
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !779, line: 51, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !779, line: 51, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !616, line: 609, size: 6208, elements: !1124)
!1124 = !{!1125, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1145, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1163, !1164, !1165, !1166, !1167, !1169, !1170, !1171, !1172, !1173, !1174, !1175}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1123, file: !616, line: 610, baseType: !619, size: 4480)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1123, file: !616, line: 610, baseType: !1127, size: 32, offset: 4480)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !455)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1123, file: !616, line: 611, baseType: !459, size: 32, offset: 4512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1123, file: !616, line: 611, baseType: !459, size: 32, offset: 4544)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1123, file: !616, line: 611, baseType: !459, size: 32, offset: 4576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1123, file: !616, line: 612, baseType: !459, size: 32, offset: 4608)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1123, file: !616, line: 613, baseType: !459, size: 32, offset: 4640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1123, file: !616, line: 614, baseType: !505, size: 64, offset: 4672)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1123, file: !616, line: 615, baseType: !507, size: 64, offset: 4736)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1123, file: !616, line: 616, baseType: !862, size: 64, offset: 4800)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1123, file: !616, line: 617, baseType: !505, size: 64, offset: 4864)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1123, file: !616, line: 618, baseType: !1138, size: 64, offset: 4928)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !616, line: 602, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 598, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1140, file: !616, line: 599, baseType: !459, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1140, file: !616, line: 600, baseType: !459, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1140, file: !616, line: 601, baseType: !522, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1123, file: !616, line: 619, baseType: !1146, size: 64, offset: 4992)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !616, line: 607, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 604, size: 128, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1148, file: !616, line: 605, baseType: !459, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1148, file: !616, line: 606, baseType: !522, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1123, file: !616, line: 620, baseType: !522, size: 64, offset: 5056)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1123, file: !616, line: 621, baseType: !514, size: 64, offset: 5120)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1123, file: !616, line: 622, baseType: !514, size: 64, offset: 5184)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1123, file: !616, line: 623, baseType: !642, size: 64, offset: 5248)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1123, file: !616, line: 623, baseType: !642, size: 64, offset: 5312)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1123, file: !616, line: 623, baseType: !642, size: 64, offset: 5376)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1123, file: !616, line: 624, baseType: !575, size: 32, offset: 5440)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1123, file: !616, line: 625, baseType: !1160, size: 64, offset: 5504)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!413}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1123, file: !616, line: 626, baseType: !496, size: 64, offset: 5568)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1123, file: !616, line: 627, baseType: !642, size: 64, offset: 5632)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1123, file: !616, line: 628, baseType: !459, size: 32, offset: 5696)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1123, file: !616, line: 629, baseType: !436, size: 64, offset: 5760)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1123, file: !616, line: 630, baseType: !1168, size: 32, offset: 5824)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1123, file: !616, line: 631, baseType: !459, size: 32, offset: 5856)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1123, file: !616, line: 631, baseType: !459, size: 32, offset: 5888)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1123, file: !616, line: 632, baseType: !575, size: 32, offset: 5920)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1123, file: !616, line: 633, baseType: !575, size: 32, offset: 5952)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1123, file: !616, line: 634, baseType: !447, size: 64, offset: 6016)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1123, file: !616, line: 634, baseType: !496, size: 64, offset: 6080)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1123, file: !616, line: 635, baseType: !467, size: 64, offset: 6144)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !622, file: !616, line: 100, baseType: !1177, size: 64, offset: 3520)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!413, !613, !459, !459, !1180, !1183}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1182)
!1182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !622, file: !616, line: 101, baseType: !1027, size: 64, offset: 3584)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !622, file: !616, line: 102, baseType: !1186, size: 64, offset: 3648)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!413, !613, !818, !818, !981}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !622, file: !616, line: 103, baseType: !625, size: 64, offset: 3712)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !622, file: !616, line: 105, baseType: !1191, size: 64, offset: 3776)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!413, !613, !818, !818, !980, !981}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !622, file: !616, line: 106, baseType: !1027, size: 64, offset: 3840)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !622, file: !616, line: 107, baseType: !1196, size: 64, offset: 3904)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!413, !613, !423}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !622, file: !616, line: 108, baseType: !1200, size: 64, offset: 3968)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!413, !613, !1203, !980, !981}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !436)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !622, file: !616, line: 109, baseType: !1160, size: 64, offset: 4032)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !622, file: !616, line: 111, baseType: !1206, size: 64, offset: 4096)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!413, !613, !613, !613, !514, !613}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !622, file: !616, line: 112, baseType: !1210, size: 64, offset: 4160)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!413, !613, !613, !613, !613}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !622, file: !616, line: 113, baseType: !1214, size: 64, offset: 4224)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!413, !613, !778, !778}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !622, file: !616, line: 114, baseType: !625, size: 64, offset: 4288)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !622, file: !616, line: 115, baseType: !1031, size: 64, offset: 4352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !622, file: !616, line: 117, baseType: !1089, size: 64, offset: 4416)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !622, file: !616, line: 118, baseType: !1089, size: 64, offset: 4480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !622, file: !616, line: 119, baseType: !1200, size: 64, offset: 4544)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !622, file: !616, line: 120, baseType: !1223, size: 64, offset: 4608)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!413, !613, !1226, !1005}
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !622, file: !616, line: 121, baseType: !1160, size: 64, offset: 4672)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !622, file: !616, line: 123, baseType: !1229, size: 64, offset: 4736)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!413, !613, !459, !496}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !622, file: !616, line: 124, baseType: !1233, size: 64, offset: 4800)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!413, !613, !1121, !642, !496}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !622, file: !616, line: 125, baseType: !1237, size: 64, offset: 4864)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!413, !551, !613}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !622, file: !616, line: 126, baseType: !639, size: 64, offset: 4928)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !622, file: !616, line: 127, baseType: !639, size: 64, offset: 4992)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !622, file: !616, line: 129, baseType: !1243, size: 64, offset: 5056)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!413, !613, !862}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !622, file: !616, line: 130, baseType: !1247, size: 64, offset: 5120)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!413, !613, !1250, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1252, file: !36, line: 653, baseType: !459, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1252, file: !36, line: 653, baseType: !642, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !622, file: !616, line: 131, baseType: !1247, size: 64, offset: 5184)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !622, file: !616, line: 132, baseType: !1258, size: 64, offset: 5248)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!413, !613, !505, !505, !505}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !622, file: !616, line: 133, baseType: !1196, size: 64, offset: 5312)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !622, file: !616, line: 135, baseType: !1263, size: 64, offset: 5376)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!413, !613, !514, !1005}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !622, file: !616, line: 136, baseType: !1263, size: 64, offset: 5440)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !622, file: !616, line: 137, baseType: !1268, size: 64, offset: 5504)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!413, !613, !1005}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !622, file: !616, line: 138, baseType: !625, size: 64, offset: 5568)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !622, file: !616, line: 139, baseType: !1273, size: 64, offset: 5632)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!413, !613, !656, !656}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !622, file: !616, line: 141, baseType: !1160, size: 64, offset: 5696)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !622, file: !616, line: 142, baseType: !1278, size: 64, offset: 5760)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!413, !613, !613, !514, !613}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !622, file: !616, line: 143, baseType: !1282, size: 64, offset: 5824)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!413, !613, !613, !613}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !622, file: !616, line: 144, baseType: !1160, size: 64, offset: 5888)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !622, file: !616, line: 145, baseType: !1278, size: 64, offset: 5952)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !622, file: !616, line: 147, baseType: !1282, size: 64, offset: 6016)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !622, file: !616, line: 148, baseType: !1160, size: 64, offset: 6080)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !622, file: !616, line: 149, baseType: !1278, size: 64, offset: 6144)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !622, file: !616, line: 150, baseType: !1282, size: 64, offset: 6208)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !622, file: !616, line: 151, baseType: !1292, size: 64, offset: 6272)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!413, !613, !575}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !622, file: !616, line: 153, baseType: !1027, size: 64, offset: 6336)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !622, file: !616, line: 154, baseType: !1027, size: 64, offset: 6400)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !622, file: !616, line: 155, baseType: !1027, size: 64, offset: 6464)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !622, file: !616, line: 156, baseType: !1027, size: 64, offset: 6528)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !622, file: !616, line: 157, baseType: !1196, size: 64, offset: 6592)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !622, file: !616, line: 159, baseType: !1301, size: 64, offset: 6656)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!413, !613, !459, !630}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !622, file: !616, line: 160, baseType: !1027, size: 64, offset: 6720)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !622, file: !616, line: 161, baseType: !1027, size: 64, offset: 6784)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !622, file: !616, line: 162, baseType: !1027, size: 64, offset: 6848)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !622, file: !616, line: 163, baseType: !1027, size: 64, offset: 6912)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !622, file: !616, line: 165, baseType: !1282, size: 64, offset: 6976)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !622, file: !616, line: 166, baseType: !1282, size: 64, offset: 7040)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !622, file: !616, line: 167, baseType: !1089, size: 64, offset: 7104)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !622, file: !616, line: 168, baseType: !1312, size: 64, offset: 7168)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!413, !613, !642, !459}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !622, file: !616, line: 169, baseType: !1316, size: 64, offset: 7232)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!413, !613, !1005, !505}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !622, file: !616, line: 171, baseType: !1051, size: 64, offset: 7296)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !622, file: !616, line: 172, baseType: !1027, size: 64, offset: 7360)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !622, file: !616, line: 173, baseType: !1322, size: 64, offset: 7424)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!413, !613, !505, !1110}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !622, file: !616, line: 174, baseType: !1186, size: 64, offset: 7488)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !622, file: !616, line: 175, baseType: !1186, size: 64, offset: 7552)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !622, file: !616, line: 177, baseType: !639, size: 64, offset: 7616)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !622, file: !616, line: 178, baseType: !977, size: 64, offset: 7680)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !622, file: !616, line: 179, baseType: !639, size: 64, offset: 7744)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !622, file: !616, line: 180, baseType: !938, size: 64, offset: 7808)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !622, file: !616, line: 181, baseType: !1332, size: 64, offset: 7872)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!413, !613, !415, !980, !981}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !622, file: !616, line: 183, baseType: !1243, size: 64, offset: 7936)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !622, file: !616, line: 184, baseType: !1012, size: 64, offset: 8000)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !622, file: !616, line: 185, baseType: !1338, size: 64, offset: 8064)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
