; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/ibcgs/ibcgs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/ibcgs/ibcgs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !140, line: 70, baseType: !5, size: 32, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !143, !144}
!142 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!143 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 451, baseType: !64, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151}
!147 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!148 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!149 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!150 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!151 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 663, baseType: !5, size: 32, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !156, !157}
!155 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 395, baseType: !64, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166}
!160 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!161 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!162 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!163 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!164 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!165 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!166 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!167 = !{!168, !172, !173, !176, !296, !376, !231, !379, !382, !258, !64, !385, !248, !5}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !169, line: 330, baseType: !170)
!169 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !169, line: 330, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !179, line: 73, size: 4480, elements: !180)
!179 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!180 = !{!181, !183, !229, !230, !232, !235, !236, !237, !238, !246, !247, !249, !253, !257, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !270, !271, !272, !274, !275, !277, !279, !280, !281, !282, !283, !286, !288, !289, !290, !291, !292, !295, !297, !298, !299, !309, !311, !312, !316, !317, !366, !371, !373, !374, !375}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !178, file: !179, line: 74, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !178, file: !179, line: 75, baseType: !184, size: 448, offset: 64)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 448, elements: !227)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !179, line: 53, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 45, size: 448, elements: !187)
!187 = !{!188, !194, !202, !207, !211, !215, !222}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !186, file: !179, line: 46, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !176, !193}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !186, file: !179, line: 47, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!192, !176, !198}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !199, line: 16, baseType: !200)
!199 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !199, line: 16, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !186, file: !179, line: 48, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!192, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !186, file: !179, line: 49, baseType: !208, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!192, !176, !173, !176}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !186, file: !179, line: 50, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!192, !176, !173, !206}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !186, file: !179, line: 51, baseType: !216, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!192, !176, !173, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !186, file: !179, line: 52, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!192, !176, !173, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!227 = !{!228}
!228 = !DISubrange(count: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !178, file: !179, line: 76, baseType: !168, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !178, file: !179, line: 77, baseType: !231, size: 32, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !178, file: !179, line: 78, baseType: !233, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !234)
!234 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !178, file: !179, line: 78, baseType: !233, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !178, file: !179, line: 78, baseType: !233, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !178, file: !179, line: 78, baseType: !233, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !178, file: !179, line: 79, baseType: !239, size: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !242, line: 27, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !244, line: 43, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!245 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !178, file: !179, line: 80, baseType: !231, size: 32, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !178, file: !179, line: 81, baseType: !248, size: 32, offset: 992)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !178, file: !179, line: 82, baseType: !250, size: 64, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !178, file: !179, line: 83, baseType: !254, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !178, file: !179, line: 84, baseType: !258, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !178, file: !179, line: 85, baseType: !258, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !178, file: !179, line: 86, baseType: !258, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !178, file: !179, line: 87, baseType: !258, size: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !178, file: !179, line: 88, baseType: !176, size: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !178, file: !179, line: 89, baseType: !239, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 90, baseType: !258, size: 64, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !178, file: !179, line: 91, baseType: !258, size: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !178, file: !179, line: 92, baseType: !231, size: 32, offset: 1664)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !178, file: !179, line: 93, baseType: !172, size: 64, offset: 1728)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !178, file: !179, line: 94, baseType: !269, size: 64, offset: 1792)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !240)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !178, file: !179, line: 95, baseType: !231, size: 32, offset: 1856)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !178, file: !179, line: 95, baseType: !231, size: 32, offset: 1888)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !178, file: !179, line: 96, baseType: !273, size: 64, offset: 1920)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !178, file: !179, line: 96, baseType: !273, size: 64, offset: 1984)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !178, file: !179, line: 97, baseType: !276, size: 64, offset: 2048)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !178, file: !179, line: 97, baseType: !278, size: 64, offset: 2112)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !178, file: !179, line: 98, baseType: !231, size: 32, offset: 2176)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !178, file: !179, line: 98, baseType: !231, size: 32, offset: 2208)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !178, file: !179, line: 99, baseType: !273, size: 64, offset: 2240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !178, file: !179, line: 99, baseType: !273, size: 64, offset: 2304)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !178, file: !179, line: 100, baseType: !284, size: 64, offset: 2368)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !234)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !178, file: !179, line: 100, baseType: !287, size: 64, offset: 2432)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !178, file: !179, line: 101, baseType: !231, size: 32, offset: 2496)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !178, file: !179, line: 101, baseType: !231, size: 32, offset: 2528)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !178, file: !179, line: 102, baseType: !273, size: 64, offset: 2560)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !178, file: !179, line: 102, baseType: !273, size: 64, offset: 2624)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !178, file: !179, line: 103, baseType: !293, size: 64, offset: 2688)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !285)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !178, file: !179, line: 103, baseType: !296, size: 64, offset: 2752)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !178, file: !179, line: 104, baseType: !226, size: 64, offset: 2816)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !178, file: !179, line: 105, baseType: !231, size: 32, offset: 2880)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !178, file: !179, line: 106, baseType: !300, size: 128, offset: 2944)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 128, elements: !307)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !179, line: 64, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 61, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !303, file: !179, line: 62, baseType: !219, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !303, file: !179, line: 63, baseType: !172, size: 64, offset: 64)
!307 = !{!308}
!308 = !DISubrange(count: 2)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !178, file: !179, line: 107, baseType: !310, size: 64, offset: 3072)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 64, elements: !307)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !178, file: !179, line: 108, baseType: !172, size: 64, offset: 3136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !178, file: !179, line: 109, baseType: !313, size: 64, offset: 3200)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!192, !172}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !178, file: !179, line: 111, baseType: !231, size: 32, offset: 3264)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !178, file: !179, line: 112, baseType: !318, size: 320, offset: 3328)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 320, elements: !364)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!192, !322, !176, !172}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !325)
!325 = !{!326, !327, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !324, file: !10, line: 100, baseType: !231, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !10, line: 101, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !339, !340, !341, !345, !347, !349, !350, !351}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !330, file: !10, line: 84, baseType: !258, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !330, file: !10, line: 85, baseType: !258, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !10, line: 86, baseType: !172, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !330, file: !10, line: 87, baseType: !250, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !330, file: !10, line: 88, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !330, file: !10, line: 89, baseType: !175, size: 8, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !330, file: !10, line: 90, baseType: !258, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !330, file: !10, line: 91, baseType: !342, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !343, line: 46, baseType: !344)
!343 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!344 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !330, file: !10, line: 92, baseType: !346, size: 32, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !10, line: 93, baseType: !348, size: 32, offset: 544)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !10, line: 94, baseType: !328, size: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !330, file: !10, line: 95, baseType: !258, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !330, file: !10, line: 96, baseType: !172, size: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !324, file: !10, line: 102, baseType: !258, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !324, file: !10, line: 102, baseType: !258, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !324, file: !10, line: 103, baseType: !258, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !324, file: !10, line: 104, baseType: !168, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !324, file: !10, line: 105, baseType: !346, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !324, file: !10, line: 105, baseType: !346, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !324, file: !10, line: 105, baseType: !346, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !324, file: !10, line: 106, baseType: !176, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !324, file: !10, line: 107, baseType: !361, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!364 = !{!365}
!365 = !DISubrange(count: 5)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !178, file: !179, line: 113, baseType: !367, size: 320, offset: 3648)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 320, elements: !364)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!192, !176, !172}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !178, file: !179, line: 114, baseType: !372, size: 320, offset: 3968)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 320, elements: !364)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !178, file: !179, line: 115, baseType: !346, size: 32, offset: 4288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !178, file: !179, line: 120, baseType: !361, size: 64, offset: 4352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !178, file: !179, line: 121, baseType: !346, size: 32, offset: 4416)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !169, line: 331, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !169, line: 331, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !169, line: 338, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !169, line: 338, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !63, line: 395, baseType: !158)
!386 = !{i32 7, !"Dwarf Version", i32 4}
!387 = !{i32 2, !"Debug Info Version", i32 3}
!388 = !{i32 1, !"wchar_size", i32 4}
!389 = !{i32 7, !"PIC Level", i32 2}
!390 = !{i32 7, !"uwtable", i32 1}
!391 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!392 = distinct !DISubprogram(name: "KSPCreate_IBCGS", scope: !393, file: !393, line: 326, type: !394, scopeLine: 327, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !932)
!393 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/ibcgs/ibcgs.c", directory: "/home/users/ndemeye/xSDK")
!394 = !DISubroutineType(types: !395)
!395 = !{!192, !396}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !71, line: 22, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !140, line: 75, size: 12800, elements: !399)
!399 = !{!400, !402, !747, !752, !753, !754, !755, !785, !786, !787, !788, !789, !791, !796, !797, !798, !799, !800, !801, !802, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !825, !831, !832, !833, !834, !839, !840, !841, !842, !847, !848, !849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !902, !903, !904, !905, !906, !913, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !929, !930, !931}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !398, file: !140, line: 76, baseType: !401, size: 4480)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !179, line: 122, baseType: !178)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !398, file: !140, line: 76, baseType: !403, size: 896, offset: 4480)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 896, elements: !227)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !140, line: 18, size: 896, elements: !405)
!405 = !{!406, !708, !712, !714, !722, !723, !727, !728, !732, !736, !740, !741, !745, !746}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !404, file: !140, line: 19, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!192, !396, !410, !424}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !413, line: 142, size: 12800, elements: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!414 = !{!415, !416, !633, !654, !655, !656, !702, !703, !704, !705, !707}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !412, file: !413, line: 143, baseType: !401, size: 4480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !412, file: !413, line: 143, baseType: !417, size: 5248, offset: 4480)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 5248, elements: !227)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !413, line: 23, size: 5248, elements: !419)
!419 = !{!420, !425, !430, !434, !438, !444, !449, !450, !451, !455, !459, !460, !461, !465, !469, !473, !474, !478, !482, !486, !487, !494, !498, !499, !503, !507, !508, !509, !513, !514, !521, !526, !527, !528, !532, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !553, !554, !555, !559, !563, !564, !565, !566, !570, !571, !572, !573, !574, !575, !576, !580, !581, !585, !592, !593, !597, !598, !602, !603, !604, !605, !606, !607, !608, !609, !613, !614, !615, !621, !625, !626, !627}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !418, file: !413, line: 24, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!192, !410, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !418, file: !413, line: 25, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!192, !410, !231, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !418, file: !413, line: 26, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!192, !231, !424}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !418, file: !413, line: 27, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!192, !410, !410, !293}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !418, file: !413, line: 28, baseType: !439, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!192, !410, !231, !442, !293}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !418, file: !413, line: 29, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!192, !410, !448, !284}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !418, file: !413, line: 30, baseType: !435, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !418, file: !413, line: 31, baseType: !439, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !418, file: !413, line: 32, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!192, !410, !294}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !418, file: !413, line: 33, baseType: !456, size: 64, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!192, !410, !410}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !418, file: !413, line: 34, baseType: !452, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !418, file: !413, line: 35, baseType: !456, size: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !418, file: !413, line: 36, baseType: !462, size: 64, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!192, !410, !294, !410}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !418, file: !413, line: 37, baseType: !466, size: 64, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!192, !410, !294, !294, !410}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !418, file: !413, line: 38, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!192, !410, !231, !377, !424}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !418, file: !413, line: 39, baseType: !462, size: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !418, file: !413, line: 40, baseType: !475, size: 64, offset: 1024)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!192, !410, !294, !410, !410}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !418, file: !413, line: 41, baseType: !479, size: 64, offset: 1088)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!192, !410, !294, !294, !294, !410, !410}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !418, file: !413, line: 42, baseType: !483, size: 64, offset: 1152)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!192, !410, !410, !410}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !418, file: !413, line: 43, baseType: !483, size: 64, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !418, file: !413, line: 44, baseType: !488, size: 64, offset: 1280)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!192, !410, !231, !491, !377, !493}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !418, file: !413, line: 45, baseType: !495, size: 64, offset: 1344)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!192, !410}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !418, file: !413, line: 46, baseType: !495, size: 64, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !418, file: !413, line: 47, baseType: !500, size: 64, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!192, !410, !296}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !418, file: !413, line: 48, baseType: !504, size: 64, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!192, !410, !276}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !418, file: !413, line: 49, baseType: !504, size: 64, offset: 1600)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !418, file: !413, line: 50, baseType: !500, size: 64, offset: 1664)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !418, file: !413, line: 51, baseType: !510, size: 64, offset: 1728)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!192, !410, !276, !284}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !418, file: !413, line: 52, baseType: !510, size: 64, offset: 1792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !418, file: !413, line: 53, baseType: !515, size: 64, offset: 1856)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!192, !410, !518}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !418, file: !413, line: 54, baseType: !522, size: 64, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!192, !410, !525, !346}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !418, file: !413, line: 55, baseType: !488, size: 64, offset: 1984)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !418, file: !413, line: 56, baseType: !495, size: 64, offset: 2048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !418, file: !413, line: 57, baseType: !529, size: 64, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!192, !410, !198}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !418, file: !413, line: 58, baseType: !533, size: 64, offset: 2176)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!192, !410, !377}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !418, file: !413, line: 59, baseType: !533, size: 64, offset: 2240)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !418, file: !413, line: 60, baseType: !435, size: 64, offset: 2304)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !418, file: !413, line: 61, baseType: !435, size: 64, offset: 2368)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !418, file: !413, line: 62, baseType: !445, size: 64, offset: 2432)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !418, file: !413, line: 63, baseType: !439, size: 64, offset: 2496)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !418, file: !413, line: 64, baseType: !439, size: 64, offset: 2560)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !418, file: !413, line: 65, baseType: !529, size: 64, offset: 2624)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !418, file: !413, line: 66, baseType: !495, size: 64, offset: 2688)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !418, file: !413, line: 67, baseType: !495, size: 64, offset: 2752)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !418, file: !413, line: 68, baseType: !546, size: 64, offset: 2816)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!192, !410, !549}
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !550, line: 30, baseType: !551)
!550 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !550, line: 30, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !418, file: !413, line: 69, baseType: !488, size: 64, offset: 2880)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !418, file: !413, line: 70, baseType: !495, size: 64, offset: 2944)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !418, file: !413, line: 71, baseType: !556, size: 64, offset: 3008)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!192, !322, !410}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !418, file: !413, line: 72, baseType: !560, size: 64, offset: 3072)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!192, !410, !410, !284}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !418, file: !413, line: 73, baseType: !483, size: 64, offset: 3136)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !418, file: !413, line: 74, baseType: !483, size: 64, offset: 3200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !418, file: !413, line: 75, baseType: !483, size: 64, offset: 3264)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !418, file: !413, line: 76, baseType: !567, size: 64, offset: 3328)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!192, !410, !231, !491, !293}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !418, file: !413, line: 77, baseType: !495, size: 64, offset: 3392)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !418, file: !413, line: 78, baseType: !495, size: 64, offset: 3456)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !418, file: !413, line: 79, baseType: !495, size: 64, offset: 3520)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !418, file: !413, line: 80, baseType: !495, size: 64, offset: 3584)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !418, file: !413, line: 81, baseType: !452, size: 64, offset: 3648)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !418, file: !413, line: 82, baseType: !495, size: 64, offset: 3712)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !418, file: !413, line: 83, baseType: !577, size: 64, offset: 3776)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!192, !410, !231, !410, !493}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !418, file: !413, line: 84, baseType: !577, size: 64, offset: 3840)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !418, file: !413, line: 85, baseType: !582, size: 64, offset: 3904)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!192, !410, !410, !293, !293}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !418, file: !413, line: 86, baseType: !586, size: 64, offset: 3968)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!192, !410, !589, !424}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !550, line: 11, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !550, line: 11, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !418, file: !413, line: 87, baseType: !586, size: 64, offset: 4032)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !418, file: !413, line: 88, baseType: !594, size: 64, offset: 4096)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!192, !410, !376}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !418, file: !413, line: 89, baseType: !594, size: 64, offset: 4160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !418, file: !413, line: 90, baseType: !599, size: 64, offset: 4224)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!192, !410, !231, !491, !491, !410, !493}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !418, file: !413, line: 91, baseType: !599, size: 64, offset: 4288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !418, file: !413, line: 92, baseType: !529, size: 64, offset: 4352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !418, file: !413, line: 93, baseType: !529, size: 64, offset: 4416)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !418, file: !413, line: 94, baseType: !456, size: 64, offset: 4480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !418, file: !413, line: 95, baseType: !456, size: 64, offset: 4544)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !418, file: !413, line: 96, baseType: !456, size: 64, offset: 4608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !418, file: !413, line: 97, baseType: !456, size: 64, offset: 4672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !418, file: !413, line: 98, baseType: !610, size: 64, offset: 4736)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!192, !410, !346}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !418, file: !413, line: 99, baseType: !500, size: 64, offset: 4800)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !418, file: !413, line: 100, baseType: !500, size: 64, offset: 4864)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !418, file: !413, line: 101, baseType: !616, size: 64, offset: 4928)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!192, !410, !296, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !418, file: !413, line: 102, baseType: !622, size: 64, offset: 4992)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!192, !410, !376, !619}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !418, file: !413, line: 103, baseType: !500, size: 64, offset: 5056)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !418, file: !413, line: 104, baseType: !594, size: 64, offset: 5120)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !418, file: !413, line: 105, baseType: !628, size: 64, offset: 5184)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!192, !231, !442, !424, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !412, file: !413, line: 144, baseType: !634, size: 64, offset: 9728)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !550, line: 60, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !637, line: 240, size: 640, elements: !638)
!637 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !636, file: !637, line: 241, baseType: !168, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !636, file: !637, line: 242, baseType: !248, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !636, file: !637, line: 243, baseType: !231, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !636, file: !637, line: 243, baseType: !231, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !636, file: !637, line: 244, baseType: !231, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !636, file: !637, line: 244, baseType: !231, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !636, file: !637, line: 245, baseType: !276, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !636, file: !637, line: 246, baseType: !346, size: 32, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !636, file: !637, line: 247, baseType: !231, size: 32, offset: 352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !636, file: !637, line: 251, baseType: !231, size: 32, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !636, file: !637, line: 252, baseType: !549, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !636, file: !637, line: 253, baseType: !346, size: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !636, file: !637, line: 254, baseType: !231, size: 32, offset: 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !636, file: !637, line: 254, baseType: !231, size: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !636, file: !637, line: 255, baseType: !231, size: 32, offset: 608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !412, file: !413, line: 145, baseType: !172, size: 64, offset: 9792)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !412, file: !413, line: 146, baseType: !346, size: 32, offset: 9856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !412, file: !413, line: 147, baseType: !657, size: 1344, offset: 9920)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !413, line: 140, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 114, size: 1344, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !678, !679, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !658, file: !413, line: 115, baseType: !231, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !658, file: !413, line: 116, baseType: !231, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !658, file: !413, line: 117, baseType: !231, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !658, file: !413, line: 118, baseType: !231, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !658, file: !413, line: 119, baseType: !231, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !658, file: !413, line: 120, baseType: !231, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !658, file: !413, line: 121, baseType: !276, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !658, file: !413, line: 122, baseType: !293, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !658, file: !413, line: 124, baseType: !168, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !658, file: !413, line: 125, baseType: !248, size: 32, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !658, file: !413, line: 125, baseType: !248, size: 32, offset: 416)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !658, file: !413, line: 126, baseType: !248, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !658, file: !413, line: 126, baseType: !248, size: 32, offset: 480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !658, file: !413, line: 127, baseType: !674, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !169, line: 339, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !169, line: 339, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !658, file: !413, line: 128, baseType: !674, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !658, file: !413, line: 129, baseType: !680, size: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !169, line: 341, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !169, line: 351, size: 192, elements: !683)
!683 = !{!684, !685, !686, !687, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !682, file: !169, line: 354, baseType: !64, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !682, file: !169, line: 355, baseType: !64, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !682, file: !169, line: 356, baseType: !64, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !682, file: !169, line: 361, baseType: !64, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !682, file: !169, line: 362, baseType: !342, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !658, file: !413, line: 130, baseType: !231, size: 32, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !658, file: !413, line: 130, baseType: !231, size: 32, offset: 736)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !658, file: !413, line: 131, baseType: !293, size: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !658, file: !413, line: 131, baseType: !293, size: 64, offset: 832)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !658, file: !413, line: 132, baseType: !276, size: 64, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !658, file: !413, line: 132, baseType: !276, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !658, file: !413, line: 133, baseType: !231, size: 32, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !658, file: !413, line: 134, baseType: !276, size: 64, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !658, file: !413, line: 135, baseType: !231, size: 32, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !658, file: !413, line: 136, baseType: !346, size: 32, offset: 1184)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !658, file: !413, line: 137, baseType: !346, size: 32, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !658, file: !413, line: 138, baseType: !493, size: 32, offset: 1248)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !658, file: !413, line: 139, baseType: !276, size: 64, offset: 1280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !412, file: !413, line: 147, baseType: !657, size: 1344, offset: 11264)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !412, file: !413, line: 148, baseType: !346, size: 32, offset: 12608)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !412, file: !413, line: 149, baseType: !231, size: 32, offset: 12640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !412, file: !413, line: 150, baseType: !706, size: 32, offset: 12672)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !412, file: !413, line: 157, baseType: !258, size: 64, offset: 12736)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !404, file: !140, line: 22, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!192, !396, !410, !410, !424}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !404, file: !140, line: 25, baseType: !713, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !404, file: !140, line: 26, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!192, !396, !718, !718}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !719, line: 16, baseType: !720)
!719 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !719, line: 16, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !404, file: !140, line: 27, baseType: !713, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !404, file: !140, line: 28, baseType: !724, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!192, !322, !396}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !404, file: !140, line: 29, baseType: !713, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !404, file: !140, line: 30, baseType: !729, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!192, !396, !284, !284}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !404, file: !140, line: 31, baseType: !733, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!192, !396, !231, !284, !284, !276}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !404, file: !140, line: 32, baseType: !737, size: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!192, !396, !346, !346, !276, !424, !284, !284}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !404, file: !140, line: 33, baseType: !713, size: 64, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !404, file: !140, line: 34, baseType: !742, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!192, !396, !198}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !404, file: !140, line: 35, baseType: !713, size: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !404, file: !140, line: 36, baseType: !742, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !398, file: !140, line: 77, baseType: !748, size: 64, offset: 5376)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !749, line: 14, baseType: !750)
!749 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !749, line: 14, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !398, file: !140, line: 78, baseType: !346, size: 32, offset: 5440)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !398, file: !140, line: 79, baseType: !346, size: 32, offset: 5472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !398, file: !140, line: 81, baseType: !231, size: 32, offset: 5504)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !398, file: !140, line: 82, baseType: !756, size: 64, offset: 5568)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !71, line: 752, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !140, line: 54, size: 5184, elements: !759)
!759 = !{!760, !761, !781, !782, !783, !784}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !758, file: !140, line: 55, baseType: !401, size: 4480)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !758, file: !140, line: 55, baseType: !762, size: 448, offset: 4480)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 448, elements: !227)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !140, line: 41, size: 448, elements: !764)
!764 = !{!765, !769, !770, !774, !775, !776, !780}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !763, file: !140, line: 42, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!192, !756, !410, !410}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !763, file: !140, line: 43, baseType: !766, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !763, file: !140, line: 44, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!192, !756}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !763, file: !140, line: 45, baseType: !771, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !763, file: !140, line: 46, baseType: !771, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !763, file: !140, line: 47, baseType: !777, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!192, !756, !198}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !763, file: !140, line: 48, baseType: !771, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !758, file: !140, line: 56, baseType: !396, size: 64, offset: 4928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !758, file: !140, line: 57, baseType: !718, size: 64, offset: 4992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !758, file: !140, line: 58, baseType: !269, size: 64, offset: 5056)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !140, line: 59, baseType: !172, size: 64, offset: 5120)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !398, file: !140, line: 83, baseType: !346, size: 32, offset: 5632)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !398, file: !140, line: 84, baseType: !346, size: 32, offset: 5664)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !398, file: !140, line: 85, baseType: !346, size: 32, offset: 5696)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !398, file: !140, line: 86, baseType: !346, size: 32, offset: 5728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !398, file: !140, line: 87, baseType: !790, size: 32, offset: 5760)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !63, line: 85, baseType: !62)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !398, file: !140, line: 88, baseType: !792, size: 384, offset: 5792)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 384, elements: !793)
!793 = !{!794, !795}
!794 = !DISubrange(count: 4)
!795 = !DISubrange(count: 3)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !398, file: !140, line: 89, baseType: !285, size: 64, offset: 6208)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !398, file: !140, line: 90, baseType: !285, size: 64, offset: 6272)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !398, file: !140, line: 91, baseType: !285, size: 64, offset: 6336)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !398, file: !140, line: 92, baseType: !285, size: 64, offset: 6400)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !398, file: !140, line: 93, baseType: !285, size: 64, offset: 6464)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !398, file: !140, line: 94, baseType: !285, size: 64, offset: 6528)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !398, file: !140, line: 95, baseType: !803, size: 32, offset: 6592)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !71, line: 540, baseType: !70)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !398, file: !140, line: 96, baseType: !346, size: 32, offset: 6624)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !398, file: !140, line: 98, baseType: !410, size: 64, offset: 6656)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !398, file: !140, line: 98, baseType: !410, size: 64, offset: 6720)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !398, file: !140, line: 102, baseType: !284, size: 64, offset: 6784)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !398, file: !140, line: 103, baseType: !284, size: 64, offset: 6848)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !398, file: !140, line: 104, baseType: !231, size: 32, offset: 6912)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !398, file: !140, line: 105, baseType: !231, size: 32, offset: 6944)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !398, file: !140, line: 106, baseType: !346, size: 32, offset: 6976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !398, file: !140, line: 107, baseType: !284, size: 64, offset: 7040)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !398, file: !140, line: 108, baseType: !284, size: 64, offset: 7104)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !398, file: !140, line: 109, baseType: !231, size: 32, offset: 7168)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !398, file: !140, line: 110, baseType: !231, size: 32, offset: 7200)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !398, file: !140, line: 111, baseType: !346, size: 32, offset: 7232)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !398, file: !140, line: 113, baseType: !231, size: 32, offset: 7264)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !398, file: !140, line: 114, baseType: !346, size: 32, offset: 7296)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !398, file: !140, line: 117, baseType: !231, size: 32, offset: 7328)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !398, file: !140, line: 120, baseType: !821, size: 320, offset: 7360)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 320, elements: !364)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!192, !396, !231, !285, !172}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !398, file: !140, line: 121, baseType: !826, size: 320, offset: 7680)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 320, elements: !364)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!192, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !398, file: !140, line: 122, baseType: !372, size: 320, offset: 8000)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !398, file: !140, line: 123, baseType: !231, size: 32, offset: 8320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !398, file: !140, line: 124, baseType: !346, size: 32, offset: 8352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !398, file: !140, line: 126, baseType: !835, size: 320, offset: 8384)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 320, elements: !364)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!192, !396, !172}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !398, file: !140, line: 127, baseType: !826, size: 320, offset: 8704)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !398, file: !140, line: 128, baseType: !372, size: 320, offset: 9024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !398, file: !140, line: 129, baseType: !231, size: 32, offset: 9344)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !398, file: !140, line: 131, baseType: !843, size: 64, offset: 9408)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!192, !396, !231, !285, !846, !172}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !398, file: !140, line: 132, baseType: !313, size: 64, offset: 9472)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !398, file: !140, line: 133, baseType: !172, size: 64, offset: 9536)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !398, file: !140, line: 135, baseType: !172, size: 64, offset: 9600)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !398, file: !140, line: 137, baseType: !851, size: 64, offset: 9664)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !63, line: 11, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !63, line: 11, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !398, file: !140, line: 139, baseType: !172, size: 64, offset: 9728)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9792)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9824)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9856)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9888)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9920)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9952)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 9984)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10016)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10048)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10080)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10112)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10144)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10176)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !398, file: !140, line: 142, baseType: !346, size: 32, offset: 10208)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10240)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10304)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10368)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10432)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10496)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10560)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10624)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10688)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10752)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10816)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10880)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 10944)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 11008)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !398, file: !140, line: 143, baseType: !198, size: 64, offset: 11072)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11136)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !95, line: 162, baseType: !94)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11168)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11200)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11232)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11264)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11296)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11328)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11360)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11392)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11424)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11456)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11488)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11520)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !398, file: !140, line: 144, baseType: !884, size: 32, offset: 11552)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !398, file: !140, line: 147, baseType: !231, size: 32, offset: 11584)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !398, file: !140, line: 148, baseType: !424, size: 64, offset: 11648)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !398, file: !140, line: 150, baseType: !901, size: 32, offset: 11712)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !140, line: 70, baseType: !139)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !398, file: !140, line: 151, baseType: !346, size: 32, offset: 11744)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !398, file: !140, line: 153, baseType: !231, size: 32, offset: 11776)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !398, file: !140, line: 154, baseType: !231, size: 32, offset: 11808)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !398, file: !140, line: 156, baseType: !346, size: 32, offset: 11840)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !398, file: !140, line: 161, baseType: !907, size: 192, offset: 11904)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !140, line: 157, size: 192, elements: !908)
!908 = !{!909, !910, !911, !912}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !907, file: !140, line: 158, baseType: !718, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !907, file: !140, line: 158, baseType: !718, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !907, file: !140, line: 159, baseType: !346, size: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !907, file: !140, line: 160, baseType: !346, size: 32, offset: 160)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !398, file: !140, line: 163, baseType: !914, size: 32, offset: 12096)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !71, line: 451, baseType: !145)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !398, file: !140, line: 165, baseType: !790, size: 32, offset: 12128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !398, file: !140, line: 166, baseType: !914, size: 32, offset: 12160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !398, file: !140, line: 171, baseType: !346, size: 32, offset: 12192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !398, file: !140, line: 172, baseType: !346, size: 32, offset: 12224)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !398, file: !140, line: 173, baseType: !346, size: 32, offset: 12256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !398, file: !140, line: 174, baseType: !410, size: 64, offset: 12288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !398, file: !140, line: 175, baseType: !410, size: 64, offset: 12352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !398, file: !140, line: 177, baseType: !231, size: 32, offset: 12416)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !398, file: !140, line: 178, baseType: !346, size: 32, offset: 12448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !398, file: !140, line: 180, baseType: !198, size: 64, offset: 12480)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !398, file: !140, line: 182, baseType: !926, size: 64, offset: 12544)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!192, !396, !410, !410, !172}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !398, file: !140, line: 183, baseType: !926, size: 64, offset: 12608)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !398, file: !140, line: 184, baseType: !172, size: 64, offset: 12672)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !398, file: !140, line: 184, baseType: !172, size: 64, offset: 12736)
!932 = !{!933, !934, !935, !937, !939}
!933 = !DILocalVariable(name: "ksp", arg: 1, scope: !392, file: !393, line: 326, type: !396)
!934 = !DILocalVariable(name: "ierr", scope: !392, file: !393, line: 328, type: !192)
!935 = !DILocalVariable(name: "ierr__", scope: !936, file: !393, line: 332, type: !192)
!936 = distinct !DILexicalBlock(scope: !392, file: !393, line: 332, column: 69)
!937 = !DILocalVariable(name: "ierr__", scope: !938, file: !393, line: 333, type: !192)
!938 = distinct !DILexicalBlock(scope: !392, file: !393, line: 333, column: 72)
!939 = !DILocalVariable(name: "ierr__", scope: !940, file: !393, line: 334, type: !192)
!940 = distinct !DILexicalBlock(scope: !392, file: !393, line: 334, column: 60)
!941 = !DILocation(line: 0, scope: !392)
!942 = !DILocation(line: 330, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !393, line: 330, column: 3)
!944 = distinct !DILexicalBlock(scope: !945, file: !393, line: 330, column: 3)
!945 = distinct !DILexicalBlock(scope: !392, file: !393, line: 330, column: 3)
!946 = !{!947, !947, i64 0}
!947 = !{!"any pointer", !948, i64 0}
!948 = !{!"omnipotent char", !949, i64 0}
!949 = !{!"Simple C/C++ TBAA"}
!950 = !DILocation(line: 330, column: 3, scope: !944)
!951 = !DILocation(line: 330, column: 3, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !393, line: 330, column: 3)
!953 = distinct !DILexicalBlock(scope: !943, file: !393, line: 330, column: 3)
!954 = !{!955, !956, i64 1536}
!955 = !{!"", !948, i64 0, !948, i64 512, !948, i64 1024, !948, i64 1280, !956, i64 1536, !956, i64 1540, !948, i64 1544}
!956 = !{!"int", !948, i64 0}
!957 = !DILocation(line: 330, column: 3, scope: !953)
!958 = !DILocation(line: 330, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !952, file: !393, line: 330, column: 3)
!960 = !{!956, !956, i64 0}
!961 = !{!955, !956, i64 1540}
!962 = !DILocation(line: 332, column: 10, scope: !392)
!963 = !DILocation(line: 0, scope: !936)
!964 = !DILocation(line: 332, column: 69, scope: !965)
!965 = distinct !DILexicalBlock(scope: !936, file: !393, line: 332, column: 69)
!966 = !DILocation(line: 332, column: 69, scope: !936)
!967 = !{!"branch_weights", i32 2000, i32 1}
!968 = !DILocation(line: 333, column: 10, scope: !392)
!969 = !DILocation(line: 0, scope: !938)
!970 = !DILocation(line: 333, column: 72, scope: !971)
!971 = distinct !DILexicalBlock(scope: !938, file: !393, line: 333, column: 72)
!972 = !DILocation(line: 333, column: 72, scope: !938)
!973 = !DILocation(line: 334, column: 10, scope: !392)
!974 = !DILocation(line: 0, scope: !940)
!975 = !DILocation(line: 334, column: 60, scope: !976)
!976 = distinct !DILexicalBlock(scope: !940, file: !393, line: 334, column: 60)
!977 = !DILocation(line: 334, column: 60, scope: !940)
!978 = !DILocation(line: 336, column: 13, scope: !392)
!979 = !DILocation(line: 336, column: 28, scope: !392)
!980 = !{!981, !947, i64 32}
!981 = !{!"_KSPOps", !947, i64 0, !947, i64 8, !947, i64 16, !947, i64 24, !947, i64 32, !947, i64 40, !947, i64 48, !947, i64 56, !947, i64 64, !947, i64 72, !947, i64 80, !947, i64 88, !947, i64 96, !947, i64 104}
!982 = !DILocation(line: 337, column: 13, scope: !392)
!983 = !DILocation(line: 337, column: 28, scope: !392)
!984 = !{!981, !947, i64 16}
!985 = !DILocation(line: 338, column: 13, scope: !392)
!986 = !DILocation(line: 338, column: 28, scope: !392)
!987 = !{!981, !947, i64 80}
!988 = !DILocation(line: 339, column: 13, scope: !392)
!989 = !DILocation(line: 339, column: 28, scope: !392)
!990 = !{!981, !947, i64 0}
!991 = !DILocation(line: 340, column: 13, scope: !392)
!992 = !DILocation(line: 340, column: 28, scope: !392)
!993 = !{!981, !947, i64 8}
!994 = !DILocation(line: 341, column: 13, scope: !392)
!995 = !DILocation(line: 341, column: 28, scope: !392)
!996 = !{!981, !947, i64 40}
