; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/preonly/preonly.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/preonly/preonly.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128}
!122 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!123 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!124 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!125 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!126 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!127 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!128 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 155, baseType: !5, size: 32, elements: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!131 = !{!132, !133, !134, !135, !136}
!132 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!137 = !{!138, !142, !143, !146}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !139, line: 330, baseType: !140)
!139 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !139, line: 330, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !149, line: 73, size: 4480, elements: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!150 = !{!151, !153, !199, !200, !202, !205, !206, !207, !208, !216, !217, !219, !223, !227, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !241, !242, !244, !245, !247, !249, !250, !251, !252, !253, !256, !258, !259, !260, !261, !262, !265, !267, !268, !269, !279, !281, !282, !286, !287, !336, !341, !343, !344, !345}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !148, file: !149, line: 74, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !148, file: !149, line: 75, baseType: !154, size: 448, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 448, elements: !197)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !149, line: 53, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 45, size: 448, elements: !157)
!157 = !{!158, !164, !172, !177, !181, !185, !192}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !156, file: !149, line: 46, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !146, !163}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !156, file: !149, line: 47, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!162, !146, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !169, line: 16, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !169, line: 16, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !156, file: !149, line: 48, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!162, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !156, file: !149, line: 49, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!162, !146, !143, !146}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !156, file: !149, line: 50, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!162, !146, !143, !176}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !156, file: !149, line: 51, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!162, !146, !143, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !156, file: !149, line: 52, baseType: !193, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!162, !146, !143, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!197 = !{!198}
!198 = !DISubrange(count: 1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !148, file: !149, line: 76, baseType: !138, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !149, line: 77, baseType: !201, size: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !148, file: !149, line: 78, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !204)
!204 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !148, file: !149, line: 78, baseType: !203, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !148, file: !149, line: 78, baseType: !203, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !148, file: !149, line: 78, baseType: !203, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !149, line: 79, baseType: !209, size: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !212, line: 27, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !214, line: 43, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!215 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !148, file: !149, line: 80, baseType: !201, size: 32, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !149, line: 81, baseType: !218, size: 32, offset: 992)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !148, file: !149, line: 82, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !148, file: !149, line: 83, baseType: !224, size: 64, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !148, file: !149, line: 84, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !148, file: !149, line: 85, baseType: !228, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !148, file: !149, line: 86, baseType: !228, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !148, file: !149, line: 87, baseType: !228, size: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !148, file: !149, line: 88, baseType: !146, size: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !148, file: !149, line: 89, baseType: !209, size: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 90, baseType: !228, size: 64, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !148, file: !149, line: 91, baseType: !228, size: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !148, file: !149, line: 92, baseType: !201, size: 32, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !148, file: !149, line: 93, baseType: !142, size: 64, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !148, file: !149, line: 94, baseType: !239, size: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !210)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !148, file: !149, line: 95, baseType: !201, size: 32, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !148, file: !149, line: 95, baseType: !201, size: 32, offset: 1888)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !148, file: !149, line: 96, baseType: !243, size: 64, offset: 1920)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !148, file: !149, line: 96, baseType: !243, size: 64, offset: 1984)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !148, file: !149, line: 97, baseType: !246, size: 64, offset: 2048)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !148, file: !149, line: 97, baseType: !248, size: 64, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !148, file: !149, line: 98, baseType: !201, size: 32, offset: 2176)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !148, file: !149, line: 98, baseType: !201, size: 32, offset: 2208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !148, file: !149, line: 99, baseType: !243, size: 64, offset: 2240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !148, file: !149, line: 99, baseType: !243, size: 64, offset: 2304)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !148, file: !149, line: 100, baseType: !254, size: 64, offset: 2368)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !204)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !148, file: !149, line: 100, baseType: !257, size: 64, offset: 2432)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !148, file: !149, line: 101, baseType: !201, size: 32, offset: 2496)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !148, file: !149, line: 101, baseType: !201, size: 32, offset: 2528)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !148, file: !149, line: 102, baseType: !243, size: 64, offset: 2560)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !148, file: !149, line: 102, baseType: !243, size: 64, offset: 2624)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !148, file: !149, line: 103, baseType: !263, size: 64, offset: 2688)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !255)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !148, file: !149, line: 103, baseType: !266, size: 64, offset: 2752)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !148, file: !149, line: 104, baseType: !196, size: 64, offset: 2816)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !148, file: !149, line: 105, baseType: !201, size: 32, offset: 2880)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !148, file: !149, line: 106, baseType: !270, size: 128, offset: 2944)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !277)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !149, line: 64, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 61, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !273, file: !149, line: 62, baseType: !189, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !273, file: !149, line: 63, baseType: !142, size: 64, offset: 64)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !148, file: !149, line: 107, baseType: !280, size: 64, offset: 3072)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !148, file: !149, line: 108, baseType: !142, size: 64, offset: 3136)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !148, file: !149, line: 109, baseType: !283, size: 64, offset: 3200)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!162, !142}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !148, file: !149, line: 111, baseType: !201, size: 32, offset: 3264)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !148, file: !149, line: 112, baseType: !288, size: 320, offset: 3328)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !334)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!162, !292, !146, !142}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !295)
!295 = !{!296, !297, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !294, file: !10, line: 100, baseType: !201, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !10, line: 101, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !309, !310, !311, !315, !317, !319, !320, !321}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !300, file: !10, line: 84, baseType: !228, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !300, file: !10, line: 85, baseType: !228, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !10, line: 86, baseType: !142, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !300, file: !10, line: 87, baseType: !220, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !300, file: !10, line: 88, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !300, file: !10, line: 89, baseType: !145, size: 8, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !300, file: !10, line: 90, baseType: !228, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !300, file: !10, line: 91, baseType: !312, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 46, baseType: !314)
!313 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !10, line: 92, baseType: !316, size: 32, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !10, line: 93, baseType: !318, size: 32, offset: 544)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !10, line: 94, baseType: !298, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !300, file: !10, line: 95, baseType: !228, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !300, file: !10, line: 96, baseType: !142, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !294, file: !10, line: 102, baseType: !228, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !294, file: !10, line: 102, baseType: !228, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !294, file: !10, line: 103, baseType: !228, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !294, file: !10, line: 104, baseType: !138, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !294, file: !10, line: 105, baseType: !316, size: 32, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !294, file: !10, line: 105, baseType: !316, size: 32, offset: 416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !294, file: !10, line: 105, baseType: !316, size: 32, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !294, file: !10, line: 106, baseType: !146, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !294, file: !10, line: 107, baseType: !331, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!334 = !{!335}
!335 = !DISubrange(count: 5)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !148, file: !149, line: 113, baseType: !337, size: 320, offset: 3648)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 320, elements: !334)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!162, !146, !142}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !148, file: !149, line: 114, baseType: !342, size: 320, offset: 3968)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 320, elements: !334)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !148, file: !149, line: 115, baseType: !316, size: 32, offset: 4288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !148, file: !149, line: 120, baseType: !331, size: 64, offset: 4352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !148, file: !149, line: 121, baseType: !316, size: 32, offset: 4416)
!346 = !{i32 7, !"Dwarf Version", i32 4}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{i32 1, !"wchar_size", i32 4}
!349 = !{i32 7, !"PIC Level", i32 2}
!350 = !{i32 7, !"uwtable", i32 1}
!351 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!352 = distinct !DISubprogram(name: "KSPCreate_PREONLY", scope: !353, file: !353, line: 100, type: !354, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !598)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/preonly/preonly.c", directory: "/home/users/ndemeye/xSDK")
!354 = !DISubroutineType(types: !355)
!355 = !{!162, !356}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !359)
!359 = !{!360, !362, !413, !418, !419, !420, !421, !451, !452, !453, !454, !455, !457, !462, !463, !464, !465, !466, !467, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !491, !497, !498, !499, !500, !505, !506, !507, !508, !513, !514, !515, !516, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !568, !569, !570, !571, !572, !579, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !595, !596, !597}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !358, file: !102, line: 76, baseType: !361, size: 4480)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !149, line: 122, baseType: !148)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !358, file: !102, line: 76, baseType: !363, size: 896, offset: 4480)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 896, elements: !197)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !365)
!365 = !{!366, !374, !378, !380, !388, !389, !393, !394, !398, !402, !406, !407, !411, !412}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !364, file: !102, line: 19, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!162, !356, !370, !373}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !130, line: 21, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !130, line: 21, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !364, file: !102, line: 22, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!162, !356, !370, !370, !373}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !364, file: !102, line: 25, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !364, file: !102, line: 26, baseType: !381, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!162, !356, !384, !384}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !385, line: 16, baseType: !386)
!385 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !385, line: 16, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !364, file: !102, line: 27, baseType: !379, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !364, file: !102, line: 28, baseType: !390, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!162, !292, !356}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !364, file: !102, line: 29, baseType: !379, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !364, file: !102, line: 30, baseType: !395, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!162, !356, !254, !254}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !364, file: !102, line: 31, baseType: !399, size: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!162, !356, !201, !254, !254, !246}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !364, file: !102, line: 32, baseType: !403, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!162, !356, !316, !316, !246, !373, !254, !254}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !364, file: !102, line: 33, baseType: !379, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !364, file: !102, line: 34, baseType: !408, size: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!162, !356, !168}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !364, file: !102, line: 35, baseType: !379, size: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !364, file: !102, line: 36, baseType: !408, size: 64, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !358, file: !102, line: 77, baseType: !414, size: 64, offset: 5376)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !415, line: 14, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !415, line: 14, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !358, file: !102, line: 78, baseType: !316, size: 32, offset: 5440)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !358, file: !102, line: 79, baseType: !316, size: 32, offset: 5472)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !358, file: !102, line: 81, baseType: !201, size: 32, offset: 5504)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !358, file: !102, line: 82, baseType: !422, size: 64, offset: 5568)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !425)
!425 = !{!426, !427, !447, !448, !449, !450}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !424, file: !102, line: 55, baseType: !361, size: 4480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !424, file: !102, line: 55, baseType: !428, size: 448, offset: 4480)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 448, elements: !197)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !430)
!430 = !{!431, !435, !436, !440, !441, !442, !446}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !429, file: !102, line: 42, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!162, !422, !370, !370}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !429, file: !102, line: 43, baseType: !432, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !429, file: !102, line: 44, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!162, !422}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !429, file: !102, line: 45, baseType: !437, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !429, file: !102, line: 46, baseType: !437, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !429, file: !102, line: 47, baseType: !443, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!162, !422, !168}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !429, file: !102, line: 48, baseType: !437, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !424, file: !102, line: 56, baseType: !356, size: 64, offset: 4928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !424, file: !102, line: 57, baseType: !384, size: 64, offset: 4992)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !424, file: !102, line: 58, baseType: !239, size: 64, offset: 5056)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !424, file: !102, line: 59, baseType: !142, size: 64, offset: 5120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !358, file: !102, line: 83, baseType: !316, size: 32, offset: 5632)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !358, file: !102, line: 84, baseType: !316, size: 32, offset: 5664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !358, file: !102, line: 85, baseType: !316, size: 32, offset: 5696)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !358, file: !102, line: 86, baseType: !316, size: 32, offset: 5728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !358, file: !102, line: 87, baseType: !456, size: 32, offset: 5760)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !358, file: !102, line: 88, baseType: !458, size: 384, offset: 5792)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 384, elements: !459)
!459 = !{!460, !461}
!460 = !DISubrange(count: 4)
!461 = !DISubrange(count: 3)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !358, file: !102, line: 89, baseType: !255, size: 64, offset: 6208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !358, file: !102, line: 90, baseType: !255, size: 64, offset: 6272)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !358, file: !102, line: 91, baseType: !255, size: 64, offset: 6336)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !358, file: !102, line: 92, baseType: !255, size: 64, offset: 6400)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !358, file: !102, line: 93, baseType: !255, size: 64, offset: 6464)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !358, file: !102, line: 94, baseType: !255, size: 64, offset: 6528)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !358, file: !102, line: 95, baseType: !469, size: 32, offset: 6592)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !358, file: !102, line: 96, baseType: !316, size: 32, offset: 6624)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !358, file: !102, line: 98, baseType: !370, size: 64, offset: 6656)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !358, file: !102, line: 98, baseType: !370, size: 64, offset: 6720)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !358, file: !102, line: 102, baseType: !254, size: 64, offset: 6784)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !358, file: !102, line: 103, baseType: !254, size: 64, offset: 6848)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !358, file: !102, line: 104, baseType: !201, size: 32, offset: 6912)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !358, file: !102, line: 105, baseType: !201, size: 32, offset: 6944)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !358, file: !102, line: 106, baseType: !316, size: 32, offset: 6976)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !358, file: !102, line: 107, baseType: !254, size: 64, offset: 7040)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !358, file: !102, line: 108, baseType: !254, size: 64, offset: 7104)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !358, file: !102, line: 109, baseType: !201, size: 32, offset: 7168)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !358, file: !102, line: 110, baseType: !201, size: 32, offset: 7200)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !358, file: !102, line: 111, baseType: !316, size: 32, offset: 7232)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !358, file: !102, line: 113, baseType: !201, size: 32, offset: 7264)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !358, file: !102, line: 114, baseType: !316, size: 32, offset: 7296)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !358, file: !102, line: 117, baseType: !201, size: 32, offset: 7328)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !358, file: !102, line: 120, baseType: !487, size: 320, offset: 7360)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 320, elements: !334)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!162, !356, !201, !255, !142}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !358, file: !102, line: 121, baseType: !492, size: 320, offset: 7680)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 320, elements: !334)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!162, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !358, file: !102, line: 122, baseType: !342, size: 320, offset: 8000)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !358, file: !102, line: 123, baseType: !201, size: 32, offset: 8320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !358, file: !102, line: 124, baseType: !316, size: 32, offset: 8352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !358, file: !102, line: 126, baseType: !501, size: 320, offset: 8384)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 320, elements: !334)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!162, !356, !142}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !358, file: !102, line: 127, baseType: !492, size: 320, offset: 8704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !358, file: !102, line: 128, baseType: !342, size: 320, offset: 9024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !358, file: !102, line: 129, baseType: !201, size: 32, offset: 9344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !358, file: !102, line: 131, baseType: !509, size: 64, offset: 9408)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!162, !356, !201, !255, !512, !142}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !358, file: !102, line: 132, baseType: !283, size: 64, offset: 9472)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !358, file: !102, line: 133, baseType: !142, size: 64, offset: 9536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !358, file: !102, line: 135, baseType: !142, size: 64, offset: 9600)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !358, file: !102, line: 137, baseType: !517, size: 64, offset: 9664)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !102, line: 139, baseType: !142, size: 64, offset: 9728)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9792)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9824)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9856)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9888)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9952)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 9984)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10016)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10080)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !358, file: !102, line: 142, baseType: !316, size: 32, offset: 10208)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10432)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10560)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10624)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10688)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10752)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10816)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10880)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 10944)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 11008)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !358, file: !102, line: 143, baseType: !168, size: 64, offset: 11072)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11136)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11168)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11232)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11264)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11296)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11328)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11360)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11392)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11424)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11456)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11488)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11520)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !358, file: !102, line: 144, baseType: !550, size: 32, offset: 11552)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !358, file: !102, line: 147, baseType: !201, size: 32, offset: 11584)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !358, file: !102, line: 148, baseType: !373, size: 64, offset: 11648)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !358, file: !102, line: 150, baseType: !567, size: 32, offset: 11712)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !358, file: !102, line: 151, baseType: !316, size: 32, offset: 11744)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !358, file: !102, line: 153, baseType: !201, size: 32, offset: 11776)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !358, file: !102, line: 154, baseType: !201, size: 32, offset: 11808)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !358, file: !102, line: 156, baseType: !316, size: 32, offset: 11840)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !358, file: !102, line: 161, baseType: !573, size: 192, offset: 11904)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !102, line: 157, size: 192, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !573, file: !102, line: 158, baseType: !384, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !573, file: !102, line: 158, baseType: !384, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !573, file: !102, line: 159, baseType: !316, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !573, file: !102, line: 160, baseType: !316, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !358, file: !102, line: 163, baseType: !580, size: 32, offset: 12096)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !358, file: !102, line: 165, baseType: !456, size: 32, offset: 12128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !358, file: !102, line: 166, baseType: !580, size: 32, offset: 12160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !358, file: !102, line: 171, baseType: !316, size: 32, offset: 12192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !358, file: !102, line: 172, baseType: !316, size: 32, offset: 12224)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !358, file: !102, line: 173, baseType: !316, size: 32, offset: 12256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !358, file: !102, line: 174, baseType: !370, size: 64, offset: 12288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !358, file: !102, line: 175, baseType: !370, size: 64, offset: 12352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !358, file: !102, line: 177, baseType: !201, size: 32, offset: 12416)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !358, file: !102, line: 178, baseType: !316, size: 32, offset: 12448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !358, file: !102, line: 180, baseType: !168, size: 64, offset: 12480)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !358, file: !102, line: 182, baseType: !592, size: 64, offset: 12544)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!162, !356, !370, !370, !142}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !358, file: !102, line: 183, baseType: !592, size: 64, offset: 12608)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !358, file: !102, line: 184, baseType: !142, size: 64, offset: 12672)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !358, file: !102, line: 184, baseType: !142, size: 64, offset: 12736)
!598 = !{!599, !600, !601, !603, !605, !607, !609, !611, !613}
!599 = !DILocalVariable(name: "ksp", arg: 1, scope: !352, file: !353, line: 100, type: !356)
!600 = !DILocalVariable(name: "ierr", scope: !352, file: !353, line: 102, type: !162)
!601 = !DILocalVariable(name: "ierr__", scope: !602, file: !353, line: 105, type: !162)
!602 = distinct !DILexicalBlock(scope: !352, file: !353, line: 105, column: 59)
!603 = !DILocalVariable(name: "ierr__", scope: !604, file: !353, line: 106, type: !162)
!604 = distinct !DILexicalBlock(scope: !352, file: !353, line: 106, column: 60)
!605 = !DILocalVariable(name: "ierr__", scope: !606, file: !353, line: 107, type: !162)
!606 = distinct !DILexicalBlock(scope: !352, file: !353, line: 107, column: 69)
!607 = !DILocalVariable(name: "ierr__", scope: !608, file: !353, line: 108, type: !162)
!608 = distinct !DILexicalBlock(scope: !352, file: !353, line: 108, column: 70)
!609 = !DILocalVariable(name: "ierr__", scope: !610, file: !353, line: 109, type: !162)
!610 = distinct !DILexicalBlock(scope: !352, file: !353, line: 109, column: 71)
!611 = !DILocalVariable(name: "ierr__", scope: !612, file: !353, line: 110, type: !162)
!612 = distinct !DILexicalBlock(scope: !352, file: !353, line: 110, column: 72)
!613 = !DILocalVariable(name: "ierr__", scope: !614, file: !353, line: 111, type: !162)
!614 = distinct !DILexicalBlock(scope: !352, file: !353, line: 111, column: 62)
!615 = !DILocation(line: 0, scope: !352)
!616 = !DILocation(line: 104, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !353, line: 104, column: 3)
!618 = distinct !DILexicalBlock(scope: !619, file: !353, line: 104, column: 3)
!619 = distinct !DILexicalBlock(scope: !352, file: !353, line: 104, column: 3)
!620 = !{!621, !621, i64 0}
!621 = !{!"any pointer", !622, i64 0}
!622 = !{!"omnipotent char", !623, i64 0}
!623 = !{!"Simple C/C++ TBAA"}
!624 = !DILocation(line: 104, column: 3, scope: !618)
!625 = !DILocation(line: 104, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !353, line: 104, column: 3)
!627 = distinct !DILexicalBlock(scope: !617, file: !353, line: 104, column: 3)
!628 = !{!629, !630, i64 1536}
!629 = !{!"", !622, i64 0, !622, i64 512, !622, i64 1024, !622, i64 1280, !630, i64 1536, !630, i64 1540, !622, i64 1544}
!630 = !{!"int", !622, i64 0}
!631 = !DILocation(line: 104, column: 3, scope: !627)
!632 = !DILocation(line: 104, column: 3, scope: !633)
!633 = distinct !DILexicalBlock(scope: !626, file: !353, line: 104, column: 3)
!634 = !{!630, !630, i64 0}
!635 = !{!629, !630, i64 1540}
!636 = !DILocation(line: 105, column: 10, scope: !352)
!637 = !DILocation(line: 0, scope: !602)
!638 = !DILocation(line: 105, column: 59, scope: !639)
!639 = distinct !DILexicalBlock(scope: !602, file: !353, line: 105, column: 59)
!640 = !DILocation(line: 105, column: 59, scope: !602)
!641 = !{!"branch_weights", i32 2000, i32 1}
!642 = !DILocation(line: 106, column: 10, scope: !352)
!643 = !DILocation(line: 0, scope: !604)
!644 = !DILocation(line: 106, column: 60, scope: !645)
!645 = distinct !DILexicalBlock(scope: !604, file: !353, line: 106, column: 60)
!646 = !DILocation(line: 106, column: 60, scope: !604)
!647 = !DILocation(line: 107, column: 10, scope: !352)
!648 = !DILocation(line: 0, scope: !606)
!649 = !DILocation(line: 107, column: 69, scope: !650)
!650 = distinct !DILexicalBlock(scope: !606, file: !353, line: 107, column: 69)
!651 = !DILocation(line: 107, column: 69, scope: !606)
!652 = !DILocation(line: 108, column: 10, scope: !352)
!653 = !DILocation(line: 0, scope: !608)
!654 = !DILocation(line: 108, column: 70, scope: !655)
!655 = distinct !DILexicalBlock(scope: !608, file: !353, line: 108, column: 70)
!656 = !DILocation(line: 108, column: 70, scope: !608)
!657 = !DILocation(line: 109, column: 10, scope: !352)
!658 = !DILocation(line: 0, scope: !610)
