; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/impls/mis/mis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/impls/mis/mis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_IS = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !{!306, !324, !405, !514, !1329, !480, !1181, !1429, !385, !395, !72, !345, !5}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !309, line: 73, size: 4480, elements: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!310 = !{!311, !313, !366, !367, !369, !372, !373, !374, !375, !383, !384, !386, !390, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !408, !409, !410, !412, !413, !415, !417, !418, !419, !420, !421, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !447, !449, !450, !454, !455, !504, !509, !511, !512, !513}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !308, file: !309, line: 74, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !308, file: !309, line: 75, baseType: !314, size: 448, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 448, elements: !364)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !309, line: 53, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 45, size: 448, elements: !317)
!317 = !{!318, !328, !336, !341, !348, !352, !359}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !316, file: !309, line: 46, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !306, !323}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !325, line: 330, baseType: !326)
!325 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !325, line: 330, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !316, file: !309, line: 47, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!322, !306, !332}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !333, line: 16, baseType: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !333, line: 16, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !316, file: !309, line: 48, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!322, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !316, file: !309, line: 49, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!322, !306, !345, !306}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !316, file: !309, line: 50, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!322, !306, !345, !340}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !316, file: !309, line: 51, baseType: !353, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!322, !306, !345, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !316, file: !309, line: 52, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!322, !306, !345, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!364 = !{!365}
!365 = !DISubrange(count: 1)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !308, file: !309, line: 76, baseType: !324, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 77, baseType: !368, size: 32, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !371)
!371 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 79, baseType: !376, size: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !379, line: 27, baseType: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !381, line: 43, baseType: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!382 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !308, file: !309, line: 80, baseType: !368, size: 32, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !308, file: !309, line: 81, baseType: !385, size: 32, offset: 992)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !308, file: !309, line: 82, baseType: !387, size: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !308, file: !309, line: 83, baseType: !391, size: 64, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !308, file: !309, line: 84, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !308, file: !309, line: 85, baseType: !395, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !308, file: !309, line: 86, baseType: !395, size: 64, offset: 1280)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !308, file: !309, line: 87, baseType: !395, size: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 88, baseType: !306, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !308, file: !309, line: 89, baseType: !376, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 90, baseType: !395, size: 64, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !309, line: 91, baseType: !395, size: 64, offset: 1600)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !308, file: !309, line: 92, baseType: !368, size: 32, offset: 1664)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !308, file: !309, line: 93, baseType: !405, size: 64, offset: 1728)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !309, line: 94, baseType: !407, size: 64, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !377)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !308, file: !309, line: 95, baseType: !368, size: 32, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !308, file: !309, line: 95, baseType: !368, size: 32, offset: 1888)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !308, file: !309, line: 96, baseType: !411, size: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !308, file: !309, line: 96, baseType: !411, size: 64, offset: 1984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !308, file: !309, line: 97, baseType: !414, size: 64, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !308, file: !309, line: 97, baseType: !416, size: 64, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !308, file: !309, line: 98, baseType: !368, size: 32, offset: 2176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !308, file: !309, line: 98, baseType: !368, size: 32, offset: 2208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !308, file: !309, line: 99, baseType: !411, size: 64, offset: 2240)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !308, file: !309, line: 99, baseType: !411, size: 64, offset: 2304)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !308, file: !309, line: 100, baseType: !422, size: 64, offset: 2368)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !371)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !308, file: !309, line: 100, baseType: !425, size: 64, offset: 2432)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !308, file: !309, line: 101, baseType: !368, size: 32, offset: 2496)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !308, file: !309, line: 101, baseType: !368, size: 32, offset: 2528)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !308, file: !309, line: 102, baseType: !411, size: 64, offset: 2560)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !308, file: !309, line: 102, baseType: !411, size: 64, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !308, file: !309, line: 103, baseType: !431, size: 64, offset: 2688)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !423)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !308, file: !309, line: 103, baseType: !434, size: 64, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !308, file: !309, line: 104, baseType: !363, size: 64, offset: 2816)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !308, file: !309, line: 105, baseType: !368, size: 32, offset: 2880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !308, file: !309, line: 106, baseType: !438, size: 128, offset: 2944)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 128, elements: !445)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !309, line: 64, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 61, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !441, file: !309, line: 62, baseType: !356, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !441, file: !309, line: 63, baseType: !405, size: 64, offset: 64)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !308, file: !309, line: 107, baseType: !448, size: 64, offset: 3072)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !445)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !308, file: !309, line: 108, baseType: !405, size: 64, offset: 3136)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !308, file: !309, line: 109, baseType: !451, size: 64, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!322, !405}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !308, file: !309, line: 111, baseType: !368, size: 32, offset: 3264)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !308, file: !309, line: 112, baseType: !456, size: 320, offset: 3328)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !502)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!322, !460, !306, !405}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !463)
!463 = !{!464, !465, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !462, file: !10, line: 100, baseType: !368, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !10, line: 101, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !477, !478, !479, !483, !485, !487, !488, !489}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !468, file: !10, line: 84, baseType: !395, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !10, line: 85, baseType: !395, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !468, file: !10, line: 86, baseType: !405, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !468, file: !10, line: 87, baseType: !387, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !468, file: !10, line: 88, baseType: !475, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !468, file: !10, line: 89, baseType: !347, size: 8, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !468, file: !10, line: 90, baseType: !395, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !468, file: !10, line: 91, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !481, line: 46, baseType: !482)
!481 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!482 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !468, file: !10, line: 92, baseType: !484, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !10, line: 93, baseType: !486, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !10, line: 94, baseType: !466, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !468, file: !10, line: 95, baseType: !395, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !468, file: !10, line: 96, baseType: !405, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !462, file: !10, line: 102, baseType: !395, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !462, file: !10, line: 102, baseType: !395, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !462, file: !10, line: 103, baseType: !395, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !462, file: !10, line: 104, baseType: !324, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !462, file: !10, line: 106, baseType: !306, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !462, file: !10, line: 107, baseType: !499, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!502 = !{!503}
!503 = !DISubrange(count: 5)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !308, file: !309, line: 113, baseType: !505, size: 320, offset: 3648)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !502)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!322, !306, !405}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !308, file: !309, line: 114, baseType: !510, size: 320, offset: 3968)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !502)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !308, file: !309, line: 115, baseType: !484, size: 32, offset: 4288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !309, line: 120, baseType: !499, size: 64, offset: 4352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !308, file: !309, line: 121, baseType: !484, size: 32, offset: 4416)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !516, line: 70, baseType: !517)
!516 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 34, size: 1344, elements: !518)
!518 = !{!519, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1314, !1315, !1316, !1317, !1323, !1324, !1325, !1326, !1327, !1328}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !517, file: !516, line: 35, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !523, line: 436, size: 23424, elements: !524)
!523 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!524 = !{!525, !527, !1034, !1054, !1055, !1056, !1058, !1059, !1060, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1187, !1188, !1204, !1205, !1206, !1207, !1208, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1243, !1263, !1264, !1266, !1267, !1268, !1269, !1270, !1271, !1289, !1290}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !522, file: !523, line: 437, baseType: !526, size: 4480)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !309, line: 122, baseType: !308)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !522, file: !523, line: 437, baseType: !528, size: 9472, offset: 4480)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 9472, elements: !364)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !523, line: 32, size: 9472, elements: !530)
!530 = !{!531, !540, !544, !545, !552, !556, !557, !558, !559, !560, !561, !562, !586, !590, !595, !601, !620, !625, !629, !630, !635, !640, !641, !646, !650, !654, !658, !662, !666, !667, !668, !669, !670, !674, !675, !680, !681, !682, !683, !684, !689, !696, !701, !705, !709, !713, !717, !718, !722, !723, !730, !735, !736, !737, !738, !800, !808, !809, !813, !814, !818, !819, !823, !828, !829, !833, !837, !844, !845, !846, !847, !848, !849, !854, !855, !859, !863, !867, !868, !869, !873, !883, !884, !888, !889, !893, !894, !898, !899, !904, !905, !909, !913, !914, !915, !916, !917, !918, !919, !923, !924, !925, !926, !927, !928, !932, !933, !934, !935, !936, !937, !938, !939, !943, !947, !948, !949, !953, !954, !955, !956, !957, !958, !959, !963, !964, !965, !970, !974, !975, !979, !980, !981, !982, !1008, !1012, !1013, !1014, !1015, !1016, !1020, !1021, !1022, !1023, !1024, !1028, !1032, !1033}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !529, file: !523, line: 34, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!322, !520, !368, !535, !368, !535, !537, !539}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !529, file: !523, line: 35, baseType: !541, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!322, !520, !368, !414, !416, !434}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !529, file: !523, line: 36, baseType: !541, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !529, file: !523, line: 37, baseType: !546, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!322, !520, !549, !549}
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !529, file: !523, line: 38, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!322, !520, !549, !549, !549}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !529, file: !523, line: 40, baseType: !546, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !529, file: !523, line: 41, baseType: !553, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !529, file: !523, line: 42, baseType: !546, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !529, file: !523, line: 43, baseType: !553, size: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !529, file: !523, line: 44, baseType: !546, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !529, file: !523, line: 46, baseType: !553, size: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !529, file: !523, line: 47, baseType: !563, size: 64, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!322, !520, !566, !566, !570}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !567, line: 11, baseType: !568)
!567 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !567, line: 11, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !573, file: !36, line: 1227, baseType: !423, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !573, file: !36, line: 1228, baseType: !423, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !573, file: !36, line: 1229, baseType: !423, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !573, file: !36, line: 1230, baseType: !423, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !573, file: !36, line: 1231, baseType: !423, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !573, file: !36, line: 1232, baseType: !423, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !573, file: !36, line: 1233, baseType: !423, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !573, file: !36, line: 1234, baseType: !423, size: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !573, file: !36, line: 1236, baseType: !423, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !573, file: !36, line: 1237, baseType: !423, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !573, file: !36, line: 1238, baseType: !423, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !529, file: !523, line: 48, baseType: !587, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!322, !520, !566, !570}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !529, file: !523, line: 49, baseType: !591, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!322, !520, !549, !423, !594, !423, !368, !368, !549}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !529, file: !523, line: 50, baseType: !596, size: 64, offset: 896)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!322, !520, !599, !600}
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !529, file: !523, line: 52, baseType: !602, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!322, !520, !605, !606}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !608, file: !36, line: 593, baseType: !370, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !608, file: !36, line: 594, baseType: !370, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !608, file: !36, line: 594, baseType: !370, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !608, file: !36, line: 594, baseType: !370, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !608, file: !36, line: 595, baseType: !370, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !608, file: !36, line: 596, baseType: !370, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !608, file: !36, line: 597, baseType: !370, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !608, file: !36, line: 598, baseType: !370, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !608, file: !36, line: 598, baseType: !370, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !608, file: !36, line: 599, baseType: !370, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !529, file: !523, line: 53, baseType: !621, size: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!322, !520, !520, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !529, file: !523, line: 54, baseType: !626, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!322, !520, !549}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !529, file: !523, line: 55, baseType: !546, size: 64, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !529, file: !523, line: 56, baseType: !631, size: 64, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!322, !520, !634, !422}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !529, file: !523, line: 58, baseType: !636, size: 64, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!322, !520, !639}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !529, file: !523, line: 59, baseType: !636, size: 64, offset: 1344)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !529, file: !523, line: 60, baseType: !642, size: 64, offset: 1408)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!322, !520, !645, !484}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !529, file: !523, line: 61, baseType: !647, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!322, !520}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !529, file: !523, line: 63, baseType: !651, size: 64, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!322, !520, !368, !535, !432, !549, !549}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !529, file: !523, line: 64, baseType: !655, size: 64, offset: 1600)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!322, !520, !520, !566, !566, !570}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !529, file: !523, line: 65, baseType: !659, size: 64, offset: 1664)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!322, !520, !520, !570}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !529, file: !523, line: 66, baseType: !663, size: 64, offset: 1728)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!322, !520, !520, !566, !570}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !529, file: !523, line: 67, baseType: !659, size: 64, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !529, file: !523, line: 69, baseType: !647, size: 64, offset: 1856)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !529, file: !523, line: 70, baseType: !655, size: 64, offset: 1920)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !529, file: !523, line: 71, baseType: !663, size: 64, offset: 1984)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !529, file: !523, line: 72, baseType: !671, size: 64, offset: 2048)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!322, !520, !600}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !529, file: !523, line: 73, baseType: !647, size: 64, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !529, file: !523, line: 75, baseType: !676, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!322, !520, !679, !600}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !529, file: !523, line: 76, baseType: !546, size: 64, offset: 2240)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !529, file: !523, line: 77, baseType: !546, size: 64, offset: 2304)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !529, file: !523, line: 78, baseType: !563, size: 64, offset: 2368)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !529, file: !523, line: 79, baseType: !587, size: 64, offset: 2432)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !529, file: !523, line: 81, baseType: !685, size: 64, offset: 2496)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!322, !520, !432, !520, !688}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !529, file: !523, line: 82, baseType: !690, size: 64, offset: 2560)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!322, !520, !368, !693, !693, !599, !695}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !529, file: !523, line: 83, baseType: !697, size: 64, offset: 2624)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!322, !520, !368, !700, !368}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !529, file: !523, line: 84, baseType: !702, size: 64, offset: 2688)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!322, !520, !368, !535, !368, !535, !431}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !529, file: !523, line: 85, baseType: !706, size: 64, offset: 2752)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!322, !520, !520, !688}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !529, file: !523, line: 87, baseType: !710, size: 64, offset: 2816)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!322, !520, !549, !414}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !529, file: !523, line: 88, baseType: !714, size: 64, offset: 2880)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!322, !520, !432}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !529, file: !523, line: 89, baseType: !714, size: 64, offset: 2944)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !529, file: !523, line: 90, baseType: !719, size: 64, offset: 3008)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!322, !520, !549, !539}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !529, file: !523, line: 91, baseType: !651, size: 64, offset: 3072)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !529, file: !523, line: 93, baseType: !724, size: 64, offset: 3136)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!322, !520, !727}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !529, file: !523, line: 94, baseType: !731, size: 64, offset: 3200)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!322, !520, !368, !484, !484, !414, !734, !734, !624}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !529, file: !523, line: 95, baseType: !731, size: 64, offset: 3264)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !529, file: !523, line: 96, baseType: !731, size: 64, offset: 3328)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !529, file: !523, line: 97, baseType: !731, size: 64, offset: 3392)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !529, file: !523, line: 99, baseType: !739, size: 64, offset: 3456)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!322, !520, !742, !745}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !567, line: 51, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !567, line: 51, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !523, line: 609, size: 6208, elements: !748)
!748 = !{!749, !750, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !769, !776, !777, !778, !779, !780, !781, !782, !783, !787, !788, !789, !790, !791, !793, !794, !795, !796, !797, !798, !799}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !747, file: !523, line: 610, baseType: !526, size: 4480)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !747, file: !523, line: 610, baseType: !751, size: 32, offset: 4480)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !364)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !747, file: !523, line: 611, baseType: !368, size: 32, offset: 4512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !747, file: !523, line: 611, baseType: !368, size: 32, offset: 4544)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !747, file: !523, line: 611, baseType: !368, size: 32, offset: 4576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !747, file: !523, line: 612, baseType: !368, size: 32, offset: 4608)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !747, file: !523, line: 613, baseType: !368, size: 32, offset: 4640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !747, file: !523, line: 614, baseType: !414, size: 64, offset: 4672)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !747, file: !523, line: 615, baseType: !416, size: 64, offset: 4736)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !747, file: !523, line: 616, baseType: !700, size: 64, offset: 4800)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !747, file: !523, line: 617, baseType: !414, size: 64, offset: 4864)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !747, file: !523, line: 618, baseType: !762, size: 64, offset: 4928)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !523, line: 602, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 598, size: 128, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !764, file: !523, line: 599, baseType: !368, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !764, file: !523, line: 600, baseType: !368, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !764, file: !523, line: 601, baseType: !431, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !747, file: !523, line: 619, baseType: !770, size: 64, offset: 4992)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !523, line: 607, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 604, size: 128, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !772, file: !523, line: 605, baseType: !368, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !772, file: !523, line: 606, baseType: !431, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !747, file: !523, line: 620, baseType: !431, size: 64, offset: 5056)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !747, file: !523, line: 621, baseType: !423, size: 64, offset: 5120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !747, file: !523, line: 622, baseType: !423, size: 64, offset: 5184)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !747, file: !523, line: 623, baseType: !549, size: 64, offset: 5248)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !747, file: !523, line: 623, baseType: !549, size: 64, offset: 5312)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !747, file: !523, line: 623, baseType: !549, size: 64, offset: 5376)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !747, file: !523, line: 624, baseType: !484, size: 32, offset: 5440)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !747, file: !523, line: 625, baseType: !784, size: 64, offset: 5504)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!322}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !747, file: !523, line: 626, baseType: !405, size: 64, offset: 5568)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !747, file: !523, line: 627, baseType: !549, size: 64, offset: 5632)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !747, file: !523, line: 628, baseType: !368, size: 32, offset: 5696)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !747, file: !523, line: 629, baseType: !345, size: 64, offset: 5760)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !747, file: !523, line: 630, baseType: !792, size: 32, offset: 5824)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !747, file: !523, line: 631, baseType: !368, size: 32, offset: 5856)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !747, file: !523, line: 631, baseType: !368, size: 32, offset: 5888)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !747, file: !523, line: 632, baseType: !484, size: 32, offset: 5920)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !747, file: !523, line: 633, baseType: !484, size: 32, offset: 5952)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !747, file: !523, line: 634, baseType: !356, size: 64, offset: 6016)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !747, file: !523, line: 634, baseType: !405, size: 64, offset: 6080)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !747, file: !523, line: 635, baseType: !376, size: 64, offset: 6144)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !529, file: !523, line: 100, baseType: !801, size: 64, offset: 3520)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!322, !520, !368, !368, !804, !807}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !806)
!806 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !529, file: !523, line: 101, baseType: !647, size: 64, offset: 3584)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !529, file: !523, line: 102, baseType: !810, size: 64, offset: 3648)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!322, !520, !566, !566, !600}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !529, file: !523, line: 103, baseType: !532, size: 64, offset: 3712)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !529, file: !523, line: 105, baseType: !815, size: 64, offset: 3776)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!322, !520, !566, !566, !599, !600}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !529, file: !523, line: 106, baseType: !647, size: 64, offset: 3840)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !529, file: !523, line: 107, baseType: !820, size: 64, offset: 3904)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!322, !520, !332}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !529, file: !523, line: 108, baseType: !824, size: 64, offset: 3968)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!322, !520, !827, !599, !600}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !345)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !529, file: !523, line: 109, baseType: !784, size: 64, offset: 4032)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !529, file: !523, line: 111, baseType: !830, size: 64, offset: 4096)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!322, !520, !520, !520, !423, !520}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !529, file: !523, line: 112, baseType: !834, size: 64, offset: 4160)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!322, !520, !520, !520, !520}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !529, file: !523, line: 113, baseType: !838, size: 64, offset: 4224)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!322, !520, !841, !841}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !567, line: 30, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !567, line: 30, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !529, file: !523, line: 114, baseType: !532, size: 64, offset: 4288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !529, file: !523, line: 115, baseType: !651, size: 64, offset: 4352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !529, file: !523, line: 117, baseType: !710, size: 64, offset: 4416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !529, file: !523, line: 118, baseType: !710, size: 64, offset: 4480)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !529, file: !523, line: 119, baseType: !824, size: 64, offset: 4544)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !529, file: !523, line: 120, baseType: !850, size: 64, offset: 4608)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!322, !520, !853, !624}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !529, file: !523, line: 121, baseType: !784, size: 64, offset: 4672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !529, file: !523, line: 123, baseType: !856, size: 64, offset: 4736)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!322, !520, !368, !405}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !529, file: !523, line: 124, baseType: !860, size: 64, offset: 4800)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!322, !520, !745, !549, !405}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !529, file: !523, line: 125, baseType: !864, size: 64, offset: 4864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!322, !460, !520}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !529, file: !523, line: 126, baseType: !546, size: 64, offset: 4928)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !529, file: !523, line: 127, baseType: !546, size: 64, offset: 4992)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !529, file: !523, line: 129, baseType: !870, size: 64, offset: 5056)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!322, !520, !700}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !529, file: !523, line: 130, baseType: !874, size: 64, offset: 5120)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!322, !520, !877, !877}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !879, file: !60, line: 653, baseType: !368, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !879, file: !60, line: 653, baseType: !549, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !529, file: !523, line: 131, baseType: !874, size: 64, offset: 5184)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !529, file: !523, line: 132, baseType: !885, size: 64, offset: 5248)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!322, !520, !414, !414, !414}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !529, file: !523, line: 133, baseType: !820, size: 64, offset: 5312)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !529, file: !523, line: 135, baseType: !890, size: 64, offset: 5376)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!322, !520, !423, !624}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !529, file: !523, line: 136, baseType: !890, size: 64, offset: 5440)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !529, file: !523, line: 137, baseType: !895, size: 64, offset: 5504)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!322, !520, !624}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !529, file: !523, line: 138, baseType: !532, size: 64, offset: 5568)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !529, file: !523, line: 139, baseType: !900, size: 64, offset: 5632)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!322, !520, !903, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !529, file: !523, line: 141, baseType: !784, size: 64, offset: 5696)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !529, file: !523, line: 142, baseType: !906, size: 64, offset: 5760)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!322, !520, !520, !423, !520}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !529, file: !523, line: 143, baseType: !910, size: 64, offset: 5824)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!322, !520, !520, !520}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !529, file: !523, line: 144, baseType: !784, size: 64, offset: 5888)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !529, file: !523, line: 145, baseType: !906, size: 64, offset: 5952)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !529, file: !523, line: 147, baseType: !910, size: 64, offset: 6016)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !529, file: !523, line: 148, baseType: !784, size: 64, offset: 6080)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !529, file: !523, line: 149, baseType: !906, size: 64, offset: 6144)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !529, file: !523, line: 150, baseType: !910, size: 64, offset: 6208)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !529, file: !523, line: 151, baseType: !920, size: 64, offset: 6272)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!322, !520, !484}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !529, file: !523, line: 153, baseType: !647, size: 64, offset: 6336)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !529, file: !523, line: 154, baseType: !647, size: 64, offset: 6400)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !529, file: !523, line: 155, baseType: !647, size: 64, offset: 6464)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !529, file: !523, line: 156, baseType: !647, size: 64, offset: 6528)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !529, file: !523, line: 157, baseType: !820, size: 64, offset: 6592)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !529, file: !523, line: 159, baseType: !929, size: 64, offset: 6656)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!322, !520, !368, !537}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !529, file: !523, line: 160, baseType: !647, size: 64, offset: 6720)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !529, file: !523, line: 161, baseType: !647, size: 64, offset: 6784)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !529, file: !523, line: 162, baseType: !647, size: 64, offset: 6848)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !529, file: !523, line: 163, baseType: !647, size: 64, offset: 6912)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !529, file: !523, line: 165, baseType: !910, size: 64, offset: 6976)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !529, file: !523, line: 166, baseType: !910, size: 64, offset: 7040)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !529, file: !523, line: 167, baseType: !710, size: 64, offset: 7104)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !529, file: !523, line: 168, baseType: !940, size: 64, offset: 7168)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!322, !520, !549, !368}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !529, file: !523, line: 169, baseType: !944, size: 64, offset: 7232)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!322, !520, !624, !414}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !529, file: !523, line: 171, baseType: !671, size: 64, offset: 7296)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !529, file: !523, line: 172, baseType: !647, size: 64, offset: 7360)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !529, file: !523, line: 173, baseType: !950, size: 64, offset: 7424)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!322, !520, !414, !734}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !529, file: !523, line: 174, baseType: !810, size: 64, offset: 7488)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !529, file: !523, line: 175, baseType: !810, size: 64, offset: 7552)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !529, file: !523, line: 177, baseType: !546, size: 64, offset: 7616)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !529, file: !523, line: 178, baseType: !596, size: 64, offset: 7680)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !529, file: !523, line: 179, baseType: !546, size: 64, offset: 7744)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !529, file: !523, line: 180, baseType: !553, size: 64, offset: 7808)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !529, file: !523, line: 181, baseType: !960, size: 64, offset: 7872)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!322, !520, !324, !599, !600}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !529, file: !523, line: 183, baseType: !870, size: 64, offset: 7936)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !529, file: !523, line: 184, baseType: !631, size: 64, offset: 8000)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !529, file: !523, line: 185, baseType: !966, size: 64, offset: 8064)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!322, !520, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !529, file: !523, line: 186, baseType: !971, size: 64, offset: 8128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!322, !520, !368, !535, !431}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !529, file: !523, line: 187, baseType: !690, size: 64, offset: 8192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !529, file: !523, line: 189, baseType: !976, size: 64, offset: 8256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!322, !520, !368, !368, !414, !537}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !529, file: !523, line: 190, baseType: !784, size: 64, offset: 8320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !529, file: !523, line: 191, baseType: !906, size: 64, offset: 8384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !529, file: !523, line: 192, baseType: !910, size: 64, offset: 8448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !529, file: !523, line: 193, baseType: !983, size: 64, offset: 8512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!322, !520, !742, !986}
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !523, line: 660, size: 5312, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !988, file: !523, line: 661, baseType: !526, size: 4480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !988, file: !523, line: 661, baseType: !751, size: 32, offset: 4480)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !988, file: !523, line: 662, baseType: !368, size: 32, offset: 4512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !988, file: !523, line: 662, baseType: !368, size: 32, offset: 4544)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !988, file: !523, line: 662, baseType: !368, size: 32, offset: 4576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !988, file: !523, line: 663, baseType: !368, size: 32, offset: 4608)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !988, file: !523, line: 664, baseType: !368, size: 32, offset: 4640)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !988, file: !523, line: 665, baseType: !414, size: 64, offset: 4672)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !988, file: !523, line: 666, baseType: !414, size: 64, offset: 4736)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !988, file: !523, line: 667, baseType: !368, size: 32, offset: 4800)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !988, file: !523, line: 668, baseType: !792, size: 32, offset: 4832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !988, file: !523, line: 670, baseType: !414, size: 64, offset: 4864)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !988, file: !523, line: 670, baseType: !414, size: 64, offset: 4928)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !988, file: !523, line: 671, baseType: !414, size: 64, offset: 4992)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !988, file: !523, line: 672, baseType: !414, size: 64, offset: 5056)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !988, file: !523, line: 673, baseType: !414, size: 64, offset: 5120)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !988, file: !523, line: 674, baseType: !368, size: 32, offset: 5184)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !988, file: !523, line: 675, baseType: !414, size: 64, offset: 5248)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !529, file: !523, line: 195, baseType: !1009, size: 64, offset: 8576)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!322, !986, !520, !520}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !529, file: !523, line: 196, baseType: !1009, size: 64, offset: 8640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !529, file: !523, line: 197, baseType: !784, size: 64, offset: 8704)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !529, file: !523, line: 198, baseType: !906, size: 64, offset: 8768)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !529, file: !523, line: 199, baseType: !910, size: 64, offset: 8832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !529, file: !523, line: 201, baseType: !1017, size: 64, offset: 8896)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!322, !520, !368, !368}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !529, file: !523, line: 202, baseType: !685, size: 64, offset: 8960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !529, file: !523, line: 203, baseType: !553, size: 64, offset: 9024)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !529, file: !523, line: 204, baseType: !739, size: 64, offset: 9088)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !529, file: !523, line: 205, baseType: !870, size: 64, offset: 9152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !529, file: !523, line: 206, baseType: !1025, size: 64, offset: 9216)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!322, !324, !520, !368, !599, !600}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !529, file: !523, line: 208, baseType: !1029, size: 64, offset: 9280)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!322, !368, !695}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !529, file: !523, line: 209, baseType: !910, size: 64, offset: 9344)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !529, file: !523, line: 210, baseType: !702, size: 64, offset: 9408)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !522, file: !523, line: 438, baseType: !1035, size: 64, offset: 13952)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !567, line: 60, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1037, file: !114, line: 241, baseType: !324, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1037, file: !114, line: 242, baseType: !385, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1037, file: !114, line: 243, baseType: !368, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1037, file: !114, line: 243, baseType: !368, size: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1037, file: !114, line: 244, baseType: !368, size: 32, offset: 160)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1037, file: !114, line: 244, baseType: !368, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1037, file: !114, line: 245, baseType: !414, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1037, file: !114, line: 246, baseType: !484, size: 32, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1037, file: !114, line: 247, baseType: !368, size: 32, offset: 352)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1037, file: !114, line: 251, baseType: !368, size: 32, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1037, file: !114, line: 252, baseType: !841, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1037, file: !114, line: 253, baseType: !484, size: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1037, file: !114, line: 254, baseType: !368, size: 32, offset: 544)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1037, file: !114, line: 254, baseType: !368, size: 32, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1037, file: !114, line: 255, baseType: !368, size: 32, offset: 608)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !522, file: !523, line: 438, baseType: !1035, size: 64, offset: 14016)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !522, file: !523, line: 439, baseType: !405, size: 64, offset: 14080)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !522, file: !523, line: 440, baseType: !1057, size: 32, offset: 14144)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !522, file: !523, line: 441, baseType: !484, size: 32, offset: 14176)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !522, file: !523, line: 442, baseType: !484, size: 32, offset: 14208)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !522, file: !523, line: 443, baseType: !1061, size: 448, offset: 14272)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 448, elements: !1063)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !345)
!1063 = !{!1064}
!1064 = !DISubrange(count: 7)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !522, file: !523, line: 444, baseType: !484, size: 32, offset: 14720)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !522, file: !523, line: 445, baseType: !484, size: 32, offset: 14752)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !522, file: !523, line: 446, baseType: !368, size: 32, offset: 14784)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !522, file: !523, line: 447, baseType: !407, size: 64, offset: 14848)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !522, file: !523, line: 448, baseType: !407, size: 64, offset: 14912)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !522, file: !523, line: 449, baseType: !607, size: 640, offset: 14976)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !522, file: !523, line: 450, baseType: !539, size: 32, offset: 15616)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !522, file: !523, line: 451, baseType: !1073, size: 2880, offset: 15680)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !523, line: 318, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !523, line: 319, size: 2880, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1095, !1096, !1101, !1106, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1121, !1122, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1154, !1155, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1178, !1179, !1180, !1184, !1185}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1074, file: !523, line: 320, baseType: !368, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1074, file: !523, line: 321, baseType: !368, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1074, file: !523, line: 322, baseType: !368, size: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1074, file: !523, line: 323, baseType: !368, size: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1074, file: !523, line: 324, baseType: !368, size: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1074, file: !523, line: 325, baseType: !368, size: 32, offset: 160)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1074, file: !523, line: 326, baseType: !1083, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !523, line: 293, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !523, line: 295, size: 448, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !523, line: 296, baseType: !1083, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1085, file: !523, line: 297, baseType: !431, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1085, file: !523, line: 297, baseType: !431, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1085, file: !523, line: 298, baseType: !414, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1085, file: !523, line: 298, baseType: !414, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1085, file: !523, line: 299, baseType: !368, size: 32, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1085, file: !523, line: 300, baseType: !368, size: 32, offset: 352)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1085, file: !523, line: 301, baseType: !368, size: 32, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1074, file: !523, line: 326, baseType: !1083, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1074, file: !523, line: 328, baseType: !1097, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!322, !520, !1100, !414}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1074, file: !523, line: 329, baseType: !1102, size: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!322, !1100, !1105, !416, !416, !434, !414}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1074, file: !523, line: 330, baseType: !1107, size: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!322, !1100}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1074, file: !523, line: 331, baseType: !1107, size: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1074, file: !523, line: 334, baseType: !324, size: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !523, line: 335, baseType: !385, size: 32, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1074, file: !523, line: 335, baseType: !385, size: 32, offset: 672)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1074, file: !523, line: 336, baseType: !385, size: 32, offset: 704)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1074, file: !523, line: 336, baseType: !385, size: 32, offset: 736)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1074, file: !523, line: 337, baseType: !1117, size: 64, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !325, line: 339, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !325, line: 339, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1074, file: !523, line: 338, baseType: !1117, size: 64, offset: 832)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1074, file: !523, line: 339, baseType: !1123, size: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !325, line: 341, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !325, line: 351, size: 192, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1131}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1125, file: !325, line: 354, baseType: !72, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1125, file: !325, line: 355, baseType: !72, size: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1125, file: !325, line: 356, baseType: !72, size: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1125, file: !325, line: 361, baseType: !72, size: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1125, file: !325, line: 362, baseType: !480, size: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1074, file: !523, line: 340, baseType: !368, size: 32, offset: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1074, file: !523, line: 340, baseType: !368, size: 32, offset: 992)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1074, file: !523, line: 341, baseType: !431, size: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1074, file: !523, line: 342, baseType: !414, size: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1074, file: !523, line: 343, baseType: !434, size: 64, offset: 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1074, file: !523, line: 344, baseType: !416, size: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1074, file: !523, line: 345, baseType: !368, size: 32, offset: 1280)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1074, file: !523, line: 346, baseType: !1105, size: 64, offset: 1344)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1074, file: !523, line: 347, baseType: !484, size: 32, offset: 1408)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1074, file: !523, line: 348, baseType: !368, size: 32, offset: 1440)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1074, file: !523, line: 351, baseType: !484, size: 32, offset: 1472)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1074, file: !523, line: 352, baseType: !484, size: 32, offset: 1504)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1074, file: !523, line: 353, baseType: !385, size: 32, offset: 1536)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1074, file: !523, line: 354, baseType: !385, size: 32, offset: 1568)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1074, file: !523, line: 355, baseType: !1105, size: 64, offset: 1600)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1074, file: !523, line: 356, baseType: !1105, size: 64, offset: 1664)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1074, file: !523, line: 357, baseType: !1149, size: 64, offset: 1728)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !523, line: 310, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 308, size: 32, elements: !1152)
!1152 = !{!1153}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1151, file: !523, line: 309, baseType: !368, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1074, file: !523, line: 357, baseType: !1149, size: 64, offset: 1792)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1074, file: !523, line: 358, baseType: !1156, size: 64, offset: 1856)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !523, line: 316, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 312, size: 128, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1158, file: !523, line: 313, baseType: !405, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1158, file: !523, line: 314, baseType: !368, size: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1158, file: !523, line: 315, baseType: !347, size: 8, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1074, file: !523, line: 359, baseType: !1156, size: 64, offset: 1920)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1074, file: !523, line: 360, baseType: !1156, size: 64, offset: 1984)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1074, file: !523, line: 361, baseType: !368, size: 32, offset: 2048)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1074, file: !523, line: 362, baseType: !385, size: 32, offset: 2080)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1074, file: !523, line: 363, baseType: !368, size: 32, offset: 2112)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1074, file: !523, line: 364, baseType: !1105, size: 64, offset: 2176)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1074, file: !523, line: 365, baseType: !1123, size: 64, offset: 2240)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1074, file: !523, line: 366, baseType: !385, size: 32, offset: 2304)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1074, file: !523, line: 367, baseType: !385, size: 32, offset: 2336)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1074, file: !523, line: 368, baseType: !1117, size: 64, offset: 2368)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1074, file: !523, line: 369, baseType: !1117, size: 64, offset: 2432)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1074, file: !523, line: 370, baseType: !1175, size: 64, offset: 2496)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1074, file: !523, line: 371, baseType: !1175, size: 64, offset: 2560)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1074, file: !523, line: 372, baseType: !1175, size: 64, offset: 2624)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1074, file: !523, line: 373, baseType: !1181, size: 64, offset: 2688)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !325, line: 331, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !325, line: 331, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1074, file: !523, line: 374, baseType: !480, size: 64, offset: 2752)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1074, file: !523, line: 375, baseType: !1186, size: 64, offset: 2816)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !522, file: !523, line: 451, baseType: !1073, size: 2880, offset: 18560)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !522, file: !523, line: 452, baseType: !1189, size: 64, offset: 21440)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !523, line: 681, size: 4864, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1197, !1198, !1199, !1203}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1191, file: !523, line: 682, baseType: !526, size: 4480)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1191, file: !523, line: 682, baseType: !751, size: 32, offset: 4480)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1191, file: !523, line: 683, baseType: !484, size: 32, offset: 4512)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1191, file: !523, line: 684, baseType: !368, size: 32, offset: 4544)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1191, file: !523, line: 685, baseType: !903, size: 64, offset: 4608)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1191, file: !523, line: 686, baseType: !431, size: 64, offset: 4672)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1191, file: !523, line: 687, baseType: !1200, size: 64, offset: 4736)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!322, !1189, !549, !405}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1191, file: !523, line: 688, baseType: !405, size: 64, offset: 4800)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !522, file: !523, line: 453, baseType: !1189, size: 64, offset: 21504)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !522, file: !523, line: 454, baseType: !1189, size: 64, offset: 21568)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !522, file: !523, line: 455, baseType: !368, size: 32, offset: 21632)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !522, file: !523, line: 456, baseType: !484, size: 32, offset: 21664)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !522, file: !523, line: 457, baseType: !1209, size: 320, offset: 21696)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !523, line: 399, baseType: !1210)
