; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/submat/submat.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/submat/submat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326}
!322 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!327 = !{!328, !332, !333, !502, !368, !536}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !329, line: 330, baseType: !330)
!329 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !329, line: 330, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !336, line: 73, size: 4480, elements: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!337 = !{!338, !340, !389, !390, !392, !395, !396, !397, !398, !406, !407, !409, !413, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !430, !431, !432, !434, !435, !437, !439, !440, !441, !442, !443, !446, !448, !449, !450, !451, !452, !455, !457, !458, !459, !469, !471, !472, !476, !477, !526, !531, !533, !534, !535}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !335, file: !336, line: 74, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !335, file: !336, line: 75, baseType: !341, size: 448, offset: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 448, elements: !387)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !336, line: 53, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 45, size: 448, elements: !344)
!344 = !{!345, !351, !359, !364, !371, !375, !382}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !343, file: !336, line: 46, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !333, !350}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !343, file: !336, line: 47, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!349, !333, !355}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !356, line: 16, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !356, line: 16, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !343, file: !336, line: 48, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!349, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !343, file: !336, line: 49, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!349, !333, !368, !333}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !343, file: !336, line: 50, baseType: !372, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!349, !333, !368, !363}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !343, file: !336, line: 51, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!349, !333, !368, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !343, file: !336, line: 52, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!349, !333, !368, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!387 = !{!388}
!388 = !DISubrange(count: 1)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !335, file: !336, line: 76, baseType: !328, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !336, line: 77, baseType: !391, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !335, file: !336, line: 78, baseType: !393, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !394)
!394 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !335, file: !336, line: 78, baseType: !393, size: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !335, file: !336, line: 78, baseType: !393, size: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !335, file: !336, line: 78, baseType: !393, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !336, line: 79, baseType: !399, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !402, line: 27, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !404, line: 43, baseType: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!405 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !335, file: !336, line: 80, baseType: !391, size: 32, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !335, file: !336, line: 81, baseType: !408, size: 32, offset: 992)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !335, file: !336, line: 82, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !335, file: !336, line: 83, baseType: !414, size: 64, offset: 1088)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !335, file: !336, line: 84, baseType: !418, size: 64, offset: 1152)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !335, file: !336, line: 85, baseType: !418, size: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !335, file: !336, line: 86, baseType: !418, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !335, file: !336, line: 87, baseType: !418, size: 64, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !335, file: !336, line: 88, baseType: !333, size: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !335, file: !336, line: 89, baseType: !399, size: 64, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !336, line: 90, baseType: !418, size: 64, offset: 1536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !335, file: !336, line: 91, baseType: !418, size: 64, offset: 1600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !335, file: !336, line: 92, baseType: !391, size: 32, offset: 1664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !335, file: !336, line: 93, baseType: !332, size: 64, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !336, line: 94, baseType: !429, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !400)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !335, file: !336, line: 95, baseType: !391, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !335, file: !336, line: 95, baseType: !391, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !335, file: !336, line: 96, baseType: !433, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !335, file: !336, line: 96, baseType: !433, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !335, file: !336, line: 97, baseType: !436, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !335, file: !336, line: 97, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !335, file: !336, line: 98, baseType: !391, size: 32, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !335, file: !336, line: 98, baseType: !391, size: 32, offset: 2208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !335, file: !336, line: 99, baseType: !433, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !335, file: !336, line: 99, baseType: !433, size: 64, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !335, file: !336, line: 100, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !394)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !335, file: !336, line: 100, baseType: !447, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !335, file: !336, line: 101, baseType: !391, size: 32, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !335, file: !336, line: 101, baseType: !391, size: 32, offset: 2528)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !335, file: !336, line: 102, baseType: !433, size: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !335, file: !336, line: 102, baseType: !433, size: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !335, file: !336, line: 103, baseType: !453, size: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !445)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !335, file: !336, line: 103, baseType: !456, size: 64, offset: 2752)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !335, file: !336, line: 104, baseType: !386, size: 64, offset: 2816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !335, file: !336, line: 105, baseType: !391, size: 32, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !335, file: !336, line: 106, baseType: !460, size: 128, offset: 2944)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !467)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !336, line: 64, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 61, size: 128, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !463, file: !336, line: 62, baseType: !379, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !463, file: !336, line: 63, baseType: !332, size: 64, offset: 64)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !335, file: !336, line: 107, baseType: !470, size: 64, offset: 3072)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 64, elements: !467)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !335, file: !336, line: 108, baseType: !332, size: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !335, file: !336, line: 109, baseType: !473, size: 64, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!349, !332}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !335, file: !336, line: 111, baseType: !391, size: 32, offset: 3264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !335, file: !336, line: 112, baseType: !478, size: 320, offset: 3328)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !524)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!349, !482, !333, !332}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !485)
!485 = !{!486, !487, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !484, file: !10, line: 100, baseType: !391, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !10, line: 101, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !499, !500, !501, !505, !507, !509, !510, !511}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !490, file: !10, line: 84, baseType: !418, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !490, file: !10, line: 85, baseType: !418, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !10, line: 86, baseType: !332, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !490, file: !10, line: 87, baseType: !410, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !490, file: !10, line: 88, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !490, file: !10, line: 89, baseType: !370, size: 8, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !490, file: !10, line: 90, baseType: !418, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !490, file: !10, line: 91, baseType: !502, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !503, line: 46, baseType: !504)
!503 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!504 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !10, line: 92, baseType: !506, size: 32, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !10, line: 93, baseType: !508, size: 32, offset: 544)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !10, line: 94, baseType: !488, size: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !490, file: !10, line: 95, baseType: !418, size: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !490, file: !10, line: 96, baseType: !332, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !484, file: !10, line: 102, baseType: !418, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !484, file: !10, line: 102, baseType: !418, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !484, file: !10, line: 103, baseType: !418, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !484, file: !10, line: 104, baseType: !328, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !484, file: !10, line: 106, baseType: !333, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !484, file: !10, line: 107, baseType: !521, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!524 = !{!525}
!525 = !DISubrange(count: 5)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !335, file: !336, line: 113, baseType: !527, size: 320, offset: 3648)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !524)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!349, !333, !332}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !335, file: !336, line: 114, baseType: !532, size: 320, offset: 3968)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 320, elements: !524)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !335, file: !336, line: 115, baseType: !506, size: 32, offset: 4288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !335, file: !336, line: 120, baseType: !521, size: 64, offset: 4352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !335, file: !336, line: 121, baseType: !506, size: 32, offset: 4416)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SubVirtual", file: !538, line: 10, baseType: !539)
!538 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/submat/submat.c", directory: "/home/users/ndemeye/xSDK")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 4, size: 576, elements: !540)
!540 = !{!541, !546, !547, !551, !552, !553, !554, !560, !561}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "isrow", scope: !539, file: !538, line: 5, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !543, line: 11, baseType: !544)
!543 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !543, line: 11, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "iscol", scope: !539, file: !538, line: 5, baseType: !542, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lwork", scope: !539, file: !538, line: 6, baseType: !548, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rwork", scope: !539, file: !538, line: 6, baseType: !548, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lwork2", scope: !539, file: !538, line: 7, baseType: !548, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rwork2", scope: !539, file: !538, line: 7, baseType: !548, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lrestrict", scope: !539, file: !538, line: 8, baseType: !555, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !556, line: 59, baseType: !557)
!556 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !556, line: 15, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !556, line: 15, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rprolong", scope: !539, file: !538, line: 8, baseType: !555, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !539, file: !538, line: 9, baseType: !562, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !565, line: 436, size: 23424, elements: !566)
!565 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!566 = !{!567, !569, !1069, !1089, !1090, !1091, !1093, !1094, !1095, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1222, !1223, !1239, !1240, !1241, !1242, !1243, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1278, !1298, !1299, !1301, !1302, !1303, !1304, !1305, !1306, !1324, !1325}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !564, file: !565, line: 437, baseType: !568, size: 4480)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !336, line: 122, baseType: !335)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !564, file: !565, line: 437, baseType: !570, size: 9472, offset: 4480)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 9472, elements: !387)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !565, line: 32, size: 9472, elements: !572)
!572 = !{!573, !582, !586, !587, !591, !595, !596, !597, !598, !599, !600, !601, !621, !625, !630, !636, !655, !660, !664, !665, !670, !675, !676, !681, !685, !689, !693, !697, !701, !702, !703, !704, !705, !709, !710, !715, !716, !717, !718, !719, !724, !731, !736, !740, !744, !748, !752, !753, !757, !758, !765, !770, !771, !772, !773, !835, !843, !844, !848, !849, !853, !854, !858, !863, !864, !868, !872, !879, !880, !881, !882, !883, !884, !889, !890, !894, !898, !902, !903, !904, !908, !918, !919, !923, !924, !928, !929, !933, !934, !939, !940, !944, !948, !949, !950, !951, !952, !953, !954, !958, !959, !960, !961, !962, !963, !967, !968, !969, !970, !971, !972, !973, !974, !978, !982, !983, !984, !988, !989, !990, !991, !992, !993, !994, !998, !999, !1000, !1005, !1009, !1010, !1014, !1015, !1016, !1017, !1043, !1047, !1048, !1049, !1050, !1051, !1055, !1056, !1057, !1058, !1059, !1063, !1067, !1068}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !571, file: !565, line: 34, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!349, !562, !391, !577, !391, !577, !579, !581}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !571, file: !565, line: 35, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!349, !562, !391, !436, !438, !456}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !571, file: !565, line: 36, baseType: !583, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !571, file: !565, line: 37, baseType: !588, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!349, !562, !548, !548}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !571, file: !565, line: 38, baseType: !592, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!349, !562, !548, !548, !548}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !571, file: !565, line: 40, baseType: !588, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !571, file: !565, line: 41, baseType: !592, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !571, file: !565, line: 42, baseType: !588, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !571, file: !565, line: 43, baseType: !592, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !571, file: !565, line: 44, baseType: !588, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !571, file: !565, line: 46, baseType: !592, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !571, file: !565, line: 47, baseType: !602, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!349, !562, !542, !542, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !608, file: !36, line: 1227, baseType: !445, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !608, file: !36, line: 1228, baseType: !445, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !608, file: !36, line: 1229, baseType: !445, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !608, file: !36, line: 1230, baseType: !445, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !608, file: !36, line: 1231, baseType: !445, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !608, file: !36, line: 1232, baseType: !445, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !608, file: !36, line: 1233, baseType: !445, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !608, file: !36, line: 1234, baseType: !445, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !608, file: !36, line: 1236, baseType: !445, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !608, file: !36, line: 1237, baseType: !445, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !608, file: !36, line: 1238, baseType: !445, size: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !571, file: !565, line: 48, baseType: !622, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!349, !562, !542, !605}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !571, file: !565, line: 49, baseType: !626, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!349, !562, !548, !445, !629, !445, !391, !391, !548}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !571, file: !565, line: 50, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!349, !562, !634, !635}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !571, file: !565, line: 52, baseType: !637, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!349, !562, !640, !641}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !643, file: !36, line: 593, baseType: !393, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !643, file: !36, line: 594, baseType: !393, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !643, file: !36, line: 594, baseType: !393, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !643, file: !36, line: 594, baseType: !393, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !643, file: !36, line: 595, baseType: !393, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !643, file: !36, line: 596, baseType: !393, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !643, file: !36, line: 597, baseType: !393, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !643, file: !36, line: 598, baseType: !393, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !643, file: !36, line: 598, baseType: !393, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !643, file: !36, line: 599, baseType: !393, size: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !571, file: !565, line: 53, baseType: !656, size: 64, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!349, !562, !562, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !571, file: !565, line: 54, baseType: !661, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!349, !562, !548}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !571, file: !565, line: 55, baseType: !588, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !571, file: !565, line: 56, baseType: !666, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!349, !562, !669, !444}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !571, file: !565, line: 58, baseType: !671, size: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!349, !562, !674}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !571, file: !565, line: 59, baseType: !671, size: 64, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !571, file: !565, line: 60, baseType: !677, size: 64, offset: 1408)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!349, !562, !680, !506}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !571, file: !565, line: 61, baseType: !682, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!349, !562}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !571, file: !565, line: 63, baseType: !686, size: 64, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!349, !562, !391, !577, !454, !548, !548}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !571, file: !565, line: 64, baseType: !690, size: 64, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!349, !562, !562, !542, !542, !605}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !571, file: !565, line: 65, baseType: !694, size: 64, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!349, !562, !562, !605}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !571, file: !565, line: 66, baseType: !698, size: 64, offset: 1728)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!349, !562, !562, !542, !605}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !571, file: !565, line: 67, baseType: !694, size: 64, offset: 1792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !571, file: !565, line: 69, baseType: !682, size: 64, offset: 1856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !571, file: !565, line: 70, baseType: !690, size: 64, offset: 1920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !571, file: !565, line: 71, baseType: !698, size: 64, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !571, file: !565, line: 72, baseType: !706, size: 64, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!349, !562, !635}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !571, file: !565, line: 73, baseType: !682, size: 64, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !571, file: !565, line: 75, baseType: !711, size: 64, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!349, !562, !714, !635}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !571, file: !565, line: 76, baseType: !588, size: 64, offset: 2240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !571, file: !565, line: 77, baseType: !588, size: 64, offset: 2304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !571, file: !565, line: 78, baseType: !602, size: 64, offset: 2368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !571, file: !565, line: 79, baseType: !622, size: 64, offset: 2432)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !571, file: !565, line: 81, baseType: !720, size: 64, offset: 2496)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!349, !562, !454, !562, !723}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !571, file: !565, line: 82, baseType: !725, size: 64, offset: 2560)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!349, !562, !391, !728, !728, !634, !730}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !571, file: !565, line: 83, baseType: !732, size: 64, offset: 2624)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!349, !562, !391, !735, !391}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !571, file: !565, line: 84, baseType: !737, size: 64, offset: 2688)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!349, !562, !391, !577, !391, !577, !453}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !571, file: !565, line: 85, baseType: !741, size: 64, offset: 2752)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!349, !562, !562, !723}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !571, file: !565, line: 87, baseType: !745, size: 64, offset: 2816)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!349, !562, !548, !436}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !571, file: !565, line: 88, baseType: !749, size: 64, offset: 2880)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!349, !562, !454}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !571, file: !565, line: 89, baseType: !749, size: 64, offset: 2944)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !571, file: !565, line: 90, baseType: !754, size: 64, offset: 3008)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!349, !562, !548, !581}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !571, file: !565, line: 91, baseType: !686, size: 64, offset: 3072)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !571, file: !565, line: 93, baseType: !759, size: 64, offset: 3136)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!349, !562, !762}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !571, file: !565, line: 94, baseType: !766, size: 64, offset: 3200)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!349, !562, !391, !506, !506, !436, !769, !769, !659}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !571, file: !565, line: 95, baseType: !766, size: 64, offset: 3264)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !571, file: !565, line: 96, baseType: !766, size: 64, offset: 3328)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !571, file: !565, line: 97, baseType: !766, size: 64, offset: 3392)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !571, file: !565, line: 99, baseType: !774, size: 64, offset: 3456)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!349, !562, !777, !780}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !543, line: 51, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !543, line: 51, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !565, line: 609, size: 6208, elements: !783)
!783 = !{!784, !785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !804, !811, !812, !813, !814, !815, !816, !817, !818, !822, !823, !824, !825, !826, !828, !829, !830, !831, !832, !833, !834}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !782, file: !565, line: 610, baseType: !568, size: 4480)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !782, file: !565, line: 610, baseType: !786, size: 32, offset: 4480)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !387)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !782, file: !565, line: 611, baseType: !391, size: 32, offset: 4512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !782, file: !565, line: 611, baseType: !391, size: 32, offset: 4544)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !782, file: !565, line: 611, baseType: !391, size: 32, offset: 4576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !782, file: !565, line: 612, baseType: !391, size: 32, offset: 4608)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !782, file: !565, line: 613, baseType: !391, size: 32, offset: 4640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !782, file: !565, line: 614, baseType: !436, size: 64, offset: 4672)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !782, file: !565, line: 615, baseType: !438, size: 64, offset: 4736)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !782, file: !565, line: 616, baseType: !735, size: 64, offset: 4800)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !782, file: !565, line: 617, baseType: !436, size: 64, offset: 4864)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !782, file: !565, line: 618, baseType: !797, size: 64, offset: 4928)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !565, line: 602, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 598, size: 128, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !799, file: !565, line: 599, baseType: !391, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !799, file: !565, line: 600, baseType: !391, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !799, file: !565, line: 601, baseType: !453, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !782, file: !565, line: 619, baseType: !805, size: 64, offset: 4992)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !565, line: 607, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 604, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !807, file: !565, line: 605, baseType: !391, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !807, file: !565, line: 606, baseType: !453, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !782, file: !565, line: 620, baseType: !453, size: 64, offset: 5056)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !782, file: !565, line: 621, baseType: !445, size: 64, offset: 5120)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !782, file: !565, line: 622, baseType: !445, size: 64, offset: 5184)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !782, file: !565, line: 623, baseType: !548, size: 64, offset: 5248)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !782, file: !565, line: 623, baseType: !548, size: 64, offset: 5312)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !782, file: !565, line: 623, baseType: !548, size: 64, offset: 5376)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !782, file: !565, line: 624, baseType: !506, size: 32, offset: 5440)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !782, file: !565, line: 625, baseType: !819, size: 64, offset: 5504)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!349}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !782, file: !565, line: 626, baseType: !332, size: 64, offset: 5568)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !782, file: !565, line: 627, baseType: !548, size: 64, offset: 5632)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !782, file: !565, line: 628, baseType: !391, size: 32, offset: 5696)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !782, file: !565, line: 629, baseType: !368, size: 64, offset: 5760)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !782, file: !565, line: 630, baseType: !827, size: 32, offset: 5824)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !782, file: !565, line: 631, baseType: !391, size: 32, offset: 5856)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !782, file: !565, line: 631, baseType: !391, size: 32, offset: 5888)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !782, file: !565, line: 632, baseType: !506, size: 32, offset: 5920)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !782, file: !565, line: 633, baseType: !506, size: 32, offset: 5952)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !782, file: !565, line: 634, baseType: !379, size: 64, offset: 6016)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !782, file: !565, line: 634, baseType: !332, size: 64, offset: 6080)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !782, file: !565, line: 635, baseType: !399, size: 64, offset: 6144)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !571, file: !565, line: 100, baseType: !836, size: 64, offset: 3520)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!349, !562, !391, !391, !839, !842}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !841)
!841 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !571, file: !565, line: 101, baseType: !682, size: 64, offset: 3584)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !571, file: !565, line: 102, baseType: !845, size: 64, offset: 3648)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!349, !562, !542, !542, !635}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !571, file: !565, line: 103, baseType: !574, size: 64, offset: 3712)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !571, file: !565, line: 105, baseType: !850, size: 64, offset: 3776)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!349, !562, !542, !542, !634, !635}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !571, file: !565, line: 106, baseType: !682, size: 64, offset: 3840)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !571, file: !565, line: 107, baseType: !855, size: 64, offset: 3904)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!349, !562, !355}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !571, file: !565, line: 108, baseType: !859, size: 64, offset: 3968)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!349, !562, !862, !634, !635}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !368)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !571, file: !565, line: 109, baseType: !819, size: 64, offset: 4032)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !571, file: !565, line: 111, baseType: !865, size: 64, offset: 4096)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!349, !562, !562, !562, !445, !562}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !571, file: !565, line: 112, baseType: !869, size: 64, offset: 4160)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!349, !562, !562, !562, !562}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !571, file: !565, line: 113, baseType: !873, size: 64, offset: 4224)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!349, !562, !876, !876}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !543, line: 30, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !543, line: 30, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !571, file: !565, line: 114, baseType: !574, size: 64, offset: 4288)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !571, file: !565, line: 115, baseType: !686, size: 64, offset: 4352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !571, file: !565, line: 117, baseType: !745, size: 64, offset: 4416)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !571, file: !565, line: 118, baseType: !745, size: 64, offset: 4480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !571, file: !565, line: 119, baseType: !859, size: 64, offset: 4544)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !571, file: !565, line: 120, baseType: !885, size: 64, offset: 4608)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!349, !562, !888, !659}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !571, file: !565, line: 121, baseType: !819, size: 64, offset: 4672)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !571, file: !565, line: 123, baseType: !891, size: 64, offset: 4736)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!349, !562, !391, !332}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !571, file: !565, line: 124, baseType: !895, size: 64, offset: 4800)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!349, !562, !780, !548, !332}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !571, file: !565, line: 125, baseType: !899, size: 64, offset: 4864)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!349, !482, !562}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !571, file: !565, line: 126, baseType: !588, size: 64, offset: 4928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !571, file: !565, line: 127, baseType: !588, size: 64, offset: 4992)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !571, file: !565, line: 129, baseType: !905, size: 64, offset: 5056)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!349, !562, !735}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !571, file: !565, line: 130, baseType: !909, size: 64, offset: 5120)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!349, !562, !912, !912}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !914, file: !60, line: 653, baseType: !391, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !914, file: !60, line: 653, baseType: !548, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !571, file: !565, line: 131, baseType: !909, size: 64, offset: 5184)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !571, file: !565, line: 132, baseType: !920, size: 64, offset: 5248)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!349, !562, !436, !436, !436}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !571, file: !565, line: 133, baseType: !855, size: 64, offset: 5312)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !571, file: !565, line: 135, baseType: !925, size: 64, offset: 5376)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!349, !562, !445, !659}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !571, file: !565, line: 136, baseType: !925, size: 64, offset: 5440)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !571, file: !565, line: 137, baseType: !930, size: 64, offset: 5504)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!349, !562, !659}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !571, file: !565, line: 138, baseType: !574, size: 64, offset: 5568)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !571, file: !565, line: 139, baseType: !935, size: 64, offset: 5632)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!349, !562, !938, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !571, file: !565, line: 141, baseType: !819, size: 64, offset: 5696)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !571, file: !565, line: 142, baseType: !941, size: 64, offset: 5760)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!349, !562, !562, !445, !562}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !571, file: !565, line: 143, baseType: !945, size: 64, offset: 5824)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!349, !562, !562, !562}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !571, file: !565, line: 144, baseType: !819, size: 64, offset: 5888)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !571, file: !565, line: 145, baseType: !941, size: 64, offset: 5952)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !571, file: !565, line: 147, baseType: !945, size: 64, offset: 6016)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !571, file: !565, line: 148, baseType: !819, size: 64, offset: 6080)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !571, file: !565, line: 149, baseType: !941, size: 64, offset: 6144)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !571, file: !565, line: 150, baseType: !945, size: 64, offset: 6208)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !571, file: !565, line: 151, baseType: !955, size: 64, offset: 6272)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!349, !562, !506}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !571, file: !565, line: 153, baseType: !682, size: 64, offset: 6336)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !571, file: !565, line: 154, baseType: !682, size: 64, offset: 6400)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !571, file: !565, line: 155, baseType: !682, size: 64, offset: 6464)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !571, file: !565, line: 156, baseType: !682, size: 64, offset: 6528)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !571, file: !565, line: 157, baseType: !855, size: 64, offset: 6592)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !571, file: !565, line: 159, baseType: !964, size: 64, offset: 6656)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!349, !562, !391, !579}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !571, file: !565, line: 160, baseType: !682, size: 64, offset: 6720)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !571, file: !565, line: 161, baseType: !682, size: 64, offset: 6784)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !571, file: !565, line: 162, baseType: !682, size: 64, offset: 6848)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !571, file: !565, line: 163, baseType: !682, size: 64, offset: 6912)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !571, file: !565, line: 165, baseType: !945, size: 64, offset: 6976)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !571, file: !565, line: 166, baseType: !945, size: 64, offset: 7040)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !571, file: !565, line: 167, baseType: !745, size: 64, offset: 7104)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !571, file: !565, line: 168, baseType: !975, size: 64, offset: 7168)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!349, !562, !548, !391}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !571, file: !565, line: 169, baseType: !979, size: 64, offset: 7232)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!349, !562, !659, !436}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !571, file: !565, line: 171, baseType: !706, size: 64, offset: 7296)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !571, file: !565, line: 172, baseType: !682, size: 64, offset: 7360)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !571, file: !565, line: 173, baseType: !985, size: 64, offset: 7424)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!349, !562, !436, !769}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !571, file: !565, line: 174, baseType: !845, size: 64, offset: 7488)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !571, file: !565, line: 175, baseType: !845, size: 64, offset: 7552)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !571, file: !565, line: 177, baseType: !588, size: 64, offset: 7616)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !571, file: !565, line: 178, baseType: !631, size: 64, offset: 7680)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !571, file: !565, line: 179, baseType: !588, size: 64, offset: 7744)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !571, file: !565, line: 180, baseType: !592, size: 64, offset: 7808)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !571, file: !565, line: 181, baseType: !995, size: 64, offset: 7872)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!349, !562, !328, !634, !635}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !571, file: !565, line: 183, baseType: !905, size: 64, offset: 7936)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !571, file: !565, line: 184, baseType: !666, size: 64, offset: 8000)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !571, file: !565, line: 185, baseType: !1001, size: 64, offset: 8064)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!349, !562, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !571, file: !565, line: 186, baseType: !1006, size: 64, offset: 8128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!349, !562, !391, !577, !453}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !571, file: !565, line: 187, baseType: !725, size: 64, offset: 8192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !571, file: !565, line: 189, baseType: !1011, size: 64, offset: 8256)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!349, !562, !391, !391, !436, !579}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !571, file: !565, line: 190, baseType: !819, size: 64, offset: 8320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !571, file: !565, line: 191, baseType: !941, size: 64, offset: 8384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !571, file: !565, line: 192, baseType: !945, size: 64, offset: 8448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !571, file: !565, line: 193, baseType: !1018, size: 64, offset: 8512)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!349, !562, !777, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !565, line: 660, size: 5312, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1023, file: !565, line: 661, baseType: !568, size: 4480)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1023, file: !565, line: 661, baseType: !786, size: 32, offset: 4480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1023, file: !565, line: 662, baseType: !391, size: 32, offset: 4512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1023, file: !565, line: 662, baseType: !391, size: 32, offset: 4544)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1023, file: !565, line: 662, baseType: !391, size: 32, offset: 4576)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1023, file: !565, line: 663, baseType: !391, size: 32, offset: 4608)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1023, file: !565, line: 664, baseType: !391, size: 32, offset: 4640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1023, file: !565, line: 665, baseType: !436, size: 64, offset: 4672)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1023, file: !565, line: 666, baseType: !436, size: 64, offset: 4736)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1023, file: !565, line: 667, baseType: !391, size: 32, offset: 4800)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1023, file: !565, line: 668, baseType: !827, size: 32, offset: 4832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1023, file: !565, line: 670, baseType: !436, size: 64, offset: 4864)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1023, file: !565, line: 670, baseType: !436, size: 64, offset: 4928)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1023, file: !565, line: 671, baseType: !436, size: 64, offset: 4992)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1023, file: !565, line: 672, baseType: !436, size: 64, offset: 5056)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1023, file: !565, line: 673, baseType: !436, size: 64, offset: 5120)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1023, file: !565, line: 674, baseType: !391, size: 32, offset: 5184)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1023, file: !565, line: 675, baseType: !436, size: 64, offset: 5248)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !571, file: !565, line: 195, baseType: !1044, size: 64, offset: 8576)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!349, !1021, !562, !562}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !571, file: !565, line: 196, baseType: !1044, size: 64, offset: 8640)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !571, file: !565, line: 197, baseType: !819, size: 64, offset: 8704)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !571, file: !565, line: 198, baseType: !941, size: 64, offset: 8768)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !571, file: !565, line: 199, baseType: !945, size: 64, offset: 8832)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !571, file: !565, line: 201, baseType: !1052, size: 64, offset: 8896)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!349, !562, !391, !391}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !571, file: !565, line: 202, baseType: !720, size: 64, offset: 8960)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !571, file: !565, line: 203, baseType: !592, size: 64, offset: 9024)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !571, file: !565, line: 204, baseType: !774, size: 64, offset: 9088)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !571, file: !565, line: 205, baseType: !905, size: 64, offset: 9152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !571, file: !565, line: 206, baseType: !1060, size: 64, offset: 9216)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!349, !328, !562, !391, !634, !635}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !571, file: !565, line: 208, baseType: !1064, size: 64, offset: 9280)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!349, !391, !730}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !571, file: !565, line: 209, baseType: !945, size: 64, offset: 9344)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !571, file: !565, line: 210, baseType: !737, size: 64, offset: 9408)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !564, file: !565, line: 438, baseType: !1070, size: 64, offset: 13952)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !543, line: 60, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1072, file: !114, line: 241, baseType: !328, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !114, line: 242, baseType: !408, size: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1072, file: !114, line: 243, baseType: !391, size: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1072, file: !114, line: 243, baseType: !391, size: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1072, file: !114, line: 244, baseType: !391, size: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1072, file: !114, line: 244, baseType: !391, size: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1072, file: !114, line: 245, baseType: !436, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1072, file: !114, line: 246, baseType: !506, size: 32, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1072, file: !114, line: 247, baseType: !391, size: 32, offset: 352)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1072, file: !114, line: 251, baseType: !391, size: 32, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1072, file: !114, line: 252, baseType: !876, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1072, file: !114, line: 253, baseType: !506, size: 32, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1072, file: !114, line: 254, baseType: !391, size: 32, offset: 544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1072, file: !114, line: 254, baseType: !391, size: 32, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1072, file: !114, line: 255, baseType: !391, size: 32, offset: 608)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !564, file: !565, line: 438, baseType: !1070, size: 64, offset: 14016)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !565, line: 439, baseType: !332, size: 64, offset: 14080)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !564, file: !565, line: 440, baseType: !1092, size: 32, offset: 14144)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !564, file: !565, line: 441, baseType: !506, size: 32, offset: 14176)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !564, file: !565, line: 442, baseType: !506, size: 32, offset: 14208)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !564, file: !565, line: 443, baseType: !1096, size: 448, offset: 14272)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 448, elements: !1098)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !368)
!1098 = !{!1099}
!1099 = !DISubrange(count: 7)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !564, file: !565, line: 444, baseType: !506, size: 32, offset: 14720)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !564, file: !565, line: 445, baseType: !506, size: 32, offset: 14752)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !564, file: !565, line: 446, baseType: !391, size: 32, offset: 14784)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !564, file: !565, line: 447, baseType: !429, size: 64, offset: 14848)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !564, file: !565, line: 448, baseType: !429, size: 64, offset: 14912)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !564, file: !565, line: 449, baseType: !642, size: 640, offset: 14976)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !564, file: !565, line: 450, baseType: !581, size: 32, offset: 15616)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !564, file: !565, line: 451, baseType: !1108, size: 2880, offset: 15680)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !565, line: 318, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !565, line: 319, size: 2880, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117, !1130, !1131, !1136, !1141, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1156, !1157, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1189, !1190, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1213, !1214, !1215, !1219, !1220}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1109, file: !565, line: 320, baseType: !391, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1109, file: !565, line: 321, baseType: !391, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1109, file: !565, line: 322, baseType: !391, size: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1109, file: !565, line: 323, baseType: !391, size: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1109, file: !565, line: 324, baseType: !391, size: 32, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1109, file: !565, line: 325, baseType: !391, size: 32, offset: 160)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1109, file: !565, line: 326, baseType: !1118, size: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !565, line: 293, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !565, line: 295, size: 448, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !565, line: 296, baseType: !1118, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1120, file: !565, line: 297, baseType: !453, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1120, file: !565, line: 297, baseType: !453, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1120, file: !565, line: 298, baseType: !436, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1120, file: !565, line: 298, baseType: !436, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1120, file: !565, line: 299, baseType: !391, size: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1120, file: !565, line: 300, baseType: !391, size: 32, offset: 352)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1120, file: !565, line: 301, baseType: !391, size: 32, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1109, file: !565, line: 326, baseType: !1118, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1109, file: !565, line: 328, baseType: !1132, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!349, !562, !1135, !436}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1109, file: !565, line: 329, baseType: !1137, size: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!349, !1135, !1140, !438, !438, !456, !436}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1109, file: !565, line: 330, baseType: !1142, size: 64, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!349, !1135}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1109, file: !565, line: 331, baseType: !1142, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1109, file: !565, line: 334, baseType: !328, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !565, line: 335, baseType: !408, size: 32, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1109, file: !565, line: 335, baseType: !408, size: 32, offset: 672)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1109, file: !565, line: 336, baseType: !408, size: 32, offset: 704)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1109, file: !565, line: 336, baseType: !408, size: 32, offset: 736)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1109, file: !565, line: 337, baseType: !1152, size: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !329, line: 339, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !329, line: 339, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1109, file: !565, line: 338, baseType: !1152, size: 64, offset: 832)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1109, file: !565, line: 339, baseType: !1158, size: 64, offset: 896)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !329, line: 341, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !329, line: 351, size: 192, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1160, file: !329, line: 354, baseType: !72, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1160, file: !329, line: 355, baseType: !72, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1160, file: !329, line: 356, baseType: !72, size: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1160, file: !329, line: 361, baseType: !72, size: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1160, file: !329, line: 362, baseType: !502, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1109, file: !565, line: 340, baseType: !391, size: 32, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1109, file: !565, line: 340, baseType: !391, size: 32, offset: 992)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1109, file: !565, line: 341, baseType: !453, size: 64, offset: 1024)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1109, file: !565, line: 342, baseType: !436, size: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1109, file: !565, line: 343, baseType: !456, size: 64, offset: 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1109, file: !565, line: 344, baseType: !438, size: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1109, file: !565, line: 345, baseType: !391, size: 32, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1109, file: !565, line: 346, baseType: !1140, size: 64, offset: 1344)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1109, file: !565, line: 347, baseType: !506, size: 32, offset: 1408)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1109, file: !565, line: 348, baseType: !391, size: 32, offset: 1440)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1109, file: !565, line: 351, baseType: !506, size: 32, offset: 1472)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1109, file: !565, line: 352, baseType: !506, size: 32, offset: 1504)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1109, file: !565, line: 353, baseType: !408, size: 32, offset: 1536)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1109, file: !565, line: 354, baseType: !408, size: 32, offset: 1568)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1109, file: !565, line: 355, baseType: !1140, size: 64, offset: 1600)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1109, file: !565, line: 356, baseType: !1140, size: 64, offset: 1664)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1109, file: !565, line: 357, baseType: !1184, size: 64, offset: 1728)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !565, line: 310, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 308, size: 32, elements: !1187)
!1187 = !{!1188}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1186, file: !565, line: 309, baseType: !391, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1109, file: !565, line: 357, baseType: !1184, size: 64, offset: 1792)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1109, file: !565, line: 358, baseType: !1191, size: 64, offset: 1856)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !565, line: 316, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 312, size: 128, elements: !1194)
!1194 = !{!1195, !1196, !1197}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1193, file: !565, line: 313, baseType: !332, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1193, file: !565, line: 314, baseType: !391, size: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1193, file: !565, line: 315, baseType: !370, size: 8, offset: 96)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1109, file: !565, line: 359, baseType: !1191, size: 64, offset: 1920)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1109, file: !565, line: 360, baseType: !1191, size: 64, offset: 1984)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1109, file: !565, line: 361, baseType: !391, size: 32, offset: 2048)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1109, file: !565, line: 362, baseType: !408, size: 32, offset: 2080)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1109, file: !565, line: 363, baseType: !391, size: 32, offset: 2112)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1109, file: !565, line: 364, baseType: !1140, size: 64, offset: 2176)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1109, file: !565, line: 365, baseType: !1158, size: 64, offset: 2240)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1109, file: !565, line: 366, baseType: !408, size: 32, offset: 2304)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1109, file: !565, line: 367, baseType: !408, size: 32, offset: 2336)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1109, file: !565, line: 368, baseType: !1152, size: 64, offset: 2368)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1109, file: !565, line: 369, baseType: !1152, size: 64, offset: 2432)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1109, file: !565, line: 370, baseType: !1210, size: 64, offset: 2496)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1109, file: !565, line: 371, baseType: !1210, size: 64, offset: 2560)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1109, file: !565, line: 372, baseType: !1210, size: 64, offset: 2624)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1109, file: !565, line: 373, baseType: !1216, size: 64, offset: 2688)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !329, line: 331, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !329, line: 331, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1109, file: !565, line: 374, baseType: !502, size: 64, offset: 2752)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1109, file: !565, line: 375, baseType: !1221, size: 64, offset: 2816)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !564, file: !565, line: 451, baseType: !1108, size: 2880, offset: 18560)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !564, file: !565, line: 452, baseType: !1224, size: 64, offset: 21440)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !565, line: 681, size: 4864, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234, !1238}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1226, file: !565, line: 682, baseType: !568, size: 4480)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1226, file: !565, line: 682, baseType: !786, size: 32, offset: 4480)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1226, file: !565, line: 683, baseType: !506, size: 32, offset: 4512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1226, file: !565, line: 684, baseType: !391, size: 32, offset: 4544)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1226, file: !565, line: 685, baseType: !938, size: 64, offset: 4608)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1226, file: !565, line: 686, baseType: !453, size: 64, offset: 4672)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1226, file: !565, line: 687, baseType: !1235, size: 64, offset: 4736)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!349, !1224, !548, !332}
