; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/seq/sbaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/seq/sbaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!308 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!349 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!367 = !{!368, !448, !527, !469, !1471, !598, !445, !1473, !412, !1475, !407, !411, !1520, !414, !1521, !517, !74, !374, !507, !1281, !1522, !381, !424, !464, !1525, !537, !499, !376, !7}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqSBAIJ", file: !370, line: 27, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sbaij/seq/sbaij.h", directory: "/home/users/ndemeye/xSDK")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 12, size: 3456, elements: !372)
!372 = !{!373, !375, !377, !378, !379, !380, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !400, !401, !402, !403, !404, !405, !406, !413, !415, !420, !421, !422, !423, !1391, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1468, !1470}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !371, file: !370, line: 13, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 480)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 544)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !371, file: !370, line: 13, baseType: !392, size: 192, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !393, line: 407, baseType: !394)
!393 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 402, size: 192, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !394, file: !393, line: 403, baseType: !374, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !394, file: !393, line: 404, baseType: !376, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !394, file: !393, line: 405, baseType: !381, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !394, file: !393, line: 406, baseType: !381, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !371, file: !370, line: 13, baseType: !381, size: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !371, file: !370, line: 13, baseType: !376, size: 32, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 1120)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !371, file: !370, line: 13, baseType: !407, size: 64, offset: 1152)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !409, line: 799, baseType: !410)
!409 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !412)
!412 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !371, file: !370, line: 13, baseType: !414, size: 64, offset: 1216)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !371, file: !370, line: 13, baseType: !416, size: 64, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !417, line: 11, baseType: !418)
!417 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !417, line: 11, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !371, file: !370, line: 13, baseType: !416, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !371, file: !370, line: 13, baseType: !416, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !371, file: !370, line: 13, baseType: !374, size: 32, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !371, file: !370, line: 13, baseType: !424, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !393, line: 436, size: 23424, elements: !427)
!427 = !{!428, !631, !1134, !1154, !1155, !1156, !1158, !1159, !1160, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1287, !1288, !1304, !1305, !1306, !1307, !1308, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1343, !1363, !1364, !1366, !1367, !1368, !1369, !1370, !1371, !1389, !1390}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !426, file: !393, line: 437, baseType: !429, size: 4480)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !430, line: 122, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !430, line: 73, size: 4480, elements: !432)
!432 = !{!433, !435, !490, !491, !492, !494, !495, !496, !497, !505, !506, !508, !512, !516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !528, !530, !531, !532, !534, !535, !536, !538, !539, !540, !541, !542, !544, !546, !547, !548, !549, !550, !551, !553, !554, !555, !565, !567, !568, !572, !573, !621, !626, !628, !629, !630}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !431, file: !430, line: 74, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !431, file: !430, line: 75, baseType: !436, size: 448, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 448, elements: !488)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !430, line: 53, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 45, size: 448, elements: !439)
!439 = !{!440, !452, !460, !465, !472, !476, !483}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !438, file: !430, line: 46, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !445, !447}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !449, line: 330, baseType: !450)
!449 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !449, line: 330, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !438, file: !430, line: 47, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!444, !445, !456}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !457, line: 16, baseType: !458)
!457 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !457, line: 16, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !438, file: !430, line: 48, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!444, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !438, file: !430, line: 49, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!444, !445, !469, !445}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !438, file: !430, line: 50, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!444, !445, !469, !464}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !438, file: !430, line: 51, baseType: !477, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!444, !445, !469, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{null}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !438, file: !430, line: 52, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!444, !445, !469, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!488 = !{!489}
!489 = !DISubrange(count: 1)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !431, file: !430, line: 76, baseType: !448, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !430, line: 77, baseType: !376, size: 32, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !431, file: !430, line: 78, baseType: !493, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !412)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !431, file: !430, line: 78, baseType: !493, size: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !431, file: !430, line: 78, baseType: !493, size: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !431, file: !430, line: 78, baseType: !493, size: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !431, file: !430, line: 79, baseType: !498, size: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !501, line: 27, baseType: !502)
!501 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !503, line: 43, baseType: !504)
!503 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!504 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !431, file: !430, line: 80, baseType: !376, size: 32, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !431, file: !430, line: 81, baseType: !507, size: 32, offset: 992)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !431, file: !430, line: 82, baseType: !509, size: 64, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !431, file: !430, line: 83, baseType: !513, size: 64, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !431, file: !430, line: 84, baseType: !517, size: 64, offset: 1152)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !431, file: !430, line: 85, baseType: !517, size: 64, offset: 1216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !431, file: !430, line: 86, baseType: !517, size: 64, offset: 1280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !431, file: !430, line: 87, baseType: !517, size: 64, offset: 1344)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !431, file: !430, line: 88, baseType: !445, size: 64, offset: 1408)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !431, file: !430, line: 89, baseType: !498, size: 64, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !430, line: 90, baseType: !517, size: 64, offset: 1536)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !431, file: !430, line: 91, baseType: !517, size: 64, offset: 1600)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !431, file: !430, line: 92, baseType: !376, size: 32, offset: 1664)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !431, file: !430, line: 93, baseType: !527, size: 64, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !431, file: !430, line: 94, baseType: !529, size: 64, offset: 1792)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !499)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !431, file: !430, line: 95, baseType: !376, size: 32, offset: 1856)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !431, file: !430, line: 95, baseType: !376, size: 32, offset: 1888)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !431, file: !430, line: 96, baseType: !533, size: 64, offset: 1920)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !431, file: !430, line: 96, baseType: !533, size: 64, offset: 1984)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !431, file: !430, line: 97, baseType: !381, size: 64, offset: 2048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !431, file: !430, line: 97, baseType: !537, size: 64, offset: 2112)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !431, file: !430, line: 98, baseType: !376, size: 32, offset: 2176)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !431, file: !430, line: 98, baseType: !376, size: 32, offset: 2208)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !431, file: !430, line: 99, baseType: !533, size: 64, offset: 2240)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !431, file: !430, line: 99, baseType: !533, size: 64, offset: 2304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !431, file: !430, line: 100, baseType: !543, size: 64, offset: 2368)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !431, file: !430, line: 100, baseType: !545, size: 64, offset: 2432)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !431, file: !430, line: 101, baseType: !376, size: 32, offset: 2496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !431, file: !430, line: 101, baseType: !376, size: 32, offset: 2528)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !431, file: !430, line: 102, baseType: !533, size: 64, offset: 2560)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !431, file: !430, line: 102, baseType: !533, size: 64, offset: 2624)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !431, file: !430, line: 103, baseType: !414, size: 64, offset: 2688)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !431, file: !430, line: 103, baseType: !552, size: 64, offset: 2752)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !431, file: !430, line: 104, baseType: !487, size: 64, offset: 2816)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !431, file: !430, line: 105, baseType: !376, size: 32, offset: 2880)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !431, file: !430, line: 106, baseType: !556, size: 128, offset: 2944)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 128, elements: !563)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !430, line: 64, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 61, size: 128, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !559, file: !430, line: 62, baseType: !480, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !559, file: !430, line: 63, baseType: !527, size: 64, offset: 64)
!563 = !{!564}
!564 = !DISubrange(count: 2)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !431, file: !430, line: 107, baseType: !566, size: 64, offset: 3072)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 64, elements: !563)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !431, file: !430, line: 108, baseType: !527, size: 64, offset: 3136)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !431, file: !430, line: 109, baseType: !569, size: 64, offset: 3200)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!444, !527}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !431, file: !430, line: 111, baseType: !376, size: 32, offset: 3264)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !431, file: !430, line: 112, baseType: !574, size: 320, offset: 3328)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !619)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!444, !578, !445, !527}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !581)
!581 = !{!582, !583, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !580, file: !12, line: 100, baseType: !376, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !12, line: 101, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !595, !596, !597, !601, !602, !604, !605, !606}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !586, file: !12, line: 84, baseType: !517, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !586, file: !12, line: 85, baseType: !517, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !12, line: 86, baseType: !527, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !586, file: !12, line: 87, baseType: !509, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !586, file: !12, line: 88, baseType: !593, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !586, file: !12, line: 89, baseType: !471, size: 8, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !586, file: !12, line: 90, baseType: !517, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !586, file: !12, line: 91, baseType: !598, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !599, line: 46, baseType: !600)
!599 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!600 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !586, file: !12, line: 92, baseType: !374, size: 32, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !12, line: 93, baseType: !603, size: 32, offset: 544)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !12, line: 94, baseType: !584, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !586, file: !12, line: 95, baseType: !517, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !586, file: !12, line: 96, baseType: !527, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !580, file: !12, line: 102, baseType: !517, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !580, file: !12, line: 102, baseType: !517, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !580, file: !12, line: 103, baseType: !517, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !580, file: !12, line: 104, baseType: !448, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !580, file: !12, line: 105, baseType: !374, size: 32, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !580, file: !12, line: 105, baseType: !374, size: 32, offset: 416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !580, file: !12, line: 105, baseType: !374, size: 32, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !580, file: !12, line: 106, baseType: !445, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !580, file: !12, line: 107, baseType: !616, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!619 = !{!620}
!620 = !DISubrange(count: 5)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !431, file: !430, line: 113, baseType: !622, size: 320, offset: 3648)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 320, elements: !619)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!444, !445, !527}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !431, file: !430, line: 114, baseType: !627, size: 320, offset: 3968)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !619)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !431, file: !430, line: 115, baseType: !374, size: 32, offset: 4288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !431, file: !430, line: 120, baseType: !616, size: 64, offset: 4352)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !431, file: !430, line: 121, baseType: !374, size: 32, offset: 4416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !426, file: !393, line: 437, baseType: !632, size: 9472, offset: 4480)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 9472, elements: !488)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !393, line: 32, size: 9472, elements: !634)
!634 = !{!635, !644, !648, !649, !656, !660, !661, !662, !663, !664, !665, !666, !686, !690, !695, !701, !720, !725, !729, !730, !735, !740, !741, !746, !750, !754, !758, !762, !766, !767, !768, !769, !770, !774, !775, !780, !781, !782, !783, !784, !789, !796, !801, !805, !809, !813, !817, !818, !822, !823, !830, !835, !836, !837, !838, !900, !908, !909, !913, !914, !918, !919, !923, !928, !929, !933, !937, !944, !945, !946, !947, !948, !949, !954, !955, !959, !963, !967, !968, !969, !973, !983, !984, !988, !989, !993, !994, !998, !999, !1004, !1005, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1043, !1047, !1048, !1049, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1070, !1074, !1075, !1079, !1080, !1081, !1082, !1108, !1112, !1113, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1124, !1128, !1132, !1133}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !633, file: !393, line: 34, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!444, !424, !376, !639, !376, !639, !641, !643}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !633, file: !393, line: 35, baseType: !645, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!444, !424, !376, !381, !537, !552}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !633, file: !393, line: 36, baseType: !645, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !633, file: !393, line: 37, baseType: !650, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!444, !424, !653, !653}
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !633, file: !393, line: 38, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!444, !424, !653, !653, !653}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !633, file: !393, line: 40, baseType: !650, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !633, file: !393, line: 41, baseType: !657, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !633, file: !393, line: 42, baseType: !650, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !633, file: !393, line: 43, baseType: !657, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !633, file: !393, line: 44, baseType: !650, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !633, file: !393, line: 46, baseType: !657, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !633, file: !393, line: 47, baseType: !667, size: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!444, !424, !416, !416, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !673, file: !38, line: 1227, baseType: !411, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !673, file: !38, line: 1228, baseType: !411, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !673, file: !38, line: 1229, baseType: !411, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !673, file: !38, line: 1230, baseType: !411, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !673, file: !38, line: 1231, baseType: !411, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !673, file: !38, line: 1232, baseType: !411, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !673, file: !38, line: 1233, baseType: !411, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !673, file: !38, line: 1234, baseType: !411, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !673, file: !38, line: 1236, baseType: !411, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !673, file: !38, line: 1237, baseType: !411, size: 64, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !673, file: !38, line: 1238, baseType: !411, size: 64, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !633, file: !393, line: 48, baseType: !687, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!444, !424, !416, !670}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !633, file: !393, line: 49, baseType: !691, size: 64, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!444, !424, !653, !411, !694, !411, !376, !376, !653}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !633, file: !393, line: 50, baseType: !696, size: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!444, !424, !699, !700}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !633, file: !393, line: 52, baseType: !702, size: 64, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!444, !424, !705, !706}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !708, file: !38, line: 593, baseType: !493, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !708, file: !38, line: 594, baseType: !493, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !708, file: !38, line: 594, baseType: !493, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !708, file: !38, line: 594, baseType: !493, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !708, file: !38, line: 595, baseType: !493, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !708, file: !38, line: 596, baseType: !493, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !708, file: !38, line: 597, baseType: !493, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !708, file: !38, line: 598, baseType: !493, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !708, file: !38, line: 598, baseType: !493, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !708, file: !38, line: 599, baseType: !493, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !633, file: !393, line: 53, baseType: !721, size: 64, offset: 1024)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!444, !424, !424, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !633, file: !393, line: 54, baseType: !726, size: 64, offset: 1088)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!444, !424, !653}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !633, file: !393, line: 55, baseType: !650, size: 64, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !633, file: !393, line: 56, baseType: !731, size: 64, offset: 1216)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!444, !424, !734, !543}
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !633, file: !393, line: 58, baseType: !736, size: 64, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!444, !424, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !633, file: !393, line: 59, baseType: !736, size: 64, offset: 1344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !633, file: !393, line: 60, baseType: !742, size: 64, offset: 1408)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!444, !424, !745, !374}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !633, file: !393, line: 61, baseType: !747, size: 64, offset: 1472)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!444, !424}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !633, file: !393, line: 63, baseType: !751, size: 64, offset: 1536)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!444, !424, !376, !639, !410, !653, !653}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !633, file: !393, line: 64, baseType: !755, size: 64, offset: 1600)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!444, !424, !424, !416, !416, !670}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !633, file: !393, line: 65, baseType: !759, size: 64, offset: 1664)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!444, !424, !424, !670}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !633, file: !393, line: 66, baseType: !763, size: 64, offset: 1728)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!444, !424, !424, !416, !670}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !633, file: !393, line: 67, baseType: !759, size: 64, offset: 1792)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !633, file: !393, line: 69, baseType: !747, size: 64, offset: 1856)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !633, file: !393, line: 70, baseType: !755, size: 64, offset: 1920)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !633, file: !393, line: 71, baseType: !763, size: 64, offset: 1984)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !633, file: !393, line: 72, baseType: !771, size: 64, offset: 2048)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!444, !424, !700}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !633, file: !393, line: 73, baseType: !747, size: 64, offset: 2112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !633, file: !393, line: 75, baseType: !776, size: 64, offset: 2176)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!444, !424, !779, !700}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !633, file: !393, line: 76, baseType: !650, size: 64, offset: 2240)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !633, file: !393, line: 77, baseType: !650, size: 64, offset: 2304)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !633, file: !393, line: 78, baseType: !667, size: 64, offset: 2368)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !633, file: !393, line: 79, baseType: !687, size: 64, offset: 2432)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !633, file: !393, line: 81, baseType: !785, size: 64, offset: 2496)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!444, !424, !410, !424, !788}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !633, file: !393, line: 82, baseType: !790, size: 64, offset: 2560)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!444, !424, !376, !793, !793, !699, !795}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !633, file: !393, line: 83, baseType: !797, size: 64, offset: 2624)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!444, !424, !376, !800, !376}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !633, file: !393, line: 84, baseType: !802, size: 64, offset: 2688)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!444, !424, !376, !639, !376, !639, !414}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !633, file: !393, line: 85, baseType: !806, size: 64, offset: 2752)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!444, !424, !424, !788}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !633, file: !393, line: 87, baseType: !810, size: 64, offset: 2816)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!444, !424, !653, !381}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !633, file: !393, line: 88, baseType: !814, size: 64, offset: 2880)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!444, !424, !410}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !633, file: !393, line: 89, baseType: !814, size: 64, offset: 2944)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !633, file: !393, line: 90, baseType: !819, size: 64, offset: 3008)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!444, !424, !653, !643}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !633, file: !393, line: 91, baseType: !751, size: 64, offset: 3072)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !633, file: !393, line: 93, baseType: !824, size: 64, offset: 3136)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!444, !424, !827}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !633, file: !393, line: 94, baseType: !831, size: 64, offset: 3200)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!444, !424, !376, !374, !374, !381, !834, !834, !724}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !633, file: !393, line: 95, baseType: !831, size: 64, offset: 3264)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !633, file: !393, line: 96, baseType: !831, size: 64, offset: 3328)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !633, file: !393, line: 97, baseType: !831, size: 64, offset: 3392)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !633, file: !393, line: 99, baseType: !839, size: 64, offset: 3456)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!444, !424, !842, !845}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !417, line: 51, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !417, line: 51, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !393, line: 609, size: 6208, elements: !848)
!848 = !{!849, !850, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !869, !876, !877, !878, !879, !880, !881, !882, !883, !887, !888, !889, !890, !891, !893, !894, !895, !896, !897, !898, !899}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !847, file: !393, line: 610, baseType: !429, size: 4480)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !847, file: !393, line: 610, baseType: !851, size: 32, offset: 4480)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !488)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !847, file: !393, line: 611, baseType: !376, size: 32, offset: 4512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !847, file: !393, line: 611, baseType: !376, size: 32, offset: 4544)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !847, file: !393, line: 611, baseType: !376, size: 32, offset: 4576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !847, file: !393, line: 612, baseType: !376, size: 32, offset: 4608)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !847, file: !393, line: 613, baseType: !376, size: 32, offset: 4640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !847, file: !393, line: 614, baseType: !381, size: 64, offset: 4672)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !847, file: !393, line: 615, baseType: !537, size: 64, offset: 4736)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !847, file: !393, line: 616, baseType: !800, size: 64, offset: 4800)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !847, file: !393, line: 617, baseType: !381, size: 64, offset: 4864)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !847, file: !393, line: 618, baseType: !862, size: 64, offset: 4928)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !393, line: 602, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 598, size: 128, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !864, file: !393, line: 599, baseType: !376, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !864, file: !393, line: 600, baseType: !376, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !864, file: !393, line: 601, baseType: !414, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !847, file: !393, line: 619, baseType: !870, size: 64, offset: 4992)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !393, line: 607, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 604, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !872, file: !393, line: 605, baseType: !376, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !872, file: !393, line: 606, baseType: !414, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !847, file: !393, line: 620, baseType: !414, size: 64, offset: 5056)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !847, file: !393, line: 621, baseType: !411, size: 64, offset: 5120)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !847, file: !393, line: 622, baseType: !411, size: 64, offset: 5184)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !847, file: !393, line: 623, baseType: !653, size: 64, offset: 5248)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !847, file: !393, line: 623, baseType: !653, size: 64, offset: 5312)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !847, file: !393, line: 623, baseType: !653, size: 64, offset: 5376)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !847, file: !393, line: 624, baseType: !374, size: 32, offset: 5440)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !847, file: !393, line: 625, baseType: !884, size: 64, offset: 5504)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!444}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !847, file: !393, line: 626, baseType: !527, size: 64, offset: 5568)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !847, file: !393, line: 627, baseType: !653, size: 64, offset: 5632)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !847, file: !393, line: 628, baseType: !376, size: 32, offset: 5696)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !847, file: !393, line: 629, baseType: !469, size: 64, offset: 5760)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !847, file: !393, line: 630, baseType: !892, size: 32, offset: 5824)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !847, file: !393, line: 631, baseType: !376, size: 32, offset: 5856)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !847, file: !393, line: 631, baseType: !376, size: 32, offset: 5888)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !847, file: !393, line: 632, baseType: !374, size: 32, offset: 5920)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !847, file: !393, line: 633, baseType: !374, size: 32, offset: 5952)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !847, file: !393, line: 634, baseType: !480, size: 64, offset: 6016)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !847, file: !393, line: 634, baseType: !527, size: 64, offset: 6080)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !847, file: !393, line: 635, baseType: !498, size: 64, offset: 6144)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !633, file: !393, line: 100, baseType: !901, size: 64, offset: 3520)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!444, !424, !376, !376, !904, !907}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !906)
!906 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !633, file: !393, line: 101, baseType: !747, size: 64, offset: 3584)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !633, file: !393, line: 102, baseType: !910, size: 64, offset: 3648)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!444, !424, !416, !416, !700}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !633, file: !393, line: 103, baseType: !636, size: 64, offset: 3712)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !633, file: !393, line: 105, baseType: !915, size: 64, offset: 3776)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!444, !424, !416, !416, !699, !700}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !633, file: !393, line: 106, baseType: !747, size: 64, offset: 3840)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !633, file: !393, line: 107, baseType: !920, size: 64, offset: 3904)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!444, !424, !456}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !633, file: !393, line: 108, baseType: !924, size: 64, offset: 3968)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!444, !424, !927, !699, !700}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !469)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !633, file: !393, line: 109, baseType: !884, size: 64, offset: 4032)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !633, file: !393, line: 111, baseType: !930, size: 64, offset: 4096)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!444, !424, !424, !424, !411, !424}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !633, file: !393, line: 112, baseType: !934, size: 64, offset: 4160)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!444, !424, !424, !424, !424}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !633, file: !393, line: 113, baseType: !938, size: 64, offset: 4224)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!444, !424, !941, !941}
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !417, line: 30, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !417, line: 30, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !633, file: !393, line: 114, baseType: !636, size: 64, offset: 4288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !633, file: !393, line: 115, baseType: !751, size: 64, offset: 4352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !633, file: !393, line: 117, baseType: !810, size: 64, offset: 4416)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !633, file: !393, line: 118, baseType: !810, size: 64, offset: 4480)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !633, file: !393, line: 119, baseType: !924, size: 64, offset: 4544)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !633, file: !393, line: 120, baseType: !950, size: 64, offset: 4608)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!444, !424, !953, !724}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !633, file: !393, line: 121, baseType: !884, size: 64, offset: 4672)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !633, file: !393, line: 123, baseType: !956, size: 64, offset: 4736)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!444, !424, !376, !527}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !633, file: !393, line: 124, baseType: !960, size: 64, offset: 4800)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!444, !424, !845, !653, !527}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !633, file: !393, line: 125, baseType: !964, size: 64, offset: 4864)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!444, !578, !424}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !633, file: !393, line: 126, baseType: !650, size: 64, offset: 4928)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !633, file: !393, line: 127, baseType: !650, size: 64, offset: 4992)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !633, file: !393, line: 129, baseType: !970, size: 64, offset: 5056)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!444, !424, !800}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !633, file: !393, line: 130, baseType: !974, size: 64, offset: 5120)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!444, !424, !977, !977}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !979, file: !62, line: 653, baseType: !376, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !979, file: !62, line: 653, baseType: !653, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !633, file: !393, line: 131, baseType: !974, size: 64, offset: 5184)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !633, file: !393, line: 132, baseType: !985, size: 64, offset: 5248)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!444, !424, !381, !381, !381}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !633, file: !393, line: 133, baseType: !920, size: 64, offset: 5312)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !633, file: !393, line: 135, baseType: !990, size: 64, offset: 5376)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!444, !424, !411, !724}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !633, file: !393, line: 136, baseType: !990, size: 64, offset: 5440)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !633, file: !393, line: 137, baseType: !995, size: 64, offset: 5504)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!444, !424, !724}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !633, file: !393, line: 138, baseType: !636, size: 64, offset: 5568)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !633, file: !393, line: 139, baseType: !1000, size: 64, offset: 5632)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!444, !424, !1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !633, file: !393, line: 141, baseType: !884, size: 64, offset: 5696)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !633, file: !393, line: 142, baseType: !1006, size: 64, offset: 5760)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!444, !424, !424, !411, !424}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !633, file: !393, line: 143, baseType: !1010, size: 64, offset: 5824)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!444, !424, !424, !424}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !633, file: !393, line: 144, baseType: !884, size: 64, offset: 5888)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !633, file: !393, line: 145, baseType: !1006, size: 64, offset: 5952)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !633, file: !393, line: 147, baseType: !1010, size: 64, offset: 6016)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !633, file: !393, line: 148, baseType: !884, size: 64, offset: 6080)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !633, file: !393, line: 149, baseType: !1006, size: 64, offset: 6144)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !633, file: !393, line: 150, baseType: !1010, size: 64, offset: 6208)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !633, file: !393, line: 151, baseType: !1020, size: 64, offset: 6272)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!444, !424, !374}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !633, file: !393, line: 153, baseType: !747, size: 64, offset: 6336)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !633, file: !393, line: 154, baseType: !747, size: 64, offset: 6400)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !633, file: !393, line: 155, baseType: !747, size: 64, offset: 6464)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !633, file: !393, line: 156, baseType: !747, size: 64, offset: 6528)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !633, file: !393, line: 157, baseType: !920, size: 64, offset: 6592)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !633, file: !393, line: 159, baseType: !1029, size: 64, offset: 6656)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!444, !424, !376, !641}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !633, file: !393, line: 160, baseType: !747, size: 64, offset: 6720)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !633, file: !393, line: 161, baseType: !747, size: 64, offset: 6784)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !633, file: !393, line: 162, baseType: !747, size: 64, offset: 6848)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !633, file: !393, line: 163, baseType: !747, size: 64, offset: 6912)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !633, file: !393, line: 165, baseType: !1010, size: 64, offset: 6976)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !633, file: !393, line: 166, baseType: !1010, size: 64, offset: 7040)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !633, file: !393, line: 167, baseType: !810, size: 64, offset: 7104)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !633, file: !393, line: 168, baseType: !1040, size: 64, offset: 7168)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!444, !424, !653, !376}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !633, file: !393, line: 169, baseType: !1044, size: 64, offset: 7232)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!444, !424, !724, !381}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !633, file: !393, line: 171, baseType: !771, size: 64, offset: 7296)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !633, file: !393, line: 172, baseType: !747, size: 64, offset: 7360)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !633, file: !393, line: 173, baseType: !1050, size: 64, offset: 7424)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!444, !424, !381, !834}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !633, file: !393, line: 174, baseType: !910, size: 64, offset: 7488)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !633, file: !393, line: 175, baseType: !910, size: 64, offset: 7552)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !633, file: !393, line: 177, baseType: !650, size: 64, offset: 7616)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !633, file: !393, line: 178, baseType: !696, size: 64, offset: 7680)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !633, file: !393, line: 179, baseType: !650, size: 64, offset: 7744)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !633, file: !393, line: 180, baseType: !657, size: 64, offset: 7808)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !633, file: !393, line: 181, baseType: !1060, size: 64, offset: 7872)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!444, !424, !448, !699, !700}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !633, file: !393, line: 183, baseType: !970, size: 64, offset: 7936)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !633, file: !393, line: 184, baseType: !731, size: 64, offset: 8000)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !633, file: !393, line: 185, baseType: !1066, size: 64, offset: 8064)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!444, !424, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !633, file: !393, line: 186, baseType: !1071, size: 64, offset: 8128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!444, !424, !376, !639, !414}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !633, file: !393, line: 187, baseType: !790, size: 64, offset: 8192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !633, file: !393, line: 189, baseType: !1076, size: 64, offset: 8256)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!444, !424, !376, !376, !381, !641}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !633, file: !393, line: 190, baseType: !884, size: 64, offset: 8320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !633, file: !393, line: 191, baseType: !1006, size: 64, offset: 8384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !633, file: !393, line: 192, baseType: !1010, size: 64, offset: 8448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !633, file: !393, line: 193, baseType: !1083, size: 64, offset: 8512)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!444, !424, !842, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !393, line: 660, size: 5312, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1088, file: !393, line: 661, baseType: !429, size: 4480)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1088, file: !393, line: 661, baseType: !851, size: 32, offset: 4480)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1088, file: !393, line: 662, baseType: !376, size: 32, offset: 4512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1088, file: !393, line: 662, baseType: !376, size: 32, offset: 4544)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1088, file: !393, line: 662, baseType: !376, size: 32, offset: 4576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1088, file: !393, line: 663, baseType: !376, size: 32, offset: 4608)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1088, file: !393, line: 664, baseType: !376, size: 32, offset: 4640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1088, file: !393, line: 665, baseType: !381, size: 64, offset: 4672)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1088, file: !393, line: 666, baseType: !381, size: 64, offset: 4736)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1088, file: !393, line: 667, baseType: !376, size: 32, offset: 4800)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1088, file: !393, line: 668, baseType: !892, size: 32, offset: 4832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1088, file: !393, line: 670, baseType: !381, size: 64, offset: 4864)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1088, file: !393, line: 670, baseType: !381, size: 64, offset: 4928)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1088, file: !393, line: 671, baseType: !381, size: 64, offset: 4992)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1088, file: !393, line: 672, baseType: !381, size: 64, offset: 5056)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1088, file: !393, line: 673, baseType: !381, size: 64, offset: 5120)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1088, file: !393, line: 674, baseType: !376, size: 32, offset: 5184)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1088, file: !393, line: 675, baseType: !381, size: 64, offset: 5248)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !633, file: !393, line: 195, baseType: !1109, size: 64, offset: 8576)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!444, !1086, !424, !424}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !633, file: !393, line: 196, baseType: !1109, size: 64, offset: 8640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !633, file: !393, line: 197, baseType: !884, size: 64, offset: 8704)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !633, file: !393, line: 198, baseType: !1006, size: 64, offset: 8768)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !633, file: !393, line: 199, baseType: !1010, size: 64, offset: 8832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !633, file: !393, line: 201, baseType: !1117, size: 64, offset: 8896)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!444, !424, !376, !376}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !633, file: !393, line: 202, baseType: !785, size: 64, offset: 8960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !633, file: !393, line: 203, baseType: !657, size: 64, offset: 9024)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !633, file: !393, line: 204, baseType: !839, size: 64, offset: 9088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !633, file: !393, line: 205, baseType: !970, size: 64, offset: 9152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !633, file: !393, line: 206, baseType: !1125, size: 64, offset: 9216)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!444, !448, !424, !376, !699, !700}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !633, file: !393, line: 208, baseType: !1129, size: 64, offset: 9280)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!444, !376, !795}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !633, file: !393, line: 209, baseType: !1010, size: 64, offset: 9344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !633, file: !393, line: 210, baseType: !802, size: 64, offset: 9408)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !426, file: !393, line: 438, baseType: !1135, size: 64, offset: 13952)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !417, line: 60, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1137, file: !116, line: 241, baseType: !448, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1137, file: !116, line: 242, baseType: !507, size: 32, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1137, file: !116, line: 243, baseType: !376, size: 32, offset: 96)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1137, file: !116, line: 243, baseType: !376, size: 32, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1137, file: !116, line: 244, baseType: !376, size: 32, offset: 160)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1137, file: !116, line: 244, baseType: !376, size: 32, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1137, file: !116, line: 245, baseType: !381, size: 64, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1137, file: !116, line: 246, baseType: !374, size: 32, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1137, file: !116, line: 247, baseType: !376, size: 32, offset: 352)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1137, file: !116, line: 251, baseType: !376, size: 32, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1137, file: !116, line: 252, baseType: !941, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1137, file: !116, line: 253, baseType: !374, size: 32, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1137, file: !116, line: 254, baseType: !376, size: 32, offset: 544)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1137, file: !116, line: 254, baseType: !376, size: 32, offset: 576)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1137, file: !116, line: 255, baseType: !376, size: 32, offset: 608)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !426, file: !393, line: 438, baseType: !1135, size: 64, offset: 14016)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !393, line: 439, baseType: !527, size: 64, offset: 14080)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !426, file: !393, line: 440, baseType: !1157, size: 32, offset: 14144)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !426, file: !393, line: 441, baseType: !374, size: 32, offset: 14176)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !426, file: !393, line: 442, baseType: !374, size: 32, offset: 14208)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !426, file: !393, line: 443, baseType: !1161, size: 448, offset: 14272)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 448, elements: !1163)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !469)
!1163 = !{!1164}
!1164 = !DISubrange(count: 7)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !426, file: !393, line: 444, baseType: !374, size: 32, offset: 14720)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !426, file: !393, line: 445, baseType: !374, size: 32, offset: 14752)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !426, file: !393, line: 446, baseType: !376, size: 32, offset: 14784)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !426, file: !393, line: 447, baseType: !529, size: 64, offset: 14848)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !426, file: !393, line: 448, baseType: !529, size: 64, offset: 14912)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !426, file: !393, line: 449, baseType: !707, size: 640, offset: 14976)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !426, file: !393, line: 450, baseType: !643, size: 32, offset: 15616)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !426, file: !393, line: 451, baseType: !1173, size: 2880, offset: 15680)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !393, line: 318, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !393, line: 319, size: 2880, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1195, !1196, !1201, !1206, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1221, !1222, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1254, !1255, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1279, !1280, !1284, !1285}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1174, file: !393, line: 320, baseType: !376, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1174, file: !393, line: 321, baseType: !376, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1174, file: !393, line: 322, baseType: !376, size: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1174, file: !393, line: 323, baseType: !376, size: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1174, file: !393, line: 324, baseType: !376, size: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1174, file: !393, line: 325, baseType: !376, size: 32, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1174, file: !393, line: 326, baseType: !1183, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !393, line: 293, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !393, line: 295, size: 448, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1185, file: !393, line: 296, baseType: !1183, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1185, file: !393, line: 297, baseType: !414, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1185, file: !393, line: 297, baseType: !414, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1185, file: !393, line: 298, baseType: !381, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1185, file: !393, line: 298, baseType: !381, size: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1185, file: !393, line: 299, baseType: !376, size: 32, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1185, file: !393, line: 300, baseType: !376, size: 32, offset: 352)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1185, file: !393, line: 301, baseType: !376, size: 32, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1174, file: !393, line: 326, baseType: !1183, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1174, file: !393, line: 328, baseType: !1197, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!444, !424, !1200, !381}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1174, file: !393, line: 329, baseType: !1202, size: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!444, !1200, !1205, !537, !537, !552, !381}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1174, file: !393, line: 330, baseType: !1207, size: 64, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!444, !1200}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1174, file: !393, line: 331, baseType: !1207, size: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1174, file: !393, line: 334, baseType: !448, size: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !393, line: 335, baseType: !507, size: 32, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1174, file: !393, line: 335, baseType: !507, size: 32, offset: 672)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1174, file: !393, line: 336, baseType: !507, size: 32, offset: 704)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1174, file: !393, line: 336, baseType: !507, size: 32, offset: 736)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1174, file: !393, line: 337, baseType: !1217, size: 64, offset: 768)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !449, line: 339, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !449, line: 339, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1174, file: !393, line: 338, baseType: !1217, size: 64, offset: 832)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1174, file: !393, line: 339, baseType: !1223, size: 64, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !449, line: 341, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !449, line: 351, size: 192, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1231}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1225, file: !449, line: 354, baseType: !74, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1225, file: !449, line: 355, baseType: !74, size: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1225, file: !449, line: 356, baseType: !74, size: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1225, file: !449, line: 361, baseType: !74, size: 32, offset: 96)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1225, file: !449, line: 362, baseType: !598, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1174, file: !393, line: 340, baseType: !376, size: 32, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1174, file: !393, line: 340, baseType: !376, size: 32, offset: 992)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1174, file: !393, line: 341, baseType: !414, size: 64, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1174, file: !393, line: 342, baseType: !381, size: 64, offset: 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1174, file: !393, line: 343, baseType: !552, size: 64, offset: 1152)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1174, file: !393, line: 344, baseType: !537, size: 64, offset: 1216)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1174, file: !393, line: 345, baseType: !376, size: 32, offset: 1280)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1174, file: !393, line: 346, baseType: !1205, size: 64, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1174, file: !393, line: 347, baseType: !374, size: 32, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1174, file: !393, line: 348, baseType: !376, size: 32, offset: 1440)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1174, file: !393, line: 351, baseType: !374, size: 32, offset: 1472)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1174, file: !393, line: 352, baseType: !374, size: 32, offset: 1504)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1174, file: !393, line: 353, baseType: !507, size: 32, offset: 1536)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1174, file: !393, line: 354, baseType: !507, size: 32, offset: 1568)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1174, file: !393, line: 355, baseType: !1205, size: 64, offset: 1600)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1174, file: !393, line: 356, baseType: !1205, size: 64, offset: 1664)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1174, file: !393, line: 357, baseType: !1249, size: 64, offset: 1728)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !393, line: 310, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 308, size: 32, elements: !1252)
!1252 = !{!1253}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1251, file: !393, line: 309, baseType: !376, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1174, file: !393, line: 357, baseType: !1249, size: 64, offset: 1792)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1174, file: !393, line: 358, baseType: !1256, size: 64, offset: 1856)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !393, line: 316, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 312, size: 128, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1258, file: !393, line: 313, baseType: !527, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1258, file: !393, line: 314, baseType: !376, size: 32, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1258, file: !393, line: 315, baseType: !471, size: 8, offset: 96)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1174, file: !393, line: 359, baseType: !1256, size: 64, offset: 1920)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1174, file: !393, line: 360, baseType: !1256, size: 64, offset: 1984)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1174, file: !393, line: 361, baseType: !376, size: 32, offset: 2048)
