; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnls/bqnls.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnls/bqnls.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!343 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!344 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!345 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!346 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!347 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!348 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!349 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!350 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!351 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!352 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!353 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!354 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!355 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!356 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!357 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!358 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!359 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 663, baseType: !7, size: 32, elements: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!362 = !{!363, !364, !365}
!363 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!366 = !{!367, !371, !372, !1994, !423, !403}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !368, line: 330, baseType: !369)
!368 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !368, line: 330, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNK", file: !374, line: 209, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bnk/bnk.h", directory: "/home/users/ndemeye/xSDK")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 10, size: 5888, elements: !376)
!376 = !{!377, !1817, !1823, !1824, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !375, file: !374, line: 15, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !93)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !316, line: 118, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !385, line: 45, size: 14656, elements: !386)
!385 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!386 = !{!387, !591, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1689, !1695, !1697, !1698, !1699, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1770, !1771, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !384, file: !385, line: 46, baseType: !388, size: 4480)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !389, line: 122, baseType: !390)
!389 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !389, line: 73, size: 4480, elements: !391)
!391 = !{!392, !394, !444, !445, !447, !450, !451, !452, !453, !461, !462, !464, !468, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !485, !486, !487, !489, !490, !492, !494, !495, !496, !497, !498, !501, !503, !504, !505, !506, !507, !510, !512, !513, !514, !524, !526, !527, !531, !532, !581, !586, !588, !589, !590}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !390, file: !389, line: 74, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !390, file: !389, line: 75, baseType: !395, size: 448, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 448, elements: !442)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !389, line: 53, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 45, size: 448, elements: !398)
!398 = !{!399, !406, !414, !419, !426, !430, !437}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !397, file: !389, line: 46, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!381, !403, !405}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !397, file: !389, line: 47, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!381, !403, !410}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !411, line: 16, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !411, line: 16, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !397, file: !389, line: 48, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!381, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !397, file: !389, line: 49, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!381, !403, !423, !403}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !397, file: !389, line: 50, baseType: !427, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!381, !403, !423, !418}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !397, file: !389, line: 51, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!381, !403, !423, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !397, file: !389, line: 52, baseType: !438, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!381, !403, !423, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!442 = !{!443}
!443 = !DISubrange(count: 1)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !390, file: !389, line: 76, baseType: !367, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !389, line: 77, baseType: !446, size: 32, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !390, file: !389, line: 78, baseType: !448, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !449)
!449 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !390, file: !389, line: 78, baseType: !448, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !390, file: !389, line: 78, baseType: !448, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !390, file: !389, line: 78, baseType: !448, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !389, line: 79, baseType: !454, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !457, line: 27, baseType: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !459, line: 43, baseType: !460)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!460 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !390, file: !389, line: 80, baseType: !446, size: 32, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !389, line: 81, baseType: !463, size: 32, offset: 992)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !390, file: !389, line: 82, baseType: !465, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !390, file: !389, line: 83, baseType: !469, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !390, file: !389, line: 84, baseType: !473, size: 64, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !390, file: !389, line: 85, baseType: !473, size: 64, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !390, file: !389, line: 86, baseType: !473, size: 64, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !390, file: !389, line: 87, baseType: !473, size: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !390, file: !389, line: 88, baseType: !403, size: 64, offset: 1408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !390, file: !389, line: 89, baseType: !454, size: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !389, line: 90, baseType: !473, size: 64, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !390, file: !389, line: 91, baseType: !473, size: 64, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !390, file: !389, line: 92, baseType: !446, size: 32, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !390, file: !389, line: 93, baseType: !371, size: 64, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !390, file: !389, line: 94, baseType: !484, size: 64, offset: 1792)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !455)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !390, file: !389, line: 95, baseType: !446, size: 32, offset: 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !390, file: !389, line: 95, baseType: !446, size: 32, offset: 1888)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !390, file: !389, line: 96, baseType: !488, size: 64, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !390, file: !389, line: 96, baseType: !488, size: 64, offset: 1984)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !390, file: !389, line: 97, baseType: !491, size: 64, offset: 2048)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !390, file: !389, line: 97, baseType: !493, size: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !390, file: !389, line: 98, baseType: !446, size: 32, offset: 2176)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !390, file: !389, line: 98, baseType: !446, size: 32, offset: 2208)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !390, file: !389, line: 99, baseType: !488, size: 64, offset: 2240)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !390, file: !389, line: 99, baseType: !488, size: 64, offset: 2304)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !390, file: !389, line: 100, baseType: !499, size: 64, offset: 2368)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !449)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !390, file: !389, line: 100, baseType: !502, size: 64, offset: 2432)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !390, file: !389, line: 101, baseType: !446, size: 32, offset: 2496)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !390, file: !389, line: 101, baseType: !446, size: 32, offset: 2528)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !390, file: !389, line: 102, baseType: !488, size: 64, offset: 2560)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !390, file: !389, line: 102, baseType: !488, size: 64, offset: 2624)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !390, file: !389, line: 103, baseType: !508, size: 64, offset: 2688)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !500)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !390, file: !389, line: 103, baseType: !511, size: 64, offset: 2752)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !390, file: !389, line: 104, baseType: !441, size: 64, offset: 2816)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !390, file: !389, line: 105, baseType: !446, size: 32, offset: 2880)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !390, file: !389, line: 106, baseType: !515, size: 128, offset: 2944)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 128, elements: !522)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !389, line: 64, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 61, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !518, file: !389, line: 62, baseType: !434, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !518, file: !389, line: 63, baseType: !371, size: 64, offset: 64)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !390, file: !389, line: 107, baseType: !525, size: 64, offset: 3072)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 64, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !390, file: !389, line: 108, baseType: !371, size: 64, offset: 3136)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !390, file: !389, line: 109, baseType: !528, size: 64, offset: 3200)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!381, !371}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !390, file: !389, line: 111, baseType: !446, size: 32, offset: 3264)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !390, file: !389, line: 112, baseType: !533, size: 320, offset: 3328)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !579)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!381, !537, !403, !371}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !540)
!540 = !{!541, !542, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !539, file: !12, line: 100, baseType: !446, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !12, line: 101, baseType: !543, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !554, !555, !556, !560, !562, !564, !565, !566}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !545, file: !12, line: 84, baseType: !473, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !545, file: !12, line: 85, baseType: !473, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !12, line: 86, baseType: !371, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !545, file: !12, line: 87, baseType: !465, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !545, file: !12, line: 88, baseType: !552, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !545, file: !12, line: 89, baseType: !425, size: 8, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !545, file: !12, line: 90, baseType: !473, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !545, file: !12, line: 91, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !558, line: 46, baseType: !559)
!558 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!559 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !545, file: !12, line: 92, baseType: !561, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !12, line: 93, baseType: !563, size: 32, offset: 544)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !12, line: 94, baseType: !543, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !545, file: !12, line: 95, baseType: !473, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !545, file: !12, line: 96, baseType: !371, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !539, file: !12, line: 102, baseType: !473, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !539, file: !12, line: 102, baseType: !473, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !539, file: !12, line: 103, baseType: !473, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !539, file: !12, line: 104, baseType: !367, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !539, file: !12, line: 105, baseType: !561, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !539, file: !12, line: 105, baseType: !561, size: 32, offset: 416)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !539, file: !12, line: 105, baseType: !561, size: 32, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !539, file: !12, line: 106, baseType: !403, size: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !539, file: !12, line: 107, baseType: !576, size: 64, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!579 = !{!580}
!580 = !DISubrange(count: 5)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !390, file: !389, line: 113, baseType: !582, size: 320, offset: 3648)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 320, elements: !579)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!381, !403, !371}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !390, file: !389, line: 114, baseType: !587, size: 320, offset: 3968)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 320, elements: !579)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !390, file: !389, line: 115, baseType: !561, size: 32, offset: 4288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !390, file: !389, line: 120, baseType: !576, size: 64, offset: 4352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !390, file: !389, line: 121, baseType: !561, size: 32, offset: 4416)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !384, file: !385, line: 46, baseType: !592, size: 1536, offset: 4480)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 1536, elements: !442)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !385, line: 13, size: 1536, elements: !594)
!594 = !{!595, !899, !903, !907, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1641, !1642, !1643, !1644, !1648, !1652, !1653, !1657, !1658, !1659, !1663, !1667}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !593, file: !385, line: 15, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!381, !382, !599, !499, !371}
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !602, line: 142, size: 12800, elements: !603)
!602 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!603 = !{!604, !605, !825, !845, !846, !847, !893, !894, !895, !896, !898}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !601, file: !602, line: 143, baseType: !388, size: 4480)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !601, file: !602, line: 143, baseType: !606, size: 5248, offset: 4480)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 5248, elements: !442)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !602, line: 23, size: 5248, elements: !608)
!608 = !{!609, !614, !619, !623, !627, !633, !638, !639, !640, !644, !648, !649, !650, !654, !658, !664, !665, !669, !673, !677, !678, !685, !689, !690, !694, !698, !699, !700, !704, !705, !712, !717, !718, !719, !723, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !744, !745, !746, !750, !754, !755, !756, !757, !761, !762, !763, !764, !765, !766, !767, !771, !772, !776, !783, !784, !789, !790, !794, !795, !796, !797, !798, !799, !800, !801, !805, !806, !807, !813, !817, !818, !819}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !607, file: !602, line: 24, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!381, !599, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !607, file: !602, line: 25, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!381, !599, !446, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !607, file: !602, line: 26, baseType: !620, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!381, !446, !613}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !607, file: !602, line: 27, baseType: !624, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!381, !599, !599, !508}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !607, file: !602, line: 28, baseType: !628, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!381, !599, !446, !631, !508}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !607, file: !602, line: 29, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!381, !599, !637, !499}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !607, file: !602, line: 30, baseType: !624, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !607, file: !602, line: 31, baseType: !628, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !607, file: !602, line: 32, baseType: !641, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!381, !599, !509}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !607, file: !602, line: 33, baseType: !645, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!381, !599, !599}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !607, file: !602, line: 34, baseType: !641, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !607, file: !602, line: 35, baseType: !645, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !607, file: !602, line: 36, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!381, !599, !509, !599}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !607, file: !602, line: 37, baseType: !655, size: 64, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!381, !599, !509, !509, !599}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !607, file: !602, line: 38, baseType: !659, size: 64, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!381, !599, !446, !662, !613}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !607, file: !602, line: 39, baseType: !651, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !607, file: !602, line: 40, baseType: !666, size: 64, offset: 1024)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!381, !599, !509, !599, !599}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !607, file: !602, line: 41, baseType: !670, size: 64, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!381, !599, !509, !509, !509, !599, !599}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !607, file: !602, line: 42, baseType: !674, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!381, !599, !599, !599}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !607, file: !602, line: 43, baseType: !674, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !607, file: !602, line: 44, baseType: !679, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!381, !599, !446, !682, !662, !684}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !607, file: !602, line: 45, baseType: !686, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!381, !599}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !607, file: !602, line: 46, baseType: !686, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !607, file: !602, line: 47, baseType: !691, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!381, !599, !511}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !607, file: !602, line: 48, baseType: !695, size: 64, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!381, !599, !491}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !607, file: !602, line: 49, baseType: !695, size: 64, offset: 1600)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !607, file: !602, line: 50, baseType: !691, size: 64, offset: 1664)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !607, file: !602, line: 51, baseType: !701, size: 64, offset: 1728)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!381, !599, !491, !499}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !607, file: !602, line: 52, baseType: !701, size: 64, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !607, file: !602, line: 53, baseType: !706, size: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!381, !599, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !607, file: !602, line: 54, baseType: !713, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!381, !599, !716, !561}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !607, file: !602, line: 55, baseType: !679, size: 64, offset: 1984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !607, file: !602, line: 56, baseType: !686, size: 64, offset: 2048)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !607, file: !602, line: 57, baseType: !720, size: 64, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!381, !599, !410}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !607, file: !602, line: 58, baseType: !724, size: 64, offset: 2176)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!381, !599, !662}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !607, file: !602, line: 59, baseType: !724, size: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !607, file: !602, line: 60, baseType: !624, size: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !607, file: !602, line: 61, baseType: !624, size: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !607, file: !602, line: 62, baseType: !634, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !607, file: !602, line: 63, baseType: !628, size: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !607, file: !602, line: 64, baseType: !628, size: 64, offset: 2560)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !607, file: !602, line: 65, baseType: !720, size: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !607, file: !602, line: 66, baseType: !686, size: 64, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !607, file: !602, line: 67, baseType: !686, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !607, file: !602, line: 68, baseType: !737, size: 64, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!381, !599, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !741, line: 30, baseType: !742)
!741 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !741, line: 30, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !607, file: !602, line: 69, baseType: !679, size: 64, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !607, file: !602, line: 70, baseType: !686, size: 64, offset: 2944)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !607, file: !602, line: 71, baseType: !747, size: 64, offset: 3008)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!381, !537, !599}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !607, file: !602, line: 72, baseType: !751, size: 64, offset: 3072)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!381, !599, !599, !499}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !607, file: !602, line: 73, baseType: !674, size: 64, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !607, file: !602, line: 74, baseType: !674, size: 64, offset: 3200)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !607, file: !602, line: 75, baseType: !674, size: 64, offset: 3264)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !607, file: !602, line: 76, baseType: !758, size: 64, offset: 3328)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!381, !599, !446, !682, !508}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !607, file: !602, line: 77, baseType: !686, size: 64, offset: 3392)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !607, file: !602, line: 78, baseType: !686, size: 64, offset: 3456)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !607, file: !602, line: 79, baseType: !686, size: 64, offset: 3520)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !607, file: !602, line: 80, baseType: !686, size: 64, offset: 3584)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !607, file: !602, line: 81, baseType: !641, size: 64, offset: 3648)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !607, file: !602, line: 82, baseType: !686, size: 64, offset: 3712)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !607, file: !602, line: 83, baseType: !768, size: 64, offset: 3776)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!381, !599, !446, !599, !684}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !607, file: !602, line: 84, baseType: !768, size: 64, offset: 3840)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !607, file: !602, line: 85, baseType: !773, size: 64, offset: 3904)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!381, !599, !599, !508, !508}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !607, file: !602, line: 86, baseType: !777, size: 64, offset: 3968)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!381, !599, !780, !613}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !741, line: 11, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !741, line: 11, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !607, file: !602, line: 87, baseType: !777, size: 64, offset: 4032)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !607, file: !602, line: 88, baseType: !785, size: 64, offset: 4096)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!381, !599, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !607, file: !602, line: 89, baseType: !785, size: 64, offset: 4160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !607, file: !602, line: 90, baseType: !791, size: 64, offset: 4224)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!381, !599, !446, !682, !682, !599, !684}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !607, file: !602, line: 91, baseType: !791, size: 64, offset: 4288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !607, file: !602, line: 92, baseType: !720, size: 64, offset: 4352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !607, file: !602, line: 93, baseType: !720, size: 64, offset: 4416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !607, file: !602, line: 94, baseType: !645, size: 64, offset: 4480)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !607, file: !602, line: 95, baseType: !645, size: 64, offset: 4544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !607, file: !602, line: 96, baseType: !645, size: 64, offset: 4608)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !607, file: !602, line: 97, baseType: !645, size: 64, offset: 4672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !607, file: !602, line: 98, baseType: !802, size: 64, offset: 4736)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!381, !599, !561}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !607, file: !602, line: 99, baseType: !691, size: 64, offset: 4800)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !607, file: !602, line: 100, baseType: !691, size: 64, offset: 4864)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !607, file: !602, line: 101, baseType: !808, size: 64, offset: 4928)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!381, !599, !511, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !607, file: !602, line: 102, baseType: !814, size: 64, offset: 4992)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!381, !599, !788, !811}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !607, file: !602, line: 103, baseType: !691, size: 64, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !607, file: !602, line: 104, baseType: !785, size: 64, offset: 5120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !607, file: !602, line: 105, baseType: !820, size: 64, offset: 5184)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!381, !446, !631, !613, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !601, file: !602, line: 144, baseType: !826, size: 64, offset: 9728)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !741, line: 60, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !828, file: !135, line: 241, baseType: !367, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !135, line: 242, baseType: !463, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !828, file: !135, line: 243, baseType: !446, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !828, file: !135, line: 243, baseType: !446, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !828, file: !135, line: 244, baseType: !446, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !828, file: !135, line: 244, baseType: !446, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !828, file: !135, line: 245, baseType: !491, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !828, file: !135, line: 246, baseType: !561, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !828, file: !135, line: 247, baseType: !446, size: 32, offset: 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !828, file: !135, line: 251, baseType: !446, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !828, file: !135, line: 252, baseType: !740, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !828, file: !135, line: 253, baseType: !561, size: 32, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !828, file: !135, line: 254, baseType: !446, size: 32, offset: 544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !828, file: !135, line: 254, baseType: !446, size: 32, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !828, file: !135, line: 255, baseType: !446, size: 32, offset: 608)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !602, line: 145, baseType: !371, size: 64, offset: 9792)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !601, file: !602, line: 146, baseType: !561, size: 32, offset: 9856)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !601, file: !602, line: 147, baseType: !848, size: 1344, offset: 9920)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !602, line: 140, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 114, size: 1344, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !869, !870, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !849, file: !602, line: 115, baseType: !446, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !849, file: !602, line: 116, baseType: !446, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !849, file: !602, line: 117, baseType: !446, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !849, file: !602, line: 118, baseType: !446, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !849, file: !602, line: 119, baseType: !446, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !849, file: !602, line: 120, baseType: !446, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !849, file: !602, line: 121, baseType: !491, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !849, file: !602, line: 122, baseType: !508, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !849, file: !602, line: 124, baseType: !367, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !602, line: 125, baseType: !463, size: 32, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !849, file: !602, line: 125, baseType: !463, size: 32, offset: 416)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !849, file: !602, line: 126, baseType: !463, size: 32, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !849, file: !602, line: 126, baseType: !463, size: 32, offset: 480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !849, file: !602, line: 127, baseType: !865, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !368, line: 339, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !368, line: 339, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !849, file: !602, line: 128, baseType: !865, size: 64, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !849, file: !602, line: 129, baseType: !871, size: 64, offset: 640)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !368, line: 341, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !368, line: 351, size: 192, elements: !874)
!874 = !{!875, !876, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !873, file: !368, line: 354, baseType: !93, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !873, file: !368, line: 355, baseType: !93, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !873, file: !368, line: 356, baseType: !93, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !873, file: !368, line: 361, baseType: !93, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !873, file: !368, line: 362, baseType: !557, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !849, file: !602, line: 130, baseType: !446, size: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !849, file: !602, line: 130, baseType: !446, size: 32, offset: 736)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !849, file: !602, line: 131, baseType: !508, size: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !849, file: !602, line: 131, baseType: !508, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !849, file: !602, line: 132, baseType: !491, size: 64, offset: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !849, file: !602, line: 132, baseType: !491, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !849, file: !602, line: 133, baseType: !446, size: 32, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !849, file: !602, line: 134, baseType: !491, size: 64, offset: 1088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !849, file: !602, line: 135, baseType: !446, size: 32, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !849, file: !602, line: 136, baseType: !561, size: 32, offset: 1184)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !849, file: !602, line: 137, baseType: !561, size: 32, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !849, file: !602, line: 138, baseType: !684, size: 32, offset: 1248)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !849, file: !602, line: 139, baseType: !491, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !601, file: !602, line: 147, baseType: !848, size: 1344, offset: 11264)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !601, file: !602, line: 148, baseType: !561, size: 32, offset: 12608)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !601, file: !602, line: 149, baseType: !446, size: 32, offset: 12640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !601, file: !602, line: 150, baseType: !897, size: 32, offset: 12672)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !601, file: !602, line: 157, baseType: !473, size: 64, offset: 12736)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !593, file: !385, line: 16, baseType: !900, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!381, !382, !599, !499, !599, !371}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !593, file: !385, line: 17, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!381, !382, !599, !599, !371}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !593, file: !385, line: 18, baseType: !908, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!381, !382, !599, !911, !911, !371}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !914, line: 436, size: 23424, elements: !915)
!914 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!915 = !{!916, !917, !1402, !1403, !1404, !1405, !1407, !1408, !1409, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1523, !1524, !1540, !1541, !1542, !1543, !1544, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1579, !1599, !1600, !1602, !1603, !1604, !1605, !1606, !1607, !1625, !1626}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !913, file: !914, line: 437, baseType: !388, size: 4480)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !913, file: !914, line: 437, baseType: !918, size: 9472, offset: 4480)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 9472, elements: !442)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !914, line: 32, size: 9472, elements: !920)
!920 = !{!921, !925, !929, !930, !934, !938, !939, !940, !941, !942, !943, !944, !964, !968, !973, !979, !998, !1003, !1007, !1008, !1012, !1017, !1018, !1023, !1027, !1031, !1035, !1039, !1043, !1044, !1045, !1046, !1047, !1051, !1052, !1057, !1058, !1059, !1060, !1061, !1066, !1073, !1077, !1081, !1085, !1089, !1093, !1094, !1098, !1099, !1103, !1108, !1109, !1110, !1111, !1173, !1181, !1182, !1186, !1187, !1191, !1192, !1196, !1201, !1202, !1206, !1210, !1214, !1215, !1216, !1217, !1218, !1219, !1224, !1225, !1229, !1233, !1237, !1238, !1239, !1243, !1253, !1254, !1258, !1259, !1263, !1264, !1268, !1269, !1273, !1274, !1278, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1316, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1338, !1342, !1343, !1347, !1348, !1349, !1350, !1376, !1380, !1381, !1382, !1383, !1384, !1388, !1389, !1390, !1391, !1392, !1396, !1400, !1401}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !919, file: !914, line: 34, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!381, !911, !446, !682, !446, !682, !662, !684}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !919, file: !914, line: 35, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!381, !911, !446, !491, !493, !511}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !919, file: !914, line: 36, baseType: !926, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !919, file: !914, line: 37, baseType: !931, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!381, !911, !599, !599}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !919, file: !914, line: 38, baseType: !935, size: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!381, !911, !599, !599, !599}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !919, file: !914, line: 40, baseType: !931, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !919, file: !914, line: 41, baseType: !935, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !919, file: !914, line: 42, baseType: !931, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !919, file: !914, line: 43, baseType: !935, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !919, file: !914, line: 44, baseType: !931, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !919, file: !914, line: 46, baseType: !935, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !919, file: !914, line: 47, baseType: !945, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!381, !911, !780, !780, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !65, line: 1239, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 1226, size: 704, elements: !952)
!952 = !{!953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !951, file: !65, line: 1227, baseType: !500, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !951, file: !65, line: 1228, baseType: !500, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !951, file: !65, line: 1229, baseType: !500, size: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !951, file: !65, line: 1230, baseType: !500, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !951, file: !65, line: 1231, baseType: !500, size: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !951, file: !65, line: 1232, baseType: !500, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !951, file: !65, line: 1233, baseType: !500, size: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !951, file: !65, line: 1234, baseType: !500, size: 64, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !951, file: !65, line: 1236, baseType: !500, size: 64, offset: 512)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !951, file: !65, line: 1237, baseType: !500, size: 64, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !951, file: !65, line: 1238, baseType: !500, size: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !919, file: !914, line: 48, baseType: !965, size: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!381, !911, !780, !948}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !919, file: !914, line: 49, baseType: !969, size: 64, offset: 832)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!381, !911, !599, !500, !972, !500, !446, !446, !599}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !65, line: 1291, baseType: !64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !919, file: !914, line: 50, baseType: !974, size: 64, offset: 896)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!381, !911, !977, !978}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !65, line: 238, baseType: !77)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !919, file: !914, line: 52, baseType: !980, size: 64, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!381, !911, !983, !984}
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !65, line: 612, baseType: !83)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !986, file: !65, line: 593, baseType: !448, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !986, file: !65, line: 594, baseType: !448, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !986, file: !65, line: 594, baseType: !448, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !986, file: !65, line: 594, baseType: !448, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !986, file: !65, line: 595, baseType: !448, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !986, file: !65, line: 596, baseType: !448, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !986, file: !65, line: 597, baseType: !448, size: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !986, file: !65, line: 598, baseType: !448, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !986, file: !65, line: 598, baseType: !448, size: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !986, file: !65, line: 599, baseType: !448, size: 64, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !919, file: !914, line: 53, baseType: !999, size: 64, offset: 1024)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!381, !911, !911, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !919, file: !914, line: 54, baseType: !1004, size: 64, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!381, !911, !599}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !919, file: !914, line: 55, baseType: !931, size: 64, offset: 1152)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !919, file: !914, line: 56, baseType: !1009, size: 64, offset: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!381, !911, !637, !499}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !919, file: !914, line: 58, baseType: !1013, size: 64, offset: 1280)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!381, !911, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !65, line: 424, baseType: !88)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !919, file: !914, line: 59, baseType: !1013, size: 64, offset: 1344)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !919, file: !914, line: 60, baseType: !1019, size: 64, offset: 1408)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!381, !911, !1022, !561}
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !65, line: 469, baseType: !92)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !919, file: !914, line: 61, baseType: !1024, size: 64, offset: 1472)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!381, !911}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !919, file: !914, line: 63, baseType: !1028, size: 64, offset: 1536)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!381, !911, !446, !682, !509, !599, !599}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !919, file: !914, line: 64, baseType: !1032, size: 64, offset: 1600)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!381, !911, !911, !780, !780, !948}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !919, file: !914, line: 65, baseType: !1036, size: 64, offset: 1664)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!381, !911, !911, !948}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !919, file: !914, line: 66, baseType: !1040, size: 64, offset: 1728)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!381, !911, !911, !780, !948}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !919, file: !914, line: 67, baseType: !1036, size: 64, offset: 1792)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !919, file: !914, line: 69, baseType: !1024, size: 64, offset: 1856)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !919, file: !914, line: 70, baseType: !1032, size: 64, offset: 1920)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !919, file: !914, line: 71, baseType: !1040, size: 64, offset: 1984)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !919, file: !914, line: 72, baseType: !1048, size: 64, offset: 2048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!381, !911, !978}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !919, file: !914, line: 73, baseType: !1024, size: 64, offset: 2112)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !919, file: !914, line: 75, baseType: !1053, size: 64, offset: 2176)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!381, !911, !1056, !978}
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !65, line: 563, baseType: !123)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !919, file: !914, line: 76, baseType: !931, size: 64, offset: 2240)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !919, file: !914, line: 77, baseType: !931, size: 64, offset: 2304)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !919, file: !914, line: 78, baseType: !945, size: 64, offset: 2368)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !919, file: !914, line: 79, baseType: !965, size: 64, offset: 2432)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !919, file: !914, line: 81, baseType: !1062, size: 64, offset: 2496)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!381, !911, !509, !911, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !65, line: 285, baseType: !128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !919, file: !914, line: 82, baseType: !1067, size: 64, offset: 2560)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!381, !911, !446, !1070, !1070, !977, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !919, file: !914, line: 83, baseType: !1074, size: 64, offset: 2624)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!381, !911, !446, !824, !446}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !919, file: !914, line: 84, baseType: !1078, size: 64, offset: 2688)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!381, !911, !446, !682, !446, !682, !508}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !919, file: !914, line: 85, baseType: !1082, size: 64, offset: 2752)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!381, !911, !911, !1065}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !919, file: !914, line: 87, baseType: !1086, size: 64, offset: 2816)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!381, !911, !599, !491}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !919, file: !914, line: 88, baseType: !1090, size: 64, offset: 2880)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!381, !911, !509}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !919, file: !914, line: 89, baseType: !1090, size: 64, offset: 2944)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !919, file: !914, line: 90, baseType: !1095, size: 64, offset: 3008)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!381, !911, !599, !684}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !919, file: !914, line: 91, baseType: !1028, size: 64, offset: 3072)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !919, file: !914, line: 93, baseType: !1100, size: 64, offset: 3136)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!381, !911, !709}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !919, file: !914, line: 94, baseType: !1104, size: 64, offset: 3200)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!381, !911, !446, !561, !561, !491, !1107, !1107, !1002}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !919, file: !914, line: 95, baseType: !1104, size: 64, offset: 3264)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !919, file: !914, line: 96, baseType: !1104, size: 64, offset: 3328)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !919, file: !914, line: 97, baseType: !1104, size: 64, offset: 3392)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !919, file: !914, line: 99, baseType: !1112, size: 64, offset: 3456)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!381, !911, !1115, !1118}
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !741, line: 51, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !741, line: 51, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !65, line: 1378, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !914, line: 609, size: 6208, elements: !1121)
!1121 = !{!1122, !1123, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1142, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1160, !1161, !1162, !1163, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1120, file: !914, line: 610, baseType: !388, size: 4480)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1120, file: !914, line: 610, baseType: !1124, size: 32, offset: 4480)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !442)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1120, file: !914, line: 611, baseType: !446, size: 32, offset: 4512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1120, file: !914, line: 611, baseType: !446, size: 32, offset: 4544)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1120, file: !914, line: 611, baseType: !446, size: 32, offset: 4576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1120, file: !914, line: 612, baseType: !446, size: 32, offset: 4608)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1120, file: !914, line: 613, baseType: !446, size: 32, offset: 4640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1120, file: !914, line: 614, baseType: !491, size: 64, offset: 4672)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1120, file: !914, line: 615, baseType: !493, size: 64, offset: 4736)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1120, file: !914, line: 616, baseType: !824, size: 64, offset: 4800)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1120, file: !914, line: 617, baseType: !491, size: 64, offset: 4864)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1120, file: !914, line: 618, baseType: !1135, size: 64, offset: 4928)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !914, line: 602, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !914, line: 598, size: 128, elements: !1138)
!1138 = !{!1139, !1140, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1137, file: !914, line: 599, baseType: !446, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1137, file: !914, line: 600, baseType: !446, size: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1137, file: !914, line: 601, baseType: !508, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1120, file: !914, line: 619, baseType: !1143, size: 64, offset: 4992)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !914, line: 607, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !914, line: 604, size: 128, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1145, file: !914, line: 605, baseType: !446, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1145, file: !914, line: 606, baseType: !508, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1120, file: !914, line: 620, baseType: !508, size: 64, offset: 5056)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1120, file: !914, line: 621, baseType: !500, size: 64, offset: 5120)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1120, file: !914, line: 622, baseType: !500, size: 64, offset: 5184)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1120, file: !914, line: 623, baseType: !599, size: 64, offset: 5248)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1120, file: !914, line: 623, baseType: !599, size: 64, offset: 5312)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1120, file: !914, line: 623, baseType: !599, size: 64, offset: 5376)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1120, file: !914, line: 624, baseType: !561, size: 32, offset: 5440)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1120, file: !914, line: 625, baseType: !1157, size: 64, offset: 5504)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!381}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1120, file: !914, line: 626, baseType: !371, size: 64, offset: 5568)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1120, file: !914, line: 627, baseType: !599, size: 64, offset: 5632)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1120, file: !914, line: 628, baseType: !446, size: 32, offset: 5696)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1120, file: !914, line: 629, baseType: !423, size: 64, offset: 5760)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1120, file: !914, line: 630, baseType: !1165, size: 32, offset: 5824)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !135, line: 213, baseType: !134)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1120, file: !914, line: 631, baseType: !446, size: 32, offset: 5856)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1120, file: !914, line: 631, baseType: !446, size: 32, offset: 5888)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1120, file: !914, line: 632, baseType: !561, size: 32, offset: 5920)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1120, file: !914, line: 633, baseType: !561, size: 32, offset: 5952)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1120, file: !914, line: 634, baseType: !434, size: 64, offset: 6016)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1120, file: !914, line: 634, baseType: !371, size: 64, offset: 6080)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1120, file: !914, line: 635, baseType: !454, size: 64, offset: 6144)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !919, file: !914, line: 100, baseType: !1174, size: 64, offset: 3520)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!381, !911, !446, !446, !1177, !1180}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !135, line: 215, baseType: !1179)
!1179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !919, file: !914, line: 101, baseType: !1024, size: 64, offset: 3584)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !919, file: !914, line: 102, baseType: !1183, size: 64, offset: 3648)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!381, !911, !780, !780, !978}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !919, file: !914, line: 103, baseType: !922, size: 64, offset: 3712)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !919, file: !914, line: 105, baseType: !1188, size: 64, offset: 3776)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!381, !911, !780, !780, !977, !978}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !919, file: !914, line: 106, baseType: !1024, size: 64, offset: 3840)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !919, file: !914, line: 107, baseType: !1193, size: 64, offset: 3904)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!381, !911, !410}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !919, file: !914, line: 108, baseType: !1197, size: 64, offset: 3968)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!381, !911, !1200, !977, !978}
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !65, line: 25, baseType: !423)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !919, file: !914, line: 109, baseType: !1157, size: 64, offset: 4032)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !919, file: !914, line: 111, baseType: !1203, size: 64, offset: 4096)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!381, !911, !911, !911, !500, !911}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !919, file: !914, line: 112, baseType: !1207, size: 64, offset: 4160)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!381, !911, !911, !911, !911}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !919, file: !914, line: 113, baseType: !1211, size: 64, offset: 4224)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!381, !911, !740, !740}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !919, file: !914, line: 114, baseType: !922, size: 64, offset: 4288)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !919, file: !914, line: 115, baseType: !1028, size: 64, offset: 4352)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !919, file: !914, line: 117, baseType: !1086, size: 64, offset: 4416)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !919, file: !914, line: 118, baseType: !1086, size: 64, offset: 4480)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !919, file: !914, line: 119, baseType: !1197, size: 64, offset: 4544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !919, file: !914, line: 120, baseType: !1220, size: 64, offset: 4608)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!381, !911, !1223, !1002}
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !65, line: 1675, baseType: !139)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !919, file: !914, line: 121, baseType: !1157, size: 64, offset: 4672)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !919, file: !914, line: 123, baseType: !1226, size: 64, offset: 4736)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!381, !911, !446, !371}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !919, file: !914, line: 124, baseType: !1230, size: 64, offset: 4800)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!381, !911, !1118, !599, !371}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !919, file: !914, line: 125, baseType: !1234, size: 64, offset: 4864)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!381, !537, !911}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !919, file: !914, line: 126, baseType: !931, size: 64, offset: 4928)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !919, file: !914, line: 127, baseType: !931, size: 64, offset: 4992)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !919, file: !914, line: 129, baseType: !1240, size: 64, offset: 5056)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!381, !911, !824}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !919, file: !914, line: 130, baseType: !1244, size: 64, offset: 5120)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!381, !911, !1247, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !27, line: 654, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !27, line: 653, size: 128, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1249, file: !27, line: 653, baseType: !446, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1249, file: !27, line: 653, baseType: !599, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !919, file: !914, line: 131, baseType: !1244, size: 64, offset: 5184)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !919, file: !914, line: 132, baseType: !1255, size: 64, offset: 5248)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!381, !911, !491, !491, !491}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !919, file: !914, line: 133, baseType: !1193, size: 64, offset: 5312)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !919, file: !914, line: 135, baseType: !1260, size: 64, offset: 5376)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!381, !911, !500, !1002}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !919, file: !914, line: 136, baseType: !1260, size: 64, offset: 5440)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !919, file: !914, line: 137, baseType: !1265, size: 64, offset: 5504)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!381, !911, !1002}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !919, file: !914, line: 138, baseType: !922, size: 64, offset: 5568)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !919, file: !914, line: 139, baseType: !1270, size: 64, offset: 5632)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!381, !911, !613, !613}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !919, file: !914, line: 141, baseType: !1157, size: 64, offset: 5696)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !919, file: !914, line: 142, baseType: !1275, size: 64, offset: 5760)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!381, !911, !911, !500, !911}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !919, file: !914, line: 143, baseType: !1279, size: 64, offset: 5824)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!381, !911, !911, !911}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !919, file: !914, line: 144, baseType: !1157, size: 64, offset: 5888)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !919, file: !914, line: 145, baseType: !1275, size: 64, offset: 5952)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !919, file: !914, line: 147, baseType: !1279, size: 64, offset: 6016)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !919, file: !914, line: 148, baseType: !1157, size: 64, offset: 6080)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !919, file: !914, line: 149, baseType: !1275, size: 64, offset: 6144)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !919, file: !914, line: 150, baseType: !1279, size: 64, offset: 6208)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !919, file: !914, line: 151, baseType: !1289, size: 64, offset: 6272)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!381, !911, !561}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !919, file: !914, line: 153, baseType: !1024, size: 64, offset: 6336)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !919, file: !914, line: 154, baseType: !1024, size: 64, offset: 6400)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !919, file: !914, line: 155, baseType: !1024, size: 64, offset: 6464)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !919, file: !914, line: 156, baseType: !1024, size: 64, offset: 6528)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !919, file: !914, line: 157, baseType: !1193, size: 64, offset: 6592)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !919, file: !914, line: 159, baseType: !1298, size: 64, offset: 6656)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!381, !911, !446, !662}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !919, file: !914, line: 160, baseType: !1024, size: 64, offset: 6720)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !919, file: !914, line: 161, baseType: !1024, size: 64, offset: 6784)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !919, file: !914, line: 162, baseType: !1024, size: 64, offset: 6848)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !919, file: !914, line: 163, baseType: !1024, size: 64, offset: 6912)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !919, file: !914, line: 165, baseType: !1279, size: 64, offset: 6976)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !919, file: !914, line: 166, baseType: !1279, size: 64, offset: 7040)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !919, file: !914, line: 167, baseType: !1086, size: 64, offset: 7104)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !919, file: !914, line: 168, baseType: !1309, size: 64, offset: 7168)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!381, !911, !599, !446}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !919, file: !914, line: 169, baseType: !1313, size: 64, offset: 7232)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!381, !911, !1002, !491}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !919, file: !914, line: 171, baseType: !1048, size: 64, offset: 7296)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !919, file: !914, line: 172, baseType: !1024, size: 64, offset: 7360)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !919, file: !914, line: 173, baseType: !1319, size: 64, offset: 7424)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!381, !911, !491, !1107}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !919, file: !914, line: 174, baseType: !1183, size: 64, offset: 7488)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !919, file: !914, line: 175, baseType: !1183, size: 64, offset: 7552)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !919, file: !914, line: 177, baseType: !931, size: 64, offset: 7616)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !919, file: !914, line: 178, baseType: !974, size: 64, offset: 7680)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !919, file: !914, line: 179, baseType: !931, size: 64, offset: 7744)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !919, file: !914, line: 180, baseType: !935, size: 64, offset: 7808)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !919, file: !914, line: 181, baseType: !1329, size: 64, offset: 7872)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!381, !911, !367, !977, !978}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !919, file: !914, line: 183, baseType: !1240, size: 64, offset: 7936)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !919, file: !914, line: 184, baseType: !1009, size: 64, offset: 8000)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !919, file: !914, line: 185, baseType: !1335, size: 64, offset: 8064)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!381, !911, !788}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !919, file: !914, line: 186, baseType: !1339, size: 64, offset: 8128)
