; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/icc/icc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/icc/icc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 161, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63}
!56 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1189, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 612, baseType: !5, size: 32, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "MAT_LOCAL", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MAT_GLOBAL_MAX", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "MAT_GLOBAL_SUM", value: 3, isUnsigned: true)
!88 = !{!89, !92, !110, !191, !297, !209, !131, !330, !337}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!91 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !95, line: 73, size: 4480, elements: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!96 = !{!97, !99, !152, !153, !155, !158, !159, !160, !161, !169, !170, !172, !176, !180, !182, !183, !184, !185, !186, !187, !188, !189, !190, !192, !194, !195, !196, !198, !199, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !215, !216, !219, !221, !222, !223, !233, !235, !236, !240, !241, !287, !292, !294, !295, !296}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !94, file: !95, line: 74, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !94, file: !95, line: 75, baseType: !100, size: 448, offset: 64)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 448, elements: !150)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !95, line: 53, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 45, size: 448, elements: !103)
!103 = !{!104, !114, !122, !127, !134, !138, !145}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !102, file: !95, line: 46, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !92, !109}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !111, line: 330, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !111, line: 330, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !102, file: !95, line: 47, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!108, !92, !118}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !119, line: 16, baseType: !120)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !119, line: 16, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !102, file: !95, line: 48, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!108, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !102, file: !95, line: 49, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!108, !92, !131, !92}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !102, file: !95, line: 50, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!108, !92, !131, !126}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !102, file: !95, line: 51, baseType: !139, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!108, !92, !131, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !102, file: !95, line: 52, baseType: !146, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!108, !92, !131, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!150 = !{!151}
!151 = !DISubrange(count: 1)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !94, file: !95, line: 76, baseType: !110, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !95, line: 77, baseType: !154, size: 32, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !94, file: !95, line: 78, baseType: !156, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !157)
!157 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !94, file: !95, line: 78, baseType: !156, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !94, file: !95, line: 78, baseType: !156, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !94, file: !95, line: 78, baseType: !156, size: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !95, line: 79, baseType: !162, size: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !165, line: 27, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !167, line: 43, baseType: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!168 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !94, file: !95, line: 80, baseType: !154, size: 32, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !94, file: !95, line: 81, baseType: !171, size: 32, offset: 992)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !94, file: !95, line: 82, baseType: !173, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !94, file: !95, line: 83, baseType: !177, size: 64, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !94, file: !95, line: 84, baseType: !181, size: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !94, file: !95, line: 85, baseType: !181, size: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !94, file: !95, line: 86, baseType: !181, size: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !94, file: !95, line: 87, baseType: !181, size: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !94, file: !95, line: 88, baseType: !92, size: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !94, file: !95, line: 89, baseType: !162, size: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 90, baseType: !181, size: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !94, file: !95, line: 91, baseType: !181, size: 64, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !94, file: !95, line: 92, baseType: !154, size: 32, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !94, file: !95, line: 93, baseType: !191, size: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !94, file: !95, line: 94, baseType: !193, size: 64, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !163)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !94, file: !95, line: 95, baseType: !154, size: 32, offset: 1856)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !94, file: !95, line: 95, baseType: !154, size: 32, offset: 1888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !94, file: !95, line: 96, baseType: !197, size: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !94, file: !95, line: 96, baseType: !197, size: 64, offset: 1984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !94, file: !95, line: 97, baseType: !200, size: 64, offset: 2048)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !94, file: !95, line: 97, baseType: !202, size: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !94, file: !95, line: 98, baseType: !154, size: 32, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !94, file: !95, line: 98, baseType: !154, size: 32, offset: 2208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !94, file: !95, line: 99, baseType: !197, size: 64, offset: 2240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !94, file: !95, line: 99, baseType: !197, size: 64, offset: 2304)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !94, file: !95, line: 100, baseType: !208, size: 64, offset: 2368)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !157)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !94, file: !95, line: 100, baseType: !211, size: 64, offset: 2432)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !94, file: !95, line: 101, baseType: !154, size: 32, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !94, file: !95, line: 101, baseType: !154, size: 32, offset: 2528)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !94, file: !95, line: 102, baseType: !197, size: 64, offset: 2560)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !94, file: !95, line: 102, baseType: !197, size: 64, offset: 2624)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !94, file: !95, line: 103, baseType: !217, size: 64, offset: 2688)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !94, file: !95, line: 103, baseType: !220, size: 64, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !94, file: !95, line: 104, baseType: !149, size: 64, offset: 2816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !94, file: !95, line: 105, baseType: !154, size: 32, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !94, file: !95, line: 106, baseType: !224, size: 128, offset: 2944)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !231)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !95, line: 64, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 61, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !227, file: !95, line: 62, baseType: !142, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !227, file: !95, line: 63, baseType: !191, size: 64, offset: 64)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !94, file: !95, line: 107, baseType: !234, size: 64, offset: 3072)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !231)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !94, file: !95, line: 108, baseType: !191, size: 64, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !94, file: !95, line: 109, baseType: !237, size: 64, offset: 3200)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!108, !191}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !94, file: !95, line: 111, baseType: !154, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !94, file: !95, line: 112, baseType: !242, size: 320, offset: 3328)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !285)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!108, !246, !92, !191}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !249)
!249 = !{!250, !251, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !248, file: !10, line: 100, baseType: !154, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !10, line: 101, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !263, !264, !265, !266, !268, !270, !271, !272}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !254, file: !10, line: 84, baseType: !181, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !254, file: !10, line: 85, baseType: !181, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !10, line: 86, baseType: !191, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !254, file: !10, line: 87, baseType: !173, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !254, file: !10, line: 88, baseType: !261, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !254, file: !10, line: 89, baseType: !133, size: 8, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !254, file: !10, line: 90, baseType: !181, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !254, file: !10, line: 91, baseType: !89, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !254, file: !10, line: 92, baseType: !267, size: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !10, line: 93, baseType: !269, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !10, line: 94, baseType: !252, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !254, file: !10, line: 95, baseType: !181, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !254, file: !10, line: 96, baseType: !191, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !248, file: !10, line: 102, baseType: !181, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !248, file: !10, line: 102, baseType: !181, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !248, file: !10, line: 103, baseType: !181, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !248, file: !10, line: 104, baseType: !110, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 416)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !248, file: !10, line: 106, baseType: !92, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !248, file: !10, line: 107, baseType: !282, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !94, file: !95, line: 113, baseType: !288, size: 320, offset: 3648)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !285)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!108, !92, !191}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !94, file: !95, line: 114, baseType: !293, size: 320, offset: 3968)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 320, elements: !285)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !94, file: !95, line: 115, baseType: !267, size: 32, offset: 4288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !94, file: !95, line: 120, baseType: !282, size: 64, offset: 4352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !94, file: !95, line: 121, baseType: !267, size: 32, offset: 4416)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Factor", file: !299, line: 19, baseType: !300)
!299 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/factor.h", directory: "/home/users/ndemeye/xSDK")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 9, size: 1152, elements: !301)
!301 = !{!302, !306, !321, !323, !324, !326, !327, !328, !329}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fact", scope: !300, file: !299, line: 10, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !300, file: !299, line: 11, baseType: !307, size: 704, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !39, line: 1239, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 1226, size: 704, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !308, file: !39, line: 1227, baseType: !209, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !308, file: !39, line: 1228, baseType: !209, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !308, file: !39, line: 1229, baseType: !209, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !308, file: !39, line: 1230, baseType: !209, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !308, file: !39, line: 1231, baseType: !209, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !308, file: !39, line: 1232, baseType: !209, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !308, file: !39, line: 1233, baseType: !209, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !308, file: !39, line: 1234, baseType: !209, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !308, file: !39, line: 1236, baseType: !209, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !308, file: !39, line: 1237, baseType: !209, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !308, file: !39, line: 1238, baseType: !209, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !300, file: !299, line: 12, baseType: !322, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !39, line: 1159, baseType: !131)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !300, file: !299, line: 13, baseType: !181, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !300, file: !299, line: 14, baseType: !325, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !39, line: 161, baseType: !54)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "actualfill", scope: !300, file: !299, line: 15, baseType: !209, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "inplace", scope: !300, file: !299, line: 16, baseType: !267, size: 32, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reuseordering", scope: !300, file: !299, line: 17, baseType: !267, size: 32, offset: 1056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reusefill", scope: !300, file: !299, line: 18, baseType: !267, size: 32, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_ICC", file: !332, line: 12, baseType: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/icc/icc.h", directory: "/home/users/ndemeye/xSDK")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 9, size: 1216, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !333, file: !332, line: 10, baseType: !298, size: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "implctx", scope: !333, file: !332, line: 11, baseType: !191, size: 64, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!338 = !{i32 7, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{i32 7, !"PIC Level", i32 2}
!342 = !{i32 7, !"uwtable", i32 1}
!343 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!344 = distinct !DISubprogram(name: "PCCreate_ICC", scope: !345, file: !345, line: 190, type: !346, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !452)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/icc/icc.c", directory: "/home/users/ndemeye/xSDK")
!346 = !DISubroutineType(types: !347)
!347 = !{!108, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !351, line: 37, size: 6720, elements: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!352 = !{!353, !355, !417, !422, !423, !424, !425, !426, !428, !429, !430, !431, !432, !433, !434, !435, !436, !446, !447, !448, !449, !450, !451}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !350, file: !351, line: 38, baseType: !354, size: 4480)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !95, line: 122, baseType: !94)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !350, file: !351, line: 38, baseType: !356, size: 1152, offset: 4480)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 1152, elements: !150)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !351, line: 13, size: 1152, elements: !358)
!358 = !{!359, !361, !369, !373, !379, !384, !385, !389, !393, !401, !402, !407, !408, !409, !410, !411, !415, !416}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !357, file: !351, line: 14, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !357, file: !351, line: 15, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!108, !348, !365, !365}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !366, line: 21, baseType: !367)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !366, line: 21, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !357, file: !351, line: 16, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!108, !348, !303, !303}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !357, file: !351, line: 17, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!108, !348, !365, !365, !365, !209, !209, !209, !154, !267, !200, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !357, file: !351, line: 18, baseType: !380, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!108, !348, !383, !365, !365, !365}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !357, file: !351, line: 19, baseType: !362, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !357, file: !351, line: 20, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!108, !348, !154, !365, !365, !365}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !357, file: !351, line: 21, baseType: !390, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!108, !246, !348}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !357, file: !351, line: 22, baseType: !394, size: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!108, !348, !397, !365, !365}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !398, line: 22, baseType: !399)
!398 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !398, line: 22, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !357, file: !351, line: 23, baseType: !394, size: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !357, file: !351, line: 24, baseType: !403, size: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!108, !348, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !357, file: !351, line: 25, baseType: !362, size: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !357, file: !351, line: 26, baseType: !362, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !357, file: !351, line: 27, baseType: !360, size: 64, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !357, file: !351, line: 28, baseType: !360, size: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !357, file: !351, line: 29, baseType: !412, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!108, !348, !118}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !357, file: !351, line: 30, baseType: !360, size: 64, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !357, file: !351, line: 31, baseType: !412, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !350, file: !351, line: 39, baseType: !418, size: 64, offset: 5632)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !419, line: 14, baseType: !420)
!419 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !419, line: 14, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !350, file: !351, line: 40, baseType: !154, size: 32, offset: 5696)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !350, file: !351, line: 41, baseType: !193, size: 64, offset: 5760)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !350, file: !351, line: 41, baseType: !193, size: 64, offset: 5824)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !350, file: !351, line: 42, baseType: !267, size: 32, offset: 5888)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !351, line: 43, baseType: !427, size: 32, offset: 5920)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !350, file: !351, line: 45, baseType: !154, size: 32, offset: 5952)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !350, file: !351, line: 46, baseType: !267, size: 32, offset: 5984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !350, file: !351, line: 47, baseType: !303, size: 64, offset: 6016)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !350, file: !351, line: 47, baseType: !303, size: 64, offset: 6080)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !350, file: !351, line: 48, baseType: !365, size: 64, offset: 6144)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !350, file: !351, line: 48, baseType: !365, size: 64, offset: 6208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !350, file: !351, line: 49, baseType: !267, size: 32, offset: 6272)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !350, file: !351, line: 50, baseType: !267, size: 32, offset: 6304)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !350, file: !351, line: 51, baseType: !437, size: 64, offset: 6336)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!108, !348, !154, !440, !440, !406, !191}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !443, line: 11, baseType: !444)
!443 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !443, line: 11, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !350, file: !351, line: 52, baseType: !191, size: 64, offset: 6400)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !351, line: 53, baseType: !191, size: 64, offset: 6464)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !350, file: !351, line: 54, baseType: !154, size: 32, offset: 6528)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !350, file: !351, line: 55, baseType: !191, size: 64, offset: 6592)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !350, file: !351, line: 56, baseType: !337, size: 32, offset: 6656)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !350, file: !351, line: 57, baseType: !337, size: 32, offset: 6688)
!452 = !{!453, !454, !455, !456, !458}
!453 = !DILocalVariable(name: "pc", arg: 1, scope: !344, file: !345, line: 190, type: !348)
!454 = !DILocalVariable(name: "ierr", scope: !344, file: !345, line: 192, type: !108)
!455 = !DILocalVariable(name: "icc", scope: !344, file: !345, line: 193, type: !330)
!456 = !DILocalVariable(name: "ierr__", scope: !457, file: !345, line: 196, type: !108)
!457 = distinct !DILexicalBlock(scope: !344, file: !345, line: 196, column: 35)
!458 = !DILocalVariable(name: "ierr__", scope: !459, file: !345, line: 198, type: !108)
!459 = distinct !DILexicalBlock(scope: !344, file: !345, line: 198, column: 53)
!460 = !DILocation(line: 0, scope: !344)
!461 = !DILocation(line: 193, column: 3, scope: !344)
!462 = !DILocation(line: 195, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !345, line: 195, column: 3)
!464 = distinct !DILexicalBlock(scope: !465, file: !345, line: 195, column: 3)
!465 = distinct !DILexicalBlock(scope: !344, file: !345, line: 195, column: 3)
!466 = !{!467, !467, i64 0}
!467 = !{!"any pointer", !468, i64 0}
!468 = !{!"omnipotent char", !469, i64 0}
!469 = !{!"Simple C/C++ TBAA"}
!470 = !DILocation(line: 195, column: 3, scope: !464)
!471 = !DILocation(line: 195, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !345, line: 195, column: 3)
!473 = distinct !DILexicalBlock(scope: !463, file: !345, line: 195, column: 3)
!474 = !{!475, !476, i64 1536}
!475 = !{!"", !468, i64 0, !468, i64 512, !468, i64 1024, !468, i64 1280, !476, i64 1536, !476, i64 1540, !468, i64 1544}
!476 = !{!"int", !468, i64 0}
!477 = !DILocation(line: 195, column: 3, scope: !473)
!478 = !DILocation(line: 195, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !345, line: 195, column: 3)
!480 = !{!476, !476, i64 0}
!481 = !{!475, !476, i64 1540}
!482 = !DILocation(line: 196, column: 14, scope: !344)
!483 = !{!"branch_weights", i32 2146410443, i32 1073205}
!484 = !DILocation(line: 0, scope: !457)
!485 = !DILocation(line: 196, column: 35, scope: !457)
!486 = !{!"branch_weights", i32 2000, i32 1}
!487 = !DILocation(line: 196, column: 35, scope: !488)
!488 = distinct !DILexicalBlock(scope: !457, file: !345, line: 196, column: 35)
!489 = !DILocation(line: 197, column: 21, scope: !344)
!490 = !DILocation(line: 197, column: 7, scope: !344)
!491 = !DILocation(line: 197, column: 12, scope: !344)
!492 = !{!493, !467, i64 808}
!493 = !{!"_p_PC", !494, i64 0, !468, i64 560, !467, i64 704, !476, i64 712, !496, i64 720, !496, i64 728, !468, i64 736, !468, i64 740, !476, i64 744, !468, i64 748, !467, i64 752, !467, i64 760, !467, i64 768, !467, i64 776, !468, i64 784, !468, i64 788, !467, i64 792, !467, i64 800, !467, i64 808, !476, i64 816, !467, i64 824, !468, i64 832, !468, i64 836}
!494 = !{!"_p_PetscObject", !476, i64 0, !468, i64 8, !467, i64 64, !476, i64 72, !495, i64 80, !495, i64 88, !495, i64 96, !495, i64 104, !496, i64 112, !476, i64 120, !476, i64 124, !467, i64 128, !467, i64 136, !467, i64 144, !467, i64 152, !467, i64 160, !467, i64 168, !467, i64 176, !496, i64 184, !467, i64 192, !467, i64 200, !476, i64 208, !467, i64 216, !496, i64 224, !476, i64 232, !476, i64 236, !467, i64 240, !467, i64 248, !467, i64 256, !467, i64 264, !476, i64 272, !476, i64 276, !467, i64 280, !467, i64 288, !467, i64 296, !467, i64 304, !476, i64 312, !476, i64 316, !467, i64 320, !467, i64 328, !467, i64 336, !467, i64 344, !467, i64 352, !476, i64 360, !468, i64 368, !468, i64 384, !467, i64 392, !467, i64 400, !476, i64 408, !468, i64 416, !468, i64 456, !468, i64 496, !468, i64 536, !467, i64 544, !468, i64 552}
!495 = !{!"double", !468, i64 0}
!496 = !{!"long", !468, i64 0}
!497 = !DILocation(line: 198, column: 14, scope: !344)
!498 = !DILocation(line: 0, scope: !459)
!499 = !DILocation(line: 198, column: 53, scope: !500)
!500 = distinct !DILexicalBlock(scope: !459, file: !345, line: 198, column: 53)
!501 = !DILocation(line: 198, column: 53, scope: !459)
!502 = !DILocation(line: 200, column: 16, scope: !344)
!503 = !DILocation(line: 200, column: 27, scope: !344)
!504 = !DILocation(line: 200, column: 37, scope: !344)
!505 = !{!506, !495, i64 48}
!506 = !{!"", !467, i64 0, !507, i64 8, !467, i64 96, !467, i64 104, !468, i64 112, !495, i64 120, !468, i64 128, !468, i64 132, !468, i64 136}
!507 = !{!"", !495, i64 0, !495, i64 8, !495, i64 16, !495, i64 24, !495, i64 32, !495, i64 40, !495, i64 48, !495, i64 56, !495, i64 64, !495, i64 72, !495, i64 80}
!508 = !DILocation(line: 201, column: 27, scope: !344)
!509 = !DILocation(line: 201, column: 37, scope: !344)
!510 = !{!506, !495, i64 32}
!511 = !DILocation(line: 202, column: 27, scope: !344)
!512 = !DILocation(line: 202, column: 37, scope: !344)
!513 = !{!506, !495, i64 80}
!514 = !DILocation(line: 204, column: 12, scope: !344)
!515 = !DILocation(line: 204, column: 32, scope: !344)
!516 = !{!517, !467, i64 8}
!517 = !{!"_PCOps", !467, i64 0, !467, i64 8, !467, i64 16, !467, i64 24, !467, i64 32, !467, i64 40, !467, i64 48, !467, i64 56, !467, i64 64, !467, i64 72, !467, i64 80, !467, i64 88, !467, i64 96, !467, i64 104, !467, i64 112, !467, i64 120, !467, i64 128, !467, i64 136}
!518 = !DILocation(line: 205, column: 12, scope: !344)
!519 = !DILocation(line: 205, column: 32, scope: !344)
!520 = !{!517, !467, i64 16}
!521 = !DILocation(line: 206, column: 12, scope: !344)
!522 = !DILocation(line: 206, column: 32, scope: !344)
!523 = !{!517, !467, i64 40}
!524 = !DILocation(line: 207, column: 12, scope: !344)
!525 = !DILocation(line: 207, column: 32, scope: !344)
!526 = !{!517, !467, i64 0}
!527 = !DILocation(line: 208, column: 12, scope: !344)
!528 = !DILocation(line: 208, column: 32, scope: !344)
!529 = !{!517, !467, i64 128}
!530 = !DILocation(line: 209, column: 12, scope: !344)
!531 = !DILocation(line: 209, column: 32, scope: !344)
!532 = !{!517, !467, i64 112}
!533 = !DILocation(line: 210, column: 12, scope: !344)
!534 = !DILocation(line: 210, column: 32, scope: !344)
!535 = !{!517, !467, i64 56}
!536 = !DILocation(line: 211, column: 12, scope: !344)
!537 = !DILocation(line: 211, column: 32, scope: !344)
!538 = !{!517, !467, i64 120}
!539 = !DILocation(line: 212, column: 12, scope: !344)
!540 = !DILocation(line: 212, column: 32, scope: !344)
!541 = !{!517, !467, i64 88}
!542 = !DILocation(line: 213, column: 12, scope: !344)
!543 = !DILocation(line: 213, column: 32, scope: !344)
!544 = !{!517, !467, i64 96}
!545 = !DILocation(line: 214, column: 3, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !345, line: 214, column: 3)
!547 = distinct !DILexicalBlock(scope: !548, file: !345, line: 214, column: 3)
!548 = distinct !DILexicalBlock(scope: !344, file: !345, line: 214, column: 3)
!549 = !DILocation(line: 214, column: 3, scope: !547)
!550 = !DILocation(line: 214, column: 3, scope: !551)
!551 = distinct !DILexicalBlock(scope: !552, file: !345, line: 214, column: 3)
!552 = distinct !DILexicalBlock(scope: !546, file: !345, line: 214, column: 3)
!553 = !DILocation(line: 214, column: 3, scope: !552)
!554 = !DILocation(line: 214, column: 3, scope: !555)
!555 = distinct !DILexicalBlock(scope: !556, file: !345, line: 214, column: 3)
!556 = distinct !DILexicalBlock(scope: !551, file: !345, line: 214, column: 3)
!557 = !{!475, !468, i64 1544}
!558 = !DILocation(line: 214, column: 3, scope: !556)
!559 = !DILocation(line: 214, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !555, file: !345, line: 214, column: 3)
!561 = !DILocation(line: 214, column: 3, scope: !562)
!562 = distinct !DILexicalBlock(scope: !551, file: !345, line: 214, column: 3)
!563 = !DILocation(line: 214, column: 3, scope: !564)
!564 = distinct !DILexicalBlock(scope: !562, file: !345, line: 214, column: 3)
!565 = !DILocation(line: 214, column: 3, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !345, line: 214, column: 3)
!567 = distinct !DILexicalBlock(scope: !564, file: !345, line: 214, column: 3)
!568 = !DILocation(line: 214, column: 3, scope: !567)
!569 = !DILocation(line: 214, column: 3, scope: !570)
!570 = distinct !DILexicalBlock(scope: !566, file: !345, line: 214, column: 3)
!571 = !DILocation(line: 215, column: 1, scope: !344)
!572 = !DISubprogram(name: "PetscMallocA", scope: !573, file: !573, line: 1288, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !576)
!573 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!574 = !DISubroutineType(types: !575)
!575 = !{!108, !26, !3, !26, !131, !131, !91, !191, null}
!576 = !{}
!577 = !DISubprogram(name: "PetscLogObjectMemory", scope: !578, file: !578, line: 228, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !576)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!579 = !DISubroutineType(types: !580)
!580 = !{!26, !93, !157}
!581 = !DISubprogram(name: "PetscError", scope: !65, file: !65, line: 668, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !576)
!582 = !DISubroutineType(types: !583)
!583 = !{!108, !112, !26, !131, !131, !26, !64, !131, null}
!584 = !DISubprogram(name: "PCFactorInitialize", scope: !299, file: !299, line: 21, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !576)
!585 = !DISubroutineType(types: !586)
!586 = !{!26, !349, !54}
!587 = distinct !DISubprogram(name: "PCApply_ICC", scope: !345, file: !345, line: 89, type: !363, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !588)
!588 = !{!589, !590, !591, !592, !593, !594}
!589 = !DILocalVariable(name: "pc", arg: 1, scope: !587, file: !345, line: 89, type: !348)
!590 = !DILocalVariable(name: "x", arg: 2, scope: !587, file: !345, line: 89, type: !365)
!591 = !DILocalVariable(name: "y", arg: 3, scope: !587, file: !345, line: 89, type: !365)
!592 = !DILocalVariable(name: "icc", scope: !587, file: !345, line: 91, type: !330)
!593 = !DILocalVariable(name: "ierr", scope: !587, file: !345, line: 92, type: !108)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !345, line: 95, type: !108)
!595 = distinct !DILexicalBlock(scope: !587, file: !345, line: 95, column: 48)
!596 = !DILocation(line: 0, scope: !587)
!597 = !DILocation(line: 91, column: 38, scope: !587)
!598 = !DILocation(line: 94, column: 3, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !345, line: 94, column: 3)
!600 = distinct !DILexicalBlock(scope: !601, file: !345, line: 94, column: 3)
!601 = distinct !DILexicalBlock(scope: !587, file: !345, line: 94, column: 3)
!602 = !DILocation(line: 94, column: 3, scope: !600)
!603 = !DILocation(line: 94, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !345, line: 94, column: 3)
!605 = distinct !DILexicalBlock(scope: !599, file: !345, line: 94, column: 3)
!606 = !DILocation(line: 94, column: 3, scope: !605)
!607 = !DILocation(line: 94, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !604, file: !345, line: 94, column: 3)
!609 = !DILocation(line: 95, column: 38, scope: !587)
!610 = !{!506, !467, i64 0}
!611 = !DILocation(line: 95, column: 10, scope: !587)
!612 = !DILocation(line: 0, scope: !595)
!613 = !DILocation(line: 95, column: 48, scope: !614)
!614 = distinct !DILexicalBlock(scope: !595, file: !345, line: 95, column: 48)
!615 = !DILocation(line: 95, column: 48, scope: !595)
!616 = !DILocation(line: 96, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !345, line: 96, column: 3)
!618 = distinct !DILexicalBlock(scope: !619, file: !345, line: 96, column: 3)
!619 = distinct !DILexicalBlock(scope: !587, file: !345, line: 96, column: 3)
!620 = !DILocation(line: 96, column: 3, scope: !618)
!621 = !DILocation(line: 96, column: 3, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !345, line: 96, column: 3)
!623 = distinct !DILexicalBlock(scope: !617, file: !345, line: 96, column: 3)
!624 = !DILocation(line: 96, column: 3, scope: !623)
!625 = !DILocation(line: 96, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !345, line: 96, column: 3)
!627 = distinct !DILexicalBlock(scope: !622, file: !345, line: 96, column: 3)
!628 = !DILocation(line: 96, column: 3, scope: !627)
!629 = !DILocation(line: 96, column: 3, scope: !630)
!630 = distinct !DILexicalBlock(scope: !626, file: !345, line: 96, column: 3)
!631 = !DILocation(line: 96, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !622, file: !345, line: 96, column: 3)
!633 = !DILocation(line: 96, column: 3, scope: !634)
!634 = distinct !DILexicalBlock(scope: !632, file: !345, line: 96, column: 3)
!635 = !DILocation(line: 96, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !345, line: 96, column: 3)
!637 = distinct !DILexicalBlock(scope: !634, file: !345, line: 96, column: 3)
!638 = !DILocation(line: 96, column: 3, scope: !637)
!639 = !DILocation(line: 96, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !345, line: 96, column: 3)
!641 = !DILocation(line: 97, column: 1, scope: !587)
!642 = distinct !DISubprogram(name: "PCMatApply_ICC", scope: !345, file: !345, line: 99, type: !371, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !643)
!643 = !{!644, !645, !646, !647, !648, !649}
!644 = !DILocalVariable(name: "pc", arg: 1, scope: !642, file: !345, line: 99, type: !348)
!645 = !DILocalVariable(name: "X", arg: 2, scope: !642, file: !345, line: 99, type: !303)
!646 = !DILocalVariable(name: "Y", arg: 3, scope: !642, file: !345, line: 99, type: !303)
!647 = !DILocalVariable(name: "icc", scope: !642, file: !345, line: 101, type: !330)
!648 = !DILocalVariable(name: "ierr", scope: !642, file: !345, line: 102, type: !108)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !345, line: 105, type: !108)
!650 = distinct !DILexicalBlock(scope: !642, file: !345, line: 105, column: 51)
!651 = !DILocation(line: 0, scope: !642)
!652 = !DILocation(line: 101, column: 38, scope: !642)
!653 = !DILocation(line: 104, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !345, line: 104, column: 3)
!655 = distinct !DILexicalBlock(scope: !656, file: !345, line: 104, column: 3)
!656 = distinct !DILexicalBlock(scope: !642, file: !345, line: 104, column: 3)
!657 = !DILocation(line: 104, column: 3, scope: !655)
!658 = !DILocation(line: 104, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !345, line: 104, column: 3)
!660 = distinct !DILexicalBlock(scope: !654, file: !345, line: 104, column: 3)
!661 = !DILocation(line: 104, column: 3, scope: !660)
!662 = !DILocation(line: 104, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !345, line: 104, column: 3)
!664 = !DILocation(line: 105, column: 41, scope: !642)
!665 = !DILocation(line: 105, column: 10, scope: !642)
!666 = !DILocation(line: 0, scope: !650)
!667 = !DILocation(line: 105, column: 51, scope: !668)
!668 = distinct !DILexicalBlock(scope: !650, file: !345, line: 105, column: 51)
!669 = !DILocation(line: 105, column: 51, scope: !650)
!670 = !DILocation(line: 106, column: 3, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !345, line: 106, column: 3)
!672 = distinct !DILexicalBlock(scope: !673, file: !345, line: 106, column: 3)
!673 = distinct !DILexicalBlock(scope: !642, file: !345, line: 106, column: 3)
!674 = !DILocation(line: 106, column: 3, scope: !672)
!675 = !DILocation(line: 106, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !345, line: 106, column: 3)
!677 = distinct !DILexicalBlock(scope: !671, file: !345, line: 106, column: 3)
!678 = !DILocation(line: 106, column: 3, scope: !677)
!679 = !DILocation(line: 106, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !345, line: 106, column: 3)
!681 = distinct !DILexicalBlock(scope: !676, file: !345, line: 106, column: 3)
!682 = !DILocation(line: 106, column: 3, scope: !681)
!683 = !DILocation(line: 106, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !680, file: !345, line: 106, column: 3)
!685 = !DILocation(line: 106, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !676, file: !345, line: 106, column: 3)
!687 = !DILocation(line: 106, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !686, file: !345, line: 106, column: 3)
!689 = !DILocation(line: 106, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !345, line: 106, column: 3)
!691 = distinct !DILexicalBlock(scope: !688, file: !345, line: 106, column: 3)
!692 = !DILocation(line: 106, column: 3, scope: !691)
!693 = !DILocation(line: 106, column: 3, scope: !694)
!694 = distinct !DILexicalBlock(scope: !690, file: !345, line: 106, column: 3)
!695 = !DILocation(line: 107, column: 1, scope: !642)
!696 = distinct !DISubprogram(name: "PCSetUp_ICC", scope: !345, file: !345, line: 4, type: !346, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !717, !719, !721, !722, !724, !730, !732, !736, !738, !740, !743, !745, !747, !749, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !774, !776}
!698 = !DILocalVariable(name: "pc", arg: 1, scope: !696, file: !345, line: 4, type: !348)
!699 = !DILocalVariable(name: "icc", scope: !696, file: !345, line: 6, type: !330)
!700 = !DILocalVariable(name: "perm", scope: !696, file: !345, line: 7, type: !442)
!701 = !DILocalVariable(name: "cperm", scope: !696, file: !345, line: 7, type: !442)
!702 = !DILocalVariable(name: "ierr", scope: !696, file: !345, line: 8, type: !108)
!703 = !DILocalVariable(name: "info", scope: !696, file: !345, line: 9, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !39, line: 600, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 592, size: 640, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !705, file: !39, line: 593, baseType: !156, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !705, file: !39, line: 594, baseType: !156, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !705, file: !39, line: 594, baseType: !156, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !705, file: !39, line: 594, baseType: !156, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !705, file: !39, line: 595, baseType: !156, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !705, file: !39, line: 596, baseType: !156, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !705, file: !39, line: 597, baseType: !156, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !705, file: !39, line: 598, baseType: !156, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !705, file: !39, line: 598, baseType: !156, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !705, file: !39, line: 599, baseType: !156, size: 64, offset: 576)
!717 = !DILocalVariable(name: "stype", scope: !696, file: !345, line: 10, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSolverType", file: !39, line: 126, baseType: !131)
!719 = !DILocalVariable(name: "err", scope: !696, file: !345, line: 11, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !39, line: 1203, baseType: !76)
!721 = !DILocalVariable(name: "canuseordering", scope: !696, file: !345, line: 12, type: !267)
!722 = !DILocalVariable(name: "ierr__", scope: !723, file: !345, line: 17, type: !108)
!723 = distinct !DILexicalBlock(scope: !696, file: !345, line: 17, column: 60)
!724 = !DILocalVariable(name: "ierr__", scope: !725, file: !345, line: 20, type: !108)
!725 = distinct !DILexicalBlock(scope: !726, file: !345, line: 20, column: 107)
!726 = distinct !DILexicalBlock(scope: !727, file: !345, line: 19, column: 35)
!727 = distinct !DILexicalBlock(scope: !728, file: !345, line: 19, column: 9)
!728 = distinct !DILexicalBlock(scope: !729, file: !345, line: 18, column: 25)
!729 = distinct !DILexicalBlock(scope: !696, file: !345, line: 18, column: 7)
!730 = !DILocalVariable(name: "ierr__", scope: !731, file: !345, line: 22, type: !108)
!731 = distinct !DILexicalBlock(scope: !728, file: !345, line: 22, column: 80)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !345, line: 24, type: !108)
!733 = distinct !DILexicalBlock(scope: !734, file: !345, line: 24, column: 52)
!734 = distinct !DILexicalBlock(scope: !735, file: !345, line: 23, column: 25)
!735 = distinct !DILexicalBlock(scope: !728, file: !345, line: 23, column: 9)
!736 = !DILocalVariable(name: "ierr__", scope: !737, file: !345, line: 25, type: !108)
!737 = distinct !DILexicalBlock(scope: !734, file: !345, line: 25, column: 81)
!738 = !DILocalVariable(name: "ierr__", scope: !739, file: !345, line: 27, type: !108)
!739 = distinct !DILexicalBlock(scope: !728, file: !345, line: 27, column: 97)
!740 = !DILocalVariable(name: "canuseordering", scope: !741, file: !345, line: 29, type: !267)
!741 = distinct !DILexicalBlock(scope: !742, file: !345, line: 28, column: 48)
!742 = distinct !DILexicalBlock(scope: !729, file: !345, line: 28, column: 14)
!743 = !DILocalVariable(name: "ierr__", scope: !744, file: !345, line: 30, type: !108)
!744 = distinct !DILexicalBlock(scope: !741, file: !345, line: 30, column: 49)
!745 = !DILocalVariable(name: "ierr__", scope: !746, file: !345, line: 31, type: !108)
!746 = distinct !DILexicalBlock(scope: !741, file: !345, line: 31, column: 105)
!747 = !DILocalVariable(name: "ierr__", scope: !748, file: !345, line: 32, type: !108)
!748 = distinct !DILexicalBlock(scope: !741, file: !345, line: 32, column: 80)
!749 = !DILocalVariable(name: "ierr__", scope: !750, file: !345, line: 34, type: !108)
!750 = distinct !DILexicalBlock(scope: !751, file: !345, line: 34, column: 52)
!751 = distinct !DILexicalBlock(scope: !752, file: !345, line: 33, column: 25)
!752 = distinct !DILexicalBlock(scope: !741, file: !345, line: 33, column: 9)
!753 = !DILocalVariable(name: "ierr__", scope: !754, file: !345, line: 35, type: !108)
!754 = distinct !DILexicalBlock(scope: !751, file: !345, line: 35, column: 81)
!755 = !DILocalVariable(name: "ierr__", scope: !756, file: !345, line: 37, type: !108)
!756 = distinct !DILexicalBlock(scope: !741, file: !345, line: 37, column: 97)
!757 = !DILocalVariable(name: "ierr__", scope: !758, file: !345, line: 39, type: !108)
!758 = distinct !DILexicalBlock(scope: !696, file: !345, line: 39, column: 77)
!759 = !DILocalVariable(name: "ierr__", scope: !760, file: !345, line: 42, type: !108)
!760 = distinct !DILexicalBlock(scope: !696, file: !345, line: 42, column: 28)
!761 = !DILocalVariable(name: "ierr__", scope: !762, file: !345, line: 43, type: !108)
!762 = distinct !DILexicalBlock(scope: !696, file: !345, line: 43, column: 27)
