; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/image/drawimage.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/image/drawimage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BasicColors", scope: !2, file: !288, line: 503, type: !454, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !285, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/image/drawimage.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !38, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 204, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 141, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 663, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!50 = !{!51, !70, !151, !226, !91, !141, !260, !58, !267, !114, !7, !279, !282, !169}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !54, line: 73, size: 4480, elements: !55)
!54 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!55 = !{!56, !59, !112, !113, !115, !118, !119, !120, !121, !129, !130, !132, !136, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !154, !155, !156, !158, !159, !161, !163, !164, !165, !166, !167, !170, !172, !173, !174, !175, !176, !179, !181, !182, !183, !193, !195, !196, !200, !201, !250, !255, !257, !258, !259}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !53, file: !54, line: 74, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !58)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !53, file: !54, line: 75, baseType: !60, size: 448, offset: 64)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 448, elements: !110)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !54, line: 53, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 45, size: 448, elements: !63)
!63 = !{!64, !74, !82, !87, !94, !98, !105}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !62, file: !54, line: 46, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !51, !69}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !58)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !71, line: 330, baseType: !72)
!71 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !71, line: 330, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !62, file: !54, line: 47, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!68, !51, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !79, line: 16, baseType: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !79, line: 16, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !62, file: !54, line: 48, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!68, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !62, file: !54, line: 49, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !51, !91, !51}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !62, file: !54, line: 50, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!68, !51, !91, !86}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !62, file: !54, line: 51, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!68, !51, !91, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !62, file: !54, line: 52, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!68, !51, !91, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !53, file: !54, line: 76, baseType: !70, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !54, line: 77, baseType: !114, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !58)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !53, file: !54, line: 78, baseType: !116, size: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !117)
!117 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !53, file: !54, line: 78, baseType: !116, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !53, file: !54, line: 78, baseType: !116, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !53, file: !54, line: 78, baseType: !116, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !54, line: 79, baseType: !122, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !125, line: 27, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !127, line: 43, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!128 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !53, file: !54, line: 80, baseType: !114, size: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !53, file: !54, line: 81, baseType: !131, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !58)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !53, file: !54, line: 82, baseType: !133, size: 64, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !53, file: !54, line: 83, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !53, file: !54, line: 84, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !53, file: !54, line: 85, baseType: !141, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !53, file: !54, line: 86, baseType: !141, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !53, file: !54, line: 87, baseType: !141, size: 64, offset: 1344)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !53, file: !54, line: 88, baseType: !51, size: 64, offset: 1408)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !53, file: !54, line: 89, baseType: !122, size: 64, offset: 1472)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !54, line: 90, baseType: !141, size: 64, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !53, file: !54, line: 91, baseType: !141, size: 64, offset: 1600)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !53, file: !54, line: 92, baseType: !114, size: 32, offset: 1664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !53, file: !54, line: 93, baseType: !151, size: 64, offset: 1728)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !54, line: 94, baseType: !153, size: 64, offset: 1792)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !123)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !53, file: !54, line: 95, baseType: !114, size: 32, offset: 1856)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !53, file: !54, line: 95, baseType: !114, size: 32, offset: 1888)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !53, file: !54, line: 96, baseType: !157, size: 64, offset: 1920)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !53, file: !54, line: 96, baseType: !157, size: 64, offset: 1984)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !53, file: !54, line: 97, baseType: !160, size: 64, offset: 2048)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !53, file: !54, line: 97, baseType: !162, size: 64, offset: 2112)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !53, file: !54, line: 98, baseType: !114, size: 32, offset: 2176)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !53, file: !54, line: 98, baseType: !114, size: 32, offset: 2208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !53, file: !54, line: 99, baseType: !157, size: 64, offset: 2240)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !53, file: !54, line: 99, baseType: !157, size: 64, offset: 2304)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !53, file: !54, line: 100, baseType: !168, size: 64, offset: 2368)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !117)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !53, file: !54, line: 100, baseType: !171, size: 64, offset: 2432)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !53, file: !54, line: 101, baseType: !114, size: 32, offset: 2496)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !53, file: !54, line: 101, baseType: !114, size: 32, offset: 2528)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !53, file: !54, line: 102, baseType: !157, size: 64, offset: 2560)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !53, file: !54, line: 102, baseType: !157, size: 64, offset: 2624)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !53, file: !54, line: 103, baseType: !177, size: 64, offset: 2688)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !169)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !53, file: !54, line: 103, baseType: !180, size: 64, offset: 2752)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !53, file: !54, line: 104, baseType: !109, size: 64, offset: 2816)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !53, file: !54, line: 105, baseType: !114, size: 32, offset: 2880)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !53, file: !54, line: 106, baseType: !184, size: 128, offset: 2944)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !191)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !54, line: 64, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 61, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !187, file: !54, line: 62, baseType: !102, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !187, file: !54, line: 63, baseType: !151, size: 64, offset: 64)
!191 = !{!192}
!192 = !DISubrange(count: 2)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !53, file: !54, line: 107, baseType: !194, size: 64, offset: 3072)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !191)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !53, file: !54, line: 108, baseType: !151, size: 64, offset: 3136)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !53, file: !54, line: 109, baseType: !197, size: 64, offset: 3200)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!68, !151}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !53, file: !54, line: 111, baseType: !114, size: 32, offset: 3264)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !53, file: !54, line: 112, baseType: !202, size: 320, offset: 3328)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, elements: !248)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!68, !206, !51, !151}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !209)
!209 = !{!210, !211, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !208, file: !12, line: 100, baseType: !114, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !12, line: 101, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !223, !224, !225, !229, !231, !233, !234, !235}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !214, file: !12, line: 84, baseType: !141, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !214, file: !12, line: 85, baseType: !141, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !12, line: 86, baseType: !151, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !214, file: !12, line: 87, baseType: !133, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !214, file: !12, line: 88, baseType: !221, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !214, file: !12, line: 89, baseType: !93, size: 8, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !214, file: !12, line: 90, baseType: !141, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !214, file: !12, line: 91, baseType: !226, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !227, line: 46, baseType: !228)
!227 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!228 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !214, file: !12, line: 92, baseType: !230, size: 32, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !12, line: 93, baseType: !232, size: 32, offset: 544)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !12, line: 94, baseType: !212, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !214, file: !12, line: 95, baseType: !141, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !214, file: !12, line: 96, baseType: !151, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !208, file: !12, line: 102, baseType: !141, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !208, file: !12, line: 102, baseType: !141, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !208, file: !12, line: 103, baseType: !141, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !208, file: !12, line: 104, baseType: !70, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !208, file: !12, line: 105, baseType: !230, size: 32, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !208, file: !12, line: 105, baseType: !230, size: 32, offset: 416)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !208, file: !12, line: 105, baseType: !230, size: 32, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !208, file: !12, line: 106, baseType: !51, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !208, file: !12, line: 107, baseType: !245, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!248 = !{!249}
!249 = !DISubrange(count: 5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !53, file: !54, line: 113, baseType: !251, size: 320, offset: 3648)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 320, elements: !248)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!68, !51, !151}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !53, file: !54, line: 114, baseType: !256, size: 320, offset: 3968)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !248)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !53, file: !54, line: 115, baseType: !230, size: 32, offset: 4288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !53, file: !54, line: 120, baseType: !245, size: 64, offset: 4352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !53, file: !54, line: 121, baseType: !230, size: 32, offset: 4416)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscImage", file: !261, line: 6, baseType: !262)
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/image/drawimage.h", directory: "/home/users/ndemeye/xSDK")
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscImage", file: !261, line: 7, size: 6400, elements: !264)
!264 = !{!265, !268, !269, !270, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !263, file: !261, line: 8, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !263, file: !261, line: 9, baseType: !58, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !263, file: !261, line: 9, baseType: !58, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !263, file: !261, line: 10, baseType: !271, size: 128, offset: 128)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !263, file: !261, line: 11, baseType: !275, size: 6144, offset: 256)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 6144, elements: !276)
!276 = !{!277, !278}
!277 = !DISubrange(count: 256)
!278 = !DISubrange(count: 3)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !71, line: 331, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !71, line: 331, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !71, line: 338, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !71, line: 338, flags: DIFlagFwdDecl)
!285 = !{!286, !447, !0}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "DvOps", scope: !2, file: !288, line: 464, type: !289, isLocal: true, isDefinition: true)
!288 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/image/drawimage.c", directory: "/home/users/ndemeye/xSDK")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !290, line: 14, size: 2304, elements: !291)
!290 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!291 = !{!292, !343, !344, !348, !352, !356, !360, !361, !365, !366, !370, !374, !378, !379, !383, !387, !388, !394, !395, !396, !397, !402, !406, !407, !411, !412, !416, !417, !418, !419, !428, !429, !430, !435, !439, !443}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !289, file: !290, line: 15, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!68, !296}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !297, line: 25, baseType: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !290, line: 53, size: 11072, elements: !300)
!300 = !{!301, !303, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !299, file: !290, line: 54, baseType: !302, size: 4480)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !54, line: 122, baseType: !53)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !299, file: !290, line: 54, baseType: !304, size: 2304, offset: 4480)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 2304, elements: !110)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !299, file: !290, line: 55, baseType: !169, size: 64, offset: 6784)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !299, file: !290, line: 56, baseType: !169, size: 64, offset: 6848)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !299, file: !290, line: 56, baseType: !169, size: 64, offset: 6912)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !299, file: !290, line: 56, baseType: !169, size: 64, offset: 6976)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !299, file: !290, line: 56, baseType: !169, size: 64, offset: 7040)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !299, file: !290, line: 57, baseType: !169, size: 64, offset: 7104)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !299, file: !290, line: 57, baseType: !169, size: 64, offset: 7168)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !299, file: !290, line: 57, baseType: !169, size: 64, offset: 7232)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !299, file: !290, line: 57, baseType: !169, size: 64, offset: 7296)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !299, file: !290, line: 58, baseType: !315, size: 1280, offset: 7360)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1280, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 20)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !299, file: !290, line: 58, baseType: !315, size: 1280, offset: 8640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !299, file: !290, line: 59, baseType: !169, size: 64, offset: 9920)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !299, file: !290, line: 59, baseType: !169, size: 64, offset: 9984)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !299, file: !290, line: 59, baseType: !169, size: 64, offset: 10048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !299, file: !290, line: 59, baseType: !169, size: 64, offset: 10112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !299, file: !290, line: 60, baseType: !114, size: 32, offset: 10176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !299, file: !290, line: 61, baseType: !325, size: 32, offset: 10208)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !27, line: 141, baseType: !38)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !299, file: !290, line: 62, baseType: !141, size: 64, offset: 10240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !299, file: !290, line: 63, baseType: !141, size: 64, offset: 10304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !299, file: !290, line: 64, baseType: !296, size: 64, offset: 10368)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !299, file: !290, line: 65, baseType: !58, size: 32, offset: 10432)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !299, file: !290, line: 65, baseType: !58, size: 32, offset: 10464)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !299, file: !290, line: 65, baseType: !58, size: 32, offset: 10496)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !299, file: !290, line: 65, baseType: !58, size: 32, offset: 10528)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !299, file: !290, line: 66, baseType: !141, size: 64, offset: 10560)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !299, file: !290, line: 67, baseType: !141, size: 64, offset: 10624)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !299, file: !290, line: 68, baseType: !141, size: 64, offset: 10688)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !299, file: !290, line: 69, baseType: !114, size: 32, offset: 10752)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !299, file: !290, line: 70, baseType: !230, size: 32, offset: 10784)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !299, file: !290, line: 71, baseType: !114, size: 32, offset: 10816)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !299, file: !290, line: 72, baseType: !141, size: 64, offset: 10880)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !299, file: !290, line: 73, baseType: !230, size: 32, offset: 10944)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !299, file: !290, line: 74, baseType: !230, size: 32, offset: 10976)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !290, line: 75, baseType: !151, size: 64, offset: 11008)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !289, file: !290, line: 16, baseType: !293, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !289, file: !290, line: 17, baseType: !345, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!68, !296, !169, !169, !169, !169, !58}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !289, file: !290, line: 18, baseType: !349, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!68, !296, !169}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !289, file: !290, line: 19, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!68, !296, !168}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !289, file: !290, line: 20, baseType: !357, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!68, !296, !169, !169, !58}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !289, file: !290, line: 21, baseType: !349, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !289, file: !290, line: 22, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!68, !296, !169, !169, !58, !91}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !289, file: !290, line: 23, baseType: !362, size: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !289, file: !290, line: 24, baseType: !367, size: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!68, !296, !169, !169}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !289, file: !290, line: 25, baseType: !371, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!68, !296, !168, !168}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !289, file: !290, line: 26, baseType: !375, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!68, !296, !169, !169, !169, !169}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !289, file: !290, line: 27, baseType: !293, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !289, file: !290, line: 28, baseType: !380, size: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!68, !296, !169, !169, !169, !169, !58, !58, !58, !58}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !289, file: !290, line: 29, baseType: !384, size: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!68, !296, !169, !169, !169, !169, !169, !169, !58, !58, !58}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !289, file: !290, line: 30, baseType: !345, size: 64, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !289, file: !290, line: 31, baseType: !389, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!68, !296, !392, !168, !168, !168, !168}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !27, line: 207, baseType: !26)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !289, file: !290, line: 32, baseType: !293, size: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !289, file: !290, line: 33, baseType: !293, size: 64, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !289, file: !290, line: 34, baseType: !293, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !289, file: !290, line: 35, baseType: !398, size: 64, offset: 1280)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!68, !296, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !289, file: !290, line: 36, baseType: !403, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!68, !296, !91}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !289, file: !290, line: 37, baseType: !293, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !289, file: !290, line: 38, baseType: !408, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!68, !296, !58, !58}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !289, file: !290, line: 39, baseType: !293, size: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !289, file: !290, line: 40, baseType: !413, size: 64, offset: 1600)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!68, !296, !78}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !289, file: !290, line: 41, baseType: !398, size: 64, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !289, file: !290, line: 42, baseType: !398, size: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !289, file: !290, line: 43, baseType: !293, size: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !289, file: !290, line: 44, baseType: !420, size: 64, offset: 1856)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!68, !296, !423, !426, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 24, elements: !425)
!425 = !{!278}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !289, file: !290, line: 45, baseType: !375, size: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !289, file: !290, line: 46, baseType: !345, size: 64, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !289, file: !290, line: 47, baseType: !431, size: 64, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!68, !296, !169, !169, !434, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !289, file: !290, line: 48, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!68, !296, !58, !58, !168, !168}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !289, file: !290, line: 49, baseType: !440, size: 64, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!68, !296, !58, !58, !58}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !289, file: !290, line: 50, baseType: !444, size: 64, offset: 2240)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!68, !296, !169, !169, !58, !58, !91, !168, !168}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "PetscImageFontBitmap", scope: !2, file: !261, line: 205, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 7680, elements: !451)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!451 = !{!452, !453}
!452 = !DISubrange(count: 96)
!453 = !DISubrange(count: 10)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 792, elements: !455)
!455 = !{!456, !278}
!456 = !DISubrange(count: 33)
!457 = !{i32 7, !"Dwarf Version", i32 4}
!458 = !{i32 2, !"Debug Info Version", i32 3}
!459 = !{i32 1, !"wchar_size", i32 4}
!460 = !{i32 7, !"PIC Level", i32 2}
!461 = !{i32 7, !"uwtable", i32 1}
!462 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!463 = distinct !DISubprogram(name: "PetscDrawCreate_Image", scope: !288, file: !288, line: 551, type: !294, scopeLine: 552, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !475, !477, !479, !481, !483, !484, !485, !489, !490, !491, !493}
!465 = !DILocalVariable(name: "draw", arg: 1, scope: !463, file: !288, line: 551, type: !296)
!466 = !DILocalVariable(name: "img", scope: !463, file: !288, line: 553, type: !260)
!467 = !DILocalVariable(name: "w", scope: !463, file: !288, line: 554, type: !58)
!468 = !DILocalVariable(name: "h", scope: !463, file: !288, line: 554, type: !58)
!469 = !DILocalVariable(name: "size", scope: !463, file: !288, line: 555, type: !194)
!470 = !DILocalVariable(name: "nsize", scope: !463, file: !288, line: 555, type: !114)
!471 = !DILocalVariable(name: "set", scope: !463, file: !288, line: 556, type: !230)
!472 = !DILocalVariable(name: "ierr", scope: !463, file: !288, line: 557, type: !68)
!473 = !DILocalVariable(name: "ierr__", scope: !474, file: !288, line: 568, type: !68)
!474 = distinct !DILexicalBlock(scope: !463, file: !288, line: 568, column: 122)
!475 = !DILocalVariable(name: "ierr__", scope: !476, file: !288, line: 575, type: !68)
!476 = distinct !DILexicalBlock(scope: !463, file: !288, line: 575, column: 33)
!477 = !DILocalVariable(name: "ierr__", scope: !478, file: !288, line: 576, type: !68)
!478 = distinct !DILexicalBlock(scope: !463, file: !288, line: 576, column: 54)
!479 = !DILocalVariable(name: "ierr__", scope: !480, file: !288, line: 580, type: !68)
!480 = distinct !DILexicalBlock(scope: !463, file: !288, line: 580, column: 61)
!481 = !DILocalVariable(name: "i", scope: !482, file: !288, line: 583, type: !58)
!482 = distinct !DILexicalBlock(scope: !463, file: !288, line: 582, column: 3)
!483 = !DILocalVariable(name: "k", scope: !482, file: !288, line: 583, type: !58)
!484 = !DILocalVariable(name: "ncolors", scope: !482, file: !288, line: 583, type: !58)
!485 = !DILocalVariable(name: "R", scope: !482, file: !288, line: 584, type: !486)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1784, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 223)
!489 = !DILocalVariable(name: "G", scope: !482, file: !288, line: 585, type: !486)
!490 = !DILocalVariable(name: "B", scope: !482, file: !288, line: 586, type: !486)
!491 = !DILocalVariable(name: "ierr__", scope: !492, file: !288, line: 587, type: !68)
!492 = distinct !DILexicalBlock(scope: !482, file: !288, line: 587, column: 56)
!493 = !DILocalVariable(name: "ierr__", scope: !494, file: !288, line: 600, type: !68)
!494 = distinct !DILexicalBlock(scope: !495, file: !288, line: 600, column: 71)
