; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/shell/partshell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/shell/partshell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscPartitioner = type { %struct._p_PetscObject, [1 x %struct._PetscPartitionerOps], i8*, i32, i32, double, %struct._p_PetscViewer*, %struct._p_PetscViewer*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/shell/partshell.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !30, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 663, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!32 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!55 = !{!56, !60, !61, !231, !97, !265, !147, !68, !183, !120}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !57, line: 330, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !57, line: 330, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !64, line: 73, size: 4480, elements: !65)
!64 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!65 = !{!66, !69, !118, !119, !121, !124, !125, !126, !127, !135, !136, !138, !142, !146, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !159, !160, !161, !163, !164, !166, !168, !169, !170, !171, !172, !175, !177, !178, !179, !180, !181, !184, !186, !187, !188, !198, !200, !201, !205, !206, !255, !260, !262, !263, !264}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !63, file: !64, line: 74, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !68)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !63, file: !64, line: 75, baseType: !70, size: 448, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 448, elements: !116)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !64, line: 53, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 45, size: 448, elements: !73)
!73 = !{!74, !80, !88, !93, !100, !104, !111}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !72, file: !64, line: 46, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !61, !79}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !68)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !72, file: !64, line: 47, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!78, !61, !84}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !85, line: 16, baseType: !86)
!85 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !85, line: 16, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !72, file: !64, line: 48, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!78, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !72, file: !64, line: 49, baseType: !94, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!78, !61, !97, !61}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !72, file: !64, line: 50, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!78, !61, !97, !92}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !72, file: !64, line: 51, baseType: !105, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!78, !61, !97, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !72, file: !64, line: 52, baseType: !112, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!78, !61, !97, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !63, file: !64, line: 76, baseType: !56, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !64, line: 77, baseType: !120, size: 32, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !68)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !63, file: !64, line: 78, baseType: !122, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !123)
!123 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !63, file: !64, line: 78, baseType: !122, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !63, file: !64, line: 78, baseType: !122, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !63, file: !64, line: 78, baseType: !122, size: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !64, line: 79, baseType: !128, size: 64, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !131, line: 27, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !133, line: 43, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!134 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !63, file: !64, line: 80, baseType: !120, size: 32, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !63, file: !64, line: 81, baseType: !137, size: 32, offset: 992)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !68)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !63, file: !64, line: 82, baseType: !139, size: 64, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !63, file: !64, line: 83, baseType: !143, size: 64, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !63, file: !64, line: 84, baseType: !147, size: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !63, file: !64, line: 85, baseType: !147, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !63, file: !64, line: 86, baseType: !147, size: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !63, file: !64, line: 87, baseType: !147, size: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !63, file: !64, line: 88, baseType: !61, size: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !63, file: !64, line: 89, baseType: !128, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 90, baseType: !147, size: 64, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !63, file: !64, line: 91, baseType: !147, size: 64, offset: 1600)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !63, file: !64, line: 92, baseType: !120, size: 32, offset: 1664)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !63, file: !64, line: 93, baseType: !60, size: 64, offset: 1728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !63, file: !64, line: 94, baseType: !158, size: 64, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !129)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !63, file: !64, line: 95, baseType: !120, size: 32, offset: 1856)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !63, file: !64, line: 95, baseType: !120, size: 32, offset: 1888)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !63, file: !64, line: 96, baseType: !162, size: 64, offset: 1920)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !63, file: !64, line: 96, baseType: !162, size: 64, offset: 1984)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !63, file: !64, line: 97, baseType: !165, size: 64, offset: 2048)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !63, file: !64, line: 97, baseType: !167, size: 64, offset: 2112)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !63, file: !64, line: 98, baseType: !120, size: 32, offset: 2176)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !63, file: !64, line: 98, baseType: !120, size: 32, offset: 2208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !63, file: !64, line: 99, baseType: !162, size: 64, offset: 2240)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !63, file: !64, line: 99, baseType: !162, size: 64, offset: 2304)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !63, file: !64, line: 100, baseType: !173, size: 64, offset: 2368)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !123)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !63, file: !64, line: 100, baseType: !176, size: 64, offset: 2432)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !63, file: !64, line: 101, baseType: !120, size: 32, offset: 2496)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !63, file: !64, line: 101, baseType: !120, size: 32, offset: 2528)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !63, file: !64, line: 102, baseType: !162, size: 64, offset: 2560)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !63, file: !64, line: 102, baseType: !162, size: 64, offset: 2624)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !63, file: !64, line: 103, baseType: !182, size: 64, offset: 2688)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !63, file: !64, line: 103, baseType: !185, size: 64, offset: 2752)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !63, file: !64, line: 104, baseType: !115, size: 64, offset: 2816)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !63, file: !64, line: 105, baseType: !120, size: 32, offset: 2880)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !63, file: !64, line: 106, baseType: !189, size: 128, offset: 2944)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, elements: !196)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !64, line: 64, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 61, size: 128, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !192, file: !64, line: 62, baseType: !108, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !192, file: !64, line: 63, baseType: !60, size: 64, offset: 64)
!196 = !{!197}
!197 = !DISubrange(count: 2)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !63, file: !64, line: 107, baseType: !199, size: 64, offset: 3072)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !196)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !63, file: !64, line: 108, baseType: !60, size: 64, offset: 3136)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !63, file: !64, line: 109, baseType: !202, size: 64, offset: 3200)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!78, !60}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !63, file: !64, line: 111, baseType: !120, size: 32, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !63, file: !64, line: 112, baseType: !207, size: 320, offset: 3328)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !253)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!78, !211, !61, !60}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !214)
!214 = !{!215, !216, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !213, file: !10, line: 100, baseType: !120, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !10, line: 101, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !228, !229, !230, !234, !236, !238, !239, !240}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !219, file: !10, line: 84, baseType: !147, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !219, file: !10, line: 85, baseType: !147, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !219, file: !10, line: 86, baseType: !60, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !219, file: !10, line: 87, baseType: !139, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !219, file: !10, line: 88, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !219, file: !10, line: 89, baseType: !99, size: 8, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !219, file: !10, line: 90, baseType: !147, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !219, file: !10, line: 91, baseType: !231, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 46, baseType: !233)
!232 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!233 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !219, file: !10, line: 92, baseType: !235, size: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !10, line: 93, baseType: !237, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !10, line: 94, baseType: !217, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !219, file: !10, line: 95, baseType: !147, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !219, file: !10, line: 96, baseType: !60, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !213, file: !10, line: 102, baseType: !147, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !213, file: !10, line: 102, baseType: !147, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !213, file: !10, line: 103, baseType: !147, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !213, file: !10, line: 104, baseType: !56, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !213, file: !10, line: 105, baseType: !235, size: 32, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !213, file: !10, line: 105, baseType: !235, size: 32, offset: 416)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !213, file: !10, line: 105, baseType: !235, size: 32, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !213, file: !10, line: 106, baseType: !61, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !213, file: !10, line: 107, baseType: !250, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!253 = !{!254}
!254 = !DISubrange(count: 5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !63, file: !64, line: 113, baseType: !256, size: 320, offset: 3648)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!78, !61, !60}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !63, file: !64, line: 114, baseType: !261, size: 320, offset: 3968)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 320, elements: !253)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !63, file: !64, line: 115, baseType: !235, size: 32, offset: 4288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !63, file: !64, line: 120, baseType: !250, size: 64, offset: 4352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !63, file: !64, line: 121, baseType: !235, size: 32, offset: 4416)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner_Shell", file: !267, line: 7, baseType: !268)
!267 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/shell/partshell.c", directory: "/home/users/ndemeye/xSDK")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 3, size: 192, elements: !269)
!269 = !{!270, !275, !280}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !268, file: !267, line: 4, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !272, line: 18, baseType: !273)
!272 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !272, line: 18, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !268, file: !267, line: 5, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !277, line: 11, baseType: !278)
!277 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !277, line: 11, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !268, file: !267, line: 6, baseType: !235, size: 32, offset: 128)
!281 = !{i32 7, !"Dwarf Version", i32 4}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{i32 7, !"PIC Level", i32 2}
!285 = !{i32 7, !"uwtable", i32 1}
!286 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!287 = distinct !DISubprogram(name: "PetscPartitionerCreate_Shell", scope: !267, file: !267, line: 139, type: !288, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !328)
!288 = !DISubroutineType(types: !289)
!289 = !{!78, !290}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !291, line: 13, baseType: !292)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !294, line: 21, size: 5312, elements: !295)
!294 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/partitionerimpl.h", directory: "/home/users/ndemeye/xSDK")
!295 = !{!296, !298, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !293, file: !294, line: 22, baseType: !297, size: 4480)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !64, line: 122, baseType: !63)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !293, file: !294, line: 22, baseType: !299, size: 384, offset: 4480)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 384, elements: !116)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscPartitionerOps", file: !294, line: 12, size: 384, elements: !301)
!301 = !{!302, !306, !308, !309, !313, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !300, file: !294, line: 13, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!78, !211, !290}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !300, file: !294, line: 14, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !300, file: !294, line: 15, baseType: !307, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !300, file: !294, line: 16, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!78, !290, !84}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !300, file: !294, line: 17, baseType: !307, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !300, file: !294, line: 18, baseType: !315, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!78, !290, !120, !120, !165, !165, !271, !271, !271, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !294, line: 23, baseType: !60, size: 64, offset: 4864)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !293, file: !294, line: 24, baseType: !120, size: 32, offset: 4928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "edgeCut", scope: !293, file: !294, line: 25, baseType: !120, size: 32, offset: 4960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !293, file: !294, line: 26, baseType: !174, size: 64, offset: 4992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !293, file: !294, line: 27, baseType: !84, size: 64, offset: 5056)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "viewerGraph", scope: !293, file: !294, line: 28, baseType: !84, size: 64, offset: 5120)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "viewGraph", scope: !293, file: !294, line: 29, baseType: !235, size: 32, offset: 5184)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "noGraph", scope: !293, file: !294, line: 30, baseType: !235, size: 32, offset: 5216)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "usevwgt", scope: !293, file: !294, line: 31, baseType: !235, size: 32, offset: 5248)
!328 = !{!329, !330, !331, !332, !334}
!329 = !DILocalVariable(name: "part", arg: 1, scope: !287, file: !267, line: 139, type: !290)
!330 = !DILocalVariable(name: "p", scope: !287, file: !267, line: 141, type: !265)
!331 = !DILocalVariable(name: "ierr", scope: !287, file: !267, line: 142, type: !78)
!332 = !DILocalVariable(name: "ierr__", scope: !333, file: !267, line: 146, type: !78)
!333 = distinct !DILexicalBlock(scope: !287, file: !267, line: 146, column: 38)
!334 = !DILocalVariable(name: "ierr__", scope: !335, file: !267, line: 149, type: !78)
!335 = distinct !DILexicalBlock(scope: !287, file: !267, line: 149, column: 49)
!336 = !DILocation(line: 0, scope: !287)
!337 = !DILocation(line: 141, column: 3, scope: !287)
!338 = !DILocation(line: 144, column: 3, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !267, line: 144, column: 3)
!340 = distinct !DILexicalBlock(scope: !341, file: !267, line: 144, column: 3)
!341 = distinct !DILexicalBlock(scope: !287, file: !267, line: 144, column: 3)
!342 = !{!343, !343, i64 0}
!343 = !{!"any pointer", !344, i64 0}
!344 = !{!"omnipotent char", !345, i64 0}
!345 = !{!"Simple C/C++ TBAA"}
!346 = !DILocation(line: 144, column: 3, scope: !340)
!347 = !DILocation(line: 144, column: 3, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !267, line: 144, column: 3)
!349 = distinct !DILexicalBlock(scope: !339, file: !267, line: 144, column: 3)
!350 = !{!351, !352, i64 1536}
!351 = !{!"", !344, i64 0, !344, i64 512, !344, i64 1024, !344, i64 1280, !352, i64 1536, !352, i64 1540, !344, i64 1544}
!352 = !{!"int", !344, i64 0}
!353 = !DILocation(line: 144, column: 3, scope: !349)
!354 = !DILocation(line: 144, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !348, file: !267, line: 144, column: 3)
!356 = !{!352, !352, i64 0}
!357 = !{!351, !352, i64 1540}
!358 = !DILocation(line: 145, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !267, line: 145, column: 3)
!360 = distinct !DILexicalBlock(scope: !287, file: !267, line: 145, column: 3)
!361 = !DILocation(line: 145, column: 3, scope: !360)
!362 = !DILocation(line: 145, column: 3, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !267, line: 145, column: 3)
!364 = !DILocation(line: 145, column: 3, scope: !365)
!365 = distinct !DILexicalBlock(scope: !360, file: !267, line: 145, column: 3)
!366 = !{!367, !352, i64 0}
!367 = !{!"_p_PetscObject", !352, i64 0, !344, i64 8, !343, i64 64, !352, i64 72, !368, i64 80, !368, i64 88, !368, i64 96, !368, i64 104, !369, i64 112, !352, i64 120, !352, i64 124, !343, i64 128, !343, i64 136, !343, i64 144, !343, i64 152, !343, i64 160, !343, i64 168, !343, i64 176, !369, i64 184, !343, i64 192, !343, i64 200, !352, i64 208, !343, i64 216, !369, i64 224, !352, i64 232, !352, i64 236, !343, i64 240, !343, i64 248, !343, i64 256, !343, i64 264, !352, i64 272, !352, i64 276, !343, i64 280, !343, i64 288, !343, i64 296, !343, i64 304, !352, i64 312, !352, i64 316, !343, i64 320, !343, i64 328, !343, i64 336, !343, i64 344, !343, i64 352, !352, i64 360, !344, i64 368, !344, i64 384, !343, i64 392, !343, i64 400, !352, i64 408, !344, i64 416, !344, i64 456, !344, i64 496, !344, i64 536, !343, i64 544, !344, i64 552}
!368 = !{!"double", !344, i64 0}
!369 = !{!"long", !344, i64 0}
!370 = !DILocation(line: 145, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !267, line: 145, column: 3)
!372 = distinct !DILexicalBlock(scope: !365, file: !267, line: 145, column: 3)
!373 = !DILocation(line: 145, column: 3, scope: !372)
!374 = !DILocation(line: 146, column: 16, scope: !287)
!375 = !{!"branch_weights", i32 2146410443, i32 1073205}
!376 = !DILocation(line: 0, scope: !333)
!377 = !DILocation(line: 146, column: 38, scope: !333)
!378 = !{!"branch_weights", i32 2000, i32 1}
