; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ls/ls.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ls/ls.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!204 = !DIEnumerator(name: "MATOP_IS_HERMITIAN", value: 85, isUnsigned: true)
!205 = !DIEnumerator(name: "MATOP_IS_STRUCTURALLY_SYMMETRIC", value: 86, isUnsigned: true)
!206 = !DIEnumerator(name: "MATOP_SET_VALUES_BLOCKEDLOCAL", value: 87, isUnsigned: true)
!207 = !DIEnumerator(name: "MATOP_CREATE_VECS", value: 88, isUnsigned: true)
!208 = !DIEnumerator(name: "MATOP_MAT_MULT", value: 89, isUnsigned: true)
!209 = !DIEnumerator(name: "MATOP_MAT_MULT_SYMBOLIC", value: 90, isUnsigned: true)
!210 = !DIEnumerator(name: "MATOP_MAT_MULT_NUMERIC", value: 91, isUnsigned: true)
!211 = !DIEnumerator(name: "MATOP_PTAP", value: 92, isUnsigned: true)
!212 = !DIEnumerator(name: "MATOP_PTAP_SYMBOLIC", value: 93, isUnsigned: true)
!213 = !DIEnumerator(name: "MATOP_PTAP_NUMERIC", value: 94, isUnsigned: true)
!214 = !DIEnumerator(name: "MATOP_MAT_TRANSPOSE_MULT", value: 95, isUnsigned: true)
!215 = !DIEnumerator(name: "MATOP_MAT_TRANSPOSE_MULT_SYMBO", value: 96, isUnsigned: true)
!216 = !DIEnumerator(name: "MATOP_MAT_TRANSPOSE_MULT_NUMER", value: 97, isUnsigned: true)
!217 = !DIEnumerator(name: "MATOP_PRODUCTSETFROMOPTIONS", value: 99, isUnsigned: true)
!218 = !DIEnumerator(name: "MATOP_PRODUCTSYMBOLIC", value: 100, isUnsigned: true)
!219 = !DIEnumerator(name: "MATOP_PRODUCTNUMERIC", value: 101, isUnsigned: true)
!220 = !DIEnumerator(name: "MATOP_CONJUGATE", value: 102, isUnsigned: true)
!221 = !DIEnumerator(name: "MATOP_SET_VALUES_ROW", value: 104, isUnsigned: true)
!222 = !DIEnumerator(name: "MATOP_REAL_PART", value: 105, isUnsigned: true)
!223 = !DIEnumerator(name: "MATOP_IMAGINARY_PART", value: 106, isUnsigned: true)
!224 = !DIEnumerator(name: "MATOP_GET_ROW_UPPER_TRIANGULAR", value: 107, isUnsigned: true)
!225 = !DIEnumerator(name: "MATOP_RESTORE_ROW_UPPER_TRIANG", value: 108, isUnsigned: true)
!226 = !DIEnumerator(name: "MATOP_MAT_SOLVE", value: 109, isUnsigned: true)
!227 = !DIEnumerator(name: "MATOP_MAT_SOLVE_TRANSPOSE", value: 110, isUnsigned: true)
!228 = !DIEnumerator(name: "MATOP_GET_ROW_MIN", value: 111, isUnsigned: true)
!229 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!236 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!237 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!238 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !{!264, !282, !363, !303, !343, !472, !475, !353, !26, !329, !438, !5}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !267, line: 73, size: 4480, elements: !268)
!267 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!268 = !{!269, !271, !324, !325, !327, !330, !331, !332, !333, !341, !342, !344, !348, !352, !354, !355, !356, !357, !358, !359, !360, !361, !362, !364, !366, !367, !368, !370, !371, !373, !375, !376, !377, !378, !379, !382, !384, !385, !386, !387, !388, !391, !393, !394, !395, !405, !407, !408, !412, !413, !462, !467, !469, !470, !471}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !266, file: !267, line: 74, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !266, file: !267, line: 75, baseType: !272, size: 448, offset: 64)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 448, elements: !322)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !267, line: 53, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 45, size: 448, elements: !275)
!275 = !{!276, !286, !294, !299, !306, !310, !317}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !274, file: !267, line: 46, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !264, !281}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !283, line: 330, baseType: !284)
!283 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !283, line: 330, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !274, file: !267, line: 47, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!280, !264, !290}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !291, line: 16, baseType: !292)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !291, line: 16, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !274, file: !267, line: 48, baseType: !295, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!280, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !274, file: !267, line: 49, baseType: !300, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!280, !264, !303, !264}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !274, file: !267, line: 50, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!280, !264, !303, !298}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !274, file: !267, line: 51, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!280, !264, !303, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !274, file: !267, line: 52, baseType: !318, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!280, !264, !303, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!322 = !{!323}
!323 = !DISubrange(count: 1)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !266, file: !267, line: 76, baseType: !282, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !267, line: 77, baseType: !326, size: 32, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !266, file: !267, line: 78, baseType: !328, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !329)
!329 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !266, file: !267, line: 78, baseType: !328, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !266, file: !267, line: 78, baseType: !328, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !266, file: !267, line: 78, baseType: !328, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !266, file: !267, line: 79, baseType: !334, size: 64, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !337, line: 27, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !339, line: 43, baseType: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!340 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !266, file: !267, line: 80, baseType: !326, size: 32, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !266, file: !267, line: 81, baseType: !343, size: 32, offset: 992)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !266, file: !267, line: 82, baseType: !345, size: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !266, file: !267, line: 83, baseType: !349, size: 64, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !266, file: !267, line: 84, baseType: !353, size: 64, offset: 1152)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !266, file: !267, line: 85, baseType: !353, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !266, file: !267, line: 86, baseType: !353, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !266, file: !267, line: 87, baseType: !353, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !266, file: !267, line: 88, baseType: !264, size: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !266, file: !267, line: 89, baseType: !334, size: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !267, line: 90, baseType: !353, size: 64, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !266, file: !267, line: 91, baseType: !353, size: 64, offset: 1600)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !266, file: !267, line: 92, baseType: !326, size: 32, offset: 1664)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !266, file: !267, line: 93, baseType: !363, size: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !267, line: 94, baseType: !365, size: 64, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !335)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !266, file: !267, line: 95, baseType: !326, size: 32, offset: 1856)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !266, file: !267, line: 95, baseType: !326, size: 32, offset: 1888)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !266, file: !267, line: 96, baseType: !369, size: 64, offset: 1920)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !266, file: !267, line: 96, baseType: !369, size: 64, offset: 1984)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !266, file: !267, line: 97, baseType: !372, size: 64, offset: 2048)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !266, file: !267, line: 97, baseType: !374, size: 64, offset: 2112)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !266, file: !267, line: 98, baseType: !326, size: 32, offset: 2176)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !266, file: !267, line: 98, baseType: !326, size: 32, offset: 2208)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !266, file: !267, line: 99, baseType: !369, size: 64, offset: 2240)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !266, file: !267, line: 99, baseType: !369, size: 64, offset: 2304)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !266, file: !267, line: 100, baseType: !380, size: 64, offset: 2368)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !329)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !266, file: !267, line: 100, baseType: !383, size: 64, offset: 2432)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !266, file: !267, line: 101, baseType: !326, size: 32, offset: 2496)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !266, file: !267, line: 101, baseType: !326, size: 32, offset: 2528)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !266, file: !267, line: 102, baseType: !369, size: 64, offset: 2560)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !266, file: !267, line: 102, baseType: !369, size: 64, offset: 2624)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !266, file: !267, line: 103, baseType: !389, size: 64, offset: 2688)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !381)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !266, file: !267, line: 103, baseType: !392, size: 64, offset: 2752)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !266, file: !267, line: 104, baseType: !321, size: 64, offset: 2816)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !266, file: !267, line: 105, baseType: !326, size: 32, offset: 2880)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !266, file: !267, line: 106, baseType: !396, size: 128, offset: 2944)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, elements: !403)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !267, line: 64, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 61, size: 128, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !399, file: !267, line: 62, baseType: !314, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !399, file: !267, line: 63, baseType: !363, size: 64, offset: 64)
!403 = !{!404}
!404 = !DISubrange(count: 2)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !266, file: !267, line: 107, baseType: !406, size: 64, offset: 3072)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, elements: !403)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !266, file: !267, line: 108, baseType: !363, size: 64, offset: 3136)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !266, file: !267, line: 109, baseType: !409, size: 64, offset: 3200)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!280, !363}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !266, file: !267, line: 111, baseType: !326, size: 32, offset: 3264)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !266, file: !267, line: 112, baseType: !414, size: 320, offset: 3328)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 320, elements: !460)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!280, !418, !264, !363}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !421)
!421 = !{!422, !423, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !420, file: !10, line: 100, baseType: !326, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !10, line: 101, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !435, !436, !437, !441, !443, !445, !446, !447}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !426, file: !10, line: 84, baseType: !353, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !426, file: !10, line: 85, baseType: !353, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !10, line: 86, baseType: !363, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !426, file: !10, line: 87, baseType: !345, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !426, file: !10, line: 88, baseType: !433, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !426, file: !10, line: 89, baseType: !305, size: 8, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !426, file: !10, line: 90, baseType: !353, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !426, file: !10, line: 91, baseType: !438, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !439, line: 46, baseType: !440)
!439 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!440 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !426, file: !10, line: 92, baseType: !442, size: 32, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !10, line: 93, baseType: !444, size: 32, offset: 544)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !10, line: 94, baseType: !424, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !426, file: !10, line: 95, baseType: !353, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !426, file: !10, line: 96, baseType: !363, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !420, file: !10, line: 102, baseType: !353, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !420, file: !10, line: 102, baseType: !353, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !420, file: !10, line: 103, baseType: !353, size: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !420, file: !10, line: 104, baseType: !282, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !420, file: !10, line: 105, baseType: !442, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !420, file: !10, line: 105, baseType: !442, size: 32, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !420, file: !10, line: 105, baseType: !442, size: 32, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !420, file: !10, line: 106, baseType: !264, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !420, file: !10, line: 107, baseType: !457, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!460 = !{!461}
!461 = !DISubrange(count: 5)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !266, file: !267, line: 113, baseType: !463, size: 320, offset: 3648)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 320, elements: !460)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!280, !264, !363}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !266, file: !267, line: 114, baseType: !468, size: 320, offset: 3968)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 320, elements: !460)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !266, file: !267, line: 115, baseType: !442, size: 32, offset: 4288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !266, file: !267, line: 120, baseType: !457, size: 64, offset: 4352)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !266, file: !267, line: 121, baseType: !442, size: 32, offset: 4416)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !283, line: 331, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !283, line: 331, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !283, line: 338, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !283, line: 338, flags: DIFlagFwdDecl)
!478 = !{i32 7, !"Dwarf Version", i32 4}
!479 = !{i32 2, !"Debug Info Version", i32 3}
!480 = !{i32 1, !"wchar_size", i32 4}
!481 = !{i32 7, !"PIC Level", i32 2}
!482 = !{i32 7, !"uwtable", i32 1}
!483 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!484 = distinct !DISubprogram(name: "SNESSolve_NEWTONLS", scope: !485, file: !485, line: 134, type: !486, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !674)
!485 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ls/ls.c", directory: "/home/users/ndemeye/xSDK")
!486 = !DISubroutineType(types: !487)
!487 = !{!280, !488}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !491, line: 38, size: 11648, elements: !492)
!491 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!492 = !{!493, !495, !559, !564, !565, !566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !581, !585, !586, !588, !589, !590, !591, !592, !597, !599, !600, !601, !602, !603, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !641, !642, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !490, file: !491, line: 39, baseType: !494, size: 4480)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !267, line: 122, baseType: !266)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !490, file: !491, line: 39, baseType: !496, size: 1088, offset: 4480)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 1088, elements: !322)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !491, line: 12, size: 1088, elements: !498)
!498 = !{!499, !506, !510, !514, !520, !521, !523, !524, !528, !532, !533, !534, !539, !543, !547, !551, !558}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !497, file: !491, line: 13, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!280, !488, !503, !363}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !87, line: 21, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !87, line: 21, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !497, file: !491, line: 14, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!280, !503, !503, !363}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !497, file: !491, line: 15, baseType: !511, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!280, !488, !326}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !497, file: !491, line: 16, baseType: !515, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!280, !488, !326, !381, !381, !381, !518, !363}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !497, file: !491, line: 17, baseType: !409, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !497, file: !491, line: 18, baseType: !522, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !497, file: !491, line: 19, baseType: !522, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !497, file: !491, line: 20, baseType: !525, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!280, !488, !290}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !497, file: !491, line: 21, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!280, !418, !488}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !497, file: !491, line: 22, baseType: !522, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !497, file: !491, line: 23, baseType: !522, size: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !497, file: !491, line: 24, baseType: !535, size: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!280, !488, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !497, file: !491, line: 25, baseType: !540, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!280, !538}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !497, file: !491, line: 26, baseType: !544, size: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!280, !488, !503, !503}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !497, file: !491, line: 27, baseType: !548, size: 64, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!280, !488, !503, !503, !363}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !497, file: !491, line: 28, baseType: !552, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!280, !488, !503, !555, !555, !363}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !497, file: !491, line: 29, baseType: !525, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !490, file: !491, line: 40, baseType: !560, size: 64, offset: 5568)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !561, line: 14, baseType: !562)
!561 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !561, line: 14, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !490, file: !491, line: 41, baseType: !442, size: 32, offset: 5632)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !490, file: !491, line: 42, baseType: !488, size: 64, offset: 5696)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !490, file: !491, line: 43, baseType: !567, size: 32, offset: 5760)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !490, file: !491, line: 44, baseType: !442, size: 32, offset: 5792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !490, file: !491, line: 47, baseType: !363, size: 64, offset: 5824)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !490, file: !491, line: 49, baseType: !503, size: 64, offset: 5888)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !490, file: !491, line: 50, baseType: !503, size: 64, offset: 5952)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !490, file: !491, line: 52, baseType: !503, size: 64, offset: 6016)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !490, file: !491, line: 54, baseType: !555, size: 64, offset: 6080)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !490, file: !491, line: 55, baseType: !555, size: 64, offset: 6144)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !490, file: !491, line: 56, baseType: !555, size: 64, offset: 6208)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !490, file: !491, line: 57, baseType: !363, size: 64, offset: 6272)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !490, file: !491, line: 58, baseType: !578, size: 64, offset: 6336)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !95, line: 22, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !95, line: 22, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !490, file: !491, line: 59, baseType: !582, size: 64, offset: 6400)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !490, file: !491, line: 60, baseType: !442, size: 32, offset: 6464)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !490, file: !491, line: 61, baseType: !587, size: 32, offset: 6496)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !490, file: !491, line: 63, baseType: !503, size: 64, offset: 6528)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !490, file: !491, line: 65, baseType: !503, size: 64, offset: 6592)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !490, file: !491, line: 66, baseType: !363, size: 64, offset: 6656)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !490, file: !491, line: 68, baseType: !381, size: 64, offset: 6720)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !490, file: !491, line: 74, baseType: !593, size: 320, offset: 6784)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 320, elements: !460)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!280, !488, !326, !381, !363}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !490, file: !491, line: 75, baseType: !598, size: 320, offset: 7104)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 320, elements: !460)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !490, file: !491, line: 76, baseType: !468, size: 320, offset: 7424)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !490, file: !491, line: 77, baseType: !326, size: 32, offset: 7744)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !490, file: !491, line: 78, baseType: !363, size: 64, offset: 7808)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !490, file: !491, line: 79, baseType: !519, size: 32, offset: 7872)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !490, file: !491, line: 80, baseType: !604, size: 320, offset: 7936)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 320, elements: !460)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!280, !488, !363}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !490, file: !491, line: 81, baseType: !598, size: 320, offset: 8256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !490, file: !491, line: 82, baseType: !468, size: 320, offset: 8576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !490, file: !491, line: 83, baseType: !326, size: 32, offset: 8896)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !490, file: !491, line: 84, baseType: !442, size: 32, offset: 8928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !490, file: !491, line: 88, baseType: !442, size: 32, offset: 8960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !491, line: 89, baseType: !363, size: 64, offset: 9024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !490, file: !491, line: 93, baseType: !326, size: 32, offset: 9088)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !490, file: !491, line: 94, baseType: !326, size: 32, offset: 9120)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !490, file: !491, line: 95, baseType: !326, size: 32, offset: 9152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !490, file: !491, line: 96, baseType: !326, size: 32, offset: 9184)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !490, file: !491, line: 97, baseType: !326, size: 32, offset: 9216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !490, file: !491, line: 98, baseType: !381, size: 64, offset: 9280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !490, file: !491, line: 99, baseType: !381, size: 64, offset: 9344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !490, file: !491, line: 100, baseType: !381, size: 64, offset: 9408)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !490, file: !491, line: 101, baseType: !381, size: 64, offset: 9472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !490, file: !491, line: 102, baseType: !381, size: 64, offset: 9536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !490, file: !491, line: 103, baseType: !381, size: 64, offset: 9600)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !490, file: !491, line: 104, baseType: !381, size: 64, offset: 9664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !490, file: !491, line: 105, baseType: !381, size: 64, offset: 9728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !490, file: !491, line: 106, baseType: !442, size: 32, offset: 9792)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !490, file: !491, line: 107, baseType: !326, size: 32, offset: 9824)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !490, file: !491, line: 108, baseType: !326, size: 32, offset: 9856)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !490, file: !491, line: 109, baseType: !326, size: 32, offset: 9888)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !490, file: !491, line: 110, baseType: !442, size: 32, offset: 9920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !490, file: !491, line: 111, baseType: !326, size: 32, offset: 9952)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !490, file: !491, line: 112, baseType: !442, size: 32, offset: 9984)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !490, file: !491, line: 113, baseType: !326, size: 32, offset: 10016)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !490, file: !491, line: 115, baseType: !442, size: 32, offset: 10048)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !490, file: !491, line: 117, baseType: !442, size: 32, offset: 10080)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !490, file: !491, line: 119, baseType: !638, size: 32, offset: 10112)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !490, file: !491, line: 120, baseType: !640, size: 32, offset: 10144)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !490, file: !491, line: 124, baseType: !326, size: 32, offset: 10176)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !490, file: !491, line: 125, baseType: !643, size: 64, offset: 10240)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !490, file: !491, line: 129, baseType: !326, size: 32, offset: 10304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !490, file: !491, line: 130, baseType: !380, size: 64, offset: 10368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !490, file: !491, line: 132, baseType: !372, size: 64, offset: 10432)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !490, file: !491, line: 133, baseType: !326, size: 32, offset: 10496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !490, file: !491, line: 134, baseType: !326, size: 32, offset: 10528)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !490, file: !491, line: 135, baseType: !442, size: 32, offset: 10560)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !490, file: !491, line: 136, baseType: !442, size: 32, offset: 10592)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !490, file: !491, line: 137, baseType: !442, size: 32, offset: 10624)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !490, file: !491, line: 140, baseType: !326, size: 32, offset: 10656)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !490, file: !491, line: 141, baseType: !326, size: 32, offset: 10688)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !490, file: !491, line: 143, baseType: !326, size: 32, offset: 10720)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !490, file: !491, line: 144, baseType: !326, size: 32, offset: 10752)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !490, file: !491, line: 146, baseType: !442, size: 32, offset: 10784)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !490, file: !491, line: 147, baseType: !442, size: 32, offset: 10816)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !490, file: !491, line: 148, baseType: !442, size: 32, offset: 10848)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !490, file: !491, line: 150, baseType: !442, size: 32, offset: 10880)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !490, file: !491, line: 151, baseType: !363, size: 64, offset: 10944)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !490, file: !491, line: 154, baseType: !381, size: 64, offset: 11008)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !490, file: !491, line: 155, baseType: !381, size: 64, offset: 11072)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !490, file: !491, line: 157, baseType: !643, size: 64, offset: 11136)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !490, file: !491, line: 158, baseType: !326, size: 32, offset: 11200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !490, file: !491, line: 160, baseType: !442, size: 32, offset: 11232)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !490, file: !491, line: 161, baseType: !442, size: 32, offset: 11264)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !490, file: !491, line: 162, baseType: !326, size: 32, offset: 11296)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !490, file: !491, line: 164, baseType: !381, size: 64, offset: 11328)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !490, file: !491, line: 165, baseType: !503, size: 64, offset: 11392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !490, file: !491, line: 165, baseType: !503, size: 64, offset: 11456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !490, file: !491, line: 166, baseType: !326, size: 32, offset: 11520)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !490, file: !491, line: 167, baseType: !442, size: 32, offset: 11552)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !490, file: !491, line: 169, baseType: !442, size: 32, offset: 11584)
!674 = !{!675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !693, !695, !697, !701, !703, !705, !707, !712, !714, !720, !721, !723, !727, !728, !730, !736, !737, !739, !742, !743, !745, !748, !749, !751, !753, !755, !757, !759, !766, !772, !774, !776, !778, !780, !782, !786, !788, !790, !794, !795, !797, !798, !799, !801, !804, !805, !807, !810, !811, !813, !816, !817, !819, !821, !824, !825, !826, !828, !830, !835, !837, !838, !839, !841, !844, !845, !847, !850, !851, !853, !856, !857, !862, !864, !866, !870, !872, !874, !876, !878, !884, !885, !887, !888, !889, !891, !894, !895, !897, !900, !901, !903, !906, !907, !912, !914, !917, !919, !921, !923, !925, !927, !929}
!675 = !DILocalVariable(name: "snes", arg: 1, scope: !484, file: !485, line: 134, type: !488)
!676 = !DILocalVariable(name: "ierr", scope: !484, file: !485, line: 136, type: !280)
!677 = !DILocalVariable(name: "maxits", scope: !484, file: !485, line: 137, type: !326)
!678 = !DILocalVariable(name: "i", scope: !484, file: !485, line: 137, type: !326)
!679 = !DILocalVariable(name: "lits", scope: !484, file: !485, line: 137, type: !326)
!680 = !DILocalVariable(name: "lssucceed", scope: !484, file: !485, line: 138, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !72)
!682 = !DILocalVariable(name: "fnorm", scope: !484, file: !485, line: 139, type: !381)
!683 = !DILocalVariable(name: "gnorm", scope: !484, file: !485, line: 139, type: !381)
!684 = !DILocalVariable(name: "xnorm", scope: !484, file: !485, line: 139, type: !381)
!685 = !DILocalVariable(name: "ynorm", scope: !484, file: !485, line: 139, type: !381)
!686 = !DILocalVariable(name: "Y", scope: !484, file: !485, line: 140, type: !503)
!687 = !DILocalVariable(name: "X", scope: !484, file: !485, line: 140, type: !503)
!688 = !DILocalVariable(name: "F", scope: !484, file: !485, line: 140, type: !503)
!689 = !DILocalVariable(name: "linesearch", scope: !484, file: !485, line: 141, type: !582)
!690 = !DILocalVariable(name: "reason", scope: !484, file: !485, line: 142, type: !519)
!691 = !DILocalVariable(name: "ierr__", scope: !692, file: !485, line: 156, type: !280)
!692 = distinct !DILexicalBlock(scope: !484, file: !485, line: 156, column: 61)
!693 = !DILocalVariable(name: "ierr__", scope: !694, file: !485, line: 159, type: !280)
!694 = distinct !DILexicalBlock(scope: !484, file: !485, line: 159, column: 62)
!695 = !DILocalVariable(name: "ierr__", scope: !696, file: !485, line: 160, type: !280)
!696 = distinct !DILexicalBlock(scope: !484, file: !485, line: 160, column: 53)
!697 = !DILocalVariable(name: "ierr__", scope: !698, file: !485, line: 164, type: !280)
!698 = distinct !DILexicalBlock(scope: !699, file: !485, line: 164, column: 40)
!699 = distinct !DILexicalBlock(scope: !700, file: !485, line: 163, column: 95)
!700 = distinct !DILexicalBlock(scope: !484, file: !485, line: 163, column: 7)
!701 = !DILocalVariable(name: "ierr__", scope: !702, file: !485, line: 165, type: !280)
!702 = distinct !DILexicalBlock(scope: !699, file: !485, line: 165, column: 54)
!703 = !DILocalVariable(name: "ierr__", scope: !704, file: !485, line: 171, type: !280)
!704 = distinct !DILexicalBlock(scope: !699, file: !485, line: 171, column: 42)
!705 = !DILocalVariable(name: "ierr__", scope: !706, file: !485, line: 172, type: !280)
!706 = distinct !DILexicalBlock(scope: !699, file: !485, line: 172, column: 40)
!707 = !DILocalVariable(name: "ierr__", scope: !708, file: !485, line: 175, type: !280)
!708 = distinct !DILexicalBlock(scope: !709, file: !485, line: 175, column: 44)
!709 = distinct !DILexicalBlock(scope: !710, file: !485, line: 174, column: 35)
!710 = distinct !DILexicalBlock(scope: !711, file: !485, line: 174, column: 9)
