; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgsr/fbcgsr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgsr/fbcgsr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !140, line: 70, baseType: !5, size: 32, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !143, !144}
!142 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!143 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 451, baseType: !64, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151}
!147 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!148 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!149 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!150 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!151 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 663, baseType: !5, size: 32, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !156, !157}
!155 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!158 = !{!159, !162, !180, !261, !201, !367, !290, !241, !675, !678, !251, !64, !5}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !160, line: 46, baseType: !161)
!160 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!161 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !165, line: 73, size: 4480, elements: !166)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!166 = !{!167, !169, !222, !223, !225, !228, !229, !230, !231, !239, !240, !242, !246, !250, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !264, !265, !266, !268, !269, !271, !273, !274, !275, !276, !277, !280, !282, !283, !284, !285, !286, !289, !291, !292, !293, !303, !305, !306, !310, !311, !357, !362, !364, !365, !366}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !164, file: !165, line: 74, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !164, file: !165, line: 75, baseType: !170, size: 448, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, elements: !220)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !165, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 45, size: 448, elements: !173)
!173 = !{!174, !184, !192, !197, !204, !208, !215}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !172, file: !165, line: 46, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !162, !179}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !181, line: 330, baseType: !182)
!181 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !181, line: 330, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !172, file: !165, line: 47, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!178, !162, !188}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !189, line: 16, baseType: !190)
!189 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !189, line: 16, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !172, file: !165, line: 48, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!178, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !172, file: !165, line: 49, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!178, !162, !201, !162}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !172, file: !165, line: 50, baseType: !205, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!178, !162, !201, !196}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !172, file: !165, line: 51, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!178, !162, !201, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !172, file: !165, line: 52, baseType: !216, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!178, !162, !201, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !164, file: !165, line: 76, baseType: !180, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 77, baseType: !224, size: 32, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !227)
!227 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !164, file: !165, line: 78, baseType: !226, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 79, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !235, line: 27, baseType: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !237, line: 43, baseType: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!238 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !164, file: !165, line: 80, baseType: !224, size: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !164, file: !165, line: 81, baseType: !241, size: 32, offset: 992)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !164, file: !165, line: 82, baseType: !243, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !164, file: !165, line: 83, baseType: !247, size: 64, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !164, file: !165, line: 84, baseType: !251, size: 64, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !164, file: !165, line: 85, baseType: !251, size: 64, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !164, file: !165, line: 86, baseType: !251, size: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !164, file: !165, line: 87, baseType: !251, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 88, baseType: !162, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !164, file: !165, line: 89, baseType: !232, size: 64, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 90, baseType: !251, size: 64, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !164, file: !165, line: 91, baseType: !251, size: 64, offset: 1600)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !164, file: !165, line: 92, baseType: !224, size: 32, offset: 1664)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !164, file: !165, line: 93, baseType: !261, size: 64, offset: 1728)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 94, baseType: !263, size: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !233)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !164, file: !165, line: 95, baseType: !224, size: 32, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !164, file: !165, line: 95, baseType: !224, size: 32, offset: 1888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !164, file: !165, line: 96, baseType: !267, size: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !164, file: !165, line: 96, baseType: !267, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !164, file: !165, line: 97, baseType: !270, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !164, file: !165, line: 97, baseType: !272, size: 64, offset: 2112)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !164, file: !165, line: 98, baseType: !224, size: 32, offset: 2176)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !164, file: !165, line: 98, baseType: !224, size: 32, offset: 2208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !164, file: !165, line: 99, baseType: !267, size: 64, offset: 2240)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !164, file: !165, line: 99, baseType: !267, size: 64, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !164, file: !165, line: 100, baseType: !278, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !227)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !164, file: !165, line: 100, baseType: !281, size: 64, offset: 2432)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !164, file: !165, line: 101, baseType: !224, size: 32, offset: 2496)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !164, file: !165, line: 101, baseType: !224, size: 32, offset: 2528)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !164, file: !165, line: 102, baseType: !267, size: 64, offset: 2560)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !164, file: !165, line: 102, baseType: !267, size: 64, offset: 2624)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !164, file: !165, line: 103, baseType: !287, size: 64, offset: 2688)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !279)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !164, file: !165, line: 103, baseType: !290, size: 64, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !164, file: !165, line: 104, baseType: !219, size: 64, offset: 2816)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !164, file: !165, line: 105, baseType: !224, size: 32, offset: 2880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !164, file: !165, line: 106, baseType: !294, size: 128, offset: 2944)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 128, elements: !301)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !165, line: 64, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 61, size: 128, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !165, line: 62, baseType: !212, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !297, file: !165, line: 63, baseType: !261, size: 64, offset: 64)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !164, file: !165, line: 107, baseType: !304, size: 64, offset: 3072)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !164, file: !165, line: 108, baseType: !261, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !164, file: !165, line: 109, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!178, !261}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !164, file: !165, line: 111, baseType: !224, size: 32, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !164, file: !165, line: 112, baseType: !312, size: 320, offset: 3328)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !355)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!178, !316, !162, !261}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !319)
!319 = !{!320, !321, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !10, line: 100, baseType: !224, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !10, line: 101, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !333, !334, !335, !336, !338, !340, !341, !342}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !324, file: !10, line: 84, baseType: !251, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !324, file: !10, line: 85, baseType: !251, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !10, line: 86, baseType: !261, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !324, file: !10, line: 87, baseType: !243, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !10, line: 88, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !324, file: !10, line: 89, baseType: !203, size: 8, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !324, file: !10, line: 90, baseType: !251, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !324, file: !10, line: 91, baseType: !159, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !10, line: 92, baseType: !337, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !10, line: 93, baseType: !339, size: 32, offset: 544)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !10, line: 94, baseType: !322, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !324, file: !10, line: 95, baseType: !251, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !324, file: !10, line: 96, baseType: !261, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !10, line: 102, baseType: !251, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !318, file: !10, line: 102, baseType: !251, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !318, file: !10, line: 103, baseType: !251, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !10, line: 104, baseType: !180, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !318, file: !10, line: 105, baseType: !337, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !318, file: !10, line: 106, baseType: !162, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !10, line: 107, baseType: !352, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!355 = !{!356}
!356 = !DISubrange(count: 5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !164, file: !165, line: 113, baseType: !358, size: 320, offset: 3648)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 320, elements: !355)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!178, !162, !261}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !164, file: !165, line: 114, baseType: !363, size: 320, offset: 3968)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !355)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !164, file: !165, line: 115, baseType: !337, size: 32, offset: 4288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !164, file: !165, line: 120, baseType: !352, size: 64, offset: 4352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !164, file: !165, line: 121, baseType: !337, size: 32, offset: 4416)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_BCGS", file: !369, line: 13, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/bcgs/bcgsimpl.h", directory: "/home/users/ndemeye/xSDK")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 11, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !370, file: !369, line: 12, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !376, line: 142, size: 12800, elements: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!377 = !{!378, !380, !600, !621, !622, !623, !669, !670, !671, !672, !674}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !375, file: !376, line: 143, baseType: !379, size: 4480)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !165, line: 122, baseType: !164)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !375, file: !376, line: 143, baseType: !381, size: 5248, offset: 4480)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 5248, elements: !220)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !376, line: 23, size: 5248, elements: !383)
!383 = !{!384, !389, !394, !398, !402, !408, !413, !414, !415, !419, !423, !424, !425, !429, !433, !439, !440, !444, !448, !452, !453, !460, !464, !465, !469, !473, !474, !475, !479, !480, !487, !492, !493, !494, !498, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !519, !520, !521, !525, !529, !530, !531, !532, !536, !537, !538, !539, !540, !541, !542, !546, !547, !551, !558, !559, !564, !565, !569, !570, !571, !572, !573, !574, !575, !576, !580, !581, !582, !588, !592, !593, !594}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !382, file: !376, line: 24, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!178, !373, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !382, file: !376, line: 25, baseType: !390, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!178, !373, !224, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !382, file: !376, line: 26, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!178, !224, !388}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !382, file: !376, line: 27, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!178, !373, !373, !287}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !382, file: !376, line: 28, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!178, !373, !224, !406, !287}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !382, file: !376, line: 29, baseType: !409, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!178, !373, !412, !278}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !382, file: !376, line: 30, baseType: !399, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !382, file: !376, line: 31, baseType: !403, size: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !382, file: !376, line: 32, baseType: !416, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!178, !373, !288}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !382, file: !376, line: 33, baseType: !420, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!178, !373, !373}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !382, file: !376, line: 34, baseType: !416, size: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !382, file: !376, line: 35, baseType: !420, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !382, file: !376, line: 36, baseType: !426, size: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!178, !373, !288, !373}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !382, file: !376, line: 37, baseType: !430, size: 64, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!178, !373, !288, !288, !373}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !382, file: !376, line: 38, baseType: !434, size: 64, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!178, !373, !224, !437, !388}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !382, file: !376, line: 39, baseType: !426, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !382, file: !376, line: 40, baseType: !441, size: 64, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!178, !373, !288, !373, !373}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !382, file: !376, line: 41, baseType: !445, size: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!178, !373, !288, !288, !288, !373, !373}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !382, file: !376, line: 42, baseType: !449, size: 64, offset: 1152)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!178, !373, !373, !373}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !382, file: !376, line: 43, baseType: !449, size: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !382, file: !376, line: 44, baseType: !454, size: 64, offset: 1280)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!178, !373, !224, !457, !437, !459}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !382, file: !376, line: 45, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!178, !373}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !382, file: !376, line: 46, baseType: !461, size: 64, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !382, file: !376, line: 47, baseType: !466, size: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!178, !373, !290}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !382, file: !376, line: 48, baseType: !470, size: 64, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!178, !373, !270}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !382, file: !376, line: 49, baseType: !470, size: 64, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !382, file: !376, line: 50, baseType: !466, size: 64, offset: 1664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !382, file: !376, line: 51, baseType: !476, size: 64, offset: 1728)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!178, !373, !270, !278}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !382, file: !376, line: 52, baseType: !476, size: 64, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !382, file: !376, line: 53, baseType: !481, size: 64, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!178, !373, !484}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !382, file: !376, line: 54, baseType: !488, size: 64, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!178, !373, !491, !337}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !382, file: !376, line: 55, baseType: !454, size: 64, offset: 1984)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !382, file: !376, line: 56, baseType: !461, size: 64, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !382, file: !376, line: 57, baseType: !495, size: 64, offset: 2112)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!178, !373, !188}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !382, file: !376, line: 58, baseType: !499, size: 64, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!178, !373, !437}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !382, file: !376, line: 59, baseType: !499, size: 64, offset: 2240)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !382, file: !376, line: 60, baseType: !399, size: 64, offset: 2304)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !382, file: !376, line: 61, baseType: !399, size: 64, offset: 2368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !382, file: !376, line: 62, baseType: !409, size: 64, offset: 2432)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !382, file: !376, line: 63, baseType: !403, size: 64, offset: 2496)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !382, file: !376, line: 64, baseType: !403, size: 64, offset: 2560)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !382, file: !376, line: 65, baseType: !495, size: 64, offset: 2624)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !382, file: !376, line: 66, baseType: !461, size: 64, offset: 2688)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !382, file: !376, line: 67, baseType: !461, size: 64, offset: 2752)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !382, file: !376, line: 68, baseType: !512, size: 64, offset: 2816)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!178, !373, !515}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !516, line: 30, baseType: !517)
!516 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !516, line: 30, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !382, file: !376, line: 69, baseType: !454, size: 64, offset: 2880)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !382, file: !376, line: 70, baseType: !461, size: 64, offset: 2944)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !382, file: !376, line: 71, baseType: !522, size: 64, offset: 3008)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!178, !316, !373}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !382, file: !376, line: 72, baseType: !526, size: 64, offset: 3072)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!178, !373, !373, !278}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !382, file: !376, line: 73, baseType: !449, size: 64, offset: 3136)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !382, file: !376, line: 74, baseType: !449, size: 64, offset: 3200)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !382, file: !376, line: 75, baseType: !449, size: 64, offset: 3264)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !382, file: !376, line: 76, baseType: !533, size: 64, offset: 3328)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!178, !373, !224, !457, !287}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !382, file: !376, line: 77, baseType: !461, size: 64, offset: 3392)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !382, file: !376, line: 78, baseType: !461, size: 64, offset: 3456)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !382, file: !376, line: 79, baseType: !461, size: 64, offset: 3520)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !382, file: !376, line: 80, baseType: !461, size: 64, offset: 3584)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !382, file: !376, line: 81, baseType: !416, size: 64, offset: 3648)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !382, file: !376, line: 82, baseType: !461, size: 64, offset: 3712)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !382, file: !376, line: 83, baseType: !543, size: 64, offset: 3776)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!178, !373, !224, !373, !459}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !382, file: !376, line: 84, baseType: !543, size: 64, offset: 3840)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !382, file: !376, line: 85, baseType: !548, size: 64, offset: 3904)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!178, !373, !373, !287, !287}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !382, file: !376, line: 86, baseType: !552, size: 64, offset: 3968)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!178, !373, !555, !388}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !516, line: 11, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !516, line: 11, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !382, file: !376, line: 87, baseType: !552, size: 64, offset: 4032)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !382, file: !376, line: 88, baseType: !560, size: 64, offset: 4096)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!178, !373, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !382, file: !376, line: 89, baseType: !560, size: 64, offset: 4160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !382, file: !376, line: 90, baseType: !566, size: 64, offset: 4224)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!178, !373, !224, !457, !457, !373, !459}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !382, file: !376, line: 91, baseType: !566, size: 64, offset: 4288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !382, file: !376, line: 92, baseType: !495, size: 64, offset: 4352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !382, file: !376, line: 93, baseType: !495, size: 64, offset: 4416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !382, file: !376, line: 94, baseType: !420, size: 64, offset: 4480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !382, file: !376, line: 95, baseType: !420, size: 64, offset: 4544)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !382, file: !376, line: 96, baseType: !420, size: 64, offset: 4608)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !382, file: !376, line: 97, baseType: !420, size: 64, offset: 4672)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !382, file: !376, line: 98, baseType: !577, size: 64, offset: 4736)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!178, !373, !337}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !382, file: !376, line: 99, baseType: !466, size: 64, offset: 4800)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !382, file: !376, line: 100, baseType: !466, size: 64, offset: 4864)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !382, file: !376, line: 101, baseType: !583, size: 64, offset: 4928)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!178, !373, !290, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !382, file: !376, line: 102, baseType: !589, size: 64, offset: 4992)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!178, !373, !563, !586}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !382, file: !376, line: 103, baseType: !466, size: 64, offset: 5056)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !382, file: !376, line: 104, baseType: !560, size: 64, offset: 5120)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !382, file: !376, line: 105, baseType: !595, size: 64, offset: 5184)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!178, !224, !406, !388, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !375, file: !376, line: 144, baseType: !601, size: 64, offset: 9728)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !516, line: 60, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !604, line: 240, size: 640, elements: !605)
!604 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !603, file: !604, line: 241, baseType: !180, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !603, file: !604, line: 242, baseType: !241, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !603, file: !604, line: 243, baseType: !224, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !603, file: !604, line: 243, baseType: !224, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !603, file: !604, line: 244, baseType: !224, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !603, file: !604, line: 244, baseType: !224, size: 32, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !603, file: !604, line: 245, baseType: !270, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !603, file: !604, line: 246, baseType: !337, size: 32, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !603, file: !604, line: 247, baseType: !224, size: 32, offset: 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !603, file: !604, line: 251, baseType: !224, size: 32, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !603, file: !604, line: 252, baseType: !515, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !603, file: !604, line: 253, baseType: !337, size: 32, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !603, file: !604, line: 254, baseType: !224, size: 32, offset: 544)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !603, file: !604, line: 254, baseType: !224, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !603, file: !604, line: 255, baseType: !224, size: 32, offset: 608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !376, line: 145, baseType: !261, size: 64, offset: 9792)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !375, file: !376, line: 146, baseType: !337, size: 32, offset: 9856)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !375, file: !376, line: 147, baseType: !624, size: 1344, offset: 9920)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !376, line: 140, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 114, size: 1344, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !645, !646, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !625, file: !376, line: 115, baseType: !224, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !625, file: !376, line: 116, baseType: !224, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !625, file: !376, line: 117, baseType: !224, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !625, file: !376, line: 118, baseType: !224, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !625, file: !376, line: 119, baseType: !224, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !625, file: !376, line: 120, baseType: !224, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !625, file: !376, line: 121, baseType: !270, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !625, file: !376, line: 122, baseType: !287, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !625, file: !376, line: 124, baseType: !180, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !376, line: 125, baseType: !241, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !625, file: !376, line: 125, baseType: !241, size: 32, offset: 416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !625, file: !376, line: 126, baseType: !241, size: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !625, file: !376, line: 126, baseType: !241, size: 32, offset: 480)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !625, file: !376, line: 127, baseType: !641, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !181, line: 339, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !181, line: 339, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !625, file: !376, line: 128, baseType: !641, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !625, file: !376, line: 129, baseType: !647, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !181, line: 341, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !181, line: 351, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !649, file: !181, line: 354, baseType: !64, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !649, file: !181, line: 355, baseType: !64, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !649, file: !181, line: 356, baseType: !64, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !649, file: !181, line: 361, baseType: !64, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !649, file: !181, line: 362, baseType: !159, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !625, file: !376, line: 130, baseType: !224, size: 32, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !625, file: !376, line: 130, baseType: !224, size: 32, offset: 736)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !625, file: !376, line: 131, baseType: !287, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !625, file: !376, line: 131, baseType: !287, size: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !625, file: !376, line: 132, baseType: !270, size: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !625, file: !376, line: 132, baseType: !270, size: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !625, file: !376, line: 133, baseType: !224, size: 32, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !625, file: !376, line: 134, baseType: !270, size: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !625, file: !376, line: 135, baseType: !224, size: 32, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !625, file: !376, line: 136, baseType: !337, size: 32, offset: 1184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !625, file: !376, line: 137, baseType: !337, size: 32, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !625, file: !376, line: 138, baseType: !459, size: 32, offset: 1248)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !625, file: !376, line: 139, baseType: !270, size: 64, offset: 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !375, file: !376, line: 147, baseType: !624, size: 1344, offset: 11264)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !375, file: !376, line: 148, baseType: !337, size: 32, offset: 12608)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !375, file: !376, line: 149, baseType: !224, size: 32, offset: 12640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !375, file: !376, line: 150, baseType: !673, size: 32, offset: 12672)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !375, file: !376, line: 157, baseType: !251, size: 64, offset: 12736)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !181, line: 331, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !181, line: 331, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !181, line: 338, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !181, line: 338, flags: DIFlagFwdDecl)
!681 = !{i32 7, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{i32 1, !"wchar_size", i32 4}
!684 = !{i32 7, !"PIC Level", i32 2}
!685 = !{i32 7, !"uwtable", i32 1}
!686 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!687 = distinct !DISubprogram(name: "KSPCreate_FBCGSR", scope: !688, file: !688, line: 207, type: !689, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !928)
!688 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgsr/fbcgsr.c", directory: "/home/users/ndemeye/xSDK")
!689 = !DISubroutineType(types: !690)
!690 = !{!178, !691}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !71, line: 22, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !140, line: 75, size: 12800, elements: !694)
!694 = !{!695, !696, !743, !748, !749, !750, !751, !781, !782, !783, !784, !785, !787, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !821, !827, !828, !829, !830, !835, !836, !837, !838, !843, !844, !845, !846, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !898, !899, !900, !901, !902, !909, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !925, !926, !927}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !693, file: !140, line: 76, baseType: !379, size: 4480)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !693, file: !140, line: 76, baseType: !697, size: 896, offset: 4480)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 896, elements: !220)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !140, line: 18, size: 896, elements: !699)
!699 = !{!700, !704, !708, !710, !718, !719, !723, !724, !728, !732, !736, !737, !741, !742}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !698, file: !140, line: 19, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!178, !691, !373, !388}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !698, file: !140, line: 22, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!178, !691, !373, !373, !388}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !698, file: !140, line: 25, baseType: !709, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !698, file: !140, line: 26, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!178, !691, !714, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !715, line: 16, baseType: !716)
!715 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !715, line: 16, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !698, file: !140, line: 27, baseType: !709, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !698, file: !140, line: 28, baseType: !720, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!178, !316, !691}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !698, file: !140, line: 29, baseType: !709, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !698, file: !140, line: 30, baseType: !725, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!178, !691, !278, !278}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !698, file: !140, line: 31, baseType: !729, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!178, !691, !224, !278, !278, !270}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !698, file: !140, line: 32, baseType: !733, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!178, !691, !337, !337, !270, !388, !278, !278}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !698, file: !140, line: 33, baseType: !709, size: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !698, file: !140, line: 34, baseType: !738, size: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!178, !691, !188}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !698, file: !140, line: 35, baseType: !709, size: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !698, file: !140, line: 36, baseType: !738, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !693, file: !140, line: 77, baseType: !744, size: 64, offset: 5376)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !745, line: 14, baseType: !746)
!745 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !745, line: 14, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !693, file: !140, line: 78, baseType: !337, size: 32, offset: 5440)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !693, file: !140, line: 79, baseType: !337, size: 32, offset: 5472)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !693, file: !140, line: 81, baseType: !224, size: 32, offset: 5504)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !693, file: !140, line: 82, baseType: !752, size: 64, offset: 5568)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !71, line: 752, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !140, line: 54, size: 5184, elements: !755)
!755 = !{!756, !757, !777, !778, !779, !780}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !754, file: !140, line: 55, baseType: !379, size: 4480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !754, file: !140, line: 55, baseType: !758, size: 448, offset: 4480)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 448, elements: !220)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !140, line: 41, size: 448, elements: !760)
!760 = !{!761, !765, !766, !770, !771, !772, !776}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !759, file: !140, line: 42, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!178, !752, !373, !373}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !759, file: !140, line: 43, baseType: !762, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !759, file: !140, line: 44, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!178, !752}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !759, file: !140, line: 45, baseType: !767, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !759, file: !140, line: 46, baseType: !767, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !759, file: !140, line: 47, baseType: !773, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!178, !752, !188}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !759, file: !140, line: 48, baseType: !767, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !754, file: !140, line: 56, baseType: !691, size: 64, offset: 4928)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !754, file: !140, line: 57, baseType: !714, size: 64, offset: 4992)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !754, file: !140, line: 58, baseType: !263, size: 64, offset: 5056)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !140, line: 59, baseType: !261, size: 64, offset: 5120)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !693, file: !140, line: 83, baseType: !337, size: 32, offset: 5632)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !693, file: !140, line: 84, baseType: !337, size: 32, offset: 5664)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !693, file: !140, line: 85, baseType: !337, size: 32, offset: 5696)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !693, file: !140, line: 86, baseType: !337, size: 32, offset: 5728)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !693, file: !140, line: 87, baseType: !786, size: 32, offset: 5760)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !63, line: 85, baseType: !62)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !693, file: !140, line: 88, baseType: !788, size: 384, offset: 5792)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 384, elements: !789)
!789 = !{!790, !791}
!790 = !DISubrange(count: 4)
!791 = !DISubrange(count: 3)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !693, file: !140, line: 89, baseType: !279, size: 64, offset: 6208)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !693, file: !140, line: 90, baseType: !279, size: 64, offset: 6272)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !693, file: !140, line: 91, baseType: !279, size: 64, offset: 6336)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !693, file: !140, line: 92, baseType: !279, size: 64, offset: 6400)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !693, file: !140, line: 93, baseType: !279, size: 64, offset: 6464)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !693, file: !140, line: 94, baseType: !279, size: 64, offset: 6528)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !693, file: !140, line: 95, baseType: !799, size: 32, offset: 6592)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !71, line: 540, baseType: !70)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !693, file: !140, line: 96, baseType: !337, size: 32, offset: 6624)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !693, file: !140, line: 98, baseType: !373, size: 64, offset: 6656)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !693, file: !140, line: 98, baseType: !373, size: 64, offset: 6720)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !693, file: !140, line: 102, baseType: !278, size: 64, offset: 6784)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !693, file: !140, line: 103, baseType: !278, size: 64, offset: 6848)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !693, file: !140, line: 104, baseType: !224, size: 32, offset: 6912)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !693, file: !140, line: 105, baseType: !224, size: 32, offset: 6944)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !693, file: !140, line: 106, baseType: !337, size: 32, offset: 6976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !693, file: !140, line: 107, baseType: !278, size: 64, offset: 7040)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !693, file: !140, line: 108, baseType: !278, size: 64, offset: 7104)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !693, file: !140, line: 109, baseType: !224, size: 32, offset: 7168)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !693, file: !140, line: 110, baseType: !224, size: 32, offset: 7200)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !693, file: !140, line: 111, baseType: !337, size: 32, offset: 7232)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !693, file: !140, line: 113, baseType: !224, size: 32, offset: 7264)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !693, file: !140, line: 114, baseType: !337, size: 32, offset: 7296)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !693, file: !140, line: 117, baseType: !224, size: 32, offset: 7328)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !693, file: !140, line: 120, baseType: !817, size: 320, offset: 7360)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 320, elements: !355)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!178, !691, !224, !279, !261}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !693, file: !140, line: 121, baseType: !822, size: 320, offset: 7680)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 320, elements: !355)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!178, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !693, file: !140, line: 122, baseType: !363, size: 320, offset: 8000)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !693, file: !140, line: 123, baseType: !224, size: 32, offset: 8320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !693, file: !140, line: 124, baseType: !337, size: 32, offset: 8352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !693, file: !140, line: 126, baseType: !831, size: 320, offset: 8384)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 320, elements: !355)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!178, !691, !261}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !693, file: !140, line: 127, baseType: !822, size: 320, offset: 8704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !693, file: !140, line: 128, baseType: !363, size: 320, offset: 9024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !693, file: !140, line: 129, baseType: !224, size: 32, offset: 9344)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !693, file: !140, line: 131, baseType: !839, size: 64, offset: 9408)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!178, !691, !224, !279, !842, !261}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !693, file: !140, line: 132, baseType: !307, size: 64, offset: 9472)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !693, file: !140, line: 133, baseType: !261, size: 64, offset: 9536)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !693, file: !140, line: 135, baseType: !261, size: 64, offset: 9600)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !693, file: !140, line: 137, baseType: !847, size: 64, offset: 9664)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !63, line: 11, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !63, line: 11, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !693, file: !140, line: 139, baseType: !261, size: 64, offset: 9728)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9792)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9824)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9856)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9888)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9920)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9952)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 9984)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10016)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10080)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10112)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10144)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10176)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !693, file: !140, line: 142, baseType: !337, size: 32, offset: 10208)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10240)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10304)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10368)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10432)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10496)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10560)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10624)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10688)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10752)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10816)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10880)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 10944)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 11008)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !693, file: !140, line: 143, baseType: !188, size: 64, offset: 11072)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11136)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !95, line: 162, baseType: !94)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11168)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11200)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11232)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11264)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11296)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11328)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11360)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11392)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11424)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11456)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11488)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11520)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !693, file: !140, line: 144, baseType: !880, size: 32, offset: 11552)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !693, file: !140, line: 147, baseType: !224, size: 32, offset: 11584)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !693, file: !140, line: 148, baseType: !388, size: 64, offset: 11648)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !693, file: !140, line: 150, baseType: !897, size: 32, offset: 11712)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !140, line: 70, baseType: !139)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !693, file: !140, line: 151, baseType: !337, size: 32, offset: 11744)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !693, file: !140, line: 153, baseType: !224, size: 32, offset: 11776)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !693, file: !140, line: 154, baseType: !224, size: 32, offset: 11808)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !693, file: !140, line: 156, baseType: !337, size: 32, offset: 11840)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !693, file: !140, line: 161, baseType: !903, size: 192, offset: 11904)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !140, line: 157, size: 192, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !903, file: !140, line: 158, baseType: !714, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !903, file: !140, line: 158, baseType: !714, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !903, file: !140, line: 159, baseType: !337, size: 32, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !903, file: !140, line: 160, baseType: !337, size: 32, offset: 160)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !693, file: !140, line: 163, baseType: !910, size: 32, offset: 12096)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !71, line: 451, baseType: !145)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !693, file: !140, line: 165, baseType: !786, size: 32, offset: 12128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !693, file: !140, line: 166, baseType: !910, size: 32, offset: 12160)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !693, file: !140, line: 171, baseType: !337, size: 32, offset: 12192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !693, file: !140, line: 172, baseType: !337, size: 32, offset: 12224)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !693, file: !140, line: 173, baseType: !337, size: 32, offset: 12256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !693, file: !140, line: 174, baseType: !373, size: 64, offset: 12288)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !693, file: !140, line: 175, baseType: !373, size: 64, offset: 12352)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !693, file: !140, line: 177, baseType: !224, size: 32, offset: 12416)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !693, file: !140, line: 178, baseType: !337, size: 32, offset: 12448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !693, file: !140, line: 180, baseType: !188, size: 64, offset: 12480)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !693, file: !140, line: 182, baseType: !922, size: 64, offset: 12544)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!178, !691, !373, !373, !261}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !693, file: !140, line: 183, baseType: !922, size: 64, offset: 12608)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !693, file: !140, line: 184, baseType: !261, size: 64, offset: 12672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !693, file: !140, line: 184, baseType: !261, size: 64, offset: 12736)
!928 = !{!929, !930, !931, !932, !934, !936, !938}
!929 = !DILocalVariable(name: "ksp", arg: 1, scope: !687, file: !688, line: 207, type: !691)
!930 = !DILocalVariable(name: "ierr", scope: !687, file: !688, line: 209, type: !178)
!931 = !DILocalVariable(name: "bcgs", scope: !687, file: !688, line: 210, type: !367)
!932 = !DILocalVariable(name: "ierr__", scope: !933, file: !688, line: 213, type: !178)
!933 = distinct !DILexicalBlock(scope: !687, file: !688, line: 213, column: 33)
!934 = !DILocalVariable(name: "ierr__", scope: !935, file: !688, line: 225, type: !178)
!935 = distinct !DILexicalBlock(scope: !687, file: !688, line: 225, column: 69)
!936 = !DILocalVariable(name: "ierr__", scope: !937, file: !688, line: 226, type: !178)
!937 = distinct !DILexicalBlock(scope: !687, file: !688, line: 226, column: 72)
!938 = !DILocalVariable(name: "ierr__", scope: !939, file: !688, line: 227, type: !178)
!939 = distinct !DILexicalBlock(scope: !687, file: !688, line: 227, column: 60)
!940 = !DILocation(line: 0, scope: !687)
!941 = !DILocation(line: 210, column: 3, scope: !687)
!942 = !DILocation(line: 212, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !688, line: 212, column: 3)
!944 = distinct !DILexicalBlock(scope: !945, file: !688, line: 212, column: 3)
!945 = distinct !DILexicalBlock(scope: !687, file: !688, line: 212, column: 3)
!946 = !{!947, !947, i64 0}
!947 = !{!"any pointer", !948, i64 0}
!948 = !{!"omnipotent char", !949, i64 0}
!949 = !{!"Simple C/C++ TBAA"}
!950 = !DILocation(line: 212, column: 3, scope: !944)
!951 = !DILocation(line: 212, column: 3, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !688, line: 212, column: 3)
!953 = distinct !DILexicalBlock(scope: !943, file: !688, line: 212, column: 3)
!954 = !{!955, !956, i64 1536}
!955 = !{!"", !948, i64 0, !948, i64 512, !948, i64 1024, !948, i64 1280, !956, i64 1536, !956, i64 1540, !948, i64 1544}
!956 = !{!"int", !948, i64 0}
!957 = !DILocation(line: 212, column: 3, scope: !953)
!958 = !DILocation(line: 212, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !952, file: !688, line: 212, column: 3)
!960 = !{!956, !956, i64 0}
!961 = !{!955, !956, i64 1540}
!962 = !DILocation(line: 213, column: 10, scope: !687)
!963 = !{!"branch_weights", i32 2146410443, i32 1073205}
!964 = !DILocation(line: 0, scope: !933)
!965 = !DILocation(line: 213, column: 33, scope: !933)
!966 = !{!"branch_weights", i32 2000, i32 1}
!967 = !DILocation(line: 213, column: 33, scope: !968)
!968 = distinct !DILexicalBlock(scope: !933, file: !688, line: 213, column: 33)
!969 = !DILocation(line: 215, column: 30, scope: !687)
!970 = !DILocation(line: 215, column: 8, scope: !687)
!971 = !DILocation(line: 215, column: 28, scope: !687)
!972 = !{!973, !947, i64 1216}
