; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dense/mpi/mpidense.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dense/mpi/mpidense.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!374 = !{!375, !406, !487, !403, !427, !803, !1038, !422, !1250, !1380, !1383, !467, !477, !74, !562, !516, !1385, !566, !1386, !1394, !1404, !450, !7, !513, !452, !1192, !1411, !1412}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIDense", file: !377, line: 48, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/dense/mpi/mpidense.h", directory: "/home/users/ndemeye/xSDK")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 26, size: 960, elements: !379)
!379 = !{!380, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1374, !1375, !1376, !1377, !1378, !1379}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !378, file: !377, line: 27, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !384, line: 436, size: 23424, elements: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!385 = !{!386, !596, !1103, !1123, !1124, !1125, !1127, !1128, !1129, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1256, !1257, !1273, !1274, !1275, !1276, !1277, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1312, !1332, !1333, !1335, !1336, !1337, !1338, !1339, !1340, !1358, !1359}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !383, file: !384, line: 437, baseType: !387, size: 4480)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !388, line: 122, baseType: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !388, line: 73, size: 4480, elements: !390)
!390 = !{!391, !393, !448, !449, !451, !454, !455, !456, !457, !465, !466, !468, !472, !476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !488, !490, !491, !492, !494, !495, !497, !499, !500, !501, !502, !503, !506, !508, !509, !510, !511, !512, !515, !517, !518, !519, !529, !531, !532, !536, !537, !586, !591, !593, !594, !595}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !389, file: !388, line: 74, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !389, file: !388, line: 75, baseType: !394, size: 448, offset: 64)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 448, elements: !446)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !388, line: 53, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 45, size: 448, elements: !397)
!397 = !{!398, !410, !418, !423, !430, !434, !441}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !396, file: !388, line: 46, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !403, !405}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !407, line: 330, baseType: !408)
!407 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !407, line: 330, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !388, line: 47, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!402, !403, !414}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !415, line: 16, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !415, line: 16, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !396, file: !388, line: 48, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!402, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !396, file: !388, line: 49, baseType: !424, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!402, !403, !427, !403}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !396, file: !388, line: 50, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!402, !403, !427, !422}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !396, file: !388, line: 51, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!402, !403, !427, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !396, file: !388, line: 52, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!402, !403, !427, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!446 = !{!447}
!447 = !DISubrange(count: 1)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !389, file: !388, line: 76, baseType: !406, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !388, line: 77, baseType: !450, size: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !389, file: !388, line: 78, baseType: !452, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !453)
!453 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !389, file: !388, line: 78, baseType: !452, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !389, file: !388, line: 78, baseType: !452, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !389, file: !388, line: 78, baseType: !452, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !389, file: !388, line: 79, baseType: !458, size: 64, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !461, line: 27, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !463, line: 43, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!464 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !389, file: !388, line: 80, baseType: !450, size: 32, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !389, file: !388, line: 81, baseType: !467, size: 32, offset: 992)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !389, file: !388, line: 82, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !389, file: !388, line: 83, baseType: !473, size: 64, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !389, file: !388, line: 84, baseType: !477, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !389, file: !388, line: 85, baseType: !477, size: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !389, file: !388, line: 86, baseType: !477, size: 64, offset: 1280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !389, file: !388, line: 87, baseType: !477, size: 64, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !389, file: !388, line: 88, baseType: !403, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !389, file: !388, line: 89, baseType: !458, size: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !388, line: 90, baseType: !477, size: 64, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !389, file: !388, line: 91, baseType: !477, size: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !389, file: !388, line: 92, baseType: !450, size: 32, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !389, file: !388, line: 93, baseType: !487, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !388, line: 94, baseType: !489, size: 64, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !459)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !389, file: !388, line: 95, baseType: !450, size: 32, offset: 1856)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !389, file: !388, line: 95, baseType: !450, size: 32, offset: 1888)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !389, file: !388, line: 96, baseType: !493, size: 64, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !389, file: !388, line: 96, baseType: !493, size: 64, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !389, file: !388, line: 97, baseType: !496, size: 64, offset: 2048)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !389, file: !388, line: 97, baseType: !498, size: 64, offset: 2112)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !389, file: !388, line: 98, baseType: !450, size: 32, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !389, file: !388, line: 98, baseType: !450, size: 32, offset: 2208)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !389, file: !388, line: 99, baseType: !493, size: 64, offset: 2240)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !389, file: !388, line: 99, baseType: !493, size: 64, offset: 2304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !389, file: !388, line: 100, baseType: !504, size: 64, offset: 2368)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !453)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !389, file: !388, line: 100, baseType: !507, size: 64, offset: 2432)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !389, file: !388, line: 101, baseType: !450, size: 32, offset: 2496)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !389, file: !388, line: 101, baseType: !450, size: 32, offset: 2528)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !389, file: !388, line: 102, baseType: !493, size: 64, offset: 2560)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !389, file: !388, line: 102, baseType: !493, size: 64, offset: 2624)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !389, file: !388, line: 103, baseType: !513, size: 64, offset: 2688)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !505)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !389, file: !388, line: 103, baseType: !516, size: 64, offset: 2752)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !389, file: !388, line: 104, baseType: !445, size: 64, offset: 2816)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !389, file: !388, line: 105, baseType: !450, size: 32, offset: 2880)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !389, file: !388, line: 106, baseType: !520, size: 128, offset: 2944)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 128, elements: !527)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !388, line: 64, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 61, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !523, file: !388, line: 62, baseType: !438, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !523, file: !388, line: 63, baseType: !487, size: 64, offset: 64)
!527 = !{!528}
!528 = !DISubrange(count: 2)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !389, file: !388, line: 107, baseType: !530, size: 64, offset: 3072)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 64, elements: !527)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !389, file: !388, line: 108, baseType: !487, size: 64, offset: 3136)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !389, file: !388, line: 109, baseType: !533, size: 64, offset: 3200)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!402, !487}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !389, file: !388, line: 111, baseType: !450, size: 32, offset: 3264)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !389, file: !388, line: 112, baseType: !538, size: 320, offset: 3328)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 320, elements: !584)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!402, !542, !403, !487}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !545)
!545 = !{!546, !547, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !544, file: !12, line: 100, baseType: !450, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !12, line: 101, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !559, !560, !561, !565, !567, !569, !570, !571}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !550, file: !12, line: 84, baseType: !477, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !550, file: !12, line: 85, baseType: !477, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !12, line: 86, baseType: !487, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !550, file: !12, line: 87, baseType: !469, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !550, file: !12, line: 88, baseType: !557, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !550, file: !12, line: 89, baseType: !429, size: 8, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !550, file: !12, line: 90, baseType: !477, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !550, file: !12, line: 91, baseType: !562, size: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !563, line: 46, baseType: !564)
!563 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!564 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !550, file: !12, line: 92, baseType: !566, size: 32, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !12, line: 93, baseType: !568, size: 32, offset: 544)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !12, line: 94, baseType: !548, size: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !550, file: !12, line: 95, baseType: !477, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !550, file: !12, line: 96, baseType: !487, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !544, file: !12, line: 102, baseType: !477, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !544, file: !12, line: 102, baseType: !477, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !544, file: !12, line: 103, baseType: !477, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !544, file: !12, line: 104, baseType: !406, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !544, file: !12, line: 105, baseType: !566, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !544, file: !12, line: 105, baseType: !566, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !544, file: !12, line: 105, baseType: !566, size: 32, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !544, file: !12, line: 106, baseType: !403, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !544, file: !12, line: 107, baseType: !581, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!584 = !{!585}
!585 = !DISubrange(count: 5)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !389, file: !388, line: 113, baseType: !587, size: 320, offset: 3648)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !584)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!402, !403, !487}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !389, file: !388, line: 114, baseType: !592, size: 320, offset: 3968)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !584)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !389, file: !388, line: 115, baseType: !566, size: 32, offset: 4288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !389, file: !388, line: 120, baseType: !581, size: 64, offset: 4352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !389, file: !388, line: 121, baseType: !566, size: 32, offset: 4416)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !383, file: !384, line: 437, baseType: !597, size: 9472, offset: 4480)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 9472, elements: !446)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !384, line: 32, size: 9472, elements: !599)
!599 = !{!600, !609, !613, !614, !621, !625, !626, !627, !628, !629, !630, !631, !655, !659, !664, !670, !689, !694, !698, !699, !704, !709, !710, !715, !719, !723, !727, !731, !735, !736, !737, !738, !739, !743, !744, !749, !750, !751, !752, !753, !758, !765, !770, !774, !778, !782, !786, !787, !791, !792, !799, !804, !805, !806, !807, !869, !877, !878, !882, !883, !887, !888, !892, !897, !898, !902, !906, !913, !914, !915, !916, !917, !918, !923, !924, !928, !932, !936, !937, !938, !942, !952, !953, !957, !958, !962, !963, !967, !968, !973, !974, !978, !982, !983, !984, !985, !986, !987, !988, !992, !993, !994, !995, !996, !997, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1032, !1033, !1034, !1039, !1043, !1044, !1048, !1049, !1050, !1051, !1077, !1081, !1082, !1083, !1084, !1085, !1089, !1090, !1091, !1092, !1093, !1097, !1101, !1102}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !598, file: !384, line: 34, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!402, !381, !450, !604, !450, !604, !606, !608}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !598, file: !384, line: 35, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!402, !381, !450, !496, !498, !516}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !598, file: !384, line: 36, baseType: !610, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !598, file: !384, line: 37, baseType: !615, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!402, !381, !618, !618}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !598, file: !384, line: 38, baseType: !622, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!402, !381, !618, !618, !618}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !598, file: !384, line: 40, baseType: !615, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !598, file: !384, line: 41, baseType: !622, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !598, file: !384, line: 42, baseType: !615, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !598, file: !384, line: 43, baseType: !622, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !598, file: !384, line: 44, baseType: !615, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !598, file: !384, line: 46, baseType: !622, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !598, file: !384, line: 47, baseType: !632, size: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!402, !381, !635, !635, !639}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !636, line: 11, baseType: !637)
!636 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !636, line: 11, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !642, file: !38, line: 1227, baseType: !505, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !642, file: !38, line: 1228, baseType: !505, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !642, file: !38, line: 1229, baseType: !505, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !642, file: !38, line: 1230, baseType: !505, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !642, file: !38, line: 1231, baseType: !505, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !642, file: !38, line: 1232, baseType: !505, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !642, file: !38, line: 1233, baseType: !505, size: 64, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !642, file: !38, line: 1234, baseType: !505, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !642, file: !38, line: 1236, baseType: !505, size: 64, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !642, file: !38, line: 1237, baseType: !505, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !642, file: !38, line: 1238, baseType: !505, size: 64, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !598, file: !384, line: 48, baseType: !656, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!402, !381, !635, !639}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !598, file: !384, line: 49, baseType: !660, size: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!402, !381, !618, !505, !663, !505, !450, !450, !618}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !598, file: !384, line: 50, baseType: !665, size: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!402, !381, !668, !669}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !598, file: !384, line: 52, baseType: !671, size: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!402, !381, !674, !675}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !677, file: !38, line: 593, baseType: !452, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !677, file: !38, line: 594, baseType: !452, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !677, file: !38, line: 594, baseType: !452, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !677, file: !38, line: 594, baseType: !452, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !677, file: !38, line: 595, baseType: !452, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !677, file: !38, line: 596, baseType: !452, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !677, file: !38, line: 597, baseType: !452, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !677, file: !38, line: 598, baseType: !452, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !677, file: !38, line: 598, baseType: !452, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !677, file: !38, line: 599, baseType: !452, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !598, file: !384, line: 53, baseType: !690, size: 64, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!402, !381, !381, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !598, file: !384, line: 54, baseType: !695, size: 64, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!402, !381, !618}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !598, file: !384, line: 55, baseType: !615, size: 64, offset: 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !598, file: !384, line: 56, baseType: !700, size: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!402, !381, !703, !504}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !598, file: !384, line: 58, baseType: !705, size: 64, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!402, !381, !708}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !598, file: !384, line: 59, baseType: !705, size: 64, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !598, file: !384, line: 60, baseType: !711, size: 64, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!402, !381, !714, !566}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !598, file: !384, line: 61, baseType: !716, size: 64, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!402, !381}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !598, file: !384, line: 63, baseType: !720, size: 64, offset: 1536)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!402, !381, !450, !604, !514, !618, !618}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !598, file: !384, line: 64, baseType: !724, size: 64, offset: 1600)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!402, !381, !381, !635, !635, !639}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !598, file: !384, line: 65, baseType: !728, size: 64, offset: 1664)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!402, !381, !381, !639}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !598, file: !384, line: 66, baseType: !732, size: 64, offset: 1728)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!402, !381, !381, !635, !639}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !598, file: !384, line: 67, baseType: !728, size: 64, offset: 1792)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !598, file: !384, line: 69, baseType: !716, size: 64, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !598, file: !384, line: 70, baseType: !724, size: 64, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !598, file: !384, line: 71, baseType: !732, size: 64, offset: 1984)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !598, file: !384, line: 72, baseType: !740, size: 64, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!402, !381, !669}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !598, file: !384, line: 73, baseType: !716, size: 64, offset: 2112)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !598, file: !384, line: 75, baseType: !745, size: 64, offset: 2176)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!402, !381, !748, !669}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !598, file: !384, line: 76, baseType: !615, size: 64, offset: 2240)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !598, file: !384, line: 77, baseType: !615, size: 64, offset: 2304)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !598, file: !384, line: 78, baseType: !632, size: 64, offset: 2368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !598, file: !384, line: 79, baseType: !656, size: 64, offset: 2432)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !598, file: !384, line: 81, baseType: !754, size: 64, offset: 2496)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!402, !381, !514, !381, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !598, file: !384, line: 82, baseType: !759, size: 64, offset: 2560)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!402, !381, !450, !762, !762, !668, !764}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !598, file: !384, line: 83, baseType: !766, size: 64, offset: 2624)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!402, !381, !450, !769, !450}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !598, file: !384, line: 84, baseType: !771, size: 64, offset: 2688)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!402, !381, !450, !604, !450, !604, !513}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !598, file: !384, line: 85, baseType: !775, size: 64, offset: 2752)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!402, !381, !381, !757}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !598, file: !384, line: 87, baseType: !779, size: 64, offset: 2816)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!402, !381, !618, !496}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !598, file: !384, line: 88, baseType: !783, size: 64, offset: 2880)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!402, !381, !514}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !598, file: !384, line: 89, baseType: !783, size: 64, offset: 2944)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !598, file: !384, line: 90, baseType: !788, size: 64, offset: 3008)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!402, !381, !618, !608}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !598, file: !384, line: 91, baseType: !720, size: 64, offset: 3072)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !598, file: !384, line: 93, baseType: !793, size: 64, offset: 3136)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!402, !381, !796}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !598, file: !384, line: 94, baseType: !800, size: 64, offset: 3200)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!402, !381, !450, !566, !566, !496, !803, !803, !693}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !598, file: !384, line: 95, baseType: !800, size: 64, offset: 3264)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !598, file: !384, line: 96, baseType: !800, size: 64, offset: 3328)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !598, file: !384, line: 97, baseType: !800, size: 64, offset: 3392)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !598, file: !384, line: 99, baseType: !808, size: 64, offset: 3456)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!402, !381, !811, !814}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !636, line: 51, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !636, line: 51, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !384, line: 609, size: 6208, elements: !817)
!817 = !{!818, !819, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !838, !845, !846, !847, !848, !849, !850, !851, !852, !856, !857, !858, !859, !860, !862, !863, !864, !865, !866, !867, !868}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !816, file: !384, line: 610, baseType: !387, size: 4480)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !816, file: !384, line: 610, baseType: !820, size: 32, offset: 4480)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !446)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !816, file: !384, line: 611, baseType: !450, size: 32, offset: 4512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !816, file: !384, line: 611, baseType: !450, size: 32, offset: 4544)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !816, file: !384, line: 611, baseType: !450, size: 32, offset: 4576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !816, file: !384, line: 612, baseType: !450, size: 32, offset: 4608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !816, file: !384, line: 613, baseType: !450, size: 32, offset: 4640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !816, file: !384, line: 614, baseType: !496, size: 64, offset: 4672)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !816, file: !384, line: 615, baseType: !498, size: 64, offset: 4736)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !816, file: !384, line: 616, baseType: !769, size: 64, offset: 4800)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !816, file: !384, line: 617, baseType: !496, size: 64, offset: 4864)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !816, file: !384, line: 618, baseType: !831, size: 64, offset: 4928)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !384, line: 602, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 598, size: 128, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !833, file: !384, line: 599, baseType: !450, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !833, file: !384, line: 600, baseType: !450, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !833, file: !384, line: 601, baseType: !513, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !816, file: !384, line: 619, baseType: !839, size: 64, offset: 4992)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !384, line: 607, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 604, size: 128, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !841, file: !384, line: 605, baseType: !450, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !841, file: !384, line: 606, baseType: !513, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !816, file: !384, line: 620, baseType: !513, size: 64, offset: 5056)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !816, file: !384, line: 621, baseType: !505, size: 64, offset: 5120)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !816, file: !384, line: 622, baseType: !505, size: 64, offset: 5184)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !816, file: !384, line: 623, baseType: !618, size: 64, offset: 5248)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !816, file: !384, line: 623, baseType: !618, size: 64, offset: 5312)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !816, file: !384, line: 623, baseType: !618, size: 64, offset: 5376)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !816, file: !384, line: 624, baseType: !566, size: 32, offset: 5440)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !816, file: !384, line: 625, baseType: !853, size: 64, offset: 5504)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!402}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !816, file: !384, line: 626, baseType: !487, size: 64, offset: 5568)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !816, file: !384, line: 627, baseType: !618, size: 64, offset: 5632)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !816, file: !384, line: 628, baseType: !450, size: 32, offset: 5696)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !816, file: !384, line: 629, baseType: !427, size: 64, offset: 5760)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !816, file: !384, line: 630, baseType: !861, size: 32, offset: 5824)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !816, file: !384, line: 631, baseType: !450, size: 32, offset: 5856)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !816, file: !384, line: 631, baseType: !450, size: 32, offset: 5888)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !816, file: !384, line: 632, baseType: !566, size: 32, offset: 5920)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !816, file: !384, line: 633, baseType: !566, size: 32, offset: 5952)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !816, file: !384, line: 634, baseType: !438, size: 64, offset: 6016)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !816, file: !384, line: 634, baseType: !487, size: 64, offset: 6080)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !816, file: !384, line: 635, baseType: !458, size: 64, offset: 6144)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !598, file: !384, line: 100, baseType: !870, size: 64, offset: 3520)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!402, !381, !450, !450, !873, !876}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !875)
!875 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !598, file: !384, line: 101, baseType: !716, size: 64, offset: 3584)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !598, file: !384, line: 102, baseType: !879, size: 64, offset: 3648)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!402, !381, !635, !635, !669}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !598, file: !384, line: 103, baseType: !601, size: 64, offset: 3712)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !598, file: !384, line: 105, baseType: !884, size: 64, offset: 3776)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!402, !381, !635, !635, !668, !669}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !598, file: !384, line: 106, baseType: !716, size: 64, offset: 3840)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !598, file: !384, line: 107, baseType: !889, size: 64, offset: 3904)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!402, !381, !414}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !598, file: !384, line: 108, baseType: !893, size: 64, offset: 3968)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!402, !381, !896, !668, !669}
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !427)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !598, file: !384, line: 109, baseType: !853, size: 64, offset: 4032)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !598, file: !384, line: 111, baseType: !899, size: 64, offset: 4096)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!402, !381, !381, !381, !505, !381}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !598, file: !384, line: 112, baseType: !903, size: 64, offset: 4160)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!402, !381, !381, !381, !381}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !598, file: !384, line: 113, baseType: !907, size: 64, offset: 4224)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!402, !381, !910, !910}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !636, line: 30, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !636, line: 30, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !598, file: !384, line: 114, baseType: !601, size: 64, offset: 4288)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !598, file: !384, line: 115, baseType: !720, size: 64, offset: 4352)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !598, file: !384, line: 117, baseType: !779, size: 64, offset: 4416)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !598, file: !384, line: 118, baseType: !779, size: 64, offset: 4480)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !598, file: !384, line: 119, baseType: !893, size: 64, offset: 4544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !598, file: !384, line: 120, baseType: !919, size: 64, offset: 4608)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!402, !381, !922, !693}
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !598, file: !384, line: 121, baseType: !853, size: 64, offset: 4672)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !598, file: !384, line: 123, baseType: !925, size: 64, offset: 4736)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!402, !381, !450, !487}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !598, file: !384, line: 124, baseType: !929, size: 64, offset: 4800)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!402, !381, !814, !618, !487}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !598, file: !384, line: 125, baseType: !933, size: 64, offset: 4864)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!402, !542, !381}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !598, file: !384, line: 126, baseType: !615, size: 64, offset: 4928)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !598, file: !384, line: 127, baseType: !615, size: 64, offset: 4992)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !598, file: !384, line: 129, baseType: !939, size: 64, offset: 5056)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!402, !381, !769}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !598, file: !384, line: 130, baseType: !943, size: 64, offset: 5120)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!402, !381, !946, !946}
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !948, file: !62, line: 653, baseType: !450, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !948, file: !62, line: 653, baseType: !618, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !598, file: !384, line: 131, baseType: !943, size: 64, offset: 5184)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !598, file: !384, line: 132, baseType: !954, size: 64, offset: 5248)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!402, !381, !496, !496, !496}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !598, file: !384, line: 133, baseType: !889, size: 64, offset: 5312)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !598, file: !384, line: 135, baseType: !959, size: 64, offset: 5376)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!402, !381, !505, !693}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !598, file: !384, line: 136, baseType: !959, size: 64, offset: 5440)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !598, file: !384, line: 137, baseType: !964, size: 64, offset: 5504)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!402, !381, !693}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !598, file: !384, line: 138, baseType: !601, size: 64, offset: 5568)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !598, file: !384, line: 139, baseType: !969, size: 64, offset: 5632)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!402, !381, !972, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !598, file: !384, line: 141, baseType: !853, size: 64, offset: 5696)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !598, file: !384, line: 142, baseType: !975, size: 64, offset: 5760)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!402, !381, !381, !505, !381}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !598, file: !384, line: 143, baseType: !979, size: 64, offset: 5824)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!402, !381, !381, !381}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !598, file: !384, line: 144, baseType: !853, size: 64, offset: 5888)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !598, file: !384, line: 145, baseType: !975, size: 64, offset: 5952)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !598, file: !384, line: 147, baseType: !979, size: 64, offset: 6016)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !598, file: !384, line: 148, baseType: !853, size: 64, offset: 6080)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !598, file: !384, line: 149, baseType: !975, size: 64, offset: 6144)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !598, file: !384, line: 150, baseType: !979, size: 64, offset: 6208)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !598, file: !384, line: 151, baseType: !989, size: 64, offset: 6272)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!402, !381, !566}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !598, file: !384, line: 153, baseType: !716, size: 64, offset: 6336)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !598, file: !384, line: 154, baseType: !716, size: 64, offset: 6400)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !598, file: !384, line: 155, baseType: !716, size: 64, offset: 6464)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !598, file: !384, line: 156, baseType: !716, size: 64, offset: 6528)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !598, file: !384, line: 157, baseType: !889, size: 64, offset: 6592)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !598, file: !384, line: 159, baseType: !998, size: 64, offset: 6656)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!402, !381, !450, !606}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !598, file: !384, line: 160, baseType: !716, size: 64, offset: 6720)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !598, file: !384, line: 161, baseType: !716, size: 64, offset: 6784)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !598, file: !384, line: 162, baseType: !716, size: 64, offset: 6848)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !598, file: !384, line: 163, baseType: !716, size: 64, offset: 6912)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !598, file: !384, line: 165, baseType: !979, size: 64, offset: 6976)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !598, file: !384, line: 166, baseType: !979, size: 64, offset: 7040)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !598, file: !384, line: 167, baseType: !779, size: 64, offset: 7104)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !598, file: !384, line: 168, baseType: !1009, size: 64, offset: 7168)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!402, !381, !618, !450}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !598, file: !384, line: 169, baseType: !1013, size: 64, offset: 7232)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!402, !381, !693, !496}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !598, file: !384, line: 171, baseType: !740, size: 64, offset: 7296)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !598, file: !384, line: 172, baseType: !716, size: 64, offset: 7360)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !598, file: !384, line: 173, baseType: !1019, size: 64, offset: 7424)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!402, !381, !496, !803}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !598, file: !384, line: 174, baseType: !879, size: 64, offset: 7488)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !598, file: !384, line: 175, baseType: !879, size: 64, offset: 7552)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !598, file: !384, line: 177, baseType: !615, size: 64, offset: 7616)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !598, file: !384, line: 178, baseType: !665, size: 64, offset: 7680)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !598, file: !384, line: 179, baseType: !615, size: 64, offset: 7744)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !598, file: !384, line: 180, baseType: !622, size: 64, offset: 7808)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !598, file: !384, line: 181, baseType: !1029, size: 64, offset: 7872)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!402, !381, !406, !668, !669}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !598, file: !384, line: 183, baseType: !939, size: 64, offset: 7936)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !598, file: !384, line: 184, baseType: !700, size: 64, offset: 8000)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !598, file: !384, line: 185, baseType: !1035, size: 64, offset: 8064)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!402, !381, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !598, file: !384, line: 186, baseType: !1040, size: 64, offset: 8128)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!402, !381, !450, !604, !513}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !598, file: !384, line: 187, baseType: !759, size: 64, offset: 8192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !598, file: !384, line: 189, baseType: !1045, size: 64, offset: 8256)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!402, !381, !450, !450, !496, !606}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !598, file: !384, line: 190, baseType: !853, size: 64, offset: 8320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !598, file: !384, line: 191, baseType: !975, size: 64, offset: 8384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !598, file: !384, line: 192, baseType: !979, size: 64, offset: 8448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !598, file: !384, line: 193, baseType: !1052, size: 64, offset: 8512)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!402, !381, !811, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !384, line: 660, size: 5312, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1057, file: !384, line: 661, baseType: !387, size: 4480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1057, file: !384, line: 661, baseType: !820, size: 32, offset: 4480)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1057, file: !384, line: 662, baseType: !450, size: 32, offset: 4512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1057, file: !384, line: 662, baseType: !450, size: 32, offset: 4544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1057, file: !384, line: 662, baseType: !450, size: 32, offset: 4576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1057, file: !384, line: 663, baseType: !450, size: 32, offset: 4608)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1057, file: !384, line: 664, baseType: !450, size: 32, offset: 4640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1057, file: !384, line: 665, baseType: !496, size: 64, offset: 4672)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1057, file: !384, line: 666, baseType: !496, size: 64, offset: 4736)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1057, file: !384, line: 667, baseType: !450, size: 32, offset: 4800)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1057, file: !384, line: 668, baseType: !861, size: 32, offset: 4832)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1057, file: !384, line: 670, baseType: !496, size: 64, offset: 4864)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1057, file: !384, line: 670, baseType: !496, size: 64, offset: 4928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1057, file: !384, line: 671, baseType: !496, size: 64, offset: 4992)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1057, file: !384, line: 672, baseType: !496, size: 64, offset: 5056)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1057, file: !384, line: 673, baseType: !496, size: 64, offset: 5120)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1057, file: !384, line: 674, baseType: !450, size: 32, offset: 5184)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1057, file: !384, line: 675, baseType: !496, size: 64, offset: 5248)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !598, file: !384, line: 195, baseType: !1078, size: 64, offset: 8576)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!402, !1055, !381, !381}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !598, file: !384, line: 196, baseType: !1078, size: 64, offset: 8640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !598, file: !384, line: 197, baseType: !853, size: 64, offset: 8704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !598, file: !384, line: 198, baseType: !975, size: 64, offset: 8768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !598, file: !384, line: 199, baseType: !979, size: 64, offset: 8832)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !598, file: !384, line: 201, baseType: !1086, size: 64, offset: 8896)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!402, !381, !450, !450}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !598, file: !384, line: 202, baseType: !754, size: 64, offset: 8960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !598, file: !384, line: 203, baseType: !622, size: 64, offset: 9024)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !598, file: !384, line: 204, baseType: !808, size: 64, offset: 9088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !598, file: !384, line: 205, baseType: !939, size: 64, offset: 9152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !598, file: !384, line: 206, baseType: !1094, size: 64, offset: 9216)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!402, !406, !381, !450, !668, !669}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !598, file: !384, line: 208, baseType: !1098, size: 64, offset: 9280)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!402, !450, !764}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !598, file: !384, line: 209, baseType: !979, size: 64, offset: 9344)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !598, file: !384, line: 210, baseType: !771, size: 64, offset: 9408)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !383, file: !384, line: 438, baseType: !1104, size: 64, offset: 13952)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !636, line: 60, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1106, file: !116, line: 241, baseType: !406, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !116, line: 242, baseType: !467, size: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1106, file: !116, line: 243, baseType: !450, size: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1106, file: !116, line: 243, baseType: !450, size: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1106, file: !116, line: 244, baseType: !450, size: 32, offset: 160)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1106, file: !116, line: 244, baseType: !450, size: 32, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1106, file: !116, line: 245, baseType: !496, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1106, file: !116, line: 246, baseType: !566, size: 32, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1106, file: !116, line: 247, baseType: !450, size: 32, offset: 352)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1106, file: !116, line: 251, baseType: !450, size: 32, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1106, file: !116, line: 252, baseType: !910, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1106, file: !116, line: 253, baseType: !566, size: 32, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1106, file: !116, line: 254, baseType: !450, size: 32, offset: 544)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1106, file: !116, line: 254, baseType: !450, size: 32, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1106, file: !116, line: 255, baseType: !450, size: 32, offset: 608)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !383, file: !384, line: 438, baseType: !1104, size: 64, offset: 14016)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !384, line: 439, baseType: !487, size: 64, offset: 14080)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !383, file: !384, line: 440, baseType: !1126, size: 32, offset: 14144)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !383, file: !384, line: 441, baseType: !566, size: 32, offset: 14176)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !383, file: !384, line: 442, baseType: !566, size: 32, offset: 14208)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !383, file: !384, line: 443, baseType: !1130, size: 448, offset: 14272)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 448, elements: !1132)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !427)
!1132 = !{!1133}
!1133 = !DISubrange(count: 7)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !383, file: !384, line: 444, baseType: !566, size: 32, offset: 14720)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !383, file: !384, line: 445, baseType: !566, size: 32, offset: 14752)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !383, file: !384, line: 446, baseType: !450, size: 32, offset: 14784)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !383, file: !384, line: 447, baseType: !489, size: 64, offset: 14848)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !383, file: !384, line: 448, baseType: !489, size: 64, offset: 14912)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !383, file: !384, line: 449, baseType: !676, size: 640, offset: 14976)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !383, file: !384, line: 450, baseType: !608, size: 32, offset: 15616)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !383, file: !384, line: 451, baseType: !1142, size: 2880, offset: 15680)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !384, line: 318, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !384, line: 319, size: 2880, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151, !1164, !1165, !1170, !1175, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1190, !1191, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1223, !1224, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1247, !1248, !1249, !1253, !1254}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1143, file: !384, line: 320, baseType: !450, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1143, file: !384, line: 321, baseType: !450, size: 32, offset: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1143, file: !384, line: 322, baseType: !450, size: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1143, file: !384, line: 323, baseType: !450, size: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1143, file: !384, line: 324, baseType: !450, size: 32, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1143, file: !384, line: 325, baseType: !450, size: 32, offset: 160)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1143, file: !384, line: 326, baseType: !1152, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !384, line: 293, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !384, line: 295, size: 448, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1154, file: !384, line: 296, baseType: !1152, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1154, file: !384, line: 297, baseType: !513, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1154, file: !384, line: 297, baseType: !513, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1154, file: !384, line: 298, baseType: !496, size: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1154, file: !384, line: 298, baseType: !496, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1154, file: !384, line: 299, baseType: !450, size: 32, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1154, file: !384, line: 300, baseType: !450, size: 32, offset: 352)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1154, file: !384, line: 301, baseType: !450, size: 32, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1143, file: !384, line: 326, baseType: !1152, size: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1143, file: !384, line: 328, baseType: !1166, size: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!402, !381, !1169, !496}
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1143, file: !384, line: 329, baseType: !1171, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!402, !1169, !1174, !498, !498, !516, !496}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1143, file: !384, line: 330, baseType: !1176, size: 64, offset: 448)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!402, !1169}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1143, file: !384, line: 331, baseType: !1176, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1143, file: !384, line: 334, baseType: !406, size: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1143, file: !384, line: 335, baseType: !467, size: 32, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1143, file: !384, line: 335, baseType: !467, size: 32, offset: 672)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1143, file: !384, line: 336, baseType: !467, size: 32, offset: 704)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1143, file: !384, line: 336, baseType: !467, size: 32, offset: 736)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1143, file: !384, line: 337, baseType: !1186, size: 64, offset: 768)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !407, line: 339, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !407, line: 339, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1143, file: !384, line: 338, baseType: !1186, size: 64, offset: 832)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1143, file: !384, line: 339, baseType: !1192, size: 64, offset: 896)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !407, line: 341, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !407, line: 351, size: 192, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1194, file: !407, line: 354, baseType: !74, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1194, file: !407, line: 355, baseType: !74, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1194, file: !407, line: 356, baseType: !74, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1194, file: !407, line: 361, baseType: !74, size: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1194, file: !407, line: 362, baseType: !562, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1143, file: !384, line: 340, baseType: !450, size: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1143, file: !384, line: 340, baseType: !450, size: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1143, file: !384, line: 341, baseType: !513, size: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1143, file: !384, line: 342, baseType: !496, size: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1143, file: !384, line: 343, baseType: !516, size: 64, offset: 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1143, file: !384, line: 344, baseType: !498, size: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1143, file: !384, line: 345, baseType: !450, size: 32, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1143, file: !384, line: 346, baseType: !1174, size: 64, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1143, file: !384, line: 347, baseType: !566, size: 32, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1143, file: !384, line: 348, baseType: !450, size: 32, offset: 1440)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1143, file: !384, line: 351, baseType: !566, size: 32, offset: 1472)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1143, file: !384, line: 352, baseType: !566, size: 32, offset: 1504)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1143, file: !384, line: 353, baseType: !467, size: 32, offset: 1536)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1143, file: !384, line: 354, baseType: !467, size: 32, offset: 1568)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1143, file: !384, line: 355, baseType: !1174, size: 64, offset: 1600)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1143, file: !384, line: 356, baseType: !1174, size: 64, offset: 1664)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1143, file: !384, line: 357, baseType: !1218, size: 64, offset: 1728)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !384, line: 310, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 308, size: 32, elements: !1221)
!1221 = !{!1222}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1220, file: !384, line: 309, baseType: !450, size: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1143, file: !384, line: 357, baseType: !1218, size: 64, offset: 1792)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1143, file: !384, line: 358, baseType: !1225, size: 64, offset: 1856)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !384, line: 316, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 312, size: 128, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1227, file: !384, line: 313, baseType: !487, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1227, file: !384, line: 314, baseType: !450, size: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1227, file: !384, line: 315, baseType: !429, size: 8, offset: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1143, file: !384, line: 359, baseType: !1225, size: 64, offset: 1920)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1143, file: !384, line: 360, baseType: !1225, size: 64, offset: 1984)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1143, file: !384, line: 361, baseType: !450, size: 32, offset: 2048)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1143, file: !384, line: 362, baseType: !467, size: 32, offset: 2080)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1143, file: !384, line: 363, baseType: !450, size: 32, offset: 2112)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1143, file: !384, line: 364, baseType: !1174, size: 64, offset: 2176)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1143, file: !384, line: 365, baseType: !1192, size: 64, offset: 2240)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1143, file: !384, line: 366, baseType: !467, size: 32, offset: 2304)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1143, file: !384, line: 367, baseType: !467, size: 32, offset: 2336)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1143, file: !384, line: 368, baseType: !1186, size: 64, offset: 2368)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1143, file: !384, line: 369, baseType: !1186, size: 64, offset: 2432)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1143, file: !384, line: 370, baseType: !1244, size: 64, offset: 2496)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1143, file: !384, line: 371, baseType: !1244, size: 64, offset: 2560)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1143, file: !384, line: 372, baseType: !1244, size: 64, offset: 2624)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1143, file: !384, line: 373, baseType: !1250, size: 64, offset: 2688)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !407, line: 331, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !407, line: 331, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1143, file: !384, line: 374, baseType: !562, size: 64, offset: 2752)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1143, file: !384, line: 375, baseType: !1255, size: 64, offset: 2816)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !383, file: !384, line: 451, baseType: !1142, size: 2880, offset: 18560)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !383, file: !384, line: 452, baseType: !1258, size: 64, offset: 21440)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1259)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !384, line: 681, size: 4864, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1260, file: !384, line: 682, baseType: !387, size: 4480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1260, file: !384, line: 682, baseType: !820, size: 32, offset: 4480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1260, file: !384, line: 683, baseType: !566, size: 32, offset: 4512)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1260, file: !384, line: 684, baseType: !450, size: 32, offset: 4544)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1260, file: !384, line: 685, baseType: !972, size: 64, offset: 4608)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1260, file: !384, line: 686, baseType: !513, size: 64, offset: 4672)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1260, file: !384, line: 687, baseType: !1269, size: 64, offset: 4736)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!402, !1258, !618, !487}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1260, file: !384, line: 688, baseType: !487, size: 64, offset: 4800)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !383, file: !384, line: 453, baseType: !1258, size: 64, offset: 21504)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !383, file: !384, line: 454, baseType: !1258, size: 64, offset: 21568)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !383, file: !384, line: 455, baseType: !450, size: 32, offset: 21632)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !383, file: !384, line: 456, baseType: !566, size: 32, offset: 21664)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !383, file: !384, line: 457, baseType: !1278, size: 320, offset: 21696)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !384, line: 399, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 394, size: 320, elements: !1280)
!1280 = !{!1281, !1282, !1286, !1287}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1279, file: !384, line: 395, baseType: !450, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1279, file: !384, line: 396, baseType: !1283, size: 128, offset: 32)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, elements: !1284)
!1284 = !{!1285}
!1285 = !DISubrange(count: 4)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1279, file: !384, line: 397, baseType: !1283, size: 128, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1279, file: !384, line: 398, baseType: !566, size: 32, offset: 288)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !383, file: !384, line: 458, baseType: !566, size: 32, offset: 22016)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !383, file: !384, line: 458, baseType: !566, size: 32, offset: 22048)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !383, file: !384, line: 458, baseType: !566, size: 32, offset: 22080)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !383, file: !384, line: 458, baseType: !566, size: 32, offset: 22112)
