; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/richscale.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/richscale.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!122 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!140 = !{!141, !145, !146, !221, !349, !352, !231, !26, !355, !181, !5}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !142, line: 330, baseType: !143)
!142 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !142, line: 330, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !149, line: 73, size: 4480, elements: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!150 = !{!151, !153, !202, !203, !205, !208, !209, !210, !211, !219, !220, !222, !226, !230, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !244, !245, !247, !248, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !264, !265, !268, !270, !271, !272, !282, !284, !285, !289, !290, !339, !344, !346, !347, !348}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !148, file: !149, line: 74, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !148, file: !149, line: 75, baseType: !154, size: 448, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 448, elements: !200)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !149, line: 53, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 45, size: 448, elements: !157)
!157 = !{!158, !164, !172, !177, !184, !188, !195}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !156, file: !149, line: 46, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !146, !163}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !156, file: !149, line: 47, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!162, !146, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !169, line: 16, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !169, line: 16, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !156, file: !149, line: 48, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!162, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !156, file: !149, line: 49, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!162, !146, !181, !146}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !156, file: !149, line: 50, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!162, !146, !181, !176}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !156, file: !149, line: 51, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!162, !146, !181, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !156, file: !149, line: 52, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!162, !146, !181, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !148, file: !149, line: 76, baseType: !141, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !149, line: 77, baseType: !204, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !207)
!207 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !149, line: 79, baseType: !212, size: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !215, line: 27, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 43, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!218 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !148, file: !149, line: 80, baseType: !204, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !149, line: 81, baseType: !221, size: 32, offset: 992)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !148, file: !149, line: 82, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !148, file: !149, line: 83, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !148, file: !149, line: 84, baseType: !231, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !148, file: !149, line: 85, baseType: !231, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !148, file: !149, line: 86, baseType: !231, size: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !148, file: !149, line: 87, baseType: !231, size: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !148, file: !149, line: 88, baseType: !146, size: 64, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !148, file: !149, line: 89, baseType: !212, size: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 90, baseType: !231, size: 64, offset: 1536)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !148, file: !149, line: 91, baseType: !231, size: 64, offset: 1600)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !148, file: !149, line: 92, baseType: !204, size: 32, offset: 1664)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !148, file: !149, line: 93, baseType: !145, size: 64, offset: 1728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !148, file: !149, line: 94, baseType: !242, size: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !213)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !148, file: !149, line: 95, baseType: !204, size: 32, offset: 1856)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !148, file: !149, line: 95, baseType: !204, size: 32, offset: 1888)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !148, file: !149, line: 96, baseType: !246, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !148, file: !149, line: 96, baseType: !246, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !148, file: !149, line: 97, baseType: !249, size: 64, offset: 2048)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !148, file: !149, line: 97, baseType: !251, size: 64, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !148, file: !149, line: 98, baseType: !204, size: 32, offset: 2176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !148, file: !149, line: 98, baseType: !204, size: 32, offset: 2208)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !148, file: !149, line: 99, baseType: !246, size: 64, offset: 2240)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !148, file: !149, line: 99, baseType: !246, size: 64, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !148, file: !149, line: 100, baseType: !257, size: 64, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !207)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !148, file: !149, line: 100, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !148, file: !149, line: 101, baseType: !204, size: 32, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !148, file: !149, line: 101, baseType: !204, size: 32, offset: 2528)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !148, file: !149, line: 102, baseType: !246, size: 64, offset: 2560)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !148, file: !149, line: 102, baseType: !246, size: 64, offset: 2624)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !148, file: !149, line: 103, baseType: !266, size: 64, offset: 2688)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !148, file: !149, line: 103, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !148, file: !149, line: 104, baseType: !199, size: 64, offset: 2816)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !148, file: !149, line: 105, baseType: !204, size: 32, offset: 2880)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !148, file: !149, line: 106, baseType: !273, size: 128, offset: 2944)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !149, line: 64, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 61, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !276, file: !149, line: 62, baseType: !192, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !149, line: 63, baseType: !145, size: 64, offset: 64)
!280 = !{!281}
!281 = !DISubrange(count: 2)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !148, file: !149, line: 107, baseType: !283, size: 64, offset: 3072)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !148, file: !149, line: 108, baseType: !145, size: 64, offset: 3136)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !148, file: !149, line: 109, baseType: !286, size: 64, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!162, !145}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !148, file: !149, line: 111, baseType: !204, size: 32, offset: 3264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !148, file: !149, line: 112, baseType: !291, size: 320, offset: 3328)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !337)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!162, !295, !146, !145}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !298)
!298 = !{!299, !300, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !297, file: !10, line: 100, baseType: !204, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 101, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !312, !313, !314, !318, !320, !322, !323, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !303, file: !10, line: 84, baseType: !231, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !303, file: !10, line: 85, baseType: !231, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !10, line: 86, baseType: !145, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !303, file: !10, line: 87, baseType: !223, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !10, line: 88, baseType: !310, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !303, file: !10, line: 89, baseType: !183, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !303, file: !10, line: 90, baseType: !231, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !303, file: !10, line: 91, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!317 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !303, file: !10, line: 92, baseType: !319, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !10, line: 93, baseType: !321, size: 32, offset: 544)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !10, line: 94, baseType: !301, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !303, file: !10, line: 95, baseType: !231, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !303, file: !10, line: 96, baseType: !145, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !297, file: !10, line: 103, baseType: !231, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !297, file: !10, line: 104, baseType: !141, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !297, file: !10, line: 106, baseType: !146, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !10, line: 107, baseType: !334, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!337 = !{!338}
!338 = !DISubrange(count: 5)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !148, file: !149, line: 113, baseType: !340, size: 320, offset: 3648)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !337)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!162, !146, !145}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !148, file: !149, line: 114, baseType: !345, size: 320, offset: 3968)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 320, elements: !337)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !148, file: !149, line: 115, baseType: !319, size: 32, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !148, file: !149, line: 120, baseType: !334, size: 64, offset: 4352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !148, file: !149, line: 121, baseType: !319, size: 32, offset: 4416)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !142, line: 331, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !142, line: 331, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !142, line: 338, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !142, line: 338, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !357, line: 1451, baseType: !192)
!357 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!358 = !{i32 7, !"Dwarf Version", i32 4}
!359 = !{i32 2, !"Debug Info Version", i32 3}
!360 = !{i32 1, !"wchar_size", i32 4}
!361 = !{i32 7, !"PIC Level", i32 2}
!362 = !{i32 7, !"uwtable", i32 1}
!363 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!364 = distinct !DISubprogram(name: "KSPRichardsonSetScale", scope: !365, file: !365, line: 21, type: !366, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !613)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/richscale.c", directory: "/home/users/ndemeye/xSDK")
!366 = !DISubroutineType(types: !367)
!367 = !{!162, !368, !258}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !371)
!371 = !{!372, !374, !428, !433, !434, !435, !436, !466, !467, !468, !469, !470, !472, !477, !478, !479, !480, !481, !482, !483, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !506, !512, !513, !514, !515, !520, !521, !522, !523, !528, !529, !530, !531, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !584, !585, !586, !587, !594, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !610, !611, !612}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !102, line: 76, baseType: !373, size: 4480)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !149, line: 122, baseType: !148)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !102, line: 76, baseType: !375, size: 896, offset: 4480)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 896, elements: !200)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !377)
!377 = !{!378, !387, !391, !395, !403, !404, !408, !409, !413, !417, !421, !422, !426, !427}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !376, file: !102, line: 19, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!162, !368, !382, !386}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !383, line: 21, baseType: !384)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !383, line: 21, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !376, file: !102, line: 22, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!162, !368, !382, !382, !386}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !376, file: !102, line: 25, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!162, !368}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !376, file: !102, line: 26, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!162, !368, !399, !399}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !400, line: 16, baseType: !401)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !400, line: 16, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !376, file: !102, line: 27, baseType: !392, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !376, file: !102, line: 28, baseType: !405, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!162, !295, !368}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !376, file: !102, line: 29, baseType: !392, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !376, file: !102, line: 30, baseType: !410, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!162, !368, !257, !257}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !376, file: !102, line: 31, baseType: !414, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!162, !368, !204, !257, !257, !249}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !376, file: !102, line: 32, baseType: !418, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!162, !368, !319, !319, !249, !386, !257, !257}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !376, file: !102, line: 33, baseType: !392, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !376, file: !102, line: 34, baseType: !423, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!162, !368, !168}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !376, file: !102, line: 35, baseType: !392, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !376, file: !102, line: 36, baseType: !423, size: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !370, file: !102, line: 77, baseType: !429, size: 64, offset: 5376)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !430, line: 14, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !430, line: 14, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !370, file: !102, line: 78, baseType: !319, size: 32, offset: 5440)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !370, file: !102, line: 79, baseType: !319, size: 32, offset: 5472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !370, file: !102, line: 81, baseType: !204, size: 32, offset: 5504)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !370, file: !102, line: 82, baseType: !437, size: 64, offset: 5568)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !440)
!440 = !{!441, !442, !462, !463, !464, !465}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !439, file: !102, line: 55, baseType: !373, size: 4480)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !439, file: !102, line: 55, baseType: !443, size: 448, offset: 4480)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 448, elements: !200)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !445)
!445 = !{!446, !450, !451, !455, !456, !457, !461}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !444, file: !102, line: 42, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!162, !437, !382, !382}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !444, file: !102, line: 43, baseType: !447, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !444, file: !102, line: 44, baseType: !452, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!162, !437}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !444, file: !102, line: 45, baseType: !452, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !444, file: !102, line: 46, baseType: !452, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !444, file: !102, line: 47, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!162, !437, !168}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !444, file: !102, line: 48, baseType: !452, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !439, file: !102, line: 56, baseType: !368, size: 64, offset: 4928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !439, file: !102, line: 57, baseType: !399, size: 64, offset: 4992)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !439, file: !102, line: 58, baseType: !242, size: 64, offset: 5056)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !439, file: !102, line: 59, baseType: !145, size: 64, offset: 5120)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !370, file: !102, line: 83, baseType: !319, size: 32, offset: 5632)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !370, file: !102, line: 84, baseType: !319, size: 32, offset: 5664)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !370, file: !102, line: 85, baseType: !319, size: 32, offset: 5696)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !370, file: !102, line: 86, baseType: !319, size: 32, offset: 5728)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !370, file: !102, line: 87, baseType: !471, size: 32, offset: 5760)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !370, file: !102, line: 88, baseType: !473, size: 384, offset: 5792)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 384, elements: !474)
!474 = !{!475, !476}
!475 = !DISubrange(count: 4)
!476 = !DISubrange(count: 3)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !370, file: !102, line: 89, baseType: !258, size: 64, offset: 6208)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !370, file: !102, line: 90, baseType: !258, size: 64, offset: 6272)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !370, file: !102, line: 91, baseType: !258, size: 64, offset: 6336)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !370, file: !102, line: 92, baseType: !258, size: 64, offset: 6400)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !370, file: !102, line: 93, baseType: !258, size: 64, offset: 6464)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !370, file: !102, line: 94, baseType: !258, size: 64, offset: 6528)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !370, file: !102, line: 95, baseType: !484, size: 32, offset: 6592)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !370, file: !102, line: 96, baseType: !319, size: 32, offset: 6624)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !370, file: !102, line: 98, baseType: !382, size: 64, offset: 6656)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !370, file: !102, line: 98, baseType: !382, size: 64, offset: 6720)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !370, file: !102, line: 102, baseType: !257, size: 64, offset: 6784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !370, file: !102, line: 103, baseType: !257, size: 64, offset: 6848)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !370, file: !102, line: 104, baseType: !204, size: 32, offset: 6912)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !370, file: !102, line: 105, baseType: !204, size: 32, offset: 6944)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !370, file: !102, line: 106, baseType: !319, size: 32, offset: 6976)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !370, file: !102, line: 107, baseType: !257, size: 64, offset: 7040)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !370, file: !102, line: 108, baseType: !257, size: 64, offset: 7104)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !370, file: !102, line: 109, baseType: !204, size: 32, offset: 7168)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !370, file: !102, line: 110, baseType: !204, size: 32, offset: 7200)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !370, file: !102, line: 111, baseType: !319, size: 32, offset: 7232)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !370, file: !102, line: 113, baseType: !204, size: 32, offset: 7264)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !370, file: !102, line: 114, baseType: !319, size: 32, offset: 7296)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !370, file: !102, line: 117, baseType: !204, size: 32, offset: 7328)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !370, file: !102, line: 120, baseType: !502, size: 320, offset: 7360)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 320, elements: !337)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!162, !368, !204, !258, !145}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !370, file: !102, line: 121, baseType: !507, size: 320, offset: 7680)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 320, elements: !337)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!162, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !370, file: !102, line: 122, baseType: !345, size: 320, offset: 8000)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !370, file: !102, line: 123, baseType: !204, size: 32, offset: 8320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !370, file: !102, line: 124, baseType: !319, size: 32, offset: 8352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !370, file: !102, line: 126, baseType: !516, size: 320, offset: 8384)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 320, elements: !337)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!162, !368, !145}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !370, file: !102, line: 127, baseType: !507, size: 320, offset: 8704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !370, file: !102, line: 128, baseType: !345, size: 320, offset: 9024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !370, file: !102, line: 129, baseType: !204, size: 32, offset: 9344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !370, file: !102, line: 131, baseType: !524, size: 64, offset: 9408)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!162, !368, !204, !258, !527, !145}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !370, file: !102, line: 132, baseType: !286, size: 64, offset: 9472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !370, file: !102, line: 133, baseType: !145, size: 64, offset: 9536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !370, file: !102, line: 135, baseType: !145, size: 64, offset: 9600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !370, file: !102, line: 137, baseType: !532, size: 64, offset: 9664)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !102, line: 139, baseType: !145, size: 64, offset: 9728)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9792)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9824)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9856)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9888)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9920)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9952)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 9984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10080)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10112)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10144)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10176)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !370, file: !102, line: 142, baseType: !319, size: 32, offset: 10208)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10240)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10304)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10432)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10496)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10560)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10624)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10688)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10752)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10816)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10880)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 10944)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 11008)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !370, file: !102, line: 143, baseType: !168, size: 64, offset: 11072)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11136)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11168)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11200)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11232)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11264)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11296)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11328)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11360)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11392)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11424)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11456)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11488)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11520)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !370, file: !102, line: 144, baseType: !565, size: 32, offset: 11552)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !370, file: !102, line: 147, baseType: !204, size: 32, offset: 11584)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !370, file: !102, line: 148, baseType: !386, size: 64, offset: 11648)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !370, file: !102, line: 150, baseType: !582, size: 32, offset: 11712)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !370, file: !102, line: 151, baseType: !319, size: 32, offset: 11744)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !370, file: !102, line: 153, baseType: !204, size: 32, offset: 11776)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !370, file: !102, line: 154, baseType: !204, size: 32, offset: 11808)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !370, file: !102, line: 156, baseType: !319, size: 32, offset: 11840)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !370, file: !102, line: 161, baseType: !588, size: 192, offset: 11904)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !102, line: 157, size: 192, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !588, file: !102, line: 158, baseType: !399, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !588, file: !102, line: 158, baseType: !399, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !588, file: !102, line: 159, baseType: !319, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !588, file: !102, line: 160, baseType: !319, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !370, file: !102, line: 163, baseType: !595, size: 32, offset: 12096)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !370, file: !102, line: 165, baseType: !471, size: 32, offset: 12128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !370, file: !102, line: 166, baseType: !595, size: 32, offset: 12160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !370, file: !102, line: 171, baseType: !319, size: 32, offset: 12192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !370, file: !102, line: 172, baseType: !319, size: 32, offset: 12224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !370, file: !102, line: 173, baseType: !319, size: 32, offset: 12256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !370, file: !102, line: 174, baseType: !382, size: 64, offset: 12288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !370, file: !102, line: 175, baseType: !382, size: 64, offset: 12352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !370, file: !102, line: 177, baseType: !204, size: 32, offset: 12416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !370, file: !102, line: 178, baseType: !319, size: 32, offset: 12448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !370, file: !102, line: 180, baseType: !168, size: 64, offset: 12480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !370, file: !102, line: 182, baseType: !607, size: 64, offset: 12544)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!162, !368, !382, !382, !145}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !370, file: !102, line: 183, baseType: !607, size: 64, offset: 12608)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !370, file: !102, line: 184, baseType: !145, size: 64, offset: 12672)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !370, file: !102, line: 184, baseType: !145, size: 64, offset: 12736)
!613 = !{!614, !615, !616, !617, !619, !620, !623, !624, !626, !630, !631, !633, !639, !640, !642, !645, !646, !648, !651, !652, !655, !656, !658, !662}
!614 = !DILocalVariable(name: "ksp", arg: 1, scope: !364, file: !365, line: 21, type: !368)
!615 = !DILocalVariable(name: "scale", arg: 2, scope: !364, file: !365, line: 21, type: !258)
!616 = !DILocalVariable(name: "ierr", scope: !364, file: !365, line: 23, type: !162)
!617 = !DILocalVariable(name: "_7_ierr", scope: !618, file: !365, line: 27, type: !162)
!618 = distinct !DILexicalBlock(scope: !364, file: !365, line: 27, column: 3)
!619 = !DILocalVariable(name: "b0", scope: !618, file: !365, line: 27, type: !258)
!620 = !DILocalVariable(name: "b1", scope: !618, file: !365, line: 27, type: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 192, elements: !622)
!622 = !{!476}
!623 = !DILocalVariable(name: "b2", scope: !618, file: !365, line: 27, type: !621)
!624 = !DILocalVariable(name: "_4_ierr", scope: !625, file: !365, line: 27, type: !162)
!625 = distinct !DILexicalBlock(scope: !618, file: !365, line: 27, column: 3)
!626 = !DILocalVariable(name: "a_b1", scope: !625, file: !365, line: 27, type: !627)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 192, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 6)
!630 = !DILocalVariable(name: "a_b2", scope: !625, file: !365, line: 27, type: !627)
!631 = !DILocalVariable(name: "_7_errorcode", scope: !632, file: !365, line: 27, type: !162)
!632 = distinct !DILexicalBlock(scope: !625, file: !365, line: 27, column: 3)
!633 = !DILocalVariable(name: "_7_errorstring", scope: !634, file: !365, line: 27, type: !636)
!634 = distinct !DILexicalBlock(scope: !635, file: !365, line: 27, column: 3)
!635 = distinct !DILexicalBlock(scope: !632, file: !365, line: 27, column: 3)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2048, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 256)
!639 = !DILocalVariable(name: "_7_resultlen", scope: !634, file: !365, line: 27, type: !221)
!640 = !DILocalVariable(name: "_7_errorcode", scope: !641, file: !365, line: 27, type: !162)
!641 = distinct !DILexicalBlock(scope: !625, file: !365, line: 27, column: 3)
!642 = !DILocalVariable(name: "_7_errorstring", scope: !643, file: !365, line: 27, type: !636)
!643 = distinct !DILexicalBlock(scope: !644, file: !365, line: 27, column: 3)
!644 = distinct !DILexicalBlock(scope: !641, file: !365, line: 27, column: 3)
!645 = !DILocalVariable(name: "_7_resultlen", scope: !643, file: !365, line: 27, type: !221)
!646 = !DILocalVariable(name: "_7_errorcode", scope: !647, file: !365, line: 27, type: !162)
!647 = distinct !DILexicalBlock(scope: !618, file: !365, line: 27, column: 3)
!648 = !DILocalVariable(name: "_7_errorstring", scope: !649, file: !365, line: 27, type: !636)
!649 = distinct !DILexicalBlock(scope: !650, file: !365, line: 27, column: 3)
!650 = distinct !DILexicalBlock(scope: !647, file: !365, line: 27, column: 3)
!651 = !DILocalVariable(name: "_7_resultlen", scope: !649, file: !365, line: 27, type: !221)
!652 = !DILocalVariable(name: "_7_f", scope: !653, file: !365, line: 28, type: !654)
!653 = distinct !DILexicalBlock(scope: !364, file: !365, line: 28, column: 10)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!655 = !DILocalVariable(name: "_7_ierr", scope: !653, file: !365, line: 28, type: !162)
!656 = !DILocalVariable(name: "ierr__", scope: !657, file: !365, line: 28, type: !162)
!657 = distinct !DILexicalBlock(scope: !653, file: !365, line: 28, column: 10)
!658 = !DILocalVariable(name: "ierr__", scope: !659, file: !365, line: 28, type: !162)
!659 = distinct !DILexicalBlock(scope: !660, file: !365, line: 28, column: 10)
!660 = distinct !DILexicalBlock(scope: !661, file: !365, line: 28, column: 10)
