; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/ftn-custom/zpartitionf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/ftn-custom/zpartitionf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_MatPartitioning = type { %struct._p_PetscObject, [1 x %struct._MatPartitioningOps], %struct._p_Mat*, i32*, double*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !{!301, !304, !309, !313, !314, !307, !315, !318, !320}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !302, line: 46, baseType: !303)
!302 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!303 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !306, line: 135, baseType: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !308, line: 100, baseType: !303)
!308 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !310, line: 330, baseType: !311)
!310 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !310, line: 330, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!322 = !{i32 7, !"Dwarf Version", i32 4}
!323 = !{i32 2, !"Debug Info Version", i32 3}
!324 = !{i32 1, !"wchar_size", i32 4}
!325 = !{i32 7, !"PIC Level", i32 2}
!326 = !{i32 7, !"uwtable", i32 1}
!327 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!328 = distinct !DISubprogram(name: "matpartitioningsetvertexweights_", scope: !329, file: !329, line: 17, type: !330, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1332)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/partition/ftn-custom/zpartitionf.c", directory: "/home/users/ndemeye/xSDK")
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332, !574, !1331}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !36, line: 1427, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !336, line: 527, size: 5248, elements: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!337 = !{!338, !533, !560, !1325, !1326, !1327, !1328, !1329, !1330}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !335, file: !336, line: 528, baseType: !339, size: 4480)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !340, line: 122, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !340, line: 73, size: 4480, elements: !342)
!342 = !{!343, !345, !390, !391, !393, !396, !397, !398, !399, !407, !408, !410, !414, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !430, !431, !432, !434, !435, !437, !439, !440, !441, !442, !443, !446, !448, !449, !450, !451, !452, !455, !457, !458, !459, !469, !471, !472, !476, !477, !523, !528, !530, !531, !532}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !341, file: !340, line: 74, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !341, file: !340, line: 75, baseType: !346, size: 448, offset: 64)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 448, elements: !388)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !340, line: 53, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 45, size: 448, elements: !349)
!349 = !{!350, !358, !366, !371, !375, !379, !383}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !348, file: !340, line: 46, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !355, !357}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !348, file: !340, line: 47, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!354, !355, !362}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !363, line: 16, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !363, line: 16, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !348, file: !340, line: 48, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!354, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !348, file: !340, line: 49, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!354, !355, !320, !355}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !348, file: !340, line: 50, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!354, !355, !320, !370}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !348, file: !340, line: 51, baseType: !380, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!354, !355, !320, !315}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !348, file: !340, line: 52, baseType: !384, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!354, !355, !320, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!388 = !{!389}
!389 = !DISubrange(count: 1)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !341, file: !340, line: 76, baseType: !309, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !340, line: 77, baseType: !392, size: 32, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !341, file: !340, line: 78, baseType: !394, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !395)
!395 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !341, file: !340, line: 78, baseType: !394, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !341, file: !340, line: 78, baseType: !394, size: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !341, file: !340, line: 78, baseType: !394, size: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !340, line: 79, baseType: !400, size: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !403, line: 27, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !405, line: 43, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!406 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !341, file: !340, line: 80, baseType: !392, size: 32, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !341, file: !340, line: 81, baseType: !409, size: 32, offset: 992)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !341, file: !340, line: 82, baseType: !411, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !341, file: !340, line: 83, baseType: !415, size: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !341, file: !340, line: 84, baseType: !318, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !341, file: !340, line: 85, baseType: !318, size: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !341, file: !340, line: 86, baseType: !318, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !341, file: !340, line: 87, baseType: !318, size: 64, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !341, file: !340, line: 88, baseType: !355, size: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !341, file: !340, line: 89, baseType: !400, size: 64, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !340, line: 90, baseType: !318, size: 64, offset: 1536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !341, file: !340, line: 91, baseType: !318, size: 64, offset: 1600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !341, file: !340, line: 92, baseType: !392, size: 32, offset: 1664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !341, file: !340, line: 93, baseType: !313, size: 64, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !341, file: !340, line: 94, baseType: !429, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !401)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !341, file: !340, line: 95, baseType: !392, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !341, file: !340, line: 95, baseType: !392, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !341, file: !340, line: 96, baseType: !433, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !341, file: !340, line: 96, baseType: !433, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !341, file: !340, line: 97, baseType: !436, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !341, file: !340, line: 97, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !341, file: !340, line: 98, baseType: !392, size: 32, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !341, file: !340, line: 98, baseType: !392, size: 32, offset: 2208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !341, file: !340, line: 99, baseType: !433, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !341, file: !340, line: 99, baseType: !433, size: 64, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !341, file: !340, line: 100, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !395)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !341, file: !340, line: 100, baseType: !447, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !341, file: !340, line: 101, baseType: !392, size: 32, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !341, file: !340, line: 101, baseType: !392, size: 32, offset: 2528)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !341, file: !340, line: 102, baseType: !433, size: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !341, file: !340, line: 102, baseType: !433, size: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !341, file: !340, line: 103, baseType: !453, size: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !445)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !341, file: !340, line: 103, baseType: !456, size: 64, offset: 2752)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !341, file: !340, line: 104, baseType: !387, size: 64, offset: 2816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !341, file: !340, line: 105, baseType: !392, size: 32, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !341, file: !340, line: 106, baseType: !460, size: 128, offset: 2944)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !467)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !340, line: 64, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 61, size: 128, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !463, file: !340, line: 62, baseType: !315, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !463, file: !340, line: 63, baseType: !313, size: 64, offset: 64)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !341, file: !340, line: 107, baseType: !470, size: 64, offset: 3072)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64, elements: !467)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !341, file: !340, line: 108, baseType: !313, size: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !341, file: !340, line: 109, baseType: !473, size: 64, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!354, !313}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !341, file: !340, line: 111, baseType: !392, size: 32, offset: 3264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !341, file: !340, line: 112, baseType: !478, size: 320, offset: 3328)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !521)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!354, !482, !355, !313}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !485)
!485 = !{!486, !487, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !484, file: !10, line: 100, baseType: !392, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !10, line: 101, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !499, !500, !501, !502, !504, !506, !507, !508}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !490, file: !10, line: 84, baseType: !318, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !490, file: !10, line: 85, baseType: !318, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !10, line: 86, baseType: !313, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !490, file: !10, line: 87, baseType: !411, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !490, file: !10, line: 88, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !490, file: !10, line: 89, baseType: !319, size: 8, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !490, file: !10, line: 90, baseType: !318, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !490, file: !10, line: 91, baseType: !301, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !10, line: 92, baseType: !503, size: 32, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !10, line: 93, baseType: !505, size: 32, offset: 544)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !10, line: 94, baseType: !488, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !490, file: !10, line: 95, baseType: !318, size: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !490, file: !10, line: 96, baseType: !313, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !484, file: !10, line: 102, baseType: !318, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !484, file: !10, line: 102, baseType: !318, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !484, file: !10, line: 103, baseType: !318, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !484, file: !10, line: 104, baseType: !309, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !484, file: !10, line: 105, baseType: !503, size: 32, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !484, file: !10, line: 105, baseType: !503, size: 32, offset: 416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !484, file: !10, line: 105, baseType: !503, size: 32, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !484, file: !10, line: 106, baseType: !355, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !484, file: !10, line: 107, baseType: !518, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!521 = !{!522}
!522 = !DISubrange(count: 5)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !341, file: !340, line: 113, baseType: !524, size: 320, offset: 3648)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !521)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!354, !355, !313}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !341, file: !340, line: 114, baseType: !529, size: 320, offset: 3968)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !521)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !341, file: !340, line: 115, baseType: !503, size: 32, offset: 4288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !341, file: !340, line: 120, baseType: !518, size: 64, offset: 4352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !341, file: !340, line: 121, baseType: !503, size: 32, offset: 4416)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !335, file: !336, line: 528, baseType: !534, size: 384, offset: 4480)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 384, elements: !388)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatPartitioningOps", file: !336, line: 518, size: 384, elements: !536)
!536 = !{!537, !546, !547, !551, !555, !559}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !535, file: !336, line: 519, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!354, !333, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !543, line: 11, baseType: !544)
!543 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !543, line: 11, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "applynd", scope: !535, file: !336, line: 520, baseType: !538, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !535, file: !336, line: 521, baseType: !548, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!354, !482, !333}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !535, file: !336, line: 522, baseType: !552, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!354, !333}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !535, file: !336, line: 523, baseType: !556, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!354, !333, !362}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !535, file: !336, line: 524, baseType: !538, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !335, file: !336, line: 529, baseType: !561, size: 64, offset: 4864)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !336, line: 436, size: 23424, elements: !564)
!564 = !{!565, !566, !1068, !1088, !1089, !1090, !1092, !1093, !1094, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1221, !1222, !1238, !1239, !1240, !1241, !1242, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1277, !1297, !1298, !1300, !1301, !1302, !1303, !1304, !1305, !1323, !1324}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !563, file: !336, line: 437, baseType: !339, size: 4480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !563, file: !336, line: 437, baseType: !567, size: 9472, offset: 4480)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 9472, elements: !388)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !336, line: 32, size: 9472, elements: !569)
!569 = !{!570, !579, !583, !584, !591, !595, !596, !597, !598, !599, !600, !601, !621, !625, !630, !636, !655, !660, !664, !665, !670, !675, !676, !681, !685, !689, !693, !697, !701, !702, !703, !704, !705, !709, !710, !715, !716, !717, !718, !719, !724, !731, !735, !739, !743, !747, !751, !752, !756, !757, !764, !769, !770, !771, !772, !834, !842, !843, !847, !848, !852, !853, !857, !862, !863, !867, !871, !878, !879, !880, !881, !882, !883, !888, !889, !893, !897, !901, !902, !903, !907, !917, !918, !922, !923, !927, !928, !932, !933, !938, !939, !943, !947, !948, !949, !950, !951, !952, !953, !957, !958, !959, !960, !961, !962, !966, !967, !968, !969, !970, !971, !972, !973, !977, !981, !982, !983, !987, !988, !989, !990, !991, !992, !993, !997, !998, !999, !1004, !1008, !1009, !1013, !1014, !1015, !1016, !1042, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1062, !1066, !1067}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !568, file: !336, line: 34, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!354, !561, !392, !574, !392, !574, !576, !578}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !568, file: !336, line: 35, baseType: !580, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!354, !561, !392, !436, !438, !456}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !568, file: !336, line: 36, baseType: !580, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !568, file: !336, line: 37, baseType: !585, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!354, !561, !588, !588}
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !568, file: !336, line: 38, baseType: !592, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!354, !561, !588, !588, !588}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !568, file: !336, line: 40, baseType: !585, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !568, file: !336, line: 41, baseType: !592, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !568, file: !336, line: 42, baseType: !585, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !568, file: !336, line: 43, baseType: !592, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !568, file: !336, line: 44, baseType: !585, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !568, file: !336, line: 46, baseType: !592, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !568, file: !336, line: 47, baseType: !602, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!354, !561, !542, !542, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !608, file: !36, line: 1227, baseType: !445, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !608, file: !36, line: 1228, baseType: !445, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !608, file: !36, line: 1229, baseType: !445, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !608, file: !36, line: 1230, baseType: !445, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !608, file: !36, line: 1231, baseType: !445, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !608, file: !36, line: 1232, baseType: !445, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !608, file: !36, line: 1233, baseType: !445, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !608, file: !36, line: 1234, baseType: !445, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !608, file: !36, line: 1236, baseType: !445, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !608, file: !36, line: 1237, baseType: !445, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !608, file: !36, line: 1238, baseType: !445, size: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !568, file: !336, line: 48, baseType: !622, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!354, !561, !542, !605}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !568, file: !336, line: 49, baseType: !626, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!354, !561, !588, !445, !629, !445, !392, !392, !588}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !568, file: !336, line: 50, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!354, !561, !634, !635}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !568, file: !336, line: 52, baseType: !637, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!354, !561, !640, !641}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !643, file: !36, line: 593, baseType: !394, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !643, file: !36, line: 594, baseType: !394, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !643, file: !36, line: 594, baseType: !394, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !643, file: !36, line: 594, baseType: !394, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !643, file: !36, line: 595, baseType: !394, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !643, file: !36, line: 596, baseType: !394, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !643, file: !36, line: 597, baseType: !394, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !643, file: !36, line: 598, baseType: !394, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !643, file: !36, line: 598, baseType: !394, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !643, file: !36, line: 599, baseType: !394, size: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !568, file: !336, line: 53, baseType: !656, size: 64, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!354, !561, !561, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !568, file: !336, line: 54, baseType: !661, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!354, !561, !588}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !568, file: !336, line: 55, baseType: !585, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !568, file: !336, line: 56, baseType: !666, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!354, !561, !669, !444}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !568, file: !336, line: 58, baseType: !671, size: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!354, !561, !674}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !568, file: !336, line: 59, baseType: !671, size: 64, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !568, file: !336, line: 60, baseType: !677, size: 64, offset: 1408)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!354, !561, !680, !503}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !568, file: !336, line: 61, baseType: !682, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!354, !561}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !568, file: !336, line: 63, baseType: !686, size: 64, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!354, !561, !392, !574, !454, !588, !588}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !568, file: !336, line: 64, baseType: !690, size: 64, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!354, !561, !561, !542, !542, !605}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !568, file: !336, line: 65, baseType: !694, size: 64, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!354, !561, !561, !605}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !568, file: !336, line: 66, baseType: !698, size: 64, offset: 1728)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!354, !561, !561, !542, !605}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !568, file: !336, line: 67, baseType: !694, size: 64, offset: 1792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !568, file: !336, line: 69, baseType: !682, size: 64, offset: 1856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !568, file: !336, line: 70, baseType: !690, size: 64, offset: 1920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !568, file: !336, line: 71, baseType: !698, size: 64, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !568, file: !336, line: 72, baseType: !706, size: 64, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!354, !561, !635}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !568, file: !336, line: 73, baseType: !682, size: 64, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !568, file: !336, line: 75, baseType: !711, size: 64, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!354, !561, !714, !635}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !568, file: !336, line: 76, baseType: !585, size: 64, offset: 2240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !568, file: !336, line: 77, baseType: !585, size: 64, offset: 2304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !568, file: !336, line: 78, baseType: !602, size: 64, offset: 2368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !568, file: !336, line: 79, baseType: !622, size: 64, offset: 2432)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !568, file: !336, line: 81, baseType: !720, size: 64, offset: 2496)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!354, !561, !454, !561, !723}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !568, file: !336, line: 82, baseType: !725, size: 64, offset: 2560)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!354, !561, !392, !728, !728, !634, !730}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !568, file: !336, line: 83, baseType: !732, size: 64, offset: 2624)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!354, !561, !392, !541, !392}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !568, file: !336, line: 84, baseType: !736, size: 64, offset: 2688)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!354, !561, !392, !574, !392, !574, !453}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !568, file: !336, line: 85, baseType: !740, size: 64, offset: 2752)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!354, !561, !561, !723}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !568, file: !336, line: 87, baseType: !744, size: 64, offset: 2816)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!354, !561, !588, !436}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !568, file: !336, line: 88, baseType: !748, size: 64, offset: 2880)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!354, !561, !454}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !568, file: !336, line: 89, baseType: !748, size: 64, offset: 2944)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !568, file: !336, line: 90, baseType: !753, size: 64, offset: 3008)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!354, !561, !588, !578}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !568, file: !336, line: 91, baseType: !686, size: 64, offset: 3072)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !568, file: !336, line: 93, baseType: !758, size: 64, offset: 3136)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!354, !561, !761}
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !568, file: !336, line: 94, baseType: !765, size: 64, offset: 3200)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!354, !561, !392, !503, !503, !436, !768, !768, !659}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !568, file: !336, line: 95, baseType: !765, size: 64, offset: 3264)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !568, file: !336, line: 96, baseType: !765, size: 64, offset: 3328)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !568, file: !336, line: 97, baseType: !765, size: 64, offset: 3392)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !568, file: !336, line: 99, baseType: !773, size: 64, offset: 3456)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!354, !561, !776, !779}
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !543, line: 51, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !543, line: 51, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !336, line: 609, size: 6208, elements: !782)
!782 = !{!783, !784, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !803, !810, !811, !812, !813, !814, !815, !816, !817, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832, !833}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !781, file: !336, line: 610, baseType: !339, size: 4480)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !781, file: !336, line: 610, baseType: !785, size: 32, offset: 4480)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !388)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !781, file: !336, line: 611, baseType: !392, size: 32, offset: 4512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !781, file: !336, line: 611, baseType: !392, size: 32, offset: 4544)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !781, file: !336, line: 611, baseType: !392, size: 32, offset: 4576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !781, file: !336, line: 612, baseType: !392, size: 32, offset: 4608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !781, file: !336, line: 613, baseType: !392, size: 32, offset: 4640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !781, file: !336, line: 614, baseType: !436, size: 64, offset: 4672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !781, file: !336, line: 615, baseType: !438, size: 64, offset: 4736)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !781, file: !336, line: 616, baseType: !541, size: 64, offset: 4800)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !781, file: !336, line: 617, baseType: !436, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !781, file: !336, line: 618, baseType: !796, size: 64, offset: 4928)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !336, line: 602, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 598, size: 128, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !798, file: !336, line: 599, baseType: !392, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !798, file: !336, line: 600, baseType: !392, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !798, file: !336, line: 601, baseType: !453, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !781, file: !336, line: 619, baseType: !804, size: 64, offset: 4992)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !336, line: 607, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 604, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !806, file: !336, line: 605, baseType: !392, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !806, file: !336, line: 606, baseType: !453, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !781, file: !336, line: 620, baseType: !453, size: 64, offset: 5056)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !781, file: !336, line: 621, baseType: !445, size: 64, offset: 5120)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !781, file: !336, line: 622, baseType: !445, size: 64, offset: 5184)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !781, file: !336, line: 623, baseType: !588, size: 64, offset: 5248)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !781, file: !336, line: 623, baseType: !588, size: 64, offset: 5312)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !781, file: !336, line: 623, baseType: !588, size: 64, offset: 5376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !781, file: !336, line: 624, baseType: !503, size: 32, offset: 5440)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !781, file: !336, line: 625, baseType: !818, size: 64, offset: 5504)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!354}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !781, file: !336, line: 626, baseType: !313, size: 64, offset: 5568)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !781, file: !336, line: 627, baseType: !588, size: 64, offset: 5632)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !781, file: !336, line: 628, baseType: !392, size: 32, offset: 5696)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !781, file: !336, line: 629, baseType: !320, size: 64, offset: 5760)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !781, file: !336, line: 630, baseType: !826, size: 32, offset: 5824)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !781, file: !336, line: 631, baseType: !392, size: 32, offset: 5856)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !781, file: !336, line: 631, baseType: !392, size: 32, offset: 5888)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !781, file: !336, line: 632, baseType: !503, size: 32, offset: 5920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !781, file: !336, line: 633, baseType: !503, size: 32, offset: 5952)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !781, file: !336, line: 634, baseType: !315, size: 64, offset: 6016)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !781, file: !336, line: 634, baseType: !313, size: 64, offset: 6080)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !781, file: !336, line: 635, baseType: !400, size: 64, offset: 6144)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !568, file: !336, line: 100, baseType: !835, size: 64, offset: 3520)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!354, !561, !392, !392, !838, !841}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !840)
!840 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !568, file: !336, line: 101, baseType: !682, size: 64, offset: 3584)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !568, file: !336, line: 102, baseType: !844, size: 64, offset: 3648)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!354, !561, !542, !542, !635}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !568, file: !336, line: 103, baseType: !571, size: 64, offset: 3712)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !568, file: !336, line: 105, baseType: !849, size: 64, offset: 3776)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!354, !561, !542, !542, !634, !635}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !568, file: !336, line: 106, baseType: !682, size: 64, offset: 3840)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !568, file: !336, line: 107, baseType: !854, size: 64, offset: 3904)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!354, !561, !362}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !568, file: !336, line: 108, baseType: !858, size: 64, offset: 3968)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!354, !561, !861, !634, !635}
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !568, file: !336, line: 109, baseType: !818, size: 64, offset: 4032)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !568, file: !336, line: 111, baseType: !864, size: 64, offset: 4096)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!354, !561, !561, !561, !445, !561}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !568, file: !336, line: 112, baseType: !868, size: 64, offset: 4160)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!354, !561, !561, !561, !561}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !568, file: !336, line: 113, baseType: !872, size: 64, offset: 4224)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!354, !561, !875, !875}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !543, line: 30, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !543, line: 30, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !568, file: !336, line: 114, baseType: !571, size: 64, offset: 4288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !568, file: !336, line: 115, baseType: !686, size: 64, offset: 4352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !568, file: !336, line: 117, baseType: !744, size: 64, offset: 4416)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !568, file: !336, line: 118, baseType: !744, size: 64, offset: 4480)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !568, file: !336, line: 119, baseType: !858, size: 64, offset: 4544)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !568, file: !336, line: 120, baseType: !884, size: 64, offset: 4608)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!354, !561, !887, !659}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !568, file: !336, line: 121, baseType: !818, size: 64, offset: 4672)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !568, file: !336, line: 123, baseType: !890, size: 64, offset: 4736)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!354, !561, !392, !313}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !568, file: !336, line: 124, baseType: !894, size: 64, offset: 4800)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!354, !561, !779, !588, !313}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !568, file: !336, line: 125, baseType: !898, size: 64, offset: 4864)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!354, !482, !561}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !568, file: !336, line: 126, baseType: !585, size: 64, offset: 4928)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !568, file: !336, line: 127, baseType: !585, size: 64, offset: 4992)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !568, file: !336, line: 129, baseType: !904, size: 64, offset: 5056)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!354, !561, !541}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !568, file: !336, line: 130, baseType: !908, size: 64, offset: 5120)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!354, !561, !911, !911}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !913, file: !60, line: 653, baseType: !392, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !913, file: !60, line: 653, baseType: !588, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !568, file: !336, line: 131, baseType: !908, size: 64, offset: 5184)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !568, file: !336, line: 132, baseType: !919, size: 64, offset: 5248)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!354, !561, !436, !436, !436}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !568, file: !336, line: 133, baseType: !854, size: 64, offset: 5312)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !568, file: !336, line: 135, baseType: !924, size: 64, offset: 5376)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!354, !561, !445, !659}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !568, file: !336, line: 136, baseType: !924, size: 64, offset: 5440)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !568, file: !336, line: 137, baseType: !929, size: 64, offset: 5504)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!354, !561, !659}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !568, file: !336, line: 138, baseType: !571, size: 64, offset: 5568)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !568, file: !336, line: 139, baseType: !934, size: 64, offset: 5632)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!354, !561, !937, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !568, file: !336, line: 141, baseType: !818, size: 64, offset: 5696)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !568, file: !336, line: 142, baseType: !940, size: 64, offset: 5760)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!354, !561, !561, !445, !561}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !568, file: !336, line: 143, baseType: !944, size: 64, offset: 5824)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!354, !561, !561, !561}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !568, file: !336, line: 144, baseType: !818, size: 64, offset: 5888)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !568, file: !336, line: 145, baseType: !940, size: 64, offset: 5952)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !568, file: !336, line: 147, baseType: !944, size: 64, offset: 6016)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !568, file: !336, line: 148, baseType: !818, size: 64, offset: 6080)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !568, file: !336, line: 149, baseType: !940, size: 64, offset: 6144)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !568, file: !336, line: 150, baseType: !944, size: 64, offset: 6208)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !568, file: !336, line: 151, baseType: !954, size: 64, offset: 6272)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!354, !561, !503}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !568, file: !336, line: 153, baseType: !682, size: 64, offset: 6336)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !568, file: !336, line: 154, baseType: !682, size: 64, offset: 6400)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !568, file: !336, line: 155, baseType: !682, size: 64, offset: 6464)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !568, file: !336, line: 156, baseType: !682, size: 64, offset: 6528)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !568, file: !336, line: 157, baseType: !854, size: 64, offset: 6592)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !568, file: !336, line: 159, baseType: !963, size: 64, offset: 6656)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!354, !561, !392, !576}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !568, file: !336, line: 160, baseType: !682, size: 64, offset: 6720)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !568, file: !336, line: 161, baseType: !682, size: 64, offset: 6784)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !568, file: !336, line: 162, baseType: !682, size: 64, offset: 6848)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !568, file: !336, line: 163, baseType: !682, size: 64, offset: 6912)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !568, file: !336, line: 165, baseType: !944, size: 64, offset: 6976)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !568, file: !336, line: 166, baseType: !944, size: 64, offset: 7040)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !568, file: !336, line: 167, baseType: !744, size: 64, offset: 7104)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !568, file: !336, line: 168, baseType: !974, size: 64, offset: 7168)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!354, !561, !588, !392}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !568, file: !336, line: 169, baseType: !978, size: 64, offset: 7232)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!354, !561, !659, !436}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !568, file: !336, line: 171, baseType: !706, size: 64, offset: 7296)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !568, file: !336, line: 172, baseType: !682, size: 64, offset: 7360)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !568, file: !336, line: 173, baseType: !984, size: 64, offset: 7424)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!354, !561, !436, !768}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !568, file: !336, line: 174, baseType: !844, size: 64, offset: 7488)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !568, file: !336, line: 175, baseType: !844, size: 64, offset: 7552)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !568, file: !336, line: 177, baseType: !585, size: 64, offset: 7616)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !568, file: !336, line: 178, baseType: !631, size: 64, offset: 7680)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !568, file: !336, line: 179, baseType: !585, size: 64, offset: 7744)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !568, file: !336, line: 180, baseType: !592, size: 64, offset: 7808)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !568, file: !336, line: 181, baseType: !994, size: 64, offset: 7872)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!354, !561, !309, !634, !635}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !568, file: !336, line: 183, baseType: !904, size: 64, offset: 7936)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !568, file: !336, line: 184, baseType: !666, size: 64, offset: 8000)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !568, file: !336, line: 185, baseType: !1000, size: 64, offset: 8064)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!354, !561, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !568, file: !336, line: 186, baseType: !1005, size: 64, offset: 8128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!354, !561, !392, !574, !453}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !568, file: !336, line: 187, baseType: !725, size: 64, offset: 8192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !568, file: !336, line: 189, baseType: !1010, size: 64, offset: 8256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!354, !561, !392, !392, !436, !576}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !568, file: !336, line: 190, baseType: !818, size: 64, offset: 8320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !568, file: !336, line: 191, baseType: !940, size: 64, offset: 8384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !568, file: !336, line: 192, baseType: !944, size: 64, offset: 8448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !568, file: !336, line: 193, baseType: !1017, size: 64, offset: 8512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!354, !561, !776, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !336, line: 660, size: 5312, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1022, file: !336, line: 661, baseType: !339, size: 4480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1022, file: !336, line: 661, baseType: !785, size: 32, offset: 4480)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1022, file: !336, line: 662, baseType: !392, size: 32, offset: 4512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1022, file: !336, line: 662, baseType: !392, size: 32, offset: 4544)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1022, file: !336, line: 662, baseType: !392, size: 32, offset: 4576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1022, file: !336, line: 663, baseType: !392, size: 32, offset: 4608)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1022, file: !336, line: 664, baseType: !392, size: 32, offset: 4640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1022, file: !336, line: 665, baseType: !436, size: 64, offset: 4672)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1022, file: !336, line: 666, baseType: !436, size: 64, offset: 4736)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1022, file: !336, line: 667, baseType: !392, size: 32, offset: 4800)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1022, file: !336, line: 668, baseType: !826, size: 32, offset: 4832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1022, file: !336, line: 670, baseType: !436, size: 64, offset: 4864)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1022, file: !336, line: 670, baseType: !436, size: 64, offset: 4928)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1022, file: !336, line: 671, baseType: !436, size: 64, offset: 4992)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1022, file: !336, line: 672, baseType: !436, size: 64, offset: 5056)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1022, file: !336, line: 673, baseType: !436, size: 64, offset: 5120)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1022, file: !336, line: 674, baseType: !392, size: 32, offset: 5184)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1022, file: !336, line: 675, baseType: !436, size: 64, offset: 5248)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !568, file: !336, line: 195, baseType: !1043, size: 64, offset: 8576)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!354, !1020, !561, !561}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !568, file: !336, line: 196, baseType: !1043, size: 64, offset: 8640)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !568, file: !336, line: 197, baseType: !818, size: 64, offset: 8704)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !568, file: !336, line: 198, baseType: !940, size: 64, offset: 8768)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !568, file: !336, line: 199, baseType: !944, size: 64, offset: 8832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !568, file: !336, line: 201, baseType: !1051, size: 64, offset: 8896)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!354, !561, !392, !392}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !568, file: !336, line: 202, baseType: !720, size: 64, offset: 8960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !568, file: !336, line: 203, baseType: !592, size: 64, offset: 9024)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !568, file: !336, line: 204, baseType: !773, size: 64, offset: 9088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !568, file: !336, line: 205, baseType: !904, size: 64, offset: 9152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !568, file: !336, line: 206, baseType: !1059, size: 64, offset: 9216)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!354, !309, !561, !392, !634, !635}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !568, file: !336, line: 208, baseType: !1063, size: 64, offset: 9280)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!354, !392, !730}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !568, file: !336, line: 209, baseType: !944, size: 64, offset: 9344)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !568, file: !336, line: 210, baseType: !736, size: 64, offset: 9408)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !563, file: !336, line: 438, baseType: !1069, size: 64, offset: 13952)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !543, line: 60, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1071, file: !114, line: 241, baseType: !309, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1071, file: !114, line: 242, baseType: !409, size: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1071, file: !114, line: 243, baseType: !392, size: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1071, file: !114, line: 243, baseType: !392, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1071, file: !114, line: 244, baseType: !392, size: 32, offset: 160)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1071, file: !114, line: 244, baseType: !392, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1071, file: !114, line: 245, baseType: !436, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1071, file: !114, line: 246, baseType: !503, size: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1071, file: !114, line: 247, baseType: !392, size: 32, offset: 352)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1071, file: !114, line: 251, baseType: !392, size: 32, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1071, file: !114, line: 252, baseType: !875, size: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1071, file: !114, line: 253, baseType: !503, size: 32, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1071, file: !114, line: 254, baseType: !392, size: 32, offset: 544)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1071, file: !114, line: 254, baseType: !392, size: 32, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1071, file: !114, line: 255, baseType: !392, size: 32, offset: 608)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !563, file: !336, line: 438, baseType: !1069, size: 64, offset: 14016)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !563, file: !336, line: 439, baseType: !313, size: 64, offset: 14080)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !563, file: !336, line: 440, baseType: !1091, size: 32, offset: 14144)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !563, file: !336, line: 441, baseType: !503, size: 32, offset: 14176)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !563, file: !336, line: 442, baseType: !503, size: 32, offset: 14208)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !563, file: !336, line: 443, baseType: !1095, size: 448, offset: 14272)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 448, elements: !1097)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !320)
!1097 = !{!1098}
!1098 = !DISubrange(count: 7)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !563, file: !336, line: 444, baseType: !503, size: 32, offset: 14720)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !563, file: !336, line: 445, baseType: !503, size: 32, offset: 14752)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !563, file: !336, line: 446, baseType: !392, size: 32, offset: 14784)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !563, file: !336, line: 447, baseType: !429, size: 64, offset: 14848)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !563, file: !336, line: 448, baseType: !429, size: 64, offset: 14912)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !563, file: !336, line: 449, baseType: !642, size: 640, offset: 14976)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !563, file: !336, line: 450, baseType: !578, size: 32, offset: 15616)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !563, file: !336, line: 451, baseType: !1107, size: 2880, offset: 15680)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !336, line: 318, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !336, line: 319, size: 2880, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1129, !1130, !1135, !1140, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1155, !1156, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1188, !1189, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1212, !1213, !1214, !1218, !1219}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1108, file: !336, line: 320, baseType: !392, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1108, file: !336, line: 321, baseType: !392, size: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1108, file: !336, line: 322, baseType: !392, size: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1108, file: !336, line: 323, baseType: !392, size: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1108, file: !336, line: 324, baseType: !392, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1108, file: !336, line: 325, baseType: !392, size: 32, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1108, file: !336, line: 326, baseType: !1117, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !336, line: 293, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !336, line: 295, size: 448, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1119, file: !336, line: 296, baseType: !1117, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1119, file: !336, line: 297, baseType: !453, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1119, file: !336, line: 297, baseType: !453, size: 64, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1119, file: !336, line: 298, baseType: !436, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1119, file: !336, line: 298, baseType: !436, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1119, file: !336, line: 299, baseType: !392, size: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1119, file: !336, line: 300, baseType: !392, size: 32, offset: 352)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1119, file: !336, line: 301, baseType: !392, size: 32, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1108, file: !336, line: 326, baseType: !1117, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1108, file: !336, line: 328, baseType: !1131, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!354, !561, !1134, !436}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1108, file: !336, line: 329, baseType: !1136, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!354, !1134, !1139, !438, !438, !456, !436}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1108, file: !336, line: 330, baseType: !1141, size: 64, offset: 448)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!354, !1134}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1108, file: !336, line: 331, baseType: !1141, size: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1108, file: !336, line: 334, baseType: !309, size: 64, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !336, line: 335, baseType: !409, size: 32, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1108, file: !336, line: 335, baseType: !409, size: 32, offset: 672)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1108, file: !336, line: 336, baseType: !409, size: 32, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1108, file: !336, line: 336, baseType: !409, size: 32, offset: 736)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1108, file: !336, line: 337, baseType: !1151, size: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !310, line: 339, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !310, line: 339, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1108, file: !336, line: 338, baseType: !1151, size: 64, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1108, file: !336, line: 339, baseType: !1157, size: 64, offset: 896)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !310, line: 341, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !310, line: 351, size: 192, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1159, file: !310, line: 354, baseType: !72, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1159, file: !310, line: 355, baseType: !72, size: 32, offset: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1159, file: !310, line: 356, baseType: !72, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1159, file: !310, line: 361, baseType: !72, size: 32, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1159, file: !310, line: 362, baseType: !301, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1108, file: !336, line: 340, baseType: !392, size: 32, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1108, file: !336, line: 340, baseType: !392, size: 32, offset: 992)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1108, file: !336, line: 341, baseType: !453, size: 64, offset: 1024)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1108, file: !336, line: 342, baseType: !436, size: 64, offset: 1088)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1108, file: !336, line: 343, baseType: !456, size: 64, offset: 1152)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1108, file: !336, line: 344, baseType: !438, size: 64, offset: 1216)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1108, file: !336, line: 345, baseType: !392, size: 32, offset: 1280)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1108, file: !336, line: 346, baseType: !1139, size: 64, offset: 1344)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1108, file: !336, line: 347, baseType: !503, size: 32, offset: 1408)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1108, file: !336, line: 348, baseType: !392, size: 32, offset: 1440)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1108, file: !336, line: 351, baseType: !503, size: 32, offset: 1472)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1108, file: !336, line: 352, baseType: !503, size: 32, offset: 1504)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1108, file: !336, line: 353, baseType: !409, size: 32, offset: 1536)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1108, file: !336, line: 354, baseType: !409, size: 32, offset: 1568)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1108, file: !336, line: 355, baseType: !1139, size: 64, offset: 1600)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1108, file: !336, line: 356, baseType: !1139, size: 64, offset: 1664)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1108, file: !336, line: 357, baseType: !1183, size: 64, offset: 1728)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !336, line: 310, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 308, size: 32, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1185, file: !336, line: 309, baseType: !392, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1108, file: !336, line: 357, baseType: !1183, size: 64, offset: 1792)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1108, file: !336, line: 358, baseType: !1190, size: 64, offset: 1856)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !336, line: 316, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 312, size: 128, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1192, file: !336, line: 313, baseType: !313, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1192, file: !336, line: 314, baseType: !392, size: 32, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1192, file: !336, line: 315, baseType: !319, size: 8, offset: 96)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1108, file: !336, line: 359, baseType: !1190, size: 64, offset: 1920)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1108, file: !336, line: 360, baseType: !1190, size: 64, offset: 1984)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1108, file: !336, line: 361, baseType: !392, size: 32, offset: 2048)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1108, file: !336, line: 362, baseType: !409, size: 32, offset: 2080)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1108, file: !336, line: 363, baseType: !392, size: 32, offset: 2112)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1108, file: !336, line: 364, baseType: !1139, size: 64, offset: 2176)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1108, file: !336, line: 365, baseType: !1157, size: 64, offset: 2240)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1108, file: !336, line: 366, baseType: !409, size: 32, offset: 2304)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1108, file: !336, line: 367, baseType: !409, size: 32, offset: 2336)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1108, file: !336, line: 368, baseType: !1151, size: 64, offset: 2368)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1108, file: !336, line: 369, baseType: !1151, size: 64, offset: 2432)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1108, file: !336, line: 370, baseType: !1209, size: 64, offset: 2496)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1108, file: !336, line: 371, baseType: !1209, size: 64, offset: 2560)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1108, file: !336, line: 372, baseType: !1209, size: 64, offset: 2624)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1108, file: !336, line: 373, baseType: !1215, size: 64, offset: 2688)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !310, line: 331, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !310, line: 331, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1108, file: !336, line: 374, baseType: !301, size: 64, offset: 2752)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1108, file: !336, line: 375, baseType: !1220, size: 64, offset: 2816)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !563, file: !336, line: 451, baseType: !1107, size: 2880, offset: 18560)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !563, file: !336, line: 452, baseType: !1223, size: 64, offset: 21440)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1224)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !336, line: 681, size: 4864, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1225, file: !336, line: 682, baseType: !339, size: 4480)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1225, file: !336, line: 682, baseType: !785, size: 32, offset: 4480)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1225, file: !336, line: 683, baseType: !503, size: 32, offset: 4512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1225, file: !336, line: 684, baseType: !392, size: 32, offset: 4544)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1225, file: !336, line: 685, baseType: !937, size: 64, offset: 4608)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1225, file: !336, line: 686, baseType: !453, size: 64, offset: 4672)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1225, file: !336, line: 687, baseType: !1234, size: 64, offset: 4736)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!354, !1223, !588, !313}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1225, file: !336, line: 688, baseType: !313, size: 64, offset: 4800)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !563, file: !336, line: 453, baseType: !1223, size: 64, offset: 21504)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !563, file: !336, line: 454, baseType: !1223, size: 64, offset: 21568)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !563, file: !336, line: 455, baseType: !392, size: 32, offset: 21632)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !563, file: !336, line: 456, baseType: !503, size: 32, offset: 21664)
