; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/svd/svd.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/svd/svd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 19, baseType: !5, size: 32, elements: !62)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/svd/svd.c", directory: "/home/users/ndemeye/xSDK")
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "READ", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "WRITE", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "READ_WRITE", value: 3, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76}
!68 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 30, baseType: !5, size: 32, elements: !79)
!78 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!79 = !{!80, !81, !82, !83, !84}
!80 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 238, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 563, baseType: !5, size: 32, elements: !92)
!92 = !{!93, !94, !95}
!93 = !DIEnumerator(name: "MAT_DO_NOT_COPY_VALUES", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "MAT_COPY_VALUES", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "MAT_SHARE_NONZERO_PATTERN", value: 2, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 726, baseType: !5, size: 32, elements: !97)
!97 = !{!98, !99}
!98 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!100 = !{!101, !104, !122, !203, !143, !309, !193, !26, !169, !337}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !107, line: 73, size: 4480, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !111, !164, !165, !167, !170, !171, !172, !173, !181, !182, !184, !188, !192, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !206, !207, !208, !210, !211, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !227, !228, !231, !233, !234, !235, !245, !247, !248, !252, !253, !299, !304, !306, !307, !308}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !106, file: !107, line: 74, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !106, file: !107, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !162)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !107, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 45, size: 448, elements: !115)
!115 = !{!116, !126, !134, !139, !146, !150, !157}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !107, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !104, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !123, line: 330, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !123, line: 330, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !107, line: 47, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!120, !104, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !131, line: 16, baseType: !132)
!131 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !131, line: 16, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !107, line: 48, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!120, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !107, line: 49, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!120, !104, !143, !104}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !107, line: 50, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !104, !143, !138}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !107, line: 51, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!120, !104, !143, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !107, line: 52, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!120, !104, !143, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !106, file: !107, line: 76, baseType: !122, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !107, line: 77, baseType: !166, size: 32, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !106, file: !107, line: 78, baseType: !168, size: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !169)
!169 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !106, file: !107, line: 78, baseType: !168, size: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !106, file: !107, line: 78, baseType: !168, size: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !106, file: !107, line: 78, baseType: !168, size: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !107, line: 79, baseType: !174, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !177, line: 27, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !179, line: 43, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!180 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !106, file: !107, line: 80, baseType: !166, size: 32, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !106, file: !107, line: 81, baseType: !183, size: 32, offset: 992)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !106, file: !107, line: 82, baseType: !185, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !106, file: !107, line: 83, baseType: !189, size: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !106, file: !107, line: 84, baseType: !193, size: 64, offset: 1152)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !106, file: !107, line: 85, baseType: !193, size: 64, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !106, file: !107, line: 86, baseType: !193, size: 64, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !106, file: !107, line: 87, baseType: !193, size: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !106, file: !107, line: 88, baseType: !104, size: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !106, file: !107, line: 89, baseType: !174, size: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !107, line: 90, baseType: !193, size: 64, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !106, file: !107, line: 91, baseType: !193, size: 64, offset: 1600)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !106, file: !107, line: 92, baseType: !166, size: 32, offset: 1664)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !106, file: !107, line: 93, baseType: !203, size: 64, offset: 1728)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !106, file: !107, line: 94, baseType: !205, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !175)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !106, file: !107, line: 95, baseType: !166, size: 32, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !106, file: !107, line: 95, baseType: !166, size: 32, offset: 1888)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !106, file: !107, line: 96, baseType: !209, size: 64, offset: 1920)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !106, file: !107, line: 96, baseType: !209, size: 64, offset: 1984)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !106, file: !107, line: 97, baseType: !212, size: 64, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !106, file: !107, line: 97, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !106, file: !107, line: 98, baseType: !166, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !106, file: !107, line: 98, baseType: !166, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !106, file: !107, line: 99, baseType: !209, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !106, file: !107, line: 99, baseType: !209, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !106, file: !107, line: 100, baseType: !220, size: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !169)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !106, file: !107, line: 100, baseType: !223, size: 64, offset: 2432)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !106, file: !107, line: 101, baseType: !166, size: 32, offset: 2496)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !106, file: !107, line: 101, baseType: !166, size: 32, offset: 2528)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !106, file: !107, line: 102, baseType: !209, size: 64, offset: 2560)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !106, file: !107, line: 102, baseType: !209, size: 64, offset: 2624)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !106, file: !107, line: 103, baseType: !229, size: 64, offset: 2688)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !221)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !106, file: !107, line: 103, baseType: !232, size: 64, offset: 2752)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !106, file: !107, line: 104, baseType: !161, size: 64, offset: 2816)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !106, file: !107, line: 105, baseType: !166, size: 32, offset: 2880)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !106, file: !107, line: 106, baseType: !236, size: 128, offset: 2944)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 128, elements: !243)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !107, line: 64, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 61, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !239, file: !107, line: 62, baseType: !154, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !239, file: !107, line: 63, baseType: !203, size: 64, offset: 64)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !106, file: !107, line: 107, baseType: !246, size: 64, offset: 3072)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !106, file: !107, line: 108, baseType: !203, size: 64, offset: 3136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !106, file: !107, line: 109, baseType: !249, size: 64, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!120, !203}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !106, file: !107, line: 111, baseType: !166, size: 32, offset: 3264)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !106, file: !107, line: 112, baseType: !254, size: 320, offset: 3328)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 320, elements: !297)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!120, !258, !104, !203}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !261)
!261 = !{!262, !263, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !260, file: !10, line: 100, baseType: !166, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !10, line: 101, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !275, !276, !277, !278, !280, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !266, file: !10, line: 84, baseType: !193, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !266, file: !10, line: 85, baseType: !193, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !10, line: 86, baseType: !203, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !266, file: !10, line: 87, baseType: !185, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !266, file: !10, line: 88, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !266, file: !10, line: 89, baseType: !145, size: 8, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !266, file: !10, line: 90, baseType: !193, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !266, file: !10, line: 91, baseType: !101, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !266, file: !10, line: 92, baseType: !279, size: 32, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !10, line: 93, baseType: !281, size: 32, offset: 544)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !10, line: 94, baseType: !264, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !266, file: !10, line: 95, baseType: !193, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !266, file: !10, line: 96, baseType: !203, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !260, file: !10, line: 102, baseType: !193, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !260, file: !10, line: 102, baseType: !193, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !260, file: !10, line: 103, baseType: !193, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !260, file: !10, line: 104, baseType: !122, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !260, file: !10, line: 106, baseType: !104, size: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !260, file: !10, line: 107, baseType: !294, size: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!297 = !{!298}
!298 = !DISubrange(count: 5)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !106, file: !107, line: 113, baseType: !300, size: 320, offset: 3648)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 320, elements: !297)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!120, !104, !203}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !106, file: !107, line: 114, baseType: !305, size: 320, offset: 3968)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, elements: !297)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !106, file: !107, line: 115, baseType: !279, size: 32, offset: 4288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !106, file: !107, line: 120, baseType: !294, size: 64, offset: 4352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !106, file: !107, line: 121, baseType: !279, size: 32, offset: 4416)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_SVD", file: !61, line: 17, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 8, size: 832, elements: !312)
!312 = !{!313, !317, !318, !322, !323, !324, !325, !326, !327, !333, !334, !335, !336}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !311, file: !61, line: 9, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !78, line: 21, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !78, line: 21, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !311, file: !61, line: 9, baseType: !314, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !311, file: !61, line: 10, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !311, file: !61, line: 10, baseType: !319, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Vt", scope: !311, file: !61, line: 10, baseType: !319, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nzero", scope: !311, file: !61, line: 11, baseType: !166, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "zerosing", scope: !311, file: !61, line: 12, baseType: !221, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "essrank", scope: !311, file: !61, line: 13, baseType: !166, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "left2red", scope: !311, file: !61, line: 14, baseType: !328, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !329, line: 59, baseType: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !329, line: 15, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !329, line: 15, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "right2red", scope: !311, file: !61, line: 14, baseType: !328, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "leftred", scope: !311, file: !61, line: 15, baseType: !314, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rightred", scope: !311, file: !61, line: 15, baseType: !314, size: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !311, file: !61, line: 16, baseType: !130, size: 64, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !4, line: 140, baseType: !26)
!338 = !{i32 7, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{i32 7, !"PIC Level", i32 2}
!342 = !{i32 7, !"uwtable", i32 1}
!343 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!344 = distinct !DISubprogram(name: "PCCreate_SVD", scope: !61, file: !61, line: 371, type: !345, scopeLine: 372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !448)
!345 = !DISubroutineType(types: !346)
!346 = !{!120, !347}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !350, line: 37, size: 6720, elements: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = !{!352, !354, !412, !417, !418, !419, !420, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !441, !442, !443, !444, !445, !447}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !349, file: !350, line: 38, baseType: !353, size: 4480)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !107, line: 122, baseType: !106)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !349, file: !350, line: 38, baseType: !355, size: 1152, offset: 4480)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 1152, elements: !162)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !350, line: 13, size: 1152, elements: !357)
!357 = !{!358, !360, !364, !368, !374, !379, !380, !384, !388, !396, !397, !402, !403, !404, !405, !406, !410, !411}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !356, file: !350, line: 14, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !356, file: !350, line: 15, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!120, !347, !314, !314}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !356, file: !350, line: 16, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!120, !347, !319, !319}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !356, file: !350, line: 17, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!120, !347, !314, !314, !314, !221, !221, !221, !166, !279, !212, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !356, file: !350, line: 18, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!120, !347, !378, !314, !314, !314}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !356, file: !350, line: 19, baseType: !361, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !356, file: !350, line: 20, baseType: !381, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!120, !347, !166, !314, !314, !314}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !356, file: !350, line: 21, baseType: !385, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!120, !258, !347}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !356, file: !350, line: 22, baseType: !389, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!120, !347, !392, !314, !314}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !393, line: 22, baseType: !394)
!393 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !393, line: 22, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !356, file: !350, line: 23, baseType: !389, size: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !356, file: !350, line: 24, baseType: !398, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!120, !347, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !356, file: !350, line: 25, baseType: !361, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !356, file: !350, line: 26, baseType: !361, size: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !356, file: !350, line: 27, baseType: !359, size: 64, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !356, file: !350, line: 28, baseType: !359, size: 64, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !356, file: !350, line: 29, baseType: !407, size: 64, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!120, !347, !130}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !356, file: !350, line: 30, baseType: !359, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !356, file: !350, line: 31, baseType: !407, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !349, file: !350, line: 39, baseType: !413, size: 64, offset: 5632)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !414, line: 14, baseType: !415)
!414 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !414, line: 14, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !349, file: !350, line: 40, baseType: !166, size: 32, offset: 5696)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !349, file: !350, line: 41, baseType: !205, size: 64, offset: 5760)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !349, file: !350, line: 41, baseType: !205, size: 64, offset: 5824)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !349, file: !350, line: 42, baseType: !279, size: 32, offset: 5888)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !350, line: 43, baseType: !422, size: 32, offset: 5920)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !349, file: !350, line: 45, baseType: !166, size: 32, offset: 5952)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !349, file: !350, line: 46, baseType: !279, size: 32, offset: 5984)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !349, file: !350, line: 47, baseType: !319, size: 64, offset: 6016)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !349, file: !350, line: 47, baseType: !319, size: 64, offset: 6080)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !349, file: !350, line: 48, baseType: !314, size: 64, offset: 6144)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !349, file: !350, line: 48, baseType: !314, size: 64, offset: 6208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !349, file: !350, line: 49, baseType: !279, size: 32, offset: 6272)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !349, file: !350, line: 50, baseType: !279, size: 32, offset: 6304)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !349, file: !350, line: 51, baseType: !432, size: 64, offset: 6336)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!120, !347, !166, !435, !435, !401, !203}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !438, line: 11, baseType: !439)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !438, line: 11, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !349, file: !350, line: 52, baseType: !203, size: 64, offset: 6400)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !350, line: 53, baseType: !203, size: 64, offset: 6464)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !349, file: !350, line: 54, baseType: !166, size: 32, offset: 6528)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !349, file: !350, line: 55, baseType: !203, size: 64, offset: 6592)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !349, file: !350, line: 56, baseType: !446, size: 32, offset: 6656)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !349, file: !350, line: 57, baseType: !446, size: 32, offset: 6688)
!448 = !{!449, !450, !451, !452}
!449 = !DILocalVariable(name: "pc", arg: 1, scope: !344, file: !61, line: 371, type: !347)
!450 = !DILocalVariable(name: "jac", scope: !344, file: !61, line: 373, type: !309)
!451 = !DILocalVariable(name: "ierr", scope: !344, file: !61, line: 374, type: !120)
!452 = !DILocalVariable(name: "ierr__", scope: !453, file: !61, line: 381, type: !120)
!453 = distinct !DILexicalBlock(scope: !344, file: !61, line: 381, column: 40)
!454 = !DILocation(line: 0, scope: !344)
!455 = !DILocation(line: 373, column: 3, scope: !344)
!456 = !DILocation(line: 376, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !61, line: 376, column: 3)
!458 = distinct !DILexicalBlock(scope: !459, file: !61, line: 376, column: 3)
!459 = distinct !DILexicalBlock(scope: !344, file: !61, line: 376, column: 3)
!460 = !{!461, !461, i64 0}
!461 = !{!"any pointer", !462, i64 0}
!462 = !{!"omnipotent char", !463, i64 0}
!463 = !{!"Simple C/C++ TBAA"}
!464 = !DILocation(line: 376, column: 3, scope: !458)
!465 = !DILocation(line: 376, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !61, line: 376, column: 3)
!467 = distinct !DILexicalBlock(scope: !457, file: !61, line: 376, column: 3)
!468 = !{!469, !470, i64 1536}
!469 = !{!"", !462, i64 0, !462, i64 512, !462, i64 1024, !462, i64 1280, !470, i64 1536, !470, i64 1540, !462, i64 1544}
!470 = !{!"int", !462, i64 0}
!471 = !DILocation(line: 376, column: 3, scope: !467)
!472 = !DILocation(line: 376, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !466, file: !61, line: 376, column: 3)
!474 = !{!470, !470, i64 0}
!475 = !{!469, !470, i64 1540}
!476 = !DILocation(line: 381, column: 19, scope: !344)
!477 = !{!"branch_weights", i32 2146410443, i32 1073205}
!478 = !DILocation(line: 0, scope: !453)
!479 = !DILocation(line: 381, column: 40, scope: !453)
!480 = !{!"branch_weights", i32 2000, i32 1}
!481 = !DILocation(line: 381, column: 40, scope: !482)
!482 = distinct !DILexicalBlock(scope: !453, file: !61, line: 381, column: 40)
!483 = !DILocation(line: 382, column: 3, scope: !344)
!484 = !DILocation(line: 382, column: 8, scope: !344)
!485 = !DILocation(line: 382, column: 17, scope: !344)
!486 = !{!487, !488, i64 48}
!487 = !{!"", !461, i64 0, !461, i64 8, !461, i64 16, !461, i64 24, !461, i64 32, !470, i64 40, !488, i64 48, !470, i64 56, !461, i64 64, !461, i64 72, !461, i64 80, !461, i64 88, !461, i64 96}
!488 = !{!"double", !462, i64 0}
!489 = !DILocation(line: 383, column: 7, scope: !344)
!490 = !DILocation(line: 383, column: 17, scope: !344)
!491 = !{!492, !461, i64 808}
!492 = !{!"_p_PC", !493, i64 0, !462, i64 560, !461, i64 704, !470, i64 712, !494, i64 720, !494, i64 728, !462, i64 736, !462, i64 740, !470, i64 744, !462, i64 748, !461, i64 752, !461, i64 760, !461, i64 768, !461, i64 776, !462, i64 784, !462, i64 788, !461, i64 792, !461, i64 800, !461, i64 808, !470, i64 816, !461, i64 824, !462, i64 832, !462, i64 836}
!493 = !{!"_p_PetscObject", !470, i64 0, !462, i64 8, !461, i64 64, !470, i64 72, !488, i64 80, !488, i64 88, !488, i64 96, !488, i64 104, !494, i64 112, !470, i64 120, !470, i64 124, !461, i64 128, !461, i64 136, !461, i64 144, !461, i64 152, !461, i64 160, !461, i64 168, !461, i64 176, !494, i64 184, !461, i64 192, !461, i64 200, !470, i64 208, !461, i64 216, !494, i64 224, !470, i64 232, !470, i64 236, !461, i64 240, !461, i64 248, !461, i64 256, !461, i64 264, !470, i64 272, !470, i64 276, !461, i64 280, !461, i64 288, !461, i64 296, !461, i64 304, !470, i64 312, !470, i64 316, !461, i64 320, !461, i64 328, !461, i64 336, !461, i64 344, !461, i64 352, !470, i64 360, !462, i64 368, !462, i64 384, !461, i64 392, !461, i64 400, !470, i64 408, !462, i64 416, !462, i64 456, !462, i64 496, !462, i64 536, !461, i64 544, !462, i64 552}
!494 = !{!"long", !462, i64 0}
