; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gatherv/sfgatherv.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gatherv/sfgatherv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 663, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 24, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!70 = !{!71, !129, !163, !160, !232, !80, !184, !372, !132, !79, !369, !208}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Gatherv", file: !73, line: 7, baseType: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gatherv/sfgatherv.c", directory: "/home/users/ndemeye/xSDK")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Allgatherv", file: !75, line: 11, baseType: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.h", directory: "/home/users/ndemeye/xSDK")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 8, size: 1280, elements: !77)
!77 = !{!78, !81, !82, !84, !86, !88, !89, !93, !95, !98, !99, !114, !115, !116, !117, !622, !623, !624}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !76, file: !75, line: 9, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !80)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !76, file: !75, line: 9, baseType: !79, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !76, file: !75, line: 9, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !76, file: !75, line: 9, baseType: !85, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !80)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !76, file: !75, line: 9, baseType: !87, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !76, file: !75, line: 9, baseType: !87, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !76, file: !75, line: 9, baseType: !90, size: 128, offset: 320)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 2)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !76, file: !75, line: 9, baseType: !94, size: 64, offset: 448)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !91)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !76, file: !75, line: 9, baseType: !96, size: 64, offset: 512)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !91)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !76, file: !75, line: 9, baseType: !94, size: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !76, file: !75, line: 9, baseType: !100, size: 128, offset: 640)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 128, elements: !91)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !66, line: 41, size: 576, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !103, file: !66, line: 42, baseType: !87, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !103, file: !66, line: 43, baseType: !85, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !103, file: !66, line: 44, baseType: !87, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !103, file: !66, line: 45, baseType: !87, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !103, file: !66, line: 46, baseType: !87, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !103, file: !66, line: 46, baseType: !87, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !103, file: !66, line: 46, baseType: !87, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !103, file: !66, line: 47, baseType: !87, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !103, file: !66, line: 47, baseType: !87, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !76, file: !75, line: 9, baseType: !100, size: 128, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !76, file: !75, line: 9, baseType: !96, size: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !76, file: !75, line: 9, baseType: !85, size: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !76, file: !75, line: 9, baseType: !118, size: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !119, line: 6, baseType: !120)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !66, line: 52, size: 6592, elements: !122)
!122 = !{!123, !135, !524, !525, !526, !527, !531, !532, !536, !537, !538, !542, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !562, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !602, !603, !605, !606, !607, !608, !615, !616, !618, !619, !620, !621}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !121, file: !66, line: 53, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !118, !128, !129, !128, !130, !132}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !80)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 46, baseType: !134)
!133 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !121, file: !66, line: 54, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!127, !139, !118, !523}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !140, line: 15, baseType: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !143)
!143 = !{!144, !342, !438, !453, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !490, !491, !516, !517, !518, !519, !520, !522}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !142, file: !44, line: 67, baseType: !145, size: 4480)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !146, line: 122, baseType: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !146, line: 73, size: 4480, elements: !148)
!148 = !{!149, !151, !205, !206, !207, !210, !211, !212, !213, !221, !222, !223, !227, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !244, !245, !246, !248, !249, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !264, !265, !268, !270, !271, !272, !280, !281, !282, !286, !287, !332, !337, !339, !340, !341}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !147, file: !146, line: 74, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !80)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !147, file: !146, line: 75, baseType: !152, size: 448, offset: 64)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 448, elements: !203)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !146, line: 53, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 45, size: 448, elements: !155)
!155 = !{!156, !167, !175, !180, !187, !191, !198}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !154, file: !146, line: 46, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!127, !160, !162}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !164, line: 330, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !164, line: 330, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !154, file: !146, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!127, !160, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !154, file: !146, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!127, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !154, file: !146, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!127, !160, !184, !160}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !154, file: !146, line: 50, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!127, !160, !184, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !154, file: !146, line: 51, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!127, !160, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !154, file: !146, line: 52, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!127, !160, !184, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!203 = !{!204}
!204 = !DISubrange(count: 1)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !147, file: !146, line: 76, baseType: !163, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !146, line: 77, baseType: !85, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !147, file: !146, line: 78, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !209)
!209 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !147, file: !146, line: 78, baseType: !208, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !147, file: !146, line: 78, baseType: !208, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !147, file: !146, line: 78, baseType: !208, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !146, line: 79, baseType: !214, size: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !217, line: 27, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !219, line: 43, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!220 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !147, file: !146, line: 80, baseType: !85, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !146, line: 81, baseType: !79, size: 32, offset: 992)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !147, file: !146, line: 82, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !147, file: !146, line: 83, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !146, line: 84, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !147, file: !146, line: 85, baseType: !232, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !147, file: !146, line: 86, baseType: !232, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !147, file: !146, line: 87, baseType: !232, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !146, line: 88, baseType: !160, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !147, file: !146, line: 89, baseType: !214, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !146, line: 90, baseType: !232, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !147, file: !146, line: 91, baseType: !232, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !147, file: !146, line: 92, baseType: !85, size: 32, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !147, file: !146, line: 93, baseType: !129, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !146, line: 94, baseType: !243, size: 64, offset: 1792)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !215)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !147, file: !146, line: 95, baseType: !85, size: 32, offset: 1856)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !147, file: !146, line: 95, baseType: !85, size: 32, offset: 1888)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !147, file: !146, line: 96, baseType: !247, size: 64, offset: 1920)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !147, file: !146, line: 96, baseType: !247, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !147, file: !146, line: 97, baseType: !87, size: 64, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !147, file: !146, line: 97, baseType: !251, size: 64, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !147, file: !146, line: 98, baseType: !85, size: 32, offset: 2176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !147, file: !146, line: 98, baseType: !85, size: 32, offset: 2208)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !147, file: !146, line: 99, baseType: !247, size: 64, offset: 2240)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !147, file: !146, line: 99, baseType: !247, size: 64, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !147, file: !146, line: 100, baseType: !257, size: 64, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !209)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !147, file: !146, line: 100, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !147, file: !146, line: 101, baseType: !85, size: 32, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !147, file: !146, line: 101, baseType: !85, size: 32, offset: 2528)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !147, file: !146, line: 102, baseType: !247, size: 64, offset: 2560)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !147, file: !146, line: 102, baseType: !247, size: 64, offset: 2624)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !147, file: !146, line: 103, baseType: !266, size: 64, offset: 2688)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !147, file: !146, line: 103, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !147, file: !146, line: 104, baseType: !202, size: 64, offset: 2816)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !147, file: !146, line: 105, baseType: !85, size: 32, offset: 2880)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !147, file: !146, line: 106, baseType: !273, size: 128, offset: 2944)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !91)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !146, line: 64, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 61, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !276, file: !146, line: 62, baseType: !195, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !146, line: 63, baseType: !129, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !147, file: !146, line: 107, baseType: !94, size: 64, offset: 3072)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !147, file: !146, line: 108, baseType: !129, size: 64, offset: 3136)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !147, file: !146, line: 109, baseType: !283, size: 64, offset: 3200)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!127, !129}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !147, file: !146, line: 111, baseType: !85, size: 32, offset: 3264)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !147, file: !146, line: 112, baseType: !288, size: 320, offset: 3328)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !330)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!127, !292, !160, !129}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !295)
!295 = !{!296, !297, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !294, file: !10, line: 100, baseType: !85, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !10, line: 101, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !309, !310, !311, !312, !313, !315, !316, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !300, file: !10, line: 84, baseType: !232, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !300, file: !10, line: 85, baseType: !232, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !10, line: 86, baseType: !129, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !300, file: !10, line: 87, baseType: !224, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !300, file: !10, line: 88, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !300, file: !10, line: 89, baseType: !186, size: 8, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !300, file: !10, line: 90, baseType: !232, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !300, file: !10, line: 91, baseType: !132, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !10, line: 92, baseType: !97, size: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !10, line: 93, baseType: !314, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !10, line: 94, baseType: !298, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !300, file: !10, line: 95, baseType: !232, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !300, file: !10, line: 96, baseType: !129, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !294, file: !10, line: 102, baseType: !232, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !294, file: !10, line: 102, baseType: !232, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !294, file: !10, line: 103, baseType: !232, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !294, file: !10, line: 104, baseType: !163, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !294, file: !10, line: 105, baseType: !97, size: 32, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !294, file: !10, line: 105, baseType: !97, size: 32, offset: 416)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !294, file: !10, line: 105, baseType: !97, size: 32, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !294, file: !10, line: 106, baseType: !160, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !294, file: !10, line: 107, baseType: !327, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!330 = !{!331}
!331 = !DISubrange(count: 5)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !147, file: !146, line: 113, baseType: !333, size: 320, offset: 3648)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !330)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!127, !160, !129}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !147, file: !146, line: 114, baseType: !338, size: 320, offset: 3968)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !330)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !147, file: !146, line: 115, baseType: !97, size: 32, offset: 4288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !147, file: !146, line: 120, baseType: !327, size: 64, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !147, file: !146, line: 121, baseType: !97, size: 32, offset: 4416)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !142, file: !44, line: 67, baseType: !343, size: 1344, offset: 4480)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1344, elements: !203)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !345)
!345 = !{!346, !350, !351, !352, !356, !360, !365, !375, !379, !380, !381, !385, !389, !393, !403, !407, !412, !424, !428, !429, !434}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !344, file: !44, line: 40, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!127, !139}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !344, file: !44, line: 41, baseType: !347, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !344, file: !44, line: 42, baseType: !347, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !344, file: !44, line: 43, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!127, !292, !139}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !344, file: !44, line: 44, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!127, !139, !171}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !344, file: !44, line: 45, baseType: !361, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!127, !139, !364, !139}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !344, file: !44, line: 46, baseType: !366, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!127, !139, !369, !128, !130, !128, !129, !372}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !164, line: 331, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !164, line: 331, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !164, line: 338, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !164, line: 338, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !344, file: !44, line: 47, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!127, !139, !369, !130, !129, !372}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !344, file: !44, line: 48, baseType: !366, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !344, file: !44, line: 49, baseType: !376, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !344, file: !44, line: 50, baseType: !382, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!127, !139, !369, !128, !129, !128, !130, !129, !372}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !344, file: !44, line: 51, baseType: !386, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!127, !139, !369, !129, !130, !129, !372}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !344, file: !44, line: 52, baseType: !390, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!127, !139, !369, !128, !130, !128, !129}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !344, file: !44, line: 53, baseType: !394, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!127, !139, !87, !397, !400, !400, !400}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !344, file: !44, line: 54, baseType: !404, size: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!127, !139, !87, !397, !400, !400}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !344, file: !44, line: 55, baseType: !408, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!127, !139, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !344, file: !44, line: 56, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!127, !139, !87, !87, !400, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !140, line: 49, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 46, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !420, file: !140, line: 47, baseType: !85, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !420, file: !140, line: 48, baseType: !85, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !344, file: !44, line: 57, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!127, !139, !85, !401, !411}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !344, file: !44, line: 58, baseType: !425, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !344, file: !44, line: 60, baseType: !430, size: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!127, !128, !132, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !344, file: !44, line: 61, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!127, !128, !129}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !142, file: !44, line: 78, baseType: !439, size: 512, offset: 5824)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !142, file: !44, line: 68, size: 512, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !448, !449, !450, !451, !452}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !439, file: !44, line: 69, baseType: !85, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !439, file: !44, line: 69, baseType: !85, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !439, file: !44, line: 70, baseType: !97, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !439, file: !44, line: 71, baseType: !97, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !439, file: !44, line: 72, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !439, file: !44, line: 73, baseType: !266, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !439, file: !44, line: 74, baseType: !139, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !439, file: !44, line: 75, baseType: !85, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !439, file: !44, line: 76, baseType: !369, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !439, file: !44, line: 77, baseType: !97, size: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !142, file: !44, line: 81, baseType: !85, size: 32, offset: 6336)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !142, file: !44, line: 82, baseType: !85, size: 32, offset: 6368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !142, file: !44, line: 83, baseType: !87, size: 64, offset: 6400)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !142, file: !44, line: 84, baseType: !87, size: 64, offset: 6464)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !142, file: !44, line: 85, baseType: !85, size: 32, offset: 6528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !142, file: !44, line: 85, baseType: !85, size: 32, offset: 6560)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !142, file: !44, line: 86, baseType: !460, size: 64, offset: 6592)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !142, file: !44, line: 87, baseType: !460, size: 64, offset: 6656)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !142, file: !44, line: 88, baseType: !85, size: 32, offset: 6720)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !142, file: !44, line: 89, baseType: !85, size: 32, offset: 6752)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !142, file: !44, line: 90, baseType: !83, size: 64, offset: 6784)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !142, file: !44, line: 91, baseType: !87, size: 64, offset: 6848)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !142, file: !44, line: 92, baseType: !87, size: 64, offset: 6912)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !142, file: !44, line: 93, baseType: !90, size: 128, offset: 6976)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !142, file: !44, line: 96, baseType: !94, size: 64, offset: 7104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !142, file: !44, line: 97, baseType: !96, size: 64, offset: 7168)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !142, file: !44, line: 98, baseType: !94, size: 64, offset: 7232)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !142, file: !44, line: 99, baseType: !100, size: 128, offset: 7296)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !142, file: !44, line: 100, baseType: !100, size: 128, offset: 7424)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !142, file: !44, line: 101, baseType: !96, size: 64, offset: 7552)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !142, file: !44, line: 103, baseType: !85, size: 32, offset: 7616)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !142, file: !44, line: 104, baseType: !87, size: 64, offset: 7680)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !142, file: !44, line: 105, baseType: !97, size: 32, offset: 7744)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !142, file: !44, line: 106, baseType: !87, size: 64, offset: 7808)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !142, file: !44, line: 107, baseType: !87, size: 64, offset: 7872)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !142, file: !44, line: 108, baseType: !97, size: 32, offset: 7936)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !142, file: !44, line: 109, baseType: !481, size: 64, offset: 8000)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !164, line: 336, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !164, line: 336, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !142, file: !44, line: 110, baseType: !481, size: 64, offset: 8064)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !142, file: !44, line: 111, baseType: !139, size: 64, offset: 8128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !142, file: !44, line: 112, baseType: !97, size: 32, offset: 8192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !142, file: !44, line: 113, baseType: !97, size: 32, offset: 8224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !142, file: !44, line: 114, baseType: !489, size: 32, offset: 8256)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !142, file: !44, line: 115, baseType: !97, size: 32, offset: 8288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !142, file: !44, line: 116, baseType: !492, size: 64, offset: 8320)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !493, line: 60, baseType: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !496, line: 240, size: 640, elements: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !514, !515}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !495, file: !496, line: 241, baseType: !163, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !496, line: 242, baseType: !79, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !495, file: !496, line: 243, baseType: !85, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !495, file: !496, line: 243, baseType: !85, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !495, file: !496, line: 244, baseType: !85, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !495, file: !496, line: 244, baseType: !85, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !495, file: !496, line: 245, baseType: !87, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !495, file: !496, line: 246, baseType: !97, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !495, file: !496, line: 247, baseType: !85, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !495, file: !496, line: 251, baseType: !85, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !495, file: !496, line: 252, baseType: !509, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !493, line: 30, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !493, line: 30, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !495, file: !496, line: 253, baseType: !97, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !495, file: !496, line: 254, baseType: !85, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !495, file: !496, line: 254, baseType: !85, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !495, file: !496, line: 255, baseType: !85, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !142, file: !44, line: 117, baseType: !97, size: 32, offset: 8384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !142, file: !44, line: 118, baseType: !97, size: 32, offset: 8416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !142, file: !44, line: 119, baseType: !97, size: 32, offset: 8448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !142, file: !44, line: 120, baseType: !85, size: 32, offset: 8480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !142, file: !44, line: 121, baseType: !521, size: 32, offset: 8512)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !44, line: 122, baseType: !129, size: 64, offset: 8576)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !50)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !121, file: !66, line: 55, baseType: !136, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !121, file: !66, line: 56, baseType: !136, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !121, file: !66, line: 57, baseType: !136, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !121, file: !66, line: 58, baseType: !528, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!127, !118}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !121, file: !66, line: 59, baseType: !528, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !121, file: !66, line: 60, baseType: !533, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!127, !139, !118}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !121, file: !66, line: 62, baseType: !136, size: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !121, file: !66, line: 63, baseType: !136, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !121, file: !66, line: 65, baseType: !539, size: 64, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!127, !118, !85, !85, !101, !401, !130, !129}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !121, file: !66, line: 66, baseType: !543, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!127, !118, !85, !85, !101, !401, !129, !130}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !121, file: !66, line: 67, baseType: !543, size: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !121, file: !66, line: 68, baseType: !543, size: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !121, file: !66, line: 69, baseType: !543, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !121, file: !66, line: 70, baseType: !543, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !121, file: !66, line: 71, baseType: !543, size: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !121, file: !66, line: 72, baseType: !543, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !121, file: !66, line: 73, baseType: !543, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !121, file: !66, line: 74, baseType: !543, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !121, file: !66, line: 75, baseType: !543, size: 64, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !121, file: !66, line: 76, baseType: !543, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !121, file: !66, line: 77, baseType: !543, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !121, file: !66, line: 78, baseType: !543, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !121, file: !66, line: 79, baseType: !559, size: 64, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!127, !118, !85, !85, !101, !401, !129, !129}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !121, file: !66, line: 81, baseType: !563, size: 64, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!127, !118, !85, !85, !101, !401, !130, !85, !101, !401, !129}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !121, file: !66, line: 82, baseType: !563, size: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !121, file: !66, line: 83, baseType: !563, size: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !121, file: !66, line: 84, baseType: !563, size: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !121, file: !66, line: 85, baseType: !563, size: 64, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !121, file: !66, line: 86, baseType: !563, size: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !121, file: !66, line: 87, baseType: !563, size: 64, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !121, file: !66, line: 88, baseType: !563, size: 64, offset: 2048)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !121, file: !66, line: 89, baseType: !563, size: 64, offset: 2112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !121, file: !66, line: 90, baseType: !563, size: 64, offset: 2176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !121, file: !66, line: 91, baseType: !563, size: 64, offset: 2240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !121, file: !66, line: 92, baseType: !563, size: 64, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !121, file: !66, line: 93, baseType: !563, size: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !121, file: !66, line: 95, baseType: !579, size: 64, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!127, !118, !85, !85, !101, !401, !129, !85, !101, !401, !130, !129}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !121, file: !66, line: 97, baseType: !97, size: 32, offset: 2496)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !121, file: !66, line: 168, baseType: !79, size: 32, offset: 2528)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !121, file: !66, line: 169, baseType: !369, size: 64, offset: 2560)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !121, file: !66, line: 170, baseType: !369, size: 64, offset: 2624)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !121, file: !66, line: 171, baseType: !97, size: 32, offset: 2688)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !121, file: !66, line: 172, baseType: !132, size: 64, offset: 2752)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !121, file: !66, line: 173, baseType: !85, size: 32, offset: 2816)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !121, file: !66, line: 174, baseType: !130, size: 64, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !121, file: !66, line: 174, baseType: !130, size: 64, offset: 2944)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !121, file: !66, line: 175, baseType: !128, size: 32, offset: 3008)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !121, file: !66, line: 175, baseType: !128, size: 32, offset: 3040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !121, file: !66, line: 178, baseType: !128, size: 32, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !121, file: !66, line: 178, baseType: !128, size: 32, offset: 3104)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !121, file: !66, line: 179, baseType: !96, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !121, file: !66, line: 179, baseType: !96, size: 64, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !121, file: !66, line: 180, baseType: !85, size: 32, offset: 3264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !121, file: !66, line: 180, baseType: !85, size: 32, offset: 3296)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !121, file: !66, line: 181, baseType: !600, size: 256, offset: 3328)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, elements: !601)
!601 = !{!92, !92}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !121, file: !66, line: 182, baseType: !600, size: 256, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !121, file: !66, line: 183, baseType: !604, size: 256, offset: 3840)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 256, elements: !601)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !121, file: !66, line: 185, baseType: !604, size: 256, offset: 4096)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !121, file: !66, line: 186, baseType: !604, size: 256, offset: 4352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !121, file: !66, line: 187, baseType: !604, size: 256, offset: 4608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !121, file: !66, line: 188, baseType: !609, size: 512, offset: 4864)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 512, elements: !614)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !164, line: 339, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !164, line: 339, flags: DIFlagFwdDecl)
!614 = !{!92, !92, !92}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !121, file: !66, line: 189, baseType: !609, size: 512, offset: 5376)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !121, file: !66, line: 190, baseType: !617, size: 256, offset: 5888)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 256, elements: !614)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !121, file: !66, line: 191, baseType: !617, size: 256, offset: 6144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !121, file: !66, line: 192, baseType: !610, size: 64, offset: 6400)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !66, line: 193, baseType: !118, size: 64, offset: 6464)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !121, file: !66, line: 195, baseType: !97, size: 32, offset: 6528)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !76, file: !75, line: 9, baseType: !118, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "displs", scope: !76, file: !75, line: 10, baseType: !83, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "recvcounts", scope: !76, file: !75, line: 10, baseType: !83, size: 64, offset: 1216)
!625 = !{i32 7, !"Dwarf Version", i32 4}
!626 = !{i32 2, !"Debug Info Version", i32 3}
!627 = !{i32 1, !"wchar_size", i32 4}
!628 = !{i32 7, !"PIC Level", i32 2}
!629 = !{i32 7, !"uwtable", i32 1}
!630 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!631 = distinct !DISubprogram(name: "PetscSFBcastBegin_Gatherv", scope: !73, file: !73, line: 9, type: !367, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !650, !652, !654, !656, !658, !660, !662, !664, !670}
!633 = !DILocalVariable(name: "sf", arg: 1, scope: !631, file: !73, line: 9, type: !139)
!634 = !DILocalVariable(name: "unit", arg: 2, scope: !631, file: !73, line: 9, type: !369)
!635 = !DILocalVariable(name: "rootmtype", arg: 3, scope: !631, file: !73, line: 9, type: !128)
!636 = !DILocalVariable(name: "rootdata", arg: 4, scope: !631, file: !73, line: 9, type: !130)
!637 = !DILocalVariable(name: "leafmtype", arg: 5, scope: !631, file: !73, line: 9, type: !128)
!638 = !DILocalVariable(name: "leafdata", arg: 6, scope: !631, file: !73, line: 9, type: !129)
!639 = !DILocalVariable(name: "op", arg: 7, scope: !631, file: !73, line: 9, type: !372)
!640 = !DILocalVariable(name: "ierr", scope: !631, file: !73, line: 11, type: !127)
!641 = !DILocalVariable(name: "link", scope: !631, file: !73, line: 12, type: !118)
!642 = !DILocalVariable(name: "sendcount", scope: !631, file: !73, line: 13, type: !79)
!643 = !DILocalVariable(name: "comm", scope: !631, file: !73, line: 14, type: !163)
!644 = !DILocalVariable(name: "dat", scope: !631, file: !73, line: 15, type: !71)
!645 = !DILocalVariable(name: "rootbuf", scope: !631, file: !73, line: 16, type: !129)
!646 = !DILocalVariable(name: "leafbuf", scope: !631, file: !73, line: 16, type: !129)
!647 = !DILocalVariable(name: "req", scope: !631, file: !73, line: 17, type: !610)
!648 = !DILocalVariable(name: "ierr__", scope: !649, file: !73, line: 20, type: !127)
!649 = distinct !DILexicalBlock(scope: !631, file: !73, line: 20, column: 98)
!650 = !DILocalVariable(name: "ierr__", scope: !651, file: !73, line: 21, type: !127)
!651 = distinct !DILexicalBlock(scope: !631, file: !73, line: 21, column: 67)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !73, line: 22, type: !127)
!653 = distinct !DILexicalBlock(scope: !631, file: !73, line: 22, column: 111)
!654 = !DILocalVariable(name: "ierr__", scope: !655, file: !73, line: 23, type: !127)
!655 = distinct !DILexicalBlock(scope: !631, file: !73, line: 23, column: 52)
!656 = !DILocalVariable(name: "ierr__", scope: !657, file: !73, line: 24, type: !127)
!657 = distinct !DILexicalBlock(scope: !631, file: !73, line: 24, column: 49)
!658 = !DILocalVariable(name: "ierr__", scope: !659, file: !73, line: 25, type: !127)
!659 = distinct !DILexicalBlock(scope: !631, file: !73, line: 25, column: 101)
!660 = !DILocalVariable(name: "ierr__", scope: !661, file: !73, line: 26, type: !127)
!661 = distinct !DILexicalBlock(scope: !631, file: !73, line: 26, column: 72)
!662 = !DILocalVariable(name: "_7_errorcode", scope: !663, file: !73, line: 27, type: !127)
!663 = distinct !DILexicalBlock(scope: !631, file: !73, line: 27, column: 110)
!664 = !DILocalVariable(name: "_7_errorstring", scope: !665, file: !73, line: 27, type: !667)
!665 = distinct !DILexicalBlock(scope: !666, file: !73, line: 27, column: 110)
!666 = distinct !DILexicalBlock(scope: !663, file: !73, line: 27, column: 110)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 2048, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 256)
!670 = !DILocalVariable(name: "_7_resultlen", scope: !665, file: !73, line: 27, type: !79)
