; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xxt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xxt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.xxt_CDT = type { i32, i32, i32, %struct.xxt_solver_info*, %struct.matvec_info* }
%struct.xxt_solver_info = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i32*, i32*, double**, double*, double*, double*, i32, double }
%struct.matvec_info = type { i32, i32, i32, i32, i32*, %struct.gather_scatter_id*, i32 (%struct.matvec_info*, double*, double*)*, i8* }
%struct.gather_scatter_id = type opaque
%struct._p_PetscObject = type opaque

@n_xxt_handles = internal unnamed_addr global i32 0, align 4, !dbg !0
@n_xxt = internal unnamed_addr global i32 0, align 4, !dbg !97
@PCTFS_i_log2_num_nodes = external hidden local_unnamed_addr global i32, align 4
@PCTFS_num_nodes = external hidden local_unnamed_addr global i32, align 4
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@__func__.XXT_factor = private unnamed_addr constant [11 x i8] c"XXT_factor\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "n_xxt_handles", scope: !2, file: !22, line: 52, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !96, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xxt.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !{!18, !82, !81, !30, !86, !42, !50, !51, !25, !89, !92, !52, !53, !61, !95}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "xxt_ADT", file: !19, line: 253, baseType: !20)
!19 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/tfs/tfs.h", directory: "/home/users/ndemeye/xSDK")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xxt_CDT", file: !22, line: 43, size: 256, elements: !23)
!22 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xxt.c", directory: "/home/users/ndemeye/xSDK")
!23 = !{!24, !27, !28, !29, !60}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !21, file: !22, line: 44, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !26)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !21, file: !22, line: 45, baseType: !25, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !21, file: !22, line: 46, baseType: !25, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !21, file: !22, line: 47, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "xxt_info", file: !22, line: 33, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xxt_solver_info", file: !22, line: 25, size: 1088, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !43, !44, !45, !46, !47, !48, !49, !55, !56, !57, !58, !59}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !32, file: !22, line: 26, baseType: !25, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n_global", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_global", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nnz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "max_nnz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "msg_buf_sz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nsep", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "lnsep", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fo", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nfo", scope: !32, file: !22, line: 28, baseType: !25, size: 32, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "stages", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "col_sz", scope: !32, file: !22, line: 29, baseType: !42, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "col_indices", scope: !32, file: !22, line: 29, baseType: !42, size: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "col_vals", scope: !32, file: !22, line: 30, baseType: !50, size: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !54)
!54 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "solve_uu", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "solve_w", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nsolves", scope: !32, file: !22, line: 31, baseType: !25, size: 32, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tot_solve_time", scope: !32, file: !22, line: 32, baseType: !52, size: 64, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mvi", scope: !21, file: !22, line: 48, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "mv_info", file: !22, line: 41, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvec_info", file: !22, line: 35, size: 384, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !74, !80}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !63, file: !22, line: 36, baseType: !25, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !63, file: !22, line: 36, baseType: !25, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "n_global", scope: !63, file: !22, line: 36, baseType: !25, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m_global", scope: !63, file: !22, line: 36, baseType: !25, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "local2global", scope: !63, file: !22, line: 37, baseType: !42, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "PCTFS_gs_handle", scope: !63, file: !22, line: 38, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCTFS_gs_ADT", file: !19, line: 226, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "gather_scatter_id", file: !19, line: 226, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "matvec", scope: !63, file: !22, line: 39, baseType: !75, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !79, !51, !51}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !26)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "grid_data", scope: !63, file: !22, line: 40, baseType: !81, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !83, line: 330, baseType: !84)
!83 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !83, line: 330, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!78, !61, !51, !51}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !13, line: 430, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !13, line: 140, baseType: !26)
!96 = !{!0, !97}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "n_xxt", scope: !2, file: !22, line: 51, type: !25, isLocal: true, isDefinition: true)
!99 = !{i32 7, !"Dwarf Version", i32 4}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{i32 1, !"wchar_size", i32 4}
!102 = !{i32 7, !"PIC Level", i32 2}
!103 = !{i32 7, !"uwtable", i32 1}
!104 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!105 = distinct !DISubprogram(name: "XXT_new", scope: !22, file: !22, line: 64, type: !106, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!106 = !DISubroutineType(types: !107)
!107 = !{!18}
!108 = !{!109}
!109 = !DILocalVariable(name: "xxt_handle", scope: !105, file: !22, line: 66, type: !18)
!110 = !DILocation(line: 69, column: 16, scope: !105)
!111 = !{!112, !112, i64 0}
!112 = !{!"int", !113, i64 0}
!113 = !{!"omnipotent char", !114, i64 0}
!114 = !{!"Simple C/C++ TBAA"}
!115 = !DILocation(line: 70, column: 31, scope: !105)
!116 = !DILocation(line: 70, column: 22, scope: !105)
!117 = !DILocation(line: 0, scope: !105)
!118 = !DILocation(line: 71, column: 22, scope: !105)
!119 = !DILocation(line: 71, column: 15, scope: !105)
!120 = !DILocation(line: 71, column: 20, scope: !105)
!121 = !{!122, !112, i64 0}
!122 = !{!"xxt_CDT", !112, i64 0, !112, i64 4, !112, i64 8, !123, i64 16, !123, i64 24}
!123 = !{!"any pointer", !113, i64 0}
!124 = !DILocation(line: 72, column: 15, scope: !105)
!125 = !DILocation(line: 74, column: 3, scope: !105)
!126 = !DILocation(line: 72, column: 45, scope: !105)
!127 = distinct !DISubprogram(name: "XXT_factor", scope: !22, file: !22, line: 78, type: !128, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !133)
!128 = !DISubroutineType(types: !129)
!129 = !{!78, !18, !42, !25, !25, !130, !81}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!78, !81, !51, !51}
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DILocalVariable(name: "xxt_handle", arg: 1, scope: !127, file: !22, line: 78, type: !18)
!135 = !DILocalVariable(name: "local2global", arg: 2, scope: !127, file: !22, line: 79, type: !42)
!136 = !DILocalVariable(name: "n", arg: 3, scope: !127, file: !22, line: 80, type: !25)
!137 = !DILocalVariable(name: "m", arg: 4, scope: !127, file: !22, line: 81, type: !25)
!138 = !DILocalVariable(name: "matvec", arg: 5, scope: !127, file: !22, line: 82, type: !130)
