; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errtrace.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errtrace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.ompi_communicator_t = type opaque
%struct._n_PetscOptions = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscIgnoreErrorHandler = private unnamed_addr constant [24 x i8] c"PetscIgnoreErrorHandler\00", align 1
@.str = private unnamed_addr constant [78 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errtrace.c\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Invalid stack size %d, pop %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [42 x i8] c"Invalid stack: push from %s, pop from %s\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "arch", scope: !2, file: !30, line: 41, type: !87, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errtrace.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !{!18, !21, !25}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !22, line: 330, baseType: !23)
!22 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !22, line: 330, flags: DIFlagFwdDecl)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !{!27, !53, !0, !85, !90, !92, !97, !99, !104, !106}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "PetscErrorPrintfCalled", scope: !29, file: !30, line: 78, type: !52, isLocal: true, isDefinition: true)
!29 = distinct !DISubprogram(name: "PetscErrorPrintfDefault", scope: !30, file: !30, line: 75, type: !31, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !35)
!30 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/error/errtrace.c", directory: "/home/users/ndemeye/xSDK")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !18, null}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !34)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{!36, !37}
!36 = !DILocalVariable(name: "format", arg: 1, scope: !29, file: !30, line: 75, type: !18)
!37 = !DILocalVariable(name: "Argp", scope: !29, file: !30, line: 77, type: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !41, line: 32, baseType: !42)
!41 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stdarg.h", directory: "/home/users")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !30, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 192, elements: !50)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !44, file: !30, line: 77, baseType: !7, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !44, file: !30, line: 77, baseType: !7, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !44, file: !30, line: 77, baseType: !25, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !44, file: !30, line: 77, baseType: !25, size: 64, offset: 128)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "cnt", scope: !55, file: !30, line: 182, type: !34, isLocal: true, isDefinition: true)
!55 = distinct !DISubprogram(name: "PetscTraceBackErrorHandler", scope: !30, file: !30, line: 172, type: !56, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !59)
!56 = !DISubroutineType(types: !57)
!57 = !{!33, !21, !34, !18, !18, !33, !58, !18, !25}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorType", file: !6, line: 663, baseType: !5)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !72, !73, !74, !75, !77, !80}
!60 = !DILocalVariable(name: "comm", arg: 1, scope: !55, file: !30, line: 172, type: !21)
!61 = !DILocalVariable(name: "line", arg: 2, scope: !55, file: !30, line: 172, type: !34)
!62 = !DILocalVariable(name: "fun", arg: 3, scope: !55, file: !30, line: 172, type: !18)
!63 = !DILocalVariable(name: "file", arg: 4, scope: !55, file: !30, line: 172, type: !18)
!64 = !DILocalVariable(name: "n", arg: 5, scope: !55, file: !30, line: 172, type: !33)
!65 = !DILocalVariable(name: "p", arg: 6, scope: !55, file: !30, line: 172, type: !58)
!66 = !DILocalVariable(name: "mess", arg: 7, scope: !55, file: !30, line: 172, type: !18)
!67 = !DILocalVariable(name: "ctx", arg: 8, scope: !55, file: !30, line: 172, type: !25)
!68 = !DILocalVariable(name: "mem", scope: !55, file: !30, line: 174, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !70)
!70 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!71 = !DILocalVariable(name: "rss", scope: !55, file: !30, line: 174, type: !69)
!72 = !DILocalVariable(name: "flg1", scope: !55, file: !30, line: 175, type: !52)
!73 = !DILocalVariable(name: "flg2", scope: !55, file: !30, line: 175, type: !52)
!74 = !DILocalVariable(name: "flg3", scope: !55, file: !30, line: 175, type: !52)
!75 = !DILocalVariable(name: "rank", scope: !55, file: !30, line: 176, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !34)
!77 = !DILocalVariable(name: "ismain", scope: !78, file: !30, line: 181, type: !52)
!78 = distinct !DILexicalBlock(scope: !79, file: !30, line: 180, column: 14)
!79 = distinct !DILexicalBlock(scope: !55, file: !30, line: 180, column: 7)
!80 = !DILocalVariable(name: "text", scope: !81, file: !30, line: 204, type: !18)
!81 = distinct !DILexicalBlock(scope: !82, file: !30, line: 203, column: 14)
!82 = distinct !DILexicalBlock(scope: !83, file: !30, line: 188, column: 11)
!83 = distinct !DILexicalBlock(scope: !84, file: !30, line: 184, column: 19)
!84 = distinct !DILexicalBlock(scope: !78, file: !30, line: 184, column: 9)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !30, line: 41, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 128)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "username", scope: !2, file: !30, line: 41, type: !87, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "pname", scope: !2, file: !30, line: 41, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32768, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4096)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "date", scope: !2, file: !30, line: 41, type: !87, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "version", scope: !2, file: !30, line: 43, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 256)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "PetscErrorPrintfInitializeCalled", scope: !2, file: !30, line: 42, type: !52, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "petscconfigureoptions", scope: !2, file: !108, line: 1, type: !18, isLocal: true, isDefinition: true)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/arch-linux-c-debug/include/petscconfiginfo.h", directory: "/home/users/ndemeye/xSDK")
!109 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!110 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!111 = !{i32 7, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{i32 7, !"PIC Level", i32 2}
!115 = !{i32 7, !"uwtable", i32 1}
!116 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!117 = distinct !DISubprogram(name: "PetscIgnoreErrorHandler", scope: !30, file: !30, line: 33, type: !56, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126}
!119 = !DILocalVariable(name: "comm", arg: 1, scope: !117, file: !30, line: 33, type: !21)
!120 = !DILocalVariable(name: "line", arg: 2, scope: !117, file: !30, line: 33, type: !34)
!121 = !DILocalVariable(name: "fun", arg: 3, scope: !117, file: !30, line: 33, type: !18)
!122 = !DILocalVariable(name: "file", arg: 4, scope: !117, file: !30, line: 33, type: !18)
!123 = !DILocalVariable(name: "n", arg: 5, scope: !117, file: !30, line: 33, type: !33)
!124 = !DILocalVariable(name: "p", arg: 6, scope: !117, file: !30, line: 33, type: !58)
!125 = !DILocalVariable(name: "mess", arg: 7, scope: !117, file: !30, line: 33, type: !18)
!126 = !DILocalVariable(name: "ctx", arg: 8, scope: !117, file: !30, line: 33, type: !25)
!127 = !DILocation(line: 0, scope: !117)
!128 = !DILocation(line: 35, column: 3, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !30, line: 35, column: 3)
!130 = distinct !DILexicalBlock(scope: !131, file: !30, line: 35, column: 3)
!131 = distinct !DILexicalBlock(scope: !117, file: !30, line: 35, column: 3)
!132 = !{!133, !133, i64 0}
!133 = !{!"any pointer", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 35, column: 3, scope: !130)
!137 = !DILocation(line: 35, column: 3, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !30, line: 35, column: 3)
!139 = distinct !DILexicalBlock(scope: !129, file: !30, line: 35, column: 3)
!140 = !{!141, !142, i64 1536}
!141 = !{!"", !134, i64 0, !134, i64 512, !134, i64 1024, !134, i64 1280, !142, i64 1536, !142, i64 1540, !134, i64 1544}
!142 = !{!"int", !134, i64 0}
!143 = !DILocation(line: 35, column: 3, scope: !139)
!144 = !DILocation(line: 35, column: 3, scope: !145)
!145 = distinct !DILexicalBlock(scope: !138, file: !30, line: 35, column: 3)
!146 = !{!142, !142, i64 0}
!147 = !DILocation(line: 36, column: 3, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !30, line: 36, column: 3)
!149 = distinct !DILexicalBlock(scope: !150, file: !30, line: 36, column: 3)
!150 = distinct !DILexicalBlock(scope: !117, file: !30, line: 36, column: 3)
!151 = !{!141, !142, i64 1540}
!152 = !DILocation(line: 36, column: 3, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !30, line: 36, column: 3)
!154 = distinct !DILexicalBlock(scope: !148, file: !30, line: 36, column: 3)
!155 = !DILocation(line: 36, column: 3, scope: !154)
!156 = !DILocation(line: 36, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !158, file: !30, line: 36, column: 3)
!158 = distinct !DILexicalBlock(scope: !153, file: !30, line: 36, column: 3)
!159 = !{!141, !134, i64 1544}
!160 = !DILocation(line: 36, column: 3, scope: !158)
!161 = !DILocation(line: 36, column: 3, scope: !162)
!162 = distinct !DILexicalBlock(scope: !157, file: !30, line: 36, column: 3)
!163 = !DILocation(line: 36, column: 3, scope: !164)
!164 = distinct !DILexicalBlock(scope: !153, file: !30, line: 36, column: 3)
!165 = !DILocation(line: 36, column: 3, scope: !166)
!166 = distinct !DILexicalBlock(scope: !164, file: !30, line: 36, column: 3)
!167 = !DILocation(line: 36, column: 3, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !30, line: 36, column: 3)
!169 = distinct !DILexicalBlock(scope: !166, file: !30, line: 36, column: 3)
!170 = !DILocation(line: 36, column: 3, scope: !169)
!171 = !DILocation(line: 36, column: 3, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !30, line: 36, column: 3)
!173 = !DILocation(line: 36, column: 3, scope: !150)
!174 = distinct !DISubprogram(name: "PetscErrorPrintfInitialize", scope: !30, file: !30, line: 49, type: !175, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{!33}
!177 = !{!178, !179, !180, !181, !183, !185, !187, !189, !191, !193, !195}
!178 = !DILocalVariable(name: "ierr", scope: !174, file: !30, line: 51, type: !33)
!179 = !DILocalVariable(name: "use_stdout", scope: !174, file: !30, line: 52, type: !52)
!180 = !DILocalVariable(name: "use_none", scope: !174, file: !30, line: 52, type: !52)
!181 = !DILocalVariable(name: "ierr__", scope: !182, file: !30, line: 55, type: !33)
!182 = distinct !DILexicalBlock(scope: !174, file: !30, line: 55, column: 46)
!183 = !DILocalVariable(name: "ierr__", scope: !184, file: !30, line: 56, type: !33)
!184 = distinct !DILexicalBlock(scope: !174, file: !30, line: 56, column: 54)
!185 = !DILocalVariable(name: "ierr__", scope: !186, file: !30, line: 57, type: !33)
!186 = distinct !DILexicalBlock(scope: !174, file: !30, line: 57, column: 54)
!187 = !DILocalVariable(name: "ierr__", scope: !188, file: !30, line: 58, type: !33)
!188 = distinct !DILexicalBlock(scope: !174, file: !30, line: 58, column: 51)
!189 = !DILocalVariable(name: "ierr__", scope: !190, file: !30, line: 59, type: !33)
!190 = distinct !DILexicalBlock(scope: !174, file: !30, line: 59, column: 42)
!191 = !DILocalVariable(name: "ierr__", scope: !192, file: !30, line: 60, type: !33)
!192 = distinct !DILexicalBlock(scope: !174, file: !30, line: 60, column: 51)
!193 = !DILocalVariable(name: "ierr__", scope: !194, file: !30, line: 62, type: !33)
!194 = distinct !DILexicalBlock(scope: !174, file: !30, line: 62, column: 81)
!195 = !DILocalVariable(name: "ierr__", scope: !196, file: !30, line: 64, type: !33)
!196 = distinct !DILexicalBlock(scope: !174, file: !30, line: 64, column: 77)
!197 = !DILocation(line: 52, column: 3, scope: !174)
!198 = !DILocation(line: 0, scope: !174)
!199 = !DILocation(line: 52, column: 18, scope: !174)
!200 = !{!134, !134, i64 0}
!201 = !DILocation(line: 52, column: 43, scope: !174)
!202 = !DILocation(line: 54, column: 3, scope: !203)
!203 = distinct !DILexicalBlock(scope: !204, file: !30, line: 54, column: 3)
!204 = distinct !DILexicalBlock(scope: !205, file: !30, line: 54, column: 3)
!205 = distinct !DILexicalBlock(scope: !174, file: !30, line: 54, column: 3)
!206 = !DILocation(line: 54, column: 3, scope: !204)
!207 = !DILocation(line: 54, column: 3, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !30, line: 54, column: 3)
!209 = distinct !DILexicalBlock(scope: !203, file: !30, line: 54, column: 3)
!210 = !DILocation(line: 54, column: 3, scope: !209)
!211 = !DILocation(line: 54, column: 3, scope: !212)
!212 = distinct !DILexicalBlock(scope: !208, file: !30, line: 54, column: 3)
!213 = !DILocation(line: 55, column: 10, scope: !174)
!214 = !DILocation(line: 0, scope: !182)
!215 = !DILocation(line: 55, column: 46, scope: !216)
!216 = distinct !DILexicalBlock(scope: !182, file: !30, line: 55, column: 46)
!217 = !DILocation(line: 55, column: 46, scope: !182)
!218 = !{!"branch_weights", i32 2000, i32 1}
!219 = !DILocation(line: 56, column: 10, scope: !174)
!220 = !DILocation(line: 0, scope: !184)
!221 = !DILocation(line: 56, column: 54, scope: !222)
!222 = distinct !DILexicalBlock(scope: !184, file: !30, line: 56, column: 54)
!223 = !DILocation(line: 56, column: 54, scope: !184)
!224 = !DILocation(line: 57, column: 10, scope: !174)
!225 = !DILocation(line: 0, scope: !186)
!226 = !DILocation(line: 57, column: 54, scope: !227)
!227 = distinct !DILexicalBlock(scope: !186, file: !30, line: 57, column: 54)
!228 = !DILocation(line: 57, column: 54, scope: !186)
!229 = !DILocation(line: 58, column: 10, scope: !174)
!230 = !DILocation(line: 0, scope: !188)
!231 = !DILocation(line: 58, column: 51, scope: !232)
!232 = distinct !DILexicalBlock(scope: !188, file: !30, line: 58, column: 51)
!233 = !DILocation(line: 58, column: 51, scope: !188)
!234 = !DILocation(line: 59, column: 10, scope: !174)
!235 = !DILocation(line: 0, scope: !190)
!236 = !DILocation(line: 59, column: 42, scope: !237)
!237 = distinct !DILexicalBlock(scope: !190, file: !30, line: 59, column: 42)
!238 = !DILocation(line: 59, column: 42, scope: !190)
!239 = !DILocation(line: 60, column: 10, scope: !174)
!240 = !DILocation(line: 0, scope: !192)
!241 = !DILocation(line: 60, column: 51, scope: !242)
!242 = distinct !DILexicalBlock(scope: !192, file: !30, line: 60, column: 51)
!243 = !DILocation(line: 60, column: 51, scope: !192)
!244 = !DILocation(line: 62, column: 10, scope: !174)
!245 = !DILocation(line: 0, scope: !194)
!246 = !DILocation(line: 62, column: 81, scope: !247)
!247 = distinct !DILexicalBlock(scope: !194, file: !30, line: 62, column: 81)
!248 = !DILocation(line: 62, column: 81, scope: !194)
!249 = !DILocation(line: 63, column: 7, scope: !250)
!250 = distinct !DILexicalBlock(scope: !174, file: !30, line: 63, column: 7)
!251 = !DILocation(line: 63, column: 7, scope: !174)
!252 = !DILocation(line: 63, column: 34, scope: !250)
!253 = !DILocation(line: 63, column: 32, scope: !250)
!254 = !DILocation(line: 63, column: 19, scope: !250)
!255 = !DILocation(line: 64, column: 10, scope: !174)
!256 = !DILocation(line: 0, scope: !196)
!257 = !DILocation(line: 64, column: 77, scope: !258)
!258 = distinct !DILexicalBlock(scope: !196, file: !30, line: 64, column: 77)
!259 = !DILocation(line: 64, column: 77, scope: !196)
!260 = !DILocation(line: 65, column: 7, scope: !261)
!261 = distinct !DILexicalBlock(scope: !174, file: !30, line: 65, column: 7)
!262 = !DILocation(line: 65, column: 7, scope: !174)
!263 = !DILocation(line: 65, column: 34, scope: !261)
!264 = !DILocation(line: 65, column: 17, scope: !261)
!265 = !DILocation(line: 66, column: 36, scope: !174)
!266 = !DILocation(line: 67, column: 3, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !30, line: 67, column: 3)
!268 = distinct !DILexicalBlock(scope: !269, file: !30, line: 67, column: 3)
!269 = distinct !DILexicalBlock(scope: !174, file: !30, line: 67, column: 3)
!270 = !DILocation(line: 67, column: 3, scope: !268)
!271 = !DILocation(line: 67, column: 3, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !30, line: 67, column: 3)
!273 = distinct !DILexicalBlock(scope: !267, file: !30, line: 67, column: 3)
!274 = !DILocation(line: 67, column: 3, scope: !273)
!275 = !DILocation(line: 67, column: 3, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !30, line: 67, column: 3)
!277 = distinct !DILexicalBlock(scope: !272, file: !30, line: 67, column: 3)
!278 = !DILocation(line: 67, column: 3, scope: !277)
!279 = !DILocation(line: 67, column: 3, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !30, line: 67, column: 3)
!281 = !DILocation(line: 67, column: 3, scope: !282)
!282 = distinct !DILexicalBlock(scope: !272, file: !30, line: 67, column: 3)
!283 = !DILocation(line: 67, column: 3, scope: !284)
!284 = distinct !DILexicalBlock(scope: !282, file: !30, line: 67, column: 3)
!285 = !DILocation(line: 67, column: 3, scope: !286)
!286 = distinct !DILexicalBlock(scope: !287, file: !30, line: 67, column: 3)
!287 = distinct !DILexicalBlock(scope: !284, file: !30, line: 67, column: 3)
!288 = !DILocation(line: 67, column: 3, scope: !287)
!289 = !DILocation(line: 67, column: 3, scope: !290)
!290 = distinct !DILexicalBlock(scope: !286, file: !30, line: 67, column: 3)
!291 = !DILocation(line: 68, column: 1, scope: !174)
!292 = !DISubprogram(name: "PetscGetArchType", scope: !293, file: !293, line: 2486, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DISubroutineType(types: !295)
!295 = !{!34, !296, !297}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !{}
!299 = !DISubprogram(name: "PetscError", scope: !6, file: !6, line: 668, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!300 = !DISubroutineType(types: !301)
!301 = !{!33, !23, !34, !18, !18, !34, !5, !18, null}
!302 = !DISubprogram(name: "PetscGetHostName", scope: !293, file: !293, line: 2487, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!303 = !DISubprogram(name: "PetscGetUserName", scope: !293, file: !293, line: 2488, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!304 = !DISubprogram(name: "PetscGetProgramName", scope: !293, file: !293, line: 2489, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!305 = !DISubprogram(name: "PetscGetDate", scope: !293, file: !293, line: 2491, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!306 = !DISubprogram(name: "PetscGetVersion", scope: !293, file: !293, line: 2492, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!307 = !DISubprogram(name: "PetscOptionsGetBool", scope: !308, file: !308, line: 20, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!309 = !DISubroutineType(types: !310)
!310 = !{!34, !311, !18, !18, !313, !313}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !308, line: 10, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!314 = distinct !DISubprogram(name: "PetscErrorPrintfNone", scope: !30, file: !30, line: 70, type: !31, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !315)
!315 = !{!316}
!316 = !DILocalVariable(name: "format", arg: 1, scope: !314, file: !30, line: 70, type: !18)
!317 = !DILocation(line: 0, scope: !314)
!318 = !DILocation(line: 72, column: 3, scope: !314)
!319 = !DILocation(line: 0, scope: !29)
!320 = !DILocation(line: 77, column: 3, scope: !29)
!321 = !DILocation(line: 77, column: 20, scope: !29)
!322 = !DILocation(line: 87, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !29, file: !30, line: 87, column: 7)
!324 = !DILocation(line: 87, column: 7, scope: !29)
!325 = !DILocation(line: 88, column: 28, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !30, line: 87, column: 32)
!327 = !DILocation(line: 103, column: 3, scope: !326)
!328 = !DILocation(line: 105, column: 32, scope: !29)
!329 = !DILocation(line: 105, column: 65, scope: !29)
!330 = !DILocation(line: 105, column: 3, scope: !29)
!331 = !DILocation(line: 106, column: 3, scope: !29)
!332 = !DILocation(line: 107, column: 5, scope: !29)
!333 = !DILocation(line: 107, column: 20, scope: !29)
!334 = !DILocation(line: 107, column: 3, scope: !29)
!335 = !DILocation(line: 108, column: 3, scope: !29)
!336 = !DILocation(line: 110, column: 1, scope: !29)
!337 = !DILocation(line: 109, column: 3, scope: !29)
!338 = !DISubprogram(name: "PetscFPrintf", scope: !293, file: !293, line: 1658, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !298)
!339 = !DISubroutineType(types: !340)
!340 = !{!33, !23, !341, !18, null}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !343, line: 245, size: 1728, elements: !344)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !364, !365, !366, !367, !371, !373, !375, !377, !380, !382, !383, !384, !385, !386, !389, !390}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !342, file: !343, line: 246, baseType: !34, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !342, file: !343, line: 251, baseType: !296, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !342, file: !343, line: 252, baseType: !296, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !342, file: !343, line: 253, baseType: !296, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !342, file: !343, line: 254, baseType: !296, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !342, file: !343, line: 255, baseType: !296, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !342, file: !343, line: 256, baseType: !296, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !342, file: !343, line: 257, baseType: !296, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !342, file: !343, line: 258, baseType: !296, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !342, file: !343, line: 260, baseType: !296, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !342, file: !343, line: 261, baseType: !296, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !342, file: !343, line: 262, baseType: !296, size: 64, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !342, file: !343, line: 264, baseType: !358, size: 64, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !343, line: 160, size: 192, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !359, file: !343, line: 161, baseType: !358, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !359, file: !343, line: 162, baseType: !341, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !359, file: !343, line: 166, baseType: !34, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !342, file: !343, line: 266, baseType: !341, size: 64, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !342, file: !343, line: 268, baseType: !34, size: 32, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !342, file: !343, line: 272, baseType: !34, size: 32, offset: 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !342, file: !343, line: 274, baseType: !368, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !369, line: 140, baseType: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!370 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !342, file: !343, line: 278, baseType: !372, size: 16, offset: 1024)
!372 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !342, file: !343, line: 279, baseType: !374, size: 8, offset: 1040)
!374 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !342, file: !343, line: 280, baseType: !376, size: 8, offset: 1048)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !50)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !342, file: !343, line: 284, baseType: !378, size: 64, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !343, line: 154, baseType: null)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !342, file: !343, line: 293, baseType: !381, size: 64, offset: 1152)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !369, line: 141, baseType: !370)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !342, file: !343, line: 301, baseType: !25, size: 64, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !342, file: !343, line: 302, baseType: !25, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !342, file: !343, line: 303, baseType: !25, size: 64, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !342, file: !343, line: 304, baseType: !25, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !342, file: !343, line: 306, baseType: !387, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !388, line: 46, baseType: !297)
!388 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !342, file: !343, line: 307, baseType: !34, size: 32, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !342, file: !343, line: 309, baseType: !391, size: 160, offset: 1568)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 20)
!394 = !DILocation(line: 0, scope: !55)
!395 = !DILocation(line: 174, column: 3, scope: !55)
!396 = !DILocation(line: 175, column: 3, scope: !55)
!397 = !DILocation(line: 175, column: 18, scope: !55)
!398 = !DILocation(line: 175, column: 37, scope: !55)
!399 = !DILocation(line: 175, column: 56, scope: !55)
!400 = !DILocation(line: 176, column: 3, scope: !55)
!401 = !DILocation(line: 176, column: 18, scope: !55)
!402 = !DILocation(line: 178, column: 12, scope: !403)
!403 = distinct !DILexicalBlock(scope: !55, file: !30, line: 178, column: 7)
!404 = !DILocation(line: 178, column: 7, scope: !55)
!405 = !DILocation(line: 178, column: 32, scope: !403)
!406 = !DILocation(line: 180, column: 8, scope: !79)
!407 = !DILocation(line: 180, column: 7, scope: !55)
!408 = !DILocation(line: 181, column: 5, scope: !78)
!409 = !DILocation(line: 184, column: 9, scope: !84)
!410 = !DILocation(line: 184, column: 13, scope: !84)
!411 = !DILocation(line: 184, column: 9, scope: !78)
!412 = !DILocation(line: 121, column: 7, scope: !413, inlinedAt: !417)
!413 = distinct !DILexicalBlock(scope: !414, file: !30, line: 121, column: 7)
!414 = distinct !DISubprogram(name: "PetscErrorPrintfHilight", scope: !30, file: !30, line: 118, type: !415, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!415 = !DISubroutineType(types: !416)
!416 = !{null}
!417 = distinct !DILocation(line: 185, column: 7, scope: !83)
!418 = !DILocation(line: 121, column: 24, scope: !413, inlinedAt: !417)
!419 = !DILocation(line: 121, column: 51, scope: !413, inlinedAt: !417)
!420 = !DILocation(line: 121, column: 54, scope: !413, inlinedAt: !417)
!421 = !DILocation(line: 121, column: 70, scope: !413, inlinedAt: !417)
!422 = !DILocation(line: 121, column: 67, scope: !413, inlinedAt: !417)
!423 = !DILocation(line: 121, column: 7, scope: !414, inlinedAt: !417)
!424 = !DILocation(line: 122, column: 16, scope: !425, inlinedAt: !417)
!425 = distinct !DILexicalBlock(scope: !426, file: !30, line: 122, column: 9)
!426 = distinct !DILexicalBlock(scope: !413, file: !30, line: 121, column: 84)
!427 = !DILocation(line: 122, column: 9, scope: !425, inlinedAt: !417)
!428 = !DILocation(line: 122, column: 9, scope: !426, inlinedAt: !417)
!429 = !DILocation(line: 122, column: 47, scope: !425, inlinedAt: !417)
!430 = !DILocation(line: 122, column: 39, scope: !425, inlinedAt: !417)
!431 = !DILocation(line: 186, column: 9, scope: !83)
!432 = !DILocation(line: 186, column: 7, scope: !83)
!433 = !DILocation(line: 130, column: 7, scope: !434, inlinedAt: !436)
!434 = distinct !DILexicalBlock(scope: !435, file: !30, line: 130, column: 7)
!435 = distinct !DISubprogram(name: "PetscErrorPrintfNormal", scope: !30, file: !30, line: 127, type: !415, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!436 = distinct !DILocation(line: 187, column: 7, scope: !83)
!437 = !DILocation(line: 130, column: 24, scope: !434, inlinedAt: !436)
!438 = !DILocation(line: 130, column: 51, scope: !434, inlinedAt: !436)
!439 = !DILocation(line: 130, column: 54, scope: !434, inlinedAt: !436)
!440 = !DILocation(line: 130, column: 70, scope: !434, inlinedAt: !436)
!441 = !DILocation(line: 130, column: 67, scope: !434, inlinedAt: !436)
!442 = !DILocation(line: 130, column: 7, scope: !435, inlinedAt: !436)
!443 = !DILocation(line: 131, column: 16, scope: !444, inlinedAt: !436)
!444 = distinct !DILexicalBlock(scope: !445, file: !30, line: 131, column: 9)
!445 = distinct !DILexicalBlock(scope: !434, file: !30, line: 130, column: 84)
