; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/composite/snescomposite.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/composite/snescomposite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque

!60 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 406, baseType: !28, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!64 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!65 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!67 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!68 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 493, baseType: !28, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!72 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!73 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 815, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "SNES_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_COMPOSITE_ADDITIVEOPTIMAL", value: 2, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 663, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!81 = !{!82, !83, !84}
!82 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!87 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 155, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 726, baseType: !7, size: 32, elements: !114)
!114 = !{!115, !116}
!115 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !118)
!118 = !{!119}
!119 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!120 = !{!121, !125, !126, !201, !329, !332, !211, !28, !335, !161, !338, !295, !336, !7, !187, !567, !568}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !122, line: 330, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !122, line: 330, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !129, line: 73, size: 4480, elements: !130)
!129 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!130 = !{!131, !133, !182, !183, !185, !188, !189, !190, !191, !199, !200, !202, !206, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !223, !224, !225, !227, !228, !230, !232, !233, !234, !235, !236, !239, !241, !242, !243, !244, !245, !248, !250, !251, !252, !262, !264, !265, !269, !270, !319, !324, !326, !327, !328}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !128, file: !129, line: 74, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !128, file: !129, line: 75, baseType: !134, size: 448, offset: 64)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 448, elements: !180)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !129, line: 53, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 45, size: 448, elements: !137)
!137 = !{!138, !144, !152, !157, !164, !168, !175}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !136, file: !129, line: 46, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !126, !143}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !136, file: !129, line: 47, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!142, !126, !148}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !149, line: 16, baseType: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !149, line: 16, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !136, file: !129, line: 48, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!142, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !136, file: !129, line: 49, baseType: !158, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!142, !126, !161, !126}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !136, file: !129, line: 50, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!142, !126, !161, !156}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !136, file: !129, line: 51, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!142, !126, !161, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !136, file: !129, line: 52, baseType: !176, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!142, !126, !161, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !128, file: !129, line: 76, baseType: !121, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !129, line: 77, baseType: !184, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !128, file: !129, line: 78, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !187)
!187 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !128, file: !129, line: 78, baseType: !186, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !128, file: !129, line: 78, baseType: !186, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !128, file: !129, line: 78, baseType: !186, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !129, line: 79, baseType: !192, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !195, line: 27, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !197, line: 43, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !128, file: !129, line: 80, baseType: !184, size: 32, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !128, file: !129, line: 81, baseType: !201, size: 32, offset: 992)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !128, file: !129, line: 82, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !128, file: !129, line: 83, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !128, file: !129, line: 84, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !128, file: !129, line: 85, baseType: !211, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !128, file: !129, line: 86, baseType: !211, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !128, file: !129, line: 87, baseType: !211, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !128, file: !129, line: 88, baseType: !126, size: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !128, file: !129, line: 89, baseType: !192, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 90, baseType: !211, size: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !128, file: !129, line: 91, baseType: !211, size: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !128, file: !129, line: 92, baseType: !184, size: 32, offset: 1664)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !128, file: !129, line: 93, baseType: !125, size: 64, offset: 1728)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 94, baseType: !222, size: 64, offset: 1792)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !193)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !128, file: !129, line: 95, baseType: !184, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !128, file: !129, line: 95, baseType: !184, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !128, file: !129, line: 96, baseType: !226, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !128, file: !129, line: 96, baseType: !226, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !128, file: !129, line: 97, baseType: !229, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !128, file: !129, line: 97, baseType: !231, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !128, file: !129, line: 98, baseType: !184, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !128, file: !129, line: 98, baseType: !184, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !128, file: !129, line: 99, baseType: !226, size: 64, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !128, file: !129, line: 99, baseType: !226, size: 64, offset: 2304)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !128, file: !129, line: 100, baseType: !237, size: 64, offset: 2368)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !187)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !128, file: !129, line: 100, baseType: !240, size: 64, offset: 2432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !128, file: !129, line: 101, baseType: !184, size: 32, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !128, file: !129, line: 101, baseType: !184, size: 32, offset: 2528)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !128, file: !129, line: 102, baseType: !226, size: 64, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !128, file: !129, line: 102, baseType: !226, size: 64, offset: 2624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !128, file: !129, line: 103, baseType: !246, size: 64, offset: 2688)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !128, file: !129, line: 103, baseType: !249, size: 64, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !128, file: !129, line: 104, baseType: !179, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !128, file: !129, line: 105, baseType: !184, size: 32, offset: 2880)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !128, file: !129, line: 106, baseType: !253, size: 128, offset: 2944)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !260)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !129, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 61, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !129, line: 62, baseType: !172, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !256, file: !129, line: 63, baseType: !125, size: 64, offset: 64)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !128, file: !129, line: 107, baseType: !263, size: 64, offset: 3072)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !128, file: !129, line: 108, baseType: !125, size: 64, offset: 3136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !128, file: !129, line: 109, baseType: !266, size: 64, offset: 3200)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!142, !125}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !128, file: !129, line: 111, baseType: !184, size: 32, offset: 3264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !128, file: !129, line: 112, baseType: !271, size: 320, offset: 3328)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !317)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!142, !275, !126, !125}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !278)
!278 = !{!279, !280, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !12, line: 100, baseType: !184, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !12, line: 101, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !298, !300, !302, !303, !304}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !12, line: 84, baseType: !211, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !283, file: !12, line: 85, baseType: !211, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !12, line: 86, baseType: !125, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !283, file: !12, line: 87, baseType: !203, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !12, line: 88, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !283, file: !12, line: 89, baseType: !163, size: 8, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !283, file: !12, line: 90, baseType: !211, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !283, file: !12, line: 91, baseType: !295, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 46, baseType: !297)
!296 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !12, line: 92, baseType: !299, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !12, line: 93, baseType: !301, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !12, line: 94, baseType: !281, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !283, file: !12, line: 95, baseType: !211, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !283, file: !12, line: 96, baseType: !125, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !12, line: 102, baseType: !211, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !277, file: !12, line: 102, baseType: !211, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !277, file: !12, line: 103, baseType: !211, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !12, line: 104, baseType: !121, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !277, file: !12, line: 106, baseType: !126, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !12, line: 107, baseType: !314, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !128, file: !129, line: 113, baseType: !320, size: 320, offset: 3648)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!142, !126, !125}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !128, file: !129, line: 114, baseType: !325, size: 320, offset: 3968)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 320, elements: !317)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !128, file: !129, line: 115, baseType: !299, size: 32, offset: 4288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !128, file: !129, line: 120, baseType: !314, size: 64, offset: 4352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !128, file: !129, line: 121, baseType: !299, size: 32, offset: 4416)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !122, line: 331, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !122, line: 331, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !122, line: 338, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !122, line: 338, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !337, line: 1451, baseType: !172)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_Composite", file: !340, line: 46, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/composite/snescomposite.c", directory: "/home/users/ndemeye/xSDK")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 19, size: 1280, elements: !342)
!342 = !{!343, !542, !543, !545, !546, !547, !548, !549, !550, !551, !552, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !341, file: !340, line: 20, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_CompositeLink", file: !340, line: 10, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNES_CompositeLink", file: !340, line: 11, size: 320, elements: !347)
!347 = !{!348, !538, !539, !540, !541}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !346, file: !340, line: 12, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !352, line: 38, size: 11648, elements: !353)
!352 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!353 = !{!354, !356, !422, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !445, !449, !450, !452, !453, !454, !455, !456, !461, !463, !464, !465, !466, !467, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !503, !505, !506, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !351, file: !352, line: 39, baseType: !355, size: 4480)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !129, line: 122, baseType: !128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !351, file: !352, line: 39, baseType: !357, size: 1088, offset: 4480)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 1088, elements: !180)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !352, line: 12, size: 1088, elements: !359)
!359 = !{!360, !367, !371, !375, !381, !382, !386, !387, !391, !395, !396, !397, !402, !406, !410, !414, !421}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !358, file: !352, line: 13, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!142, !349, !364, !125}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !106, line: 21, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !106, line: 21, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !358, file: !352, line: 14, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!142, !364, !364, !125}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !358, file: !352, line: 15, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!142, !349, !184}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !358, file: !352, line: 16, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!142, !349, !184, !238, !238, !238, !379, !125}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !358, file: !352, line: 17, baseType: !266, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !358, file: !352, line: 18, baseType: !383, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!142, !349}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !358, file: !352, line: 19, baseType: !383, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !358, file: !352, line: 20, baseType: !388, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!142, !349, !148}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !358, file: !352, line: 21, baseType: !392, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!142, !275, !349}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !358, file: !352, line: 22, baseType: !383, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !358, file: !352, line: 23, baseType: !383, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !358, file: !352, line: 24, baseType: !398, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!142, !349, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !358, file: !352, line: 25, baseType: !403, size: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!142, !401}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !358, file: !352, line: 26, baseType: !407, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!142, !349, !364, !364}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !358, file: !352, line: 27, baseType: !411, size: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!142, !349, !364, !364, !125}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !358, file: !352, line: 28, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!142, !349, !364, !418, !418, !125}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !358, file: !352, line: 29, baseType: !388, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !351, file: !352, line: 40, baseType: !423, size: 64, offset: 5568)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !424, line: 14, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !424, line: 14, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !351, file: !352, line: 41, baseType: !299, size: 32, offset: 5632)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !351, file: !352, line: 42, baseType: !349, size: 64, offset: 5696)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !351, file: !352, line: 43, baseType: !430, size: 32, offset: 5760)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !351, file: !352, line: 44, baseType: !299, size: 32, offset: 5792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !351, file: !352, line: 47, baseType: !125, size: 64, offset: 5824)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !351, file: !352, line: 49, baseType: !364, size: 64, offset: 5888)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !351, file: !352, line: 50, baseType: !364, size: 64, offset: 5952)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !351, file: !352, line: 52, baseType: !364, size: 64, offset: 6016)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !351, file: !352, line: 54, baseType: !418, size: 64, offset: 6080)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !351, file: !352, line: 55, baseType: !418, size: 64, offset: 6144)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !351, file: !352, line: 56, baseType: !418, size: 64, offset: 6208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !351, file: !352, line: 57, baseType: !125, size: 64, offset: 6272)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !351, file: !352, line: 58, baseType: !441, size: 64, offset: 6336)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !442, line: 22, baseType: !443)
!442 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !442, line: 22, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !351, file: !352, line: 59, baseType: !446, size: 64, offset: 6400)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !351, file: !352, line: 60, baseType: !299, size: 32, offset: 6464)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !351, file: !352, line: 61, baseType: !451, size: 32, offset: 6496)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !351, file: !352, line: 63, baseType: !364, size: 64, offset: 6528)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !351, file: !352, line: 65, baseType: !364, size: 64, offset: 6592)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !351, file: !352, line: 66, baseType: !125, size: 64, offset: 6656)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !351, file: !352, line: 68, baseType: !238, size: 64, offset: 6720)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !351, file: !352, line: 74, baseType: !457, size: 320, offset: 6784)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 320, elements: !317)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!142, !349, !184, !238, !125}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !351, file: !352, line: 75, baseType: !462, size: 320, offset: 7104)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 320, elements: !317)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !351, file: !352, line: 76, baseType: !325, size: 320, offset: 7424)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !351, file: !352, line: 77, baseType: !184, size: 32, offset: 7744)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !351, file: !352, line: 78, baseType: !125, size: 64, offset: 7808)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !351, file: !352, line: 79, baseType: !380, size: 32, offset: 7872)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !351, file: !352, line: 80, baseType: !468, size: 320, offset: 7936)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 320, elements: !317)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!142, !349, !125}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !351, file: !352, line: 81, baseType: !462, size: 320, offset: 8256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !351, file: !352, line: 82, baseType: !325, size: 320, offset: 8576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !351, file: !352, line: 83, baseType: !184, size: 32, offset: 8896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !351, file: !352, line: 84, baseType: !299, size: 32, offset: 8928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !351, file: !352, line: 88, baseType: !299, size: 32, offset: 8960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !352, line: 89, baseType: !125, size: 64, offset: 9024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !351, file: !352, line: 93, baseType: !184, size: 32, offset: 9088)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !351, file: !352, line: 94, baseType: !184, size: 32, offset: 9120)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !351, file: !352, line: 95, baseType: !184, size: 32, offset: 9152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !351, file: !352, line: 96, baseType: !184, size: 32, offset: 9184)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !351, file: !352, line: 97, baseType: !184, size: 32, offset: 9216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !351, file: !352, line: 98, baseType: !238, size: 64, offset: 9280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !351, file: !352, line: 99, baseType: !238, size: 64, offset: 9344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !351, file: !352, line: 100, baseType: !238, size: 64, offset: 9408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !351, file: !352, line: 101, baseType: !238, size: 64, offset: 9472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !351, file: !352, line: 102, baseType: !238, size: 64, offset: 9536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !351, file: !352, line: 103, baseType: !238, size: 64, offset: 9600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !351, file: !352, line: 104, baseType: !238, size: 64, offset: 9664)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !351, file: !352, line: 105, baseType: !238, size: 64, offset: 9728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !351, file: !352, line: 106, baseType: !299, size: 32, offset: 9792)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !351, file: !352, line: 107, baseType: !184, size: 32, offset: 9824)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !351, file: !352, line: 108, baseType: !184, size: 32, offset: 9856)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !351, file: !352, line: 109, baseType: !184, size: 32, offset: 9888)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !351, file: !352, line: 110, baseType: !299, size: 32, offset: 9920)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !351, file: !352, line: 111, baseType: !184, size: 32, offset: 9952)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !351, file: !352, line: 112, baseType: !299, size: 32, offset: 9984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !351, file: !352, line: 113, baseType: !184, size: 32, offset: 10016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !351, file: !352, line: 115, baseType: !299, size: 32, offset: 10048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !351, file: !352, line: 117, baseType: !299, size: 32, offset: 10080)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !351, file: !352, line: 119, baseType: !502, size: 32, offset: 10112)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !351, file: !352, line: 120, baseType: !504, size: 32, offset: 10144)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !351, file: !352, line: 124, baseType: !184, size: 32, offset: 10176)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !351, file: !352, line: 125, baseType: !507, size: 64, offset: 10240)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !351, file: !352, line: 129, baseType: !184, size: 32, offset: 10304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !351, file: !352, line: 130, baseType: !237, size: 64, offset: 10368)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !351, file: !352, line: 132, baseType: !229, size: 64, offset: 10432)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !351, file: !352, line: 133, baseType: !184, size: 32, offset: 10496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !351, file: !352, line: 134, baseType: !184, size: 32, offset: 10528)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !351, file: !352, line: 135, baseType: !299, size: 32, offset: 10560)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !351, file: !352, line: 136, baseType: !299, size: 32, offset: 10592)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !351, file: !352, line: 137, baseType: !299, size: 32, offset: 10624)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !351, file: !352, line: 140, baseType: !184, size: 32, offset: 10656)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !351, file: !352, line: 141, baseType: !184, size: 32, offset: 10688)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !351, file: !352, line: 143, baseType: !184, size: 32, offset: 10720)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !351, file: !352, line: 144, baseType: !184, size: 32, offset: 10752)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !351, file: !352, line: 146, baseType: !299, size: 32, offset: 10784)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !351, file: !352, line: 147, baseType: !299, size: 32, offset: 10816)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !351, file: !352, line: 148, baseType: !299, size: 32, offset: 10848)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !351, file: !352, line: 150, baseType: !299, size: 32, offset: 10880)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !351, file: !352, line: 151, baseType: !125, size: 64, offset: 10944)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !351, file: !352, line: 154, baseType: !238, size: 64, offset: 11008)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !351, file: !352, line: 155, baseType: !238, size: 64, offset: 11072)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !351, file: !352, line: 157, baseType: !507, size: 64, offset: 11136)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !351, file: !352, line: 158, baseType: !184, size: 32, offset: 11200)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !351, file: !352, line: 160, baseType: !299, size: 32, offset: 11232)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !351, file: !352, line: 161, baseType: !299, size: 32, offset: 11264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !351, file: !352, line: 162, baseType: !184, size: 32, offset: 11296)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !351, file: !352, line: 164, baseType: !238, size: 64, offset: 11328)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !351, file: !352, line: 165, baseType: !364, size: 64, offset: 11392)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !351, file: !352, line: 165, baseType: !364, size: 64, offset: 11456)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !351, file: !352, line: 166, baseType: !184, size: 32, offset: 11520)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !351, file: !352, line: 167, baseType: !299, size: 32, offset: 11552)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !351, file: !352, line: 169, baseType: !299, size: 32, offset: 11584)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dmp", scope: !346, file: !340, line: 13, baseType: !238, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !346, file: !340, line: 14, baseType: !364, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !340, line: 15, baseType: !344, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !346, file: !340, line: 16, baseType: !344, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nsnes", scope: !341, file: !340, line: 21, baseType: !184, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !340, line: 22, baseType: !544, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESCompositeType", file: !27, line: 815, baseType: !74)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Xorig", scope: !341, file: !340, line: 23, baseType: !364, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "innerFailures", scope: !341, file: !340, line: 24, baseType: !184, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Xes", scope: !341, file: !340, line: 27, baseType: !507, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Fes", scope: !341, file: !340, line: 27, baseType: !507, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fnorms", scope: !341, file: !340, line: 28, baseType: !237, size: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !341, file: !340, line: 29, baseType: !246, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !341, file: !340, line: 30, baseType: !246, size: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !341, file: !340, line: 31, baseType: !553, size: 32, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !28)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nrhs", scope: !341, file: !340, line: 32, baseType: !553, size: 32, offset: 608)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lda", scope: !341, file: !340, line: 33, baseType: !553, size: 32, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ldb", scope: !341, file: !340, line: 34, baseType: !553, size: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !341, file: !340, line: 35, baseType: !237, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !341, file: !340, line: 36, baseType: !246, size: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !341, file: !340, line: 37, baseType: !238, size: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !341, file: !340, line: 38, baseType: !553, size: 32, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !341, file: !340, line: 39, baseType: !246, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rwork", scope: !341, file: !340, line: 40, baseType: !237, size: 64, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lwork", scope: !341, file: !340, line: 41, baseType: !553, size: 32, offset: 1088)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !341, file: !340, line: 42, baseType: !553, size: 32, offset: 1120)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !341, file: !340, line: 44, baseType: !238, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !341, file: !340, line: 45, baseType: !238, size: 64, offset: 1216)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !117)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!569 = !{!0}
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 384, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 6)
!573 = !{i32 7, !"Dwarf Version", i32 4}
!574 = !{i32 2, !"Debug Info Version", i32 3}
!575 = !{i32 1, !"wchar_size", i32 4}
!576 = !{i32 7, !"PIC Level", i32 2}
!577 = !{i32 7, !"uwtable", i32 1}
!578 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!579 = distinct !DISubprogram(name: "SNESCompositeSetType", scope: !340, file: !340, line: 588, type: !580, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{!142, !349, !544}
!582 = !{!583, !584, !585, !586, !588, !589, !591, !592, !594, !596, !597, !599, !605, !606, !608, !611, !612, !614, !617, !618, !621, !622, !624, !628}
!583 = !DILocalVariable(name: "snes", arg: 1, scope: !579, file: !340, line: 588, type: !349)
!584 = !DILocalVariable(name: "type", arg: 2, scope: !579, file: !340, line: 588, type: !544)
!585 = !DILocalVariable(name: "ierr", scope: !579, file: !340, line: 590, type: !142)
!586 = !DILocalVariable(name: "_7_ierr", scope: !587, file: !340, line: 594, type: !142)
!587 = distinct !DILexicalBlock(scope: !579, file: !340, line: 594, column: 3)
!588 = !DILocalVariable(name: "b0", scope: !587, file: !340, line: 594, type: !201)
!589 = !DILocalVariable(name: "b1", scope: !587, file: !340, line: 594, type: !590)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 64, elements: !260)
!591 = !DILocalVariable(name: "b2", scope: !587, file: !340, line: 594, type: !590)
!592 = !DILocalVariable(name: "_4_ierr", scope: !593, file: !340, line: 594, type: !142)
!593 = distinct !DILexicalBlock(scope: !587, file: !340, line: 594, column: 3)
!594 = !DILocalVariable(name: "a_b1", scope: !593, file: !340, line: 594, type: !595)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 192, elements: !571)
!596 = !DILocalVariable(name: "a_b2", scope: !593, file: !340, line: 594, type: !595)
!597 = !DILocalVariable(name: "_7_errorcode", scope: !598, file: !340, line: 594, type: !142)
!598 = distinct !DILexicalBlock(scope: !593, file: !340, line: 594, column: 3)
!599 = !DILocalVariable(name: "_7_errorstring", scope: !600, file: !340, line: 594, type: !602)
!600 = distinct !DILexicalBlock(scope: !601, file: !340, line: 594, column: 3)
!601 = distinct !DILexicalBlock(scope: !598, file: !340, line: 594, column: 3)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 2048, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 256)
!605 = !DILocalVariable(name: "_7_resultlen", scope: !600, file: !340, line: 594, type: !201)
!606 = !DILocalVariable(name: "_7_errorcode", scope: !607, file: !340, line: 594, type: !142)
!607 = distinct !DILexicalBlock(scope: !593, file: !340, line: 594, column: 3)
!608 = !DILocalVariable(name: "_7_errorstring", scope: !609, file: !340, line: 594, type: !602)
!609 = distinct !DILexicalBlock(scope: !610, file: !340, line: 594, column: 3)
!610 = distinct !DILexicalBlock(scope: !607, file: !340, line: 594, column: 3)
!611 = !DILocalVariable(name: "_7_resultlen", scope: !609, file: !340, line: 594, type: !201)
!612 = !DILocalVariable(name: "_7_errorcode", scope: !613, file: !340, line: 594, type: !142)
!613 = distinct !DILexicalBlock(scope: !587, file: !340, line: 594, column: 3)
!614 = !DILocalVariable(name: "_7_errorstring", scope: !615, file: !340, line: 594, type: !602)
!615 = distinct !DILexicalBlock(scope: !616, file: !340, line: 594, column: 3)
