; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-custom/zvectorf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-custom/zvectorf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_Vec = type opaque
%struct._p_PetscViewer = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "VecGetArrayAligned", scope: !2, file: !261, line: 227, type: !228, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !259, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-custom/zvectorf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !18, !22, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !19)
!19 = !{!20, !21}
!20 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 81, baseType: !7, size: 32, elements: !24)
!23 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!25 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!35 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!36 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 663, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!43 = !{!44, !50, !54, !55, !176, !179, !47, !102, !225, !258, !141, !91}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !46, line: 135, baseType: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !48, line: 100, baseType: !49)
!48 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !51, line: 330, baseType: !52)
!51 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !51, line: 330, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !58, line: 73, size: 4480, elements: !59)
!58 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!59 = !{!60, !63, !112, !113, !115, !118, !119, !120, !121, !129, !130, !132, !136, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !157, !158, !160, !162, !163, !164, !165, !166, !169, !171, !172, !173, !174, !175, !178, !180, !181, !182, !192, !194, !195, !199, !200, !248, !253, !255, !256, !257}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !57, file: !58, line: 74, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !57, file: !58, line: 75, baseType: !64, size: 448, offset: 64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 448, elements: !110)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !58, line: 53, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 45, size: 448, elements: !67)
!67 = !{!68, !74, !82, !87, !94, !98, !105}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !66, file: !58, line: 46, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !55, !73}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !62)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !66, file: !58, line: 47, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!72, !55, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !79, line: 16, baseType: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !79, line: 16, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !66, file: !58, line: 48, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!72, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !66, file: !58, line: 49, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!72, !55, !91, !55}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !66, file: !58, line: 50, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!72, !55, !91, !86}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !66, file: !58, line: 51, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!72, !55, !91, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !66, file: !58, line: 52, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!72, !55, !91, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !57, file: !58, line: 76, baseType: !50, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !58, line: 77, baseType: !114, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !57, file: !58, line: 78, baseType: !116, size: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !117)
!117 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !57, file: !58, line: 78, baseType: !116, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !57, file: !58, line: 78, baseType: !116, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !57, file: !58, line: 78, baseType: !116, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !57, file: !58, line: 79, baseType: !122, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !125, line: 27, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !127, line: 43, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!128 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !57, file: !58, line: 80, baseType: !114, size: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !57, file: !58, line: 81, baseType: !131, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !62)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !57, file: !58, line: 82, baseType: !133, size: 64, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !57, file: !58, line: 83, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !57, file: !58, line: 84, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !57, file: !58, line: 85, baseType: !141, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !57, file: !58, line: 86, baseType: !141, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !57, file: !58, line: 87, baseType: !141, size: 64, offset: 1344)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !57, file: !58, line: 88, baseType: !55, size: 64, offset: 1408)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !57, file: !58, line: 89, baseType: !122, size: 64, offset: 1472)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 90, baseType: !141, size: 64, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !57, file: !58, line: 91, baseType: !141, size: 64, offset: 1600)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !57, file: !58, line: 92, baseType: !114, size: 32, offset: 1664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !57, file: !58, line: 93, baseType: !54, size: 64, offset: 1728)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !57, file: !58, line: 94, baseType: !152, size: 64, offset: 1792)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !123)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !57, file: !58, line: 95, baseType: !114, size: 32, offset: 1856)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !57, file: !58, line: 95, baseType: !114, size: 32, offset: 1888)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !57, file: !58, line: 96, baseType: !156, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !57, file: !58, line: 96, baseType: !156, size: 64, offset: 1984)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !57, file: !58, line: 97, baseType: !159, size: 64, offset: 2048)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !57, file: !58, line: 97, baseType: !161, size: 64, offset: 2112)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !57, file: !58, line: 98, baseType: !114, size: 32, offset: 2176)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !57, file: !58, line: 98, baseType: !114, size: 32, offset: 2208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !57, file: !58, line: 99, baseType: !156, size: 64, offset: 2240)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !57, file: !58, line: 99, baseType: !156, size: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !57, file: !58, line: 100, baseType: !167, size: 64, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !117)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !57, file: !58, line: 100, baseType: !170, size: 64, offset: 2432)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !57, file: !58, line: 101, baseType: !114, size: 32, offset: 2496)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !57, file: !58, line: 101, baseType: !114, size: 32, offset: 2528)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !57, file: !58, line: 102, baseType: !156, size: 64, offset: 2560)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !57, file: !58, line: 102, baseType: !156, size: 64, offset: 2624)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !57, file: !58, line: 103, baseType: !176, size: 64, offset: 2688)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !168)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !57, file: !58, line: 103, baseType: !179, size: 64, offset: 2752)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !57, file: !58, line: 104, baseType: !109, size: 64, offset: 2816)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !57, file: !58, line: 105, baseType: !114, size: 32, offset: 2880)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !57, file: !58, line: 106, baseType: !183, size: 128, offset: 2944)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !190)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !58, line: 64, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 61, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !186, file: !58, line: 62, baseType: !102, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !186, file: !58, line: 63, baseType: !54, size: 64, offset: 64)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !57, file: !58, line: 107, baseType: !193, size: 64, offset: 3072)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !190)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !57, file: !58, line: 108, baseType: !54, size: 64, offset: 3136)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !57, file: !58, line: 109, baseType: !196, size: 64, offset: 3200)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!72, !54}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !57, file: !58, line: 111, baseType: !114, size: 32, offset: 3264)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !57, file: !58, line: 112, baseType: !201, size: 320, offset: 3328)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 320, elements: !246)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!72, !205, !55, !54}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !23, line: 108, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !23, line: 99, size: 640, elements: !208)
!208 = !{!209, !210, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !207, file: !23, line: 100, baseType: !114, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !23, line: 101, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !23, line: 82, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !23, line: 83, size: 768, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !222, !223, !224, !227, !229, !231, !232, !233}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !213, file: !23, line: 84, baseType: !141, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !213, file: !23, line: 85, baseType: !141, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !23, line: 86, baseType: !54, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !213, file: !23, line: 87, baseType: !133, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !213, file: !23, line: 88, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !213, file: !23, line: 89, baseType: !93, size: 8, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !213, file: !23, line: 90, baseType: !141, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !213, file: !23, line: 91, baseType: !225, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 46, baseType: !49)
!226 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !213, file: !23, line: 92, baseType: !228, size: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !18)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !23, line: 93, baseType: !230, size: 32, offset: 544)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !23, line: 81, baseType: !22)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !23, line: 94, baseType: !211, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !213, file: !23, line: 95, baseType: !141, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !213, file: !23, line: 96, baseType: !54, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !207, file: !23, line: 102, baseType: !141, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !207, file: !23, line: 102, baseType: !141, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !207, file: !23, line: 103, baseType: !141, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !207, file: !23, line: 104, baseType: !50, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !207, file: !23, line: 105, baseType: !228, size: 32, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !207, file: !23, line: 105, baseType: !228, size: 32, offset: 416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !207, file: !23, line: 105, baseType: !228, size: 32, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !207, file: !23, line: 106, baseType: !55, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !207, file: !23, line: 107, baseType: !243, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !23, line: 10, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !23, line: 10, flags: DIFlagFwdDecl)
!246 = !{!247}
!247 = !DISubrange(count: 5)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !57, file: !58, line: 113, baseType: !249, size: 320, offset: 3648)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !246)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!72, !55, !54}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !57, file: !58, line: 114, baseType: !254, size: 320, offset: 3968)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 320, elements: !246)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !57, file: !58, line: 115, baseType: !228, size: 32, offset: 4288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !57, file: !58, line: 120, baseType: !243, size: 64, offset: 4352)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !57, file: !58, line: 121, baseType: !228, size: 32, offset: 4416)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!259 = !{!260}
!260 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-custom/zvectorf.c", directory: "/home/users/ndemeye/xSDK")
!262 = !{i32 7, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{i32 7, !"PIC Level", i32 2}
!266 = !{i32 7, !"uwtable", i32 1}
!267 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!268 = distinct !DISubprogram(name: "vecsetvalueslocal_", scope: !261, file: !261, line: 86, type: !269, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !279)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !271, !159, !159, !176, !276, !278}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !273, line: 21, baseType: !274)
!273 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !273, line: 21, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !5)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DILocalVariable(name: "x", arg: 1, scope: !268, file: !261, line: 86, type: !271)
!281 = !DILocalVariable(name: "ni", arg: 2, scope: !268, file: !261, line: 86, type: !159)
!282 = !DILocalVariable(name: "ix", arg: 3, scope: !268, file: !261, line: 86, type: !159)
!283 = !DILocalVariable(name: "y", arg: 4, scope: !268, file: !261, line: 86, type: !176)
!284 = !DILocalVariable(name: "iora", arg: 5, scope: !268, file: !261, line: 86, type: !276)
!285 = !DILocalVariable(name: "ierr", arg: 6, scope: !268, file: !261, line: 86, type: !278)
!286 = !DILocation(line: 0, scope: !268)
!287 = !DILocation(line: 88, column: 29, scope: !268)
!288 = !{!289, !289, i64 0}
!289 = !{!"any pointer", !290, i64 0}
!290 = !{!"omnipotent char", !291, i64 0}
!291 = !{!"Simple C/C++ TBAA"}
!292 = !DILocation(line: 88, column: 32, scope: !268)
!293 = !{!294, !294, i64 0}
!294 = !{!"int", !290, i64 0}
!295 = !DILocation(line: 88, column: 41, scope: !268)
!296 = !{!290, !290, i64 0}
!297 = !DILocation(line: 88, column: 11, scope: !268)
!298 = !DILocation(line: 88, column: 9, scope: !268)
!299 = !DILocation(line: 89, column: 1, scope: !268)
!300 = !DISubprogram(name: "VecSetValuesLocal", scope: !273, file: !273, line: 374, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !307)
!301 = !DISubroutineType(types: !302)
!302 = !{!62, !274, !62, !303, !305, !5}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!307 = !{}
!308 = distinct !DISubprogram(name: "vecsetvalueslocal0_", scope: !261, file: !261, line: 91, type: !269, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DILocalVariable(name: "x", arg: 1, scope: !308, file: !261, line: 91, type: !271)
!311 = !DILocalVariable(name: "ni", arg: 2, scope: !308, file: !261, line: 91, type: !159)
