; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/simple.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/simple.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_VecTagger = type { %struct._p_PetscObject, [1 x %struct._VecTaggerOps], i8*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !{!89, !104, !105, !109, !112, !276, !95, !102}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger_Simple", file: !91, line: 7, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/utils/tagger/impls/simple.h", directory: "/home/users/ndemeye/xSDK")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 5, size: 64, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !92, file: !91, line: 6, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !25, line: 768, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 765, size: 128, elements: !98)
!98 = !{!99, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !97, file: !25, line: 766, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !102)
!102 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !97, file: !25, line: 767, baseType: !100, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !106, line: 330, baseType: !107)
!106 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !106, line: 330, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !115, line: 73, size: 4480, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !120, !166, !167, !169, !171, !172, !173, !174, !182, !183, !185, !189, !193, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206, !207, !208, !210, !211, !213, !215, !216, !217, !218, !219, !221, !223, !224, !225, !226, !227, !229, !231, !232, !233, !243, !245, !246, !250, !251, !300, !305, !307, !308, !309}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !114, file: !115, line: 74, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !119)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !114, file: !115, line: 75, baseType: !121, size: 448, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 448, elements: !164)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !115, line: 53, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 45, size: 448, elements: !124)
!124 = !{!125, !131, !139, !144, !148, !152, !159}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !123, file: !115, line: 46, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !112, !130}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !119)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !123, file: !115, line: 47, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!129, !112, !135}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !136, line: 16, baseType: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !136, line: 16, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !123, file: !115, line: 48, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!129, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !123, file: !115, line: 49, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!129, !112, !109, !112}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !123, file: !115, line: 50, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!129, !112, !109, !143}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !123, file: !115, line: 51, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!129, !112, !109, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !123, file: !115, line: 52, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!129, !112, !109, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !114, file: !115, line: 76, baseType: !105, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !115, line: 77, baseType: !168, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !119)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !114, file: !115, line: 78, baseType: !170, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !102)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !114, file: !115, line: 78, baseType: !170, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !114, file: !115, line: 78, baseType: !170, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !114, file: !115, line: 78, baseType: !170, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !115, line: 79, baseType: !175, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !178, line: 27, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !180, line: 43, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !114, file: !115, line: 80, baseType: !168, size: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !114, file: !115, line: 81, baseType: !184, size: 32, offset: 992)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !119)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !114, file: !115, line: 82, baseType: !186, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !114, file: !115, line: 83, baseType: !190, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !114, file: !115, line: 84, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !114, file: !115, line: 85, baseType: !194, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !114, file: !115, line: 86, baseType: !194, size: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !114, file: !115, line: 87, baseType: !194, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !114, file: !115, line: 88, baseType: !112, size: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !114, file: !115, line: 89, baseType: !175, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !115, line: 90, baseType: !194, size: 64, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !114, file: !115, line: 91, baseType: !194, size: 64, offset: 1600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !114, file: !115, line: 92, baseType: !168, size: 32, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !114, file: !115, line: 93, baseType: !104, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !115, line: 94, baseType: !205, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !114, file: !115, line: 95, baseType: !168, size: 32, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !114, file: !115, line: 95, baseType: !168, size: 32, offset: 1888)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !114, file: !115, line: 96, baseType: !209, size: 64, offset: 1920)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !114, file: !115, line: 96, baseType: !209, size: 64, offset: 1984)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !114, file: !115, line: 97, baseType: !212, size: 64, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !114, file: !115, line: 97, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !114, file: !115, line: 98, baseType: !168, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !114, file: !115, line: 98, baseType: !168, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !114, file: !115, line: 99, baseType: !209, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !114, file: !115, line: 99, baseType: !209, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !114, file: !115, line: 100, baseType: !220, size: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !114, file: !115, line: 100, baseType: !222, size: 64, offset: 2432)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !114, file: !115, line: 101, baseType: !168, size: 32, offset: 2496)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !114, file: !115, line: 101, baseType: !168, size: 32, offset: 2528)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !114, file: !115, line: 102, baseType: !209, size: 64, offset: 2560)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !114, file: !115, line: 102, baseType: !209, size: 64, offset: 2624)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !114, file: !115, line: 103, baseType: !228, size: 64, offset: 2688)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !114, file: !115, line: 103, baseType: !230, size: 64, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !114, file: !115, line: 104, baseType: !163, size: 64, offset: 2816)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !114, file: !115, line: 105, baseType: !168, size: 32, offset: 2880)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !114, file: !115, line: 106, baseType: !234, size: 128, offset: 2944)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !241)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !115, line: 64, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 61, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !237, file: !115, line: 62, baseType: !156, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !237, file: !115, line: 63, baseType: !104, size: 64, offset: 64)
!241 = !{!242}
!242 = !DISubrange(count: 2)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !114, file: !115, line: 107, baseType: !244, size: 64, offset: 3072)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !241)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !114, file: !115, line: 108, baseType: !104, size: 64, offset: 3136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !114, file: !115, line: 109, baseType: !247, size: 64, offset: 3200)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!129, !104}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !114, file: !115, line: 111, baseType: !168, size: 32, offset: 3264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !114, file: !115, line: 112, baseType: !252, size: 320, offset: 3328)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !298)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!129, !256, !112, !104}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !259)
!259 = !{!260, !261, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !258, file: !10, line: 100, baseType: !168, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !10, line: 101, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !273, !274, !275, !279, !281, !283, !284, !285}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !264, file: !10, line: 84, baseType: !194, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !264, file: !10, line: 85, baseType: !194, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !10, line: 86, baseType: !104, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !264, file: !10, line: 87, baseType: !186, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !264, file: !10, line: 88, baseType: !271, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !264, file: !10, line: 89, baseType: !111, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !264, file: !10, line: 90, baseType: !194, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !264, file: !10, line: 91, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 46, baseType: !278)
!277 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!278 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !264, file: !10, line: 92, baseType: !280, size: 32, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !10, line: 93, baseType: !282, size: 32, offset: 544)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 94, baseType: !262, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !264, file: !10, line: 95, baseType: !194, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !264, file: !10, line: 96, baseType: !104, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !10, line: 102, baseType: !194, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !258, file: !10, line: 102, baseType: !194, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !258, file: !10, line: 103, baseType: !194, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !258, file: !10, line: 104, baseType: !105, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !258, file: !10, line: 106, baseType: !112, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !258, file: !10, line: 107, baseType: !295, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !114, file: !115, line: 113, baseType: !301, size: 320, offset: 3648)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 320, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!129, !112, !104}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !114, file: !115, line: 114, baseType: !306, size: 320, offset: 3968)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 320, elements: !298)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !114, file: !115, line: 115, baseType: !280, size: 32, offset: 4288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !115, line: 120, baseType: !295, size: 64, offset: 4352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !114, file: !115, line: 121, baseType: !280, size: 32, offset: 4416)
!310 = !{i32 7, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
!312 = !{i32 1, !"wchar_size", i32 4}
!313 = !{i32 7, !"PIC Level", i32 2}
!314 = !{i32 7, !"uwtable", i32 1}
!315 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!316 = distinct !DISubprogram(name: "VecTaggerDestroy_Simple", scope: !317, file: !317, line: 5, type: !318, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !656)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/simple.c", directory: "/home/users/ndemeye/xSDK")
!318 = !DISubroutineType(types: !319)
!319 = !{!129, !320}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !25, line: 721, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !323, line: 339, size: 5120, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !327, !652, !653, !654, !655}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !322, file: !323, line: 340, baseType: !326, size: 4480)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !115, line: 122, baseType: !114)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !322, file: !323, line: 340, baseType: !328, size: 448, offset: 4480)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 448, elements: !164)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !323, line: 330, size: 448, elements: !330)
!330 = !{!331, !333, !334, !338, !339, !343, !648}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !329, file: !323, line: 331, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !323, line: 332, baseType: !332, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !329, file: !323, line: 333, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!129, !256, !320}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !329, file: !323, line: 334, baseType: !332, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !323, line: 335, baseType: !340, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!129, !320, !135}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !329, file: !323, line: 336, baseType: !344, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!129, !320, !347, !212, !647}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !323, line: 142, size: 12800, elements: !350)
!350 = !{!351, !352, !572, !593, !594, !595, !641, !642, !643, !644, !646}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !349, file: !323, line: 143, baseType: !326, size: 4480)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !349, file: !323, line: 143, baseType: !353, size: 5248, offset: 4480)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 5248, elements: !164)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !323, line: 23, size: 5248, elements: !355)
!355 = !{!356, !361, !366, !370, !374, !380, !385, !386, !387, !391, !395, !396, !397, !401, !405, !411, !412, !416, !420, !424, !425, !432, !436, !437, !441, !445, !446, !447, !451, !452, !459, !464, !465, !466, !470, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !491, !492, !493, !497, !501, !502, !503, !504, !508, !509, !510, !511, !512, !513, !514, !518, !519, !523, !530, !531, !536, !537, !541, !542, !543, !544, !545, !546, !547, !548, !552, !553, !554, !560, !564, !565, !566}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !354, file: !323, line: 24, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!129, !347, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !354, file: !323, line: 25, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!129, !347, !168, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !354, file: !323, line: 26, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!129, !168, !360}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !354, file: !323, line: 27, baseType: !371, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!129, !347, !347, !228}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !354, file: !323, line: 28, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!129, !347, !168, !378, !228}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !354, file: !323, line: 29, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!129, !347, !384, !220}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !354, file: !323, line: 30, baseType: !371, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !354, file: !323, line: 31, baseType: !375, size: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !354, file: !323, line: 32, baseType: !388, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!129, !347, !100}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !354, file: !323, line: 33, baseType: !392, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!129, !347, !347}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !354, file: !323, line: 34, baseType: !388, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !354, file: !323, line: 35, baseType: !392, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !354, file: !323, line: 36, baseType: !398, size: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!129, !347, !100, !347}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !354, file: !323, line: 37, baseType: !402, size: 64, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!129, !347, !100, !100, !347}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !354, file: !323, line: 38, baseType: !406, size: 64, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!129, !347, !168, !409, !360}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !354, file: !323, line: 39, baseType: !398, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !354, file: !323, line: 40, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!129, !347, !100, !347, !347}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !354, file: !323, line: 41, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!129, !347, !100, !100, !100, !347, !347}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !354, file: !323, line: 42, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!129, !347, !347, !347}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !354, file: !323, line: 43, baseType: !421, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !354, file: !323, line: 44, baseType: !426, size: 64, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!129, !347, !168, !429, !409, !431}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !354, file: !323, line: 45, baseType: !433, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!129, !347}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !354, file: !323, line: 46, baseType: !433, size: 64, offset: 1408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !354, file: !323, line: 47, baseType: !438, size: 64, offset: 1472)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!129, !347, !230}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !354, file: !323, line: 48, baseType: !442, size: 64, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!129, !347, !212}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !354, file: !323, line: 49, baseType: !442, size: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !354, file: !323, line: 50, baseType: !438, size: 64, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !354, file: !323, line: 51, baseType: !448, size: 64, offset: 1728)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!129, !347, !212, !220}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !354, file: !323, line: 52, baseType: !448, size: 64, offset: 1792)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !354, file: !323, line: 53, baseType: !453, size: 64, offset: 1856)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!129, !347, !456}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !354, file: !323, line: 54, baseType: !460, size: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!129, !347, !463, !280}
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !354, file: !323, line: 55, baseType: !426, size: 64, offset: 1984)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !354, file: !323, line: 56, baseType: !433, size: 64, offset: 2048)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !354, file: !323, line: 57, baseType: !467, size: 64, offset: 2112)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!129, !347, !135}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !354, file: !323, line: 58, baseType: !471, size: 64, offset: 2176)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!129, !347, !409}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !354, file: !323, line: 59, baseType: !471, size: 64, offset: 2240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !354, file: !323, line: 60, baseType: !371, size: 64, offset: 2304)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !354, file: !323, line: 61, baseType: !371, size: 64, offset: 2368)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !354, file: !323, line: 62, baseType: !381, size: 64, offset: 2432)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !354, file: !323, line: 63, baseType: !375, size: 64, offset: 2496)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !354, file: !323, line: 64, baseType: !375, size: 64, offset: 2560)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !354, file: !323, line: 65, baseType: !467, size: 64, offset: 2624)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !354, file: !323, line: 66, baseType: !433, size: 64, offset: 2688)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !354, file: !323, line: 67, baseType: !433, size: 64, offset: 2752)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !354, file: !323, line: 68, baseType: !484, size: 64, offset: 2816)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!129, !347, !487}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !488, line: 30, baseType: !489)
!488 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !488, line: 30, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !354, file: !323, line: 69, baseType: !426, size: 64, offset: 2880)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !354, file: !323, line: 70, baseType: !433, size: 64, offset: 2944)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !354, file: !323, line: 71, baseType: !494, size: 64, offset: 3008)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!129, !256, !347}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !354, file: !323, line: 72, baseType: !498, size: 64, offset: 3072)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!129, !347, !347, !220}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !354, file: !323, line: 73, baseType: !421, size: 64, offset: 3136)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !354, file: !323, line: 74, baseType: !421, size: 64, offset: 3200)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !354, file: !323, line: 75, baseType: !421, size: 64, offset: 3264)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !354, file: !323, line: 76, baseType: !505, size: 64, offset: 3328)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!129, !347, !168, !429, !228}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !354, file: !323, line: 77, baseType: !433, size: 64, offset: 3392)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !354, file: !323, line: 78, baseType: !433, size: 64, offset: 3456)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !354, file: !323, line: 79, baseType: !433, size: 64, offset: 3520)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !354, file: !323, line: 80, baseType: !433, size: 64, offset: 3584)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !354, file: !323, line: 81, baseType: !388, size: 64, offset: 3648)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !354, file: !323, line: 82, baseType: !433, size: 64, offset: 3712)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !354, file: !323, line: 83, baseType: !515, size: 64, offset: 3776)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!129, !347, !168, !347, !431}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !354, file: !323, line: 84, baseType: !515, size: 64, offset: 3840)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !354, file: !323, line: 85, baseType: !520, size: 64, offset: 3904)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!129, !347, !347, !228, !228}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !354, file: !323, line: 86, baseType: !524, size: 64, offset: 3968)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!129, !347, !527, !360}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !488, line: 11, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !488, line: 11, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !354, file: !323, line: 87, baseType: !524, size: 64, offset: 4032)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !354, file: !323, line: 88, baseType: !532, size: 64, offset: 4096)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!129, !347, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !354, file: !323, line: 89, baseType: !532, size: 64, offset: 4160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !354, file: !323, line: 90, baseType: !538, size: 64, offset: 4224)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!129, !347, !168, !429, !429, !347, !431}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !354, file: !323, line: 91, baseType: !538, size: 64, offset: 4288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !354, file: !323, line: 92, baseType: !467, size: 64, offset: 4352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !354, file: !323, line: 93, baseType: !467, size: 64, offset: 4416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !354, file: !323, line: 94, baseType: !392, size: 64, offset: 4480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !354, file: !323, line: 95, baseType: !392, size: 64, offset: 4544)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !354, file: !323, line: 96, baseType: !392, size: 64, offset: 4608)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !354, file: !323, line: 97, baseType: !392, size: 64, offset: 4672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !354, file: !323, line: 98, baseType: !549, size: 64, offset: 4736)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!129, !347, !280}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !354, file: !323, line: 99, baseType: !438, size: 64, offset: 4800)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !354, file: !323, line: 100, baseType: !438, size: 64, offset: 4864)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !354, file: !323, line: 101, baseType: !555, size: 64, offset: 4928)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!129, !347, !230, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !354, file: !323, line: 102, baseType: !561, size: 64, offset: 4992)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!129, !347, !535, !558}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !354, file: !323, line: 103, baseType: !438, size: 64, offset: 5056)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !354, file: !323, line: 104, baseType: !532, size: 64, offset: 5120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !354, file: !323, line: 105, baseType: !567, size: 64, offset: 5184)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!129, !168, !378, !360, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !349, file: !323, line: 144, baseType: !573, size: 64, offset: 9728)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !488, line: 60, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !576, line: 240, size: 640, elements: !577)
!576 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !575, file: !576, line: 241, baseType: !105, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !575, file: !576, line: 242, baseType: !184, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !575, file: !576, line: 243, baseType: !168, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !575, file: !576, line: 243, baseType: !168, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !575, file: !576, line: 244, baseType: !168, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !575, file: !576, line: 244, baseType: !168, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !575, file: !576, line: 245, baseType: !212, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !575, file: !576, line: 246, baseType: !280, size: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !575, file: !576, line: 247, baseType: !168, size: 32, offset: 352)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !575, file: !576, line: 251, baseType: !168, size: 32, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !575, file: !576, line: 252, baseType: !487, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !575, file: !576, line: 253, baseType: !280, size: 32, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !575, file: !576, line: 254, baseType: !168, size: 32, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !575, file: !576, line: 254, baseType: !168, size: 32, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !575, file: !576, line: 255, baseType: !168, size: 32, offset: 608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !323, line: 145, baseType: !104, size: 64, offset: 9792)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !349, file: !323, line: 146, baseType: !280, size: 32, offset: 9856)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !349, file: !323, line: 147, baseType: !596, size: 1344, offset: 9920)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !323, line: 140, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 114, size: 1344, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !617, !618, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !597, file: !323, line: 115, baseType: !168, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !597, file: !323, line: 116, baseType: !168, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !597, file: !323, line: 117, baseType: !168, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !597, file: !323, line: 118, baseType: !168, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !597, file: !323, line: 119, baseType: !168, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !597, file: !323, line: 120, baseType: !168, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !597, file: !323, line: 121, baseType: !212, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !597, file: !323, line: 122, baseType: !228, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !597, file: !323, line: 124, baseType: !105, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !597, file: !323, line: 125, baseType: !184, size: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !597, file: !323, line: 125, baseType: !184, size: 32, offset: 416)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !597, file: !323, line: 126, baseType: !184, size: 32, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !597, file: !323, line: 126, baseType: !184, size: 32, offset: 480)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !597, file: !323, line: 127, baseType: !613, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !106, line: 339, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !106, line: 339, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !597, file: !323, line: 128, baseType: !613, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !597, file: !323, line: 129, baseType: !619, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !106, line: 341, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !106, line: 351, size: 192, elements: !622)
!622 = !{!623, !624, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !621, file: !106, line: 354, baseType: !119, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !621, file: !106, line: 355, baseType: !119, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !621, file: !106, line: 356, baseType: !119, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !621, file: !106, line: 361, baseType: !119, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !621, file: !106, line: 362, baseType: !276, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !597, file: !323, line: 130, baseType: !168, size: 32, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !597, file: !323, line: 130, baseType: !168, size: 32, offset: 736)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !597, file: !323, line: 131, baseType: !228, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !597, file: !323, line: 131, baseType: !228, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !597, file: !323, line: 132, baseType: !212, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !597, file: !323, line: 132, baseType: !212, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !597, file: !323, line: 133, baseType: !168, size: 32, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !597, file: !323, line: 134, baseType: !212, size: 64, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !597, file: !323, line: 135, baseType: !168, size: 32, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !597, file: !323, line: 136, baseType: !280, size: 32, offset: 1184)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !597, file: !323, line: 137, baseType: !280, size: 32, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !597, file: !323, line: 138, baseType: !431, size: 32, offset: 1248)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !597, file: !323, line: 139, baseType: !212, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !349, file: !323, line: 147, baseType: !596, size: 1344, offset: 11264)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !349, file: !323, line: 148, baseType: !280, size: 32, offset: 12608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !349, file: !323, line: 149, baseType: !168, size: 32, offset: 12640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !349, file: !323, line: 150, baseType: !645, size: 32, offset: 12672)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !349, file: !323, line: 157, baseType: !194, size: 64, offset: 12736)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !329, file: !323, line: 337, baseType: !649, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!129, !320, !347, !571}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !323, line: 341, baseType: !104, size: 64, offset: 4928)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !322, file: !323, line: 342, baseType: !168, size: 32, offset: 4992)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !322, file: !323, line: 343, baseType: !280, size: 32, offset: 5024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !322, file: !323, line: 344, baseType: !280, size: 32, offset: 5056)
!656 = !{!657, !658, !659, !660, !662}
!657 = !DILocalVariable(name: "tagger", arg: 1, scope: !316, file: !317, line: 5, type: !320)
!658 = !DILocalVariable(name: "smpl", scope: !316, file: !317, line: 7, type: !89)
!659 = !DILocalVariable(name: "ierr", scope: !316, file: !317, line: 8, type: !129)
!660 = !DILocalVariable(name: "ierr__", scope: !661, file: !317, line: 11, type: !129)
!661 = distinct !DILexicalBlock(scope: !316, file: !317, line: 11, column: 32)
!662 = !DILocalVariable(name: "ierr__", scope: !663, file: !317, line: 12, type: !129)
!663 = distinct !DILexicalBlock(scope: !316, file: !317, line: 12, column: 35)
!664 = !DILocation(line: 0, scope: !316)
!665 = !DILocation(line: 7, column: 57, scope: !316)
!666 = !{!667, !672, i64 616}
!667 = !{!"_p_VecTagger", !668, i64 0, !670, i64 560, !672, i64 616, !669, i64 624, !670, i64 628, !670, i64 632}
!668 = !{!"_p_PetscObject", !669, i64 0, !670, i64 8, !672, i64 64, !669, i64 72, !673, i64 80, !673, i64 88, !673, i64 96, !673, i64 104, !674, i64 112, !669, i64 120, !669, i64 124, !672, i64 128, !672, i64 136, !672, i64 144, !672, i64 152, !672, i64 160, !672, i64 168, !672, i64 176, !674, i64 184, !672, i64 192, !672, i64 200, !669, i64 208, !672, i64 216, !674, i64 224, !669, i64 232, !669, i64 236, !672, i64 240, !672, i64 248, !672, i64 256, !672, i64 264, !669, i64 272, !669, i64 276, !672, i64 280, !672, i64 288, !672, i64 296, !672, i64 304, !669, i64 312, !669, i64 316, !672, i64 320, !672, i64 328, !672, i64 336, !672, i64 344, !672, i64 352, !669, i64 360, !670, i64 368, !670, i64 384, !672, i64 392, !672, i64 400, !669, i64 408, !670, i64 416, !670, i64 456, !670, i64 496, !670, i64 536, !672, i64 544, !670, i64 552}
!669 = !{!"int", !670, i64 0}
!670 = !{!"omnipotent char", !671, i64 0}
!671 = !{!"Simple C/C++ TBAA"}
!672 = !{!"any pointer", !670, i64 0}
!673 = !{!"double", !670, i64 0}
!674 = !{!"long", !670, i64 0}
!675 = !DILocation(line: 10, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !317, line: 10, column: 3)
!677 = distinct !DILexicalBlock(scope: !678, file: !317, line: 10, column: 3)
!678 = distinct !DILexicalBlock(scope: !316, file: !317, line: 10, column: 3)
!679 = !{!672, !672, i64 0}
!680 = !DILocation(line: 10, column: 3, scope: !677)
!681 = !DILocation(line: 10, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !317, line: 10, column: 3)
!683 = distinct !DILexicalBlock(scope: !676, file: !317, line: 10, column: 3)
!684 = !{!685, !669, i64 1536}
!685 = !{!"", !670, i64 0, !670, i64 512, !670, i64 1024, !670, i64 1280, !669, i64 1536, !669, i64 1540, !670, i64 1544}
!686 = !DILocation(line: 10, column: 3, scope: !683)
!687 = !DILocation(line: 10, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !682, file: !317, line: 10, column: 3)
!689 = !{!669, !669, i64 0}
!690 = !{!685, !669, i64 1540}
!691 = !DILocation(line: 11, column: 10, scope: !316)
!692 = !{!693, !672, i64 0}
!693 = !{!"", !672, i64 0}
!694 = !DILocation(line: 0, scope: !661)
!695 = !DILocation(line: 11, column: 32, scope: !696)
!696 = distinct !DILexicalBlock(scope: !661, file: !317, line: 11, column: 32)
!697 = !DILocation(line: 12, column: 10, scope: !316)
!698 = !DILocation(line: 0, scope: !663)
!699 = !DILocation(line: 12, column: 35, scope: !700)
!700 = distinct !DILexicalBlock(scope: !663, file: !317, line: 12, column: 35)
!701 = !DILocation(line: 13, column: 3, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !317, line: 13, column: 3)
!703 = distinct !DILexicalBlock(scope: !704, file: !317, line: 13, column: 3)
!704 = distinct !DILexicalBlock(scope: !316, file: !317, line: 13, column: 3)
!705 = !DILocation(line: 13, column: 3, scope: !703)
!706 = !DILocation(line: 13, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !317, line: 13, column: 3)
