; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/tron/tron.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/tron/tron.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 6, baseType: !26, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!56 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!57 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!58 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!59 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!60 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!61 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!62 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!63 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!64 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!65 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!66 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 155, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!77 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!95 = !{!96, !99, !117, !198, !138, !304, !164}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!98 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !102, line: 73, size: 4480, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !106, !159, !160, !162, !165, !166, !167, !168, !176, !177, !179, !183, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199, !201, !202, !203, !205, !206, !208, !210, !211, !212, !213, !214, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !240, !242, !243, !247, !248, !294, !299, !301, !302, !303}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !101, file: !102, line: 74, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !101, file: !102, line: 75, baseType: !107, size: 448, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 448, elements: !157)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !102, line: 53, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 45, size: 448, elements: !110)
!110 = !{!111, !121, !129, !134, !141, !145, !152}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !109, file: !102, line: 46, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !99, !116}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !118, line: 330, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !118, line: 330, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !109, file: !102, line: 47, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!115, !99, !125}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !126, line: 16, baseType: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !126, line: 16, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !109, file: !102, line: 48, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!115, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !109, file: !102, line: 49, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!115, !99, !138, !99}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !109, file: !102, line: 50, baseType: !142, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!115, !99, !138, !133}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !109, file: !102, line: 51, baseType: !146, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!115, !99, !138, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !109, file: !102, line: 52, baseType: !153, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!115, !99, !138, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!157 = !{!158}
!158 = !DISubrange(count: 1)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !101, file: !102, line: 76, baseType: !117, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 77, baseType: !161, size: 32, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !101, file: !102, line: 78, baseType: !163, size: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !164)
!164 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !101, file: !102, line: 78, baseType: !163, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !101, file: !102, line: 78, baseType: !163, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !101, file: !102, line: 78, baseType: !163, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !101, file: !102, line: 79, baseType: !169, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !172, line: 27, baseType: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !174, line: 43, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!175 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !101, file: !102, line: 80, baseType: !161, size: 32, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !102, line: 81, baseType: !178, size: 32, offset: 992)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !101, file: !102, line: 82, baseType: !180, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !101, file: !102, line: 83, baseType: !184, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !101, file: !102, line: 84, baseType: !188, size: 64, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !102, line: 85, baseType: !188, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !101, file: !102, line: 86, baseType: !188, size: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !101, file: !102, line: 87, baseType: !188, size: 64, offset: 1344)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !102, line: 88, baseType: !99, size: 64, offset: 1408)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !101, file: !102, line: 89, baseType: !169, size: 64, offset: 1472)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 90, baseType: !188, size: 64, offset: 1536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 91, baseType: !188, size: 64, offset: 1600)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !101, file: !102, line: 92, baseType: !161, size: 32, offset: 1664)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !101, file: !102, line: 93, baseType: !198, size: 64, offset: 1728)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !101, file: !102, line: 94, baseType: !200, size: 64, offset: 1792)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !170)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !101, file: !102, line: 95, baseType: !161, size: 32, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !101, file: !102, line: 95, baseType: !161, size: 32, offset: 1888)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !101, file: !102, line: 96, baseType: !204, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !101, file: !102, line: 96, baseType: !204, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !101, file: !102, line: 97, baseType: !207, size: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !101, file: !102, line: 97, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !101, file: !102, line: 98, baseType: !161, size: 32, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !101, file: !102, line: 98, baseType: !161, size: 32, offset: 2208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !101, file: !102, line: 99, baseType: !204, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !101, file: !102, line: 99, baseType: !204, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !101, file: !102, line: 100, baseType: !215, size: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !164)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !101, file: !102, line: 100, baseType: !218, size: 64, offset: 2432)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !101, file: !102, line: 101, baseType: !161, size: 32, offset: 2496)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !101, file: !102, line: 101, baseType: !161, size: 32, offset: 2528)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !101, file: !102, line: 102, baseType: !204, size: 64, offset: 2560)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !101, file: !102, line: 102, baseType: !204, size: 64, offset: 2624)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !101, file: !102, line: 103, baseType: !224, size: 64, offset: 2688)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !101, file: !102, line: 103, baseType: !227, size: 64, offset: 2752)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !101, file: !102, line: 104, baseType: !156, size: 64, offset: 2816)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !101, file: !102, line: 105, baseType: !161, size: 32, offset: 2880)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !101, file: !102, line: 106, baseType: !231, size: 128, offset: 2944)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !238)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !102, line: 64, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 61, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !102, line: 62, baseType: !149, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !234, file: !102, line: 63, baseType: !198, size: 64, offset: 64)
!238 = !{!239}
!239 = !DISubrange(count: 2)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !101, file: !102, line: 107, baseType: !241, size: 64, offset: 3072)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !238)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !101, file: !102, line: 108, baseType: !198, size: 64, offset: 3136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !101, file: !102, line: 109, baseType: !244, size: 64, offset: 3200)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!115, !198}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !101, file: !102, line: 111, baseType: !161, size: 32, offset: 3264)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !101, file: !102, line: 112, baseType: !249, size: 320, offset: 3328)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !292)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!115, !253, !99, !198}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !256)
!256 = !{!257, !258, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !255, file: !10, line: 100, baseType: !161, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !10, line: 101, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !270, !271, !272, !273, !275, !277, !278, !279}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !261, file: !10, line: 84, baseType: !188, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !10, line: 85, baseType: !188, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !10, line: 86, baseType: !198, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !261, file: !10, line: 87, baseType: !180, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !261, file: !10, line: 88, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !261, file: !10, line: 89, baseType: !140, size: 8, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !261, file: !10, line: 90, baseType: !188, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !261, file: !10, line: 91, baseType: !96, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !261, file: !10, line: 92, baseType: !274, size: 32, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !10, line: 93, baseType: !276, size: 32, offset: 544)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !10, line: 94, baseType: !259, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !261, file: !10, line: 95, baseType: !188, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !261, file: !10, line: 96, baseType: !198, size: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !255, file: !10, line: 102, baseType: !188, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !255, file: !10, line: 102, baseType: !188, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !255, file: !10, line: 103, baseType: !188, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !255, file: !10, line: 104, baseType: !117, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !255, file: !10, line: 105, baseType: !274, size: 32, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !255, file: !10, line: 105, baseType: !274, size: 32, offset: 416)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !255, file: !10, line: 105, baseType: !274, size: 32, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !255, file: !10, line: 106, baseType: !99, size: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !255, file: !10, line: 107, baseType: !289, size: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!292 = !{!293}
!293 = !DISubrange(count: 5)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !101, file: !102, line: 113, baseType: !295, size: 320, offset: 3648)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !292)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!115, !99, !198}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !101, file: !102, line: 114, baseType: !300, size: 320, offset: 3968)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 320, elements: !292)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !101, file: !102, line: 115, baseType: !274, size: 32, offset: 4288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !101, file: !102, line: 120, baseType: !289, size: 64, offset: 4352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !101, file: !102, line: 121, baseType: !274, size: 32, offset: 4416)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_TRON", file: !306, line: 51, baseType: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/tron/tron.h", directory: "/home/users/ndemeye/xSDK")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 7, size: 1920, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !332, !333, !334, !335, !336, !337, !338, !343, !344, !349, !355, !356}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pg_ftol", scope: !307, file: !306, line: 10, baseType: !216, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "actred", scope: !307, file: !306, line: 11, baseType: !216, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "f_new", scope: !307, file: !306, line: 12, baseType: !216, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "eta1", scope: !307, file: !306, line: 14, baseType: !216, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "eta2", scope: !307, file: !306, line: 14, baseType: !216, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "eta3", scope: !307, file: !306, line: 14, baseType: !216, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "eta4", scope: !307, file: !306, line: 14, baseType: !216, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sigma1", scope: !307, file: !306, line: 15, baseType: !216, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sigma2", scope: !307, file: !306, line: 15, baseType: !216, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sigma3", scope: !307, file: !306, line: 15, baseType: !216, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "maxgpits", scope: !307, file: !306, line: 17, baseType: !161, size: 32, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !307, file: !306, line: 20, baseType: !216, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pgstepsize", scope: !307, file: !306, line: 21, baseType: !216, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !307, file: !306, line: 25, baseType: !161, size: 32, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !307, file: !306, line: 26, baseType: !216, size: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm", scope: !307, file: !306, line: 27, baseType: !216, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !307, file: !306, line: 28, baseType: !216, size: 64, offset: 1024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "total_gp_its", scope: !307, file: !306, line: 30, baseType: !161, size: 32, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gp_iterates", scope: !307, file: !306, line: 31, baseType: !161, size: 32, offset: 1120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "X_New", scope: !307, file: !306, line: 33, baseType: !329, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !68, line: 21, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !68, line: 21, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "G_New", scope: !307, file: !306, line: 34, baseType: !329, size: 64, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !307, file: !306, line: 35, baseType: !329, size: 64, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "DXFree", scope: !307, file: !306, line: 38, baseType: !329, size: 64, offset: 1344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !307, file: !306, line: 39, baseType: !329, size: 64, offset: 1408)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rmask", scope: !307, file: !306, line: 40, baseType: !329, size: 64, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !307, file: !306, line: 41, baseType: !329, size: 64, offset: 1536)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "H_sub", scope: !307, file: !306, line: 42, baseType: !339, size: 64, offset: 1600)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !340, line: 16, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !340, line: 16, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Hpre_sub", scope: !307, file: !306, line: 43, baseType: !339, size: 64, offset: 1664)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Free_Local", scope: !307, file: !306, line: 45, baseType: !345, size: 64, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !346, line: 11, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !346, line: 11, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scatter", scope: !307, file: !306, line: 46, baseType: !350, size: 64, offset: 1792)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !351, line: 59, baseType: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !351, line: 15, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !351, line: 15, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !307, file: !306, line: 48, baseType: !161, size: 32, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "n_free_last", scope: !307, file: !306, line: 49, baseType: !161, size: 32, offset: 1888)
!357 = !{i32 7, !"Dwarf Version", i32 4}
!358 = !{i32 2, !"Debug Info Version", i32 3}
!359 = !{i32 1, !"wchar_size", i32 4}
!360 = !{i32 7, !"PIC Level", i32 2}
!361 = !{i32 7, !"uwtable", i32 1}
!362 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!363 = distinct !DISubprogram(name: "TaoCreate_TRON", scope: !364, file: !364, line: 330, type: !365, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !585)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/tron/tron.c", directory: "/home/users/ndemeye/xSDK")
!365 = !DISubroutineType(types: !366)
!366 = !{!115, !367}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !370, line: 45, size: 14656, elements: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!371 = !{!372, !374, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !457, !463, !465, !466, !467, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !537, !538, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !577, !578, !579, !580, !581, !582, !583, !584}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !369, file: !370, line: 46, baseType: !373, size: 4480)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !102, line: 122, baseType: !101)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !369, file: !370, line: 46, baseType: !375, size: 1536, offset: 4480)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 1536, elements: !157)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !370, line: 13, size: 1536, elements: !377)
!377 = !{!378, !382, !386, !390, !394, !395, !396, !397, !398, !399, !400, !404, !408, !409, !410, !411, !415, !419, !420, !424, !426, !427, !431, !435}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !376, file: !370, line: 15, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!115, !367, !329, !215, !198}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !376, file: !370, line: 16, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!115, !367, !329, !215, !329, !198}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !376, file: !370, line: 17, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!115, !367, !329, !329, !198}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !376, file: !370, line: 18, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!115, !367, !329, !339, !339, !198}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !376, file: !370, line: 19, baseType: !387, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !376, file: !370, line: 20, baseType: !391, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !376, file: !370, line: 21, baseType: !387, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !376, file: !370, line: 22, baseType: !387, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !376, file: !370, line: 23, baseType: !387, size: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !376, file: !370, line: 24, baseType: !391, size: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !376, file: !370, line: 25, baseType: !401, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!115, !367, !329, !339, !339, !339, !198}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !376, file: !370, line: 26, baseType: !405, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!115, !367, !329, !339, !198}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !376, file: !370, line: 27, baseType: !391, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !376, file: !370, line: 28, baseType: !391, size: 64, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !376, file: !370, line: 29, baseType: !387, size: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !376, file: !370, line: 30, baseType: !412, size: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!115, !367, !161, !198}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !376, file: !370, line: 31, baseType: !416, size: 64, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!115, !367, !198}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !376, file: !370, line: 32, baseType: !244, size: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !376, file: !370, line: 35, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!115, !367, !329, !329}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !376, file: !370, line: 36, baseType: !425, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !376, file: !370, line: 37, baseType: !425, size: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !376, file: !370, line: 38, baseType: !428, size: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!115, !367, !125}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !376, file: !370, line: 39, baseType: !432, size: 64, offset: 1408)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!115, !253, !367}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !376, file: !370, line: 40, baseType: !425, size: 64, offset: 1472)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !369, file: !370, line: 47, baseType: !198, size: 64, offset: 6016)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !369, file: !370, line: 48, baseType: !198, size: 64, offset: 6080)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !369, file: !370, line: 49, baseType: !198, size: 64, offset: 6144)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !369, file: !370, line: 50, baseType: !198, size: 64, offset: 6208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !369, file: !370, line: 51, baseType: !198, size: 64, offset: 6272)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !369, file: !370, line: 52, baseType: !198, size: 64, offset: 6336)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !369, file: !370, line: 53, baseType: !198, size: 64, offset: 6400)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !369, file: !370, line: 54, baseType: !198, size: 64, offset: 6464)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !369, file: !370, line: 55, baseType: !198, size: 64, offset: 6528)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !369, file: !370, line: 56, baseType: !198, size: 64, offset: 6592)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !369, file: !370, line: 57, baseType: !198, size: 64, offset: 6656)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !369, file: !370, line: 58, baseType: !198, size: 64, offset: 6720)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !369, file: !370, line: 59, baseType: !198, size: 64, offset: 6784)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !369, file: !370, line: 60, baseType: !198, size: 64, offset: 6848)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !369, file: !370, line: 61, baseType: !198, size: 64, offset: 6912)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !369, file: !370, line: 62, baseType: !198, size: 64, offset: 6976)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !369, file: !370, line: 63, baseType: !198, size: 64, offset: 7040)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !369, file: !370, line: 65, baseType: !454, size: 640, offset: 7104)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 640, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 10)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !369, file: !370, line: 66, baseType: !458, size: 640, offset: 7744)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 640, elements: !455)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!115, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !369, file: !370, line: 67, baseType: !464, size: 640, offset: 8384)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 640, elements: !455)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !369, file: !370, line: 68, baseType: !161, size: 32, offset: 9024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !369, file: !370, line: 69, baseType: !198, size: 64, offset: 9088)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !369, file: !370, line: 70, baseType: !468, size: 32, offset: 9152)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !369, file: !370, line: 72, baseType: !274, size: 32, offset: 9184)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !370, line: 73, baseType: !198, size: 64, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !369, file: !370, line: 75, baseType: !329, size: 64, offset: 9280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !369, file: !370, line: 76, baseType: !329, size: 64, offset: 9344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !369, file: !370, line: 77, baseType: !329, size: 64, offset: 9408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !369, file: !370, line: 78, baseType: !329, size: 64, offset: 9472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !369, file: !370, line: 79, baseType: !329, size: 64, offset: 9536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !369, file: !370, line: 80, baseType: !329, size: 64, offset: 9600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !369, file: !370, line: 81, baseType: !329, size: 64, offset: 9664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !369, file: !370, line: 82, baseType: !329, size: 64, offset: 9728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !369, file: !370, line: 83, baseType: !329, size: 64, offset: 9792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !369, file: !370, line: 84, baseType: !339, size: 64, offset: 9856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !369, file: !370, line: 85, baseType: !339, size: 64, offset: 9920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !369, file: !370, line: 86, baseType: !339, size: 64, offset: 9984)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !369, file: !370, line: 87, baseType: !329, size: 64, offset: 10048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !369, file: !370, line: 88, baseType: !329, size: 64, offset: 10112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !369, file: !370, line: 89, baseType: !339, size: 64, offset: 10176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !369, file: !370, line: 90, baseType: !339, size: 64, offset: 10240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !369, file: !370, line: 91, baseType: !329, size: 64, offset: 10304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !369, file: !370, line: 92, baseType: !161, size: 32, offset: 10368)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !369, file: !370, line: 93, baseType: !207, size: 64, offset: 10432)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !369, file: !370, line: 94, baseType: !207, size: 64, offset: 10496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !369, file: !370, line: 95, baseType: !215, size: 64, offset: 10560)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !369, file: !370, line: 96, baseType: !329, size: 64, offset: 10624)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !369, file: !370, line: 97, baseType: !329, size: 64, offset: 10688)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !369, file: !370, line: 98, baseType: !329, size: 64, offset: 10752)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !369, file: !370, line: 99, baseType: !339, size: 64, offset: 10816)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !369, file: !370, line: 100, baseType: !339, size: 64, offset: 10880)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !369, file: !370, line: 101, baseType: !339, size: 64, offset: 10944)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !369, file: !370, line: 102, baseType: !339, size: 64, offset: 11008)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !369, file: !370, line: 103, baseType: !339, size: 64, offset: 11072)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !369, file: !370, line: 104, baseType: !339, size: 64, offset: 11136)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !369, file: !370, line: 105, baseType: !339, size: 64, offset: 11200)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !369, file: !370, line: 106, baseType: !339, size: 64, offset: 11264)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !369, file: !370, line: 107, baseType: !339, size: 64, offset: 11328)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !369, file: !370, line: 108, baseType: !339, size: 64, offset: 11392)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !369, file: !370, line: 109, baseType: !339, size: 64, offset: 11456)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !369, file: !370, line: 110, baseType: !345, size: 64, offset: 11520)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !369, file: !370, line: 111, baseType: !345, size: 64, offset: 11584)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !369, file: !370, line: 112, baseType: !216, size: 64, offset: 11648)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !369, file: !370, line: 113, baseType: !216, size: 64, offset: 11712)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !369, file: !370, line: 114, baseType: !216, size: 64, offset: 11776)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !369, file: !370, line: 115, baseType: !216, size: 64, offset: 11840)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !369, file: !370, line: 116, baseType: !216, size: 64, offset: 11904)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !369, file: !370, line: 117, baseType: !216, size: 64, offset: 11968)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !369, file: !370, line: 119, baseType: !161, size: 32, offset: 12032)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !369, file: !370, line: 120, baseType: !161, size: 32, offset: 12064)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !369, file: !370, line: 121, baseType: !161, size: 32, offset: 12096)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !369, file: !370, line: 122, baseType: !161, size: 32, offset: 12128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !369, file: !370, line: 123, baseType: !161, size: 32, offset: 12160)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !369, file: !370, line: 124, baseType: !161, size: 32, offset: 12192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !369, file: !370, line: 125, baseType: !161, size: 32, offset: 12224)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !369, file: !370, line: 126, baseType: !161, size: 32, offset: 12256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !369, file: !370, line: 127, baseType: !161, size: 32, offset: 12288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !369, file: !370, line: 128, baseType: !161, size: 32, offset: 12320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !369, file: !370, line: 129, baseType: !161, size: 32, offset: 12352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !369, file: !370, line: 130, baseType: !161, size: 32, offset: 12384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !369, file: !370, line: 131, baseType: !161, size: 32, offset: 12416)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !369, file: !370, line: 132, baseType: !161, size: 32, offset: 12448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !369, file: !370, line: 133, baseType: !161, size: 32, offset: 12480)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !369, file: !370, line: 134, baseType: !161, size: 32, offset: 12512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !369, file: !370, line: 135, baseType: !161, size: 32, offset: 12544)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !369, file: !370, line: 137, baseType: !161, size: 32, offset: 12576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !369, file: !370, line: 138, baseType: !161, size: 32, offset: 12608)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !369, file: !370, line: 140, baseType: !534, size: 64, offset: 12672)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !53, line: 5, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !53, line: 5, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !369, file: !370, line: 141, baseType: !274, size: 32, offset: 12736)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !369, file: !370, line: 142, baseType: !539, size: 64, offset: 12800)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !540, line: 22, baseType: !541)
!540 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !540, line: 22, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !369, file: !370, line: 143, baseType: !216, size: 64, offset: 12864)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !369, file: !370, line: 144, baseType: !216, size: 64, offset: 12928)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !369, file: !370, line: 146, baseType: !216, size: 64, offset: 12992)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !369, file: !370, line: 147, baseType: !216, size: 64, offset: 13056)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !369, file: !370, line: 148, baseType: !216, size: 64, offset: 13120)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !369, file: !370, line: 149, baseType: !216, size: 64, offset: 13184)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !369, file: !370, line: 150, baseType: !216, size: 64, offset: 13248)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !369, file: !370, line: 151, baseType: !216, size: 64, offset: 13312)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !369, file: !370, line: 152, baseType: !216, size: 64, offset: 13376)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !369, file: !370, line: 153, baseType: !274, size: 32, offset: 13440)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !369, file: !370, line: 154, baseType: !274, size: 32, offset: 13472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !369, file: !370, line: 155, baseType: !274, size: 32, offset: 13504)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !369, file: !370, line: 156, baseType: !274, size: 32, offset: 13536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !369, file: !370, line: 157, baseType: !274, size: 32, offset: 13568)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !369, file: !370, line: 158, baseType: !274, size: 32, offset: 13600)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !369, file: !370, line: 159, baseType: !274, size: 32, offset: 13632)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !369, file: !370, line: 160, baseType: !274, size: 32, offset: 13664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !369, file: !370, line: 161, baseType: !274, size: 32, offset: 13696)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !369, file: !370, line: 162, baseType: !274, size: 32, offset: 13728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !369, file: !370, line: 163, baseType: !274, size: 32, offset: 13760)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !369, file: !370, line: 164, baseType: !274, size: 32, offset: 13792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !369, file: !370, line: 165, baseType: !274, size: 32, offset: 13824)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !369, file: !370, line: 166, baseType: !274, size: 32, offset: 13856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !369, file: !370, line: 167, baseType: !274, size: 32, offset: 13888)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !369, file: !370, line: 168, baseType: !274, size: 32, offset: 13920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !369, file: !370, line: 169, baseType: !274, size: 32, offset: 13952)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !369, file: !370, line: 170, baseType: !274, size: 32, offset: 13984)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !369, file: !370, line: 171, baseType: !274, size: 32, offset: 14016)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !369, file: !370, line: 172, baseType: !274, size: 32, offset: 14048)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !369, file: !370, line: 173, baseType: !274, size: 32, offset: 14080)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !369, file: !370, line: 174, baseType: !274, size: 32, offset: 14112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !369, file: !370, line: 175, baseType: !274, size: 32, offset: 14144)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !369, file: !370, line: 177, baseType: !576, size: 32, offset: 14176)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !369, file: !370, line: 178, baseType: !161, size: 32, offset: 14208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !369, file: !370, line: 179, baseType: !215, size: 64, offset: 14272)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !369, file: !370, line: 180, baseType: !215, size: 64, offset: 14336)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !369, file: !370, line: 181, baseType: !215, size: 64, offset: 14400)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !369, file: !370, line: 182, baseType: !207, size: 64, offset: 14464)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !369, file: !370, line: 183, baseType: !161, size: 32, offset: 14528)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !369, file: !370, line: 184, baseType: !274, size: 32, offset: 14560)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !369, file: !370, line: 185, baseType: !274, size: 32, offset: 14592)
!585 = !{!586, !587, !588, !589, !590, !592, !594, !596, !598, !600, !602, !604, !606, !608}
!586 = !DILocalVariable(name: "tao", arg: 1, scope: !363, file: !364, line: 330, type: !367)
!587 = !DILocalVariable(name: "tron", scope: !363, file: !364, line: 332, type: !304)
!588 = !DILocalVariable(name: "ierr", scope: !363, file: !364, line: 333, type: !115)
!589 = !DILocalVariable(name: "morethuente_type", scope: !363, file: !364, line: 334, type: !138)
!590 = !DILocalVariable(name: "ierr__", scope: !591, file: !364, line: 344, type: !115)
!591 = distinct !DILexicalBlock(scope: !363, file: !364, line: 344, column: 33)
!592 = !DILocalVariable(name: "ierr__", scope: !593, file: !364, line: 380, type: !115)
!593 = distinct !DILexicalBlock(scope: !363, file: !364, line: 380, column: 74)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !364, line: 381, type: !115)
!595 = distinct !DILexicalBlock(scope: !363, file: !364, line: 381, column: 90)
!596 = !DILocalVariable(name: "ierr__", scope: !597, file: !364, line: 382, type: !115)
!597 = distinct !DILexicalBlock(scope: !363, file: !364, line: 382, column: 65)
!598 = !DILocalVariable(name: "ierr__", scope: !599, file: !364, line: 383, type: !115)
!599 = distinct !DILexicalBlock(scope: !363, file: !364, line: 383, column: 59)
!600 = !DILocalVariable(name: "ierr__", scope: !601, file: !364, line: 384, type: !115)
!601 = distinct !DILexicalBlock(scope: !363, file: !364, line: 384, column: 73)
!602 = !DILocalVariable(name: "ierr__", scope: !603, file: !364, line: 386, type: !115)
!603 = distinct !DILexicalBlock(scope: !363, file: !364, line: 386, column: 57)
!604 = !DILocalVariable(name: "ierr__", scope: !605, file: !364, line: 387, type: !115)
!605 = distinct !DILexicalBlock(scope: !363, file: !364, line: 387, column: 83)
!606 = !DILocalVariable(name: "ierr__", scope: !607, file: !364, line: 388, type: !115)
!607 = distinct !DILexicalBlock(scope: !363, file: !364, line: 388, column: 57)
!608 = !DILocalVariable(name: "ierr__", scope: !609, file: !364, line: 389, type: !115)
!609 = distinct !DILexicalBlock(scope: !363, file: !364, line: 389, column: 39)
!610 = !DILocation(line: 0, scope: !363)
!611 = !DILocation(line: 332, column: 3, scope: !363)
!612 = !DILocation(line: 336, column: 3, scope: !613)
!613 = distinct !DILexicalBlock(scope: !614, file: !364, line: 336, column: 3)
!614 = distinct !DILexicalBlock(scope: !615, file: !364, line: 336, column: 3)
!615 = distinct !DILexicalBlock(scope: !363, file: !364, line: 336, column: 3)
!616 = !{!617, !617, i64 0}
!617 = !{!"any pointer", !618, i64 0}
!618 = !{!"omnipotent char", !619, i64 0}
!619 = !{!"Simple C/C++ TBAA"}
!620 = !DILocation(line: 336, column: 3, scope: !614)
!621 = !DILocation(line: 336, column: 3, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !364, line: 336, column: 3)
!623 = distinct !DILexicalBlock(scope: !613, file: !364, line: 336, column: 3)
!624 = !{!625, !626, i64 1536}
!625 = !{!"", !618, i64 0, !618, i64 512, !618, i64 1024, !618, i64 1280, !626, i64 1536, !626, i64 1540, !618, i64 1544}
!626 = !{!"int", !618, i64 0}
!627 = !DILocation(line: 336, column: 3, scope: !623)
!628 = !DILocation(line: 336, column: 3, scope: !629)
!629 = distinct !DILexicalBlock(scope: !622, file: !364, line: 336, column: 3)
!630 = !{!626, !626, i64 0}
!631 = !{!625, !626, i64 1540}
!632 = !DILocation(line: 337, column: 13, scope: !363)
!633 = !DILocation(line: 337, column: 28, scope: !363)
!634 = !{!635, !617, i64 152}
!635 = !{!"_TaoOps", !617, i64 0, !617, i64 8, !617, i64 16, !617, i64 24, !617, i64 32, !617, i64 40, !617, i64 48, !617, i64 56, !617, i64 64, !617, i64 72, !617, i64 80, !617, i64 88, !617, i64 96, !617, i64 104, !617, i64 112, !617, i64 120, !617, i64 128, !617, i64 136, !617, i64 144, !617, i64 152, !617, i64 160, !617, i64 168, !617, i64 176, !617, i64 184}
