; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/err.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/err.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._EH = type { i32 (%struct.ompi_communicator_t*, i32, i8*, i8*, i32, i32, i8*, i8*)*, i8*, %struct._EH* }
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._p_PetscViewer = type opaque

!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/err.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !17, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 663, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!19 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 81, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!40 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!51 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!52 = !{!53, !57, !58, !61, !62, !65, !67, !66, !262, !125, !173, !124}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !54, line: 330, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !54, line: 330, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !66)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !70, line: 73, size: 4480, elements: !71)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!71 = !{!72, !74, !120, !121, !123, !126, !127, !128, !129, !137, !138, !139, !143, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !159, !160, !161, !163, !164, !166, !168, !169, !170, !171, !172, !175, !177, !178, !179, !180, !181, !184, !186, !187, !188, !198, !200, !201, !205, !206, !252, !257, !259, !260, !261}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !69, file: !70, line: 74, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !66)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !69, file: !70, line: 75, baseType: !75, size: 448, offset: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 448, elements: !118)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !70, line: 53, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 45, size: 448, elements: !78)
!78 = !{!79, !85, !93, !98, !102, !106, !113}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !77, file: !70, line: 46, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !67, !84}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !66)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !77, file: !70, line: 47, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!83, !67, !89}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !90, line: 16, baseType: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !90, line: 16, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !77, file: !70, line: 48, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!83, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !77, file: !70, line: 49, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!83, !67, !58, !67}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !77, file: !70, line: 50, baseType: !103, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!83, !67, !58, !97}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !77, file: !70, line: 51, baseType: !107, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!83, !67, !58, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !77, file: !70, line: 52, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!83, !67, !58, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !69, file: !70, line: 76, baseType: !53, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !70, line: 77, baseType: !122, size: 32, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !66)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !69, file: !70, line: 78, baseType: !124, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !125)
!125 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !69, file: !70, line: 78, baseType: !124, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !69, file: !70, line: 78, baseType: !124, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !69, file: !70, line: 78, baseType: !124, size: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !70, line: 79, baseType: !130, size: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !133, line: 27, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !135, line: 43, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!136 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !69, file: !70, line: 80, baseType: !122, size: 32, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !69, file: !70, line: 81, baseType: !65, size: 32, offset: 992)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !69, file: !70, line: 82, baseType: !140, size: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !69, file: !70, line: 83, baseType: !144, size: 64, offset: 1088)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !69, file: !70, line: 84, baseType: !61, size: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !69, file: !70, line: 85, baseType: !61, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !69, file: !70, line: 86, baseType: !61, size: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !69, file: !70, line: 87, baseType: !61, size: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !69, file: !70, line: 88, baseType: !67, size: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !69, file: !70, line: 89, baseType: !130, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !70, line: 90, baseType: !61, size: 64, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !69, file: !70, line: 91, baseType: !61, size: 64, offset: 1600)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !69, file: !70, line: 92, baseType: !122, size: 32, offset: 1664)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !69, file: !70, line: 93, baseType: !57, size: 64, offset: 1728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !69, file: !70, line: 94, baseType: !158, size: 64, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !131)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !69, file: !70, line: 95, baseType: !122, size: 32, offset: 1856)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !69, file: !70, line: 95, baseType: !122, size: 32, offset: 1888)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !69, file: !70, line: 96, baseType: !162, size: 64, offset: 1920)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !69, file: !70, line: 96, baseType: !162, size: 64, offset: 1984)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !69, file: !70, line: 97, baseType: !165, size: 64, offset: 2048)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !69, file: !70, line: 97, baseType: !167, size: 64, offset: 2112)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !69, file: !70, line: 98, baseType: !122, size: 32, offset: 2176)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !69, file: !70, line: 98, baseType: !122, size: 32, offset: 2208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !69, file: !70, line: 99, baseType: !162, size: 64, offset: 2240)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !69, file: !70, line: 99, baseType: !162, size: 64, offset: 2304)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !69, file: !70, line: 100, baseType: !173, size: 64, offset: 2368)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !125)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !69, file: !70, line: 100, baseType: !176, size: 64, offset: 2432)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !69, file: !70, line: 101, baseType: !122, size: 32, offset: 2496)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !69, file: !70, line: 101, baseType: !122, size: 32, offset: 2528)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !69, file: !70, line: 102, baseType: !162, size: 64, offset: 2560)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !69, file: !70, line: 102, baseType: !162, size: 64, offset: 2624)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !69, file: !70, line: 103, baseType: !182, size: 64, offset: 2688)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !69, file: !70, line: 103, baseType: !185, size: 64, offset: 2752)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !69, file: !70, line: 104, baseType: !117, size: 64, offset: 2816)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !69, file: !70, line: 105, baseType: !122, size: 32, offset: 2880)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !69, file: !70, line: 106, baseType: !189, size: 128, offset: 2944)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, elements: !196)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !70, line: 64, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 61, size: 128, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !192, file: !70, line: 62, baseType: !110, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !192, file: !70, line: 63, baseType: !57, size: 64, offset: 64)
!196 = !{!197}
!197 = !DISubrange(count: 2)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !69, file: !70, line: 107, baseType: !199, size: 64, offset: 3072)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !196)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !69, file: !70, line: 108, baseType: !57, size: 64, offset: 3136)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !69, file: !70, line: 109, baseType: !202, size: 64, offset: 3200)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!83, !57}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !69, file: !70, line: 111, baseType: !122, size: 32, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !69, file: !70, line: 112, baseType: !207, size: 320, offset: 3328)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !250)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!83, !211, !67, !57}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !38, line: 108, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !38, line: 99, size: 640, elements: !214)
!214 = !{!215, !216, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !213, file: !38, line: 100, baseType: !122, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !38, line: 101, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !38, line: 82, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !38, line: 83, size: 768, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !228, !229, !230, !231, !233, !235, !236, !237}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !219, file: !38, line: 84, baseType: !61, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !219, file: !38, line: 85, baseType: !61, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !219, file: !38, line: 86, baseType: !57, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !219, file: !38, line: 87, baseType: !140, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !219, file: !38, line: 88, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !219, file: !38, line: 89, baseType: !60, size: 8, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !219, file: !38, line: 90, baseType: !61, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !219, file: !38, line: 91, baseType: !62, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !219, file: !38, line: 92, baseType: !232, size: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !38, line: 93, baseType: !234, size: 32, offset: 544)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !38, line: 81, baseType: !37)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !38, line: 94, baseType: !217, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !219, file: !38, line: 95, baseType: !61, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !219, file: !38, line: 96, baseType: !57, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !213, file: !38, line: 102, baseType: !61, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !213, file: !38, line: 102, baseType: !61, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !213, file: !38, line: 103, baseType: !61, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !213, file: !38, line: 104, baseType: !53, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !213, file: !38, line: 105, baseType: !232, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !213, file: !38, line: 105, baseType: !232, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !213, file: !38, line: 105, baseType: !232, size: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !213, file: !38, line: 106, baseType: !67, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !213, file: !38, line: 107, baseType: !247, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !38, line: 10, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !38, line: 10, flags: DIFlagFwdDecl)
!250 = !{!251}
!251 = !DISubrange(count: 5)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !69, file: !70, line: 113, baseType: !253, size: 320, offset: 3648)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 320, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!83, !67, !57}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !69, file: !70, line: 114, baseType: !258, size: 320, offset: 3968)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 320, elements: !250)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !69, file: !70, line: 115, baseType: !232, size: 32, offset: 4288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !69, file: !70, line: 120, baseType: !247, size: 64, offset: 4352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !69, file: !70, line: 121, baseType: !232, size: 32, offset: 4416)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !54, line: 331, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !54, line: 331, flags: DIFlagFwdDecl)
!265 = !{!266, !272, !0, !277}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "PetscErrorBaseMessage", scope: !2, file: !268, line: 218, type: !269, isLocal: true, isDefinition: true)
!268 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/error/err.c", directory: "/home/users/ndemeye/xSDK")
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 1024)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "PetscAbortSourceFiles", scope: !2, file: !268, line: 11, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 832, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 13)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "PetscErrorStrings", scope: !2, file: !268, line: 223, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2816, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 44)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "EH", file: !268, line: 46, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EH", file: !268, line: 47, size: 192, elements: !285)
!285 = !{!286, !291, !292}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !284, file: !268, line: 48, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!83, !53, !66, !58, !58, !83, !290, !58, !57}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorType", file: !12, line: 663, baseType: !11)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !284, file: !268, line: 49, baseType: !57, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !284, file: !268, line: 50, baseType: !282, size: 64, offset: 128)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{i32 7, !"PIC Level", i32 2}
!297 = !{i32 7, !"uwtable", i32 1}
!298 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!299 = distinct !DISubprogram(name: "PetscAbortFindSourceFile_Private", scope: !268, file: !268, line: 28, type: !300, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{!83, !58, !165}
!302 = !{!303, !304, !305, !306, !307, !308, !309, !313, !318}
!303 = !DILocalVariable(name: "filepath", arg: 1, scope: !299, file: !268, line: 28, type: !58)
!304 = !DILocalVariable(name: "idx", arg: 2, scope: !299, file: !268, line: 28, type: !165)
!305 = !DILocalVariable(name: "ierr", scope: !299, file: !268, line: 30, type: !83)
!306 = !DILocalVariable(name: "i", scope: !299, file: !268, line: 31, type: !122)
!307 = !DILocalVariable(name: "n", scope: !299, file: !268, line: 31, type: !122)
!308 = !DILocalVariable(name: "match", scope: !299, file: !268, line: 32, type: !232)
!309 = !DILocalVariable(name: "subpath", scope: !299, file: !268, line: 33, type: !310)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 256)
!313 = !DILocalVariable(name: "ierr__", scope: !314, file: !268, line: 39, type: !83)
!314 = distinct !DILexicalBlock(scope: !315, file: !268, line: 39, column: 63)
!315 = distinct !DILexicalBlock(scope: !316, file: !268, line: 38, column: 23)
!316 = distinct !DILexicalBlock(scope: !317, file: !268, line: 38, column: 3)
!317 = distinct !DILexicalBlock(scope: !299, file: !268, line: 38, column: 3)
!318 = !DILocalVariable(name: "ierr__", scope: !319, file: !268, line: 40, type: !83)
!319 = distinct !DILexicalBlock(scope: !315, file: !268, line: 40, column: 54)
!320 = !DILocation(line: 0, scope: !299)
!321 = !DILocation(line: 32, column: 3, scope: !299)
!322 = !DILocation(line: 33, column: 3, scope: !299)
!323 = !DILocation(line: 33, column: 19, scope: !299)
!324 = !DILocation(line: 35, column: 3, scope: !325)
!325 = distinct !DILexicalBlock(scope: !326, file: !268, line: 35, column: 3)
!326 = distinct !DILexicalBlock(scope: !327, file: !268, line: 35, column: 3)
!327 = distinct !DILexicalBlock(scope: !299, file: !268, line: 35, column: 3)
!328 = !{!329, !329, i64 0}
!329 = !{!"any pointer", !330, i64 0}
!330 = !{!"omnipotent char", !331, i64 0}
!331 = !{!"Simple C/C++ TBAA"}
!332 = !DILocation(line: 35, column: 3, scope: !326)
!333 = !DILocation(line: 35, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !268, line: 35, column: 3)
!335 = distinct !DILexicalBlock(scope: !325, file: !268, line: 35, column: 3)
!336 = !{!337, !338, i64 1536}
!337 = !{!"", !330, i64 0, !330, i64 512, !330, i64 1024, !330, i64 1280, !338, i64 1536, !338, i64 1540, !330, i64 1544}
!338 = !{!"int", !330, i64 0}
!339 = !DILocation(line: 35, column: 3, scope: !335)
!340 = !DILocation(line: 35, column: 3, scope: !341)
!341 = distinct !DILexicalBlock(scope: !334, file: !268, line: 35, column: 3)
!342 = !{!338, !338, i64 0}
!343 = !{!337, !338, i64 1540}
!344 = !DILocation(line: 36, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !268, line: 36, column: 3)
!346 = distinct !DILexicalBlock(scope: !299, file: !268, line: 36, column: 3)
!347 = !DILocation(line: 36, column: 3, scope: !346)
!348 = !DILocation(line: 36, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !346, file: !268, line: 36, column: 3)
!350 = !DILocation(line: 37, column: 8, scope: !299)
!351 = !DILocation(line: 39, column: 12, scope: !315)
!352 = !DILocation(line: 0, scope: !314)
!353 = !DILocation(line: 39, column: 63, scope: !354)
!354 = distinct !DILexicalBlock(scope: !314, file: !268, line: 39, column: 63)
!355 = !DILocation(line: 39, column: 63, scope: !314)
!356 = !{!"branch_weights", i32 2000, i32 1}
!357 = !DILocation(line: 40, column: 12, scope: !315)
!358 = !DILocation(line: 0, scope: !319)
!359 = !DILocation(line: 40, column: 54, scope: !360)
!360 = distinct !DILexicalBlock(scope: !319, file: !268, line: 40, column: 54)
!361 = !DILocation(line: 40, column: 54, scope: !319)
!362 = !DILocation(line: 41, column: 9, scope: !363)
!363 = distinct !DILexicalBlock(scope: !315, file: !268, line: 41, column: 9)
!364 = !{!330, !330, i64 0}
!365 = !DILocation(line: 41, column: 9, scope: !315)
!366 = !DILocation(line: 41, column: 22, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !268, line: 41, column: 16)
!368 = !DILocation(line: 41, column: 27, scope: !367)
!369 = !DILocation(line: 43, column: 3, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !268, line: 43, column: 3)
!371 = distinct !DILexicalBlock(scope: !372, file: !268, line: 43, column: 3)
!372 = distinct !DILexicalBlock(scope: !299, file: !268, line: 43, column: 3)
!373 = !DILocation(line: 43, column: 3, scope: !371)
!374 = !DILocation(line: 43, column: 3, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !268, line: 43, column: 3)
!376 = distinct !DILexicalBlock(scope: !370, file: !268, line: 43, column: 3)
!377 = !DILocation(line: 43, column: 3, scope: !376)
!378 = !DILocation(line: 43, column: 3, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !268, line: 43, column: 3)
!380 = distinct !DILexicalBlock(scope: !375, file: !268, line: 43, column: 3)
!381 = !{!337, !330, i64 1544}
!382 = !DILocation(line: 43, column: 3, scope: !380)
!383 = !DILocation(line: 43, column: 3, scope: !384)
!384 = distinct !DILexicalBlock(scope: !379, file: !268, line: 43, column: 3)
!385 = !DILocation(line: 43, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !375, file: !268, line: 43, column: 3)
!387 = !DILocation(line: 43, column: 3, scope: !388)
!388 = distinct !DILexicalBlock(scope: !386, file: !268, line: 43, column: 3)
!389 = !DILocation(line: 43, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !268, line: 43, column: 3)
!391 = distinct !DILexicalBlock(scope: !388, file: !268, line: 43, column: 3)
!392 = !DILocation(line: 43, column: 3, scope: !391)
!393 = !DILocation(line: 43, column: 3, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !268, line: 43, column: 3)
!395 = !DILocation(line: 44, column: 1, scope: !299)
!396 = distinct !DISubprogram(name: "PetscError", scope: !268, file: !268, line: 372, type: !397, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!83, !53, !66, !58, !58, !83, !290, !58, null}
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !420, !421, !425, !426, !427, !428}
!400 = !DILocalVariable(name: "comm", arg: 1, scope: !396, file: !268, line: 372, type: !53)
!401 = !DILocalVariable(name: "line", arg: 2, scope: !396, file: !268, line: 372, type: !66)
!402 = !DILocalVariable(name: "func", arg: 3, scope: !396, file: !268, line: 372, type: !58)
!403 = !DILocalVariable(name: "file", arg: 4, scope: !396, file: !268, line: 372, type: !58)
!404 = !DILocalVariable(name: "n", arg: 5, scope: !396, file: !268, line: 372, type: !83)
!405 = !DILocalVariable(name: "p", arg: 6, scope: !396, file: !268, line: 372, type: !290)
!406 = !DILocalVariable(name: "mess", arg: 7, scope: !396, file: !268, line: 372, type: !58)
!407 = !DILocalVariable(name: "Argp", scope: !396, file: !268, line: 374, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !409, line: 46, baseType: !410)
!409 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !411, line: 32, baseType: !412)
!411 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stdarg.h", directory: "/home/users")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !268, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 192, elements: !118)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !414, file: !268, line: 374, baseType: !7, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !414, file: !268, line: 374, baseType: !7, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !414, file: !268, line: 374, baseType: !57, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !414, file: !268, line: 374, baseType: !57, size: 64, offset: 128)
!420 = !DILocalVariable(name: "fullLength", scope: !396, file: !268, line: 375, type: !62)
!421 = !DILocalVariable(name: "buf", scope: !396, file: !268, line: 376, type: !422)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 16384, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 2048)
!425 = !DILocalVariable(name: "lbuf", scope: !396, file: !268, line: 376, type: !61)
!426 = !DILocalVariable(name: "ismain", scope: !396, file: !268, line: 377, type: !232)
!427 = !DILocalVariable(name: "ierr", scope: !396, file: !268, line: 378, type: !83)
!428 = !DILocalVariable(name: "errcode", scope: !429, file: !268, line: 407, type: !65)
!429 = distinct !DILexicalBlock(scope: !430, file: !268, line: 406, column: 15)
!430 = distinct !DILexicalBlock(scope: !396, file: !268, line: 406, column: 7)
!431 = !DILocation(line: 0, scope: !396)
!432 = !DILocation(line: 374, column: 3, scope: !396)
!433 = !DILocation(line: 374, column: 18, scope: !396)
!434 = !DILocation(line: 375, column: 3, scope: !396)
!435 = !DILocation(line: 376, column: 3, scope: !396)
!436 = !DILocation(line: 376, column: 18, scope: !396)
!437 = !DILocation(line: 377, column: 3, scope: !396)
!438 = !DILocation(line: 380, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !396, file: !268, line: 380, column: 7)
!440 = !DILocation(line: 380, column: 7, scope: !396)
!441 = !DILocation(line: 381, column: 8, scope: !442)
!442 = distinct !DILexicalBlock(scope: !396, file: !268, line: 381, column: 7)
!443 = !DILocation(line: 381, column: 7, scope: !396)
!444 = !DILocation(line: 382, column: 12, scope: !445)
!445 = distinct !DILexicalBlock(scope: !396, file: !268, line: 382, column: 7)
!446 = !DILocation(line: 382, column: 7, scope: !396)
!447 = !DILocation(line: 385, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !396, file: !268, line: 385, column: 7)
!449 = !DILocation(line: 385, column: 7, scope: !396)
!450 = !DILocation(line: 386, column: 5, scope: !451)
!451 = distinct !DILexicalBlock(scope: !448, file: !268, line: 385, column: 13)
!452 = !DILocation(line: 387, column: 5, scope: !451)
!453 = !DILocation(line: 388, column: 5, scope: !451)
!454 = !DILocation(line: 390, column: 11, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !268, line: 390, column: 9)
!456 = !DILocation(line: 390, column: 9, scope: !451)
!457 = !DILocation(line: 390, column: 35, scope: !455)
!458 = !DILocation(line: 393, column: 9, scope: !459)
!459 = distinct !DILexicalBlock(scope: !396, file: !268, line: 393, column: 7)
!460 = !DILocation(line: 393, column: 32, scope: !459)
!461 = !DILocation(line: 393, column: 56, scope: !459)
!462 = !DILocation(line: 395, column: 8, scope: !463)
!463 = distinct !DILexicalBlock(scope: !396, file: !268, line: 395, column: 7)
!464 = !DILocation(line: 395, column: 7, scope: !396)
!465 = !DILocation(line: 395, column: 19, scope: !463)
!466 = !DILocation(line: 395, column: 12, scope: !463)
!467 = !DILocation(line: 396, column: 21, scope: !463)
!468 = !{!469, !329, i64 0}
!469 = !{!"_EH", !329, i64 0, !329, i64 8, !329, i64 16}
!470 = !DILocation(line: 396, column: 63, scope: !463)
!471 = !{!469, !329, i64 8}
!472 = !DILocation(line: 396, column: 15, scope: !463)
!473 = !DILocation(line: 0, scope: !463)
!474 = !DILocation(line: 397, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !268, line: 397, column: 3)
!476 = distinct !DILexicalBlock(scope: !396, file: !268, line: 397, column: 3)
!477 = !DILocation(line: 397, column: 3, scope: !476)
!478 = !DILocation(line: 397, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !268, line: 397, column: 3)
!480 = !DILocation(line: 397, column: 3, scope: !481)
!481 = distinct !DILexicalBlock(scope: !476, file: !268, line: 397, column: 3)
!482 = !DILocation(line: 397, column: 3, scope: !483)
!483 = distinct !DILexicalBlock(scope: !481, file: !268, line: 397, column: 3)
!484 = !DILocation(line: 405, column: 3, scope: !396)
!485 = !DILocation(line: 406, column: 7, scope: !430)
!486 = !DILocation(line: 406, column: 7, scope: !396)
!487 = !DILocation(line: 0, scope: !429)
!488 = !DILocation(line: 409, column: 9, scope: !489)
!489 = distinct !DILexicalBlock(scope: !429, file: !268, line: 409, column: 9)
!490 = !DILocation(line: 409, column: 9, scope: !429)
!491 = !DILocation(line: 409, column: 32, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !268, line: 409, column: 30)
!493 = !DILocation(line: 409, column: 50, scope: !492)
!494 = !DILocation(line: 410, column: 5, scope: !429)
!495 = !DILocation(line: 411, column: 3, scope: !429)
!496 = !DILocation(line: 419, column: 1, scope: !396)
!497 = !DILocation(line: 418, column: 3, scope: !396)
!498 = !DISubprogram(name: "PetscCheckPointer", scope: !70, file: !70, line: 183, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!499 = !DISubroutineType(types: !500)
!500 = !{!5, !501, !17}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!503 = !{}
!504 = !DISubprogram(name: "PetscFixFilename", scope: !505, file: !505, line: 1655, type: !506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!505 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!506 = !DISubroutineType(types: !507)
!507 = !{!66, !58, !61}
!508 = !DISubprogram(name: "PetscStrendswith", scope: !505, file: !505, line: 1360, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!509 = !DISubroutineType(types: !510)
!510 = !{!66, !58, !58, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!512 = distinct !DISubprogram(name: "PetscEmacsClientErrorHandler", scope: !268, file: !268, line: 84, type: !288, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528}
!514 = !DILocalVariable(name: "comm", arg: 1, scope: !512, file: !268, line: 84, type: !53)
!515 = !DILocalVariable(name: "line", arg: 2, scope: !512, file: !268, line: 84, type: !66)
!516 = !DILocalVariable(name: "fun", arg: 3, scope: !512, file: !268, line: 84, type: !58)
!517 = !DILocalVariable(name: "file", arg: 4, scope: !512, file: !268, line: 84, type: !58)
!518 = !DILocalVariable(name: "n", arg: 5, scope: !512, file: !268, line: 84, type: !83)
!519 = !DILocalVariable(name: "p", arg: 6, scope: !512, file: !268, line: 84, type: !290)
!520 = !DILocalVariable(name: "mess", arg: 7, scope: !512, file: !268, line: 84, type: !58)
!521 = !DILocalVariable(name: "ctx", arg: 8, scope: !512, file: !268, line: 84, type: !57)
!522 = !DILocalVariable(name: "ierr", scope: !512, file: !268, line: 86, type: !83)
!523 = !DILocalVariable(name: "command", scope: !512, file: !268, line: 87, type: !524)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32768, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 4096)
!527 = !DILocalVariable(name: "pdir", scope: !512, file: !268, line: 88, type: !58)
!528 = !DILocalVariable(name: "fp", scope: !512, file: !268, line: 89, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !531, line: 7, baseType: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !533, line: 245, size: 1728, elements: !534)
!533 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !555, !556, !557, !558, !560, !562, !564, !566, !569, !571, !572, !573, !574, !575, !576, !577}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !532, file: !533, line: 246, baseType: !66, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !532, file: !533, line: 251, baseType: !61, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !532, file: !533, line: 252, baseType: !61, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !532, file: !533, line: 253, baseType: !61, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !532, file: !533, line: 254, baseType: !61, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !532, file: !533, line: 255, baseType: !61, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !532, file: !533, line: 256, baseType: !61, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !532, file: !533, line: 257, baseType: !61, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !532, file: !533, line: 258, baseType: !61, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !532, file: !533, line: 260, baseType: !61, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !532, file: !533, line: 261, baseType: !61, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !532, file: !533, line: 262, baseType: !61, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !532, file: !533, line: 264, baseType: !548, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !533, line: 160, size: 192, elements: !550)
!550 = !{!551, !552, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !549, file: !533, line: 161, baseType: !548, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !549, file: !533, line: 162, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !549, file: !533, line: 166, baseType: !66, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !532, file: !533, line: 266, baseType: !553, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !532, file: !533, line: 268, baseType: !66, size: 32, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !532, file: !533, line: 272, baseType: !66, size: 32, offset: 928)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !532, file: !533, line: 274, baseType: !559, size: 64, offset: 960)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !135, line: 140, baseType: !136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !532, file: !533, line: 278, baseType: !561, size: 16, offset: 1024)
!561 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !532, file: !533, line: 279, baseType: !563, size: 8, offset: 1040)
!563 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !532, file: !533, line: 280, baseType: !565, size: 8, offset: 1048)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, elements: !118)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !532, file: !533, line: 284, baseType: !567, size: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !533, line: 154, baseType: null)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !532, file: !533, line: 293, baseType: !570, size: 64, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !135, line: 141, baseType: !136)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !532, file: !533, line: 301, baseType: !57, size: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !532, file: !533, line: 302, baseType: !57, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !532, file: !533, line: 303, baseType: !57, size: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !532, file: !533, line: 304, baseType: !57, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !532, file: !533, line: 306, baseType: !62, size: 64, offset: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !532, file: !533, line: 307, baseType: !66, size: 32, offset: 1536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !532, file: !533, line: 309, baseType: !578, size: 160, offset: 1568)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 20)
!581 = !DILocation(line: 0, scope: !512)
!582 = !DILocation(line: 87, column: 3, scope: !512)
!583 = !DILocation(line: 87, column: 18, scope: !512)
!584 = !DILocation(line: 88, column: 3, scope: !512)
!585 = !DILocation(line: 89, column: 3, scope: !512)
!586 = !DILocation(line: 91, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !268, line: 91, column: 3)
!588 = distinct !DILexicalBlock(scope: !589, file: !268, line: 91, column: 3)
!589 = distinct !DILexicalBlock(scope: !512, file: !268, line: 91, column: 3)
!590 = !DILocation(line: 91, column: 3, scope: !588)
!591 = !DILocation(line: 91, column: 3, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !268, line: 91, column: 3)
!593 = distinct !DILexicalBlock(scope: !587, file: !268, line: 91, column: 3)
!594 = !DILocation(line: 91, column: 3, scope: !593)
!595 = !DILocation(line: 91, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !592, file: !268, line: 91, column: 3)
!597 = !DILocation(line: 92, column: 10, scope: !512)
!598 = !DILocation(line: 92, column: 38, scope: !599)
!599 = distinct !DILexicalBlock(scope: !512, file: !268, line: 92, column: 38)
!600 = !DILocation(line: 92, column: 38, scope: !512)
!601 = !DILocation(line: 92, column: 44, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !268, line: 92, column: 44)
!603 = distinct !DILexicalBlock(scope: !604, file: !268, line: 92, column: 44)
!604 = distinct !DILexicalBlock(scope: !599, file: !268, line: 92, column: 44)
!605 = !DILocation(line: 92, column: 44, scope: !603)
!606 = !DILocation(line: 92, column: 44, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !268, line: 92, column: 44)
!608 = distinct !DILexicalBlock(scope: !602, file: !268, line: 92, column: 44)
!609 = !DILocation(line: 92, column: 44, scope: !608)
!610 = !DILocation(line: 92, column: 44, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !268, line: 92, column: 44)
!612 = distinct !DILexicalBlock(scope: !607, file: !268, line: 92, column: 44)
!613 = !DILocation(line: 92, column: 44, scope: !612)
!614 = !DILocation(line: 92, column: 44, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !268, line: 92, column: 44)
!616 = !DILocation(line: 92, column: 44, scope: !617)
!617 = distinct !DILexicalBlock(scope: !607, file: !268, line: 92, column: 44)
!618 = !DILocation(line: 92, column: 44, scope: !619)
!619 = distinct !DILexicalBlock(scope: !617, file: !268, line: 92, column: 44)
!620 = !DILocation(line: 92, column: 44, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !268, line: 92, column: 44)
!622 = distinct !DILexicalBlock(scope: !619, file: !268, line: 92, column: 44)
!623 = !DILocation(line: 92, column: 44, scope: !622)
!624 = !DILocation(line: 92, column: 44, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !268, line: 92, column: 44)
!626 = !DILocation(line: 93, column: 59, scope: !512)
!627 = !DILocation(line: 93, column: 3, scope: !512)
!628 = !DILocation(line: 95, column: 10, scope: !512)
!629 = !DILocation(line: 95, column: 68, scope: !630)
!630 = distinct !DILexicalBlock(scope: !512, file: !268, line: 95, column: 68)
!631 = !DILocation(line: 95, column: 68, scope: !512)
!632 = !DILocation(line: 95, column: 74, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !268, line: 95, column: 74)
!634 = distinct !DILexicalBlock(scope: !635, file: !268, line: 95, column: 74)
!635 = distinct !DILexicalBlock(scope: !630, file: !268, line: 95, column: 74)
!636 = !DILocation(line: 95, column: 74, scope: !634)
!637 = !DILocation(line: 95, column: 74, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !268, line: 95, column: 74)
