; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/noise/snesmfj2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/noise/snesmfj2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 238, baseType: !72, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!297 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!298 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!299 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!300 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!301 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!302 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!303 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!304 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!305 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!306 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!307 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!308 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!309 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!310 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!311 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!312 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!313 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 85, baseType: !72, size: 32, elements: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!316 = !{!317, !318, !319, !320}
!317 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!318 = !DIEnumerator(name: "PC_LEFT", value: 0)
!319 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!320 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 406, baseType: !72, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328}
!323 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!324 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!325 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!326 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!327 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!328 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 493, baseType: !72, size: 32, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!332 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!333 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 663, baseType: !5, size: 32, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !338, !339}
!337 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!340 = !{!341, !343, !342, !347, !350, !408, !516, !393}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !344, line: 330, baseType: !345)
!344 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !344, line: 330, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !353, line: 73, size: 4480, elements: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!354 = !{!355, !357, !403, !404, !406, !409, !410, !411, !412, !420, !421, !423, !427, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !444, !445, !446, !448, !449, !451, !453, !454, !455, !456, !457, !460, !462, !463, !464, !465, !466, !469, !471, !472, !473, !483, !485, !486, !490, !491, !540, !545, !547, !548, !549}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !352, file: !353, line: 74, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !352, file: !353, line: 75, baseType: !358, size: 448, offset: 64)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 448, elements: !401)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !353, line: 53, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 45, size: 448, elements: !361)
!361 = !{!362, !368, !376, !381, !385, !389, !396}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !360, file: !353, line: 46, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !350, !367}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !360, file: !353, line: 47, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!366, !350, !372}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !373, line: 16, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !373, line: 16, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !360, file: !353, line: 48, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!366, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !360, file: !353, line: 49, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!366, !350, !347, !350}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !360, file: !353, line: 50, baseType: !386, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!366, !350, !347, !380}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !360, file: !353, line: 51, baseType: !390, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!366, !350, !347, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !360, file: !353, line: 52, baseType: !397, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!366, !350, !347, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!401 = !{!402}
!402 = !DISubrange(count: 1)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !352, file: !353, line: 76, baseType: !343, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !353, line: 77, baseType: !405, size: 32, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !352, file: !353, line: 78, baseType: !407, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !408)
!408 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !352, file: !353, line: 78, baseType: !407, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !352, file: !353, line: 78, baseType: !407, size: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !352, file: !353, line: 78, baseType: !407, size: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !352, file: !353, line: 79, baseType: !413, size: 64, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !416, line: 27, baseType: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !418, line: 43, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!419 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !352, file: !353, line: 80, baseType: !405, size: 32, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !352, file: !353, line: 81, baseType: !422, size: 32, offset: 992)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !352, file: !353, line: 82, baseType: !424, size: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !352, file: !353, line: 83, baseType: !428, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !352, file: !353, line: 84, baseType: !432, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !352, file: !353, line: 85, baseType: !432, size: 64, offset: 1216)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !352, file: !353, line: 86, baseType: !432, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !352, file: !353, line: 87, baseType: !432, size: 64, offset: 1344)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !352, file: !353, line: 88, baseType: !350, size: 64, offset: 1408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !352, file: !353, line: 89, baseType: !413, size: 64, offset: 1472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !352, file: !353, line: 90, baseType: !432, size: 64, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !352, file: !353, line: 91, baseType: !432, size: 64, offset: 1600)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !352, file: !353, line: 92, baseType: !405, size: 32, offset: 1664)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !352, file: !353, line: 93, baseType: !342, size: 64, offset: 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !353, line: 94, baseType: !443, size: 64, offset: 1792)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !414)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !352, file: !353, line: 95, baseType: !405, size: 32, offset: 1856)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !352, file: !353, line: 95, baseType: !405, size: 32, offset: 1888)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !352, file: !353, line: 96, baseType: !447, size: 64, offset: 1920)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !352, file: !353, line: 96, baseType: !447, size: 64, offset: 1984)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !352, file: !353, line: 97, baseType: !450, size: 64, offset: 2048)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !352, file: !353, line: 97, baseType: !452, size: 64, offset: 2112)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !352, file: !353, line: 98, baseType: !405, size: 32, offset: 2176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !352, file: !353, line: 98, baseType: !405, size: 32, offset: 2208)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !352, file: !353, line: 99, baseType: !447, size: 64, offset: 2240)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !352, file: !353, line: 99, baseType: !447, size: 64, offset: 2304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !352, file: !353, line: 100, baseType: !458, size: 64, offset: 2368)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !352, file: !353, line: 100, baseType: !461, size: 64, offset: 2432)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !352, file: !353, line: 101, baseType: !405, size: 32, offset: 2496)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !352, file: !353, line: 101, baseType: !405, size: 32, offset: 2528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !352, file: !353, line: 102, baseType: !447, size: 64, offset: 2560)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !352, file: !353, line: 102, baseType: !447, size: 64, offset: 2624)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !352, file: !353, line: 103, baseType: !467, size: 64, offset: 2688)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !459)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !352, file: !353, line: 103, baseType: !470, size: 64, offset: 2752)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !352, file: !353, line: 104, baseType: !400, size: 64, offset: 2816)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !352, file: !353, line: 105, baseType: !405, size: 32, offset: 2880)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !352, file: !353, line: 106, baseType: !474, size: 128, offset: 2944)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 128, elements: !481)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !353, line: 64, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 61, size: 128, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !477, file: !353, line: 62, baseType: !393, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !477, file: !353, line: 63, baseType: !342, size: 64, offset: 64)
!481 = !{!482}
!482 = !DISubrange(count: 2)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !352, file: !353, line: 107, baseType: !484, size: 64, offset: 3072)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 64, elements: !481)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !352, file: !353, line: 108, baseType: !342, size: 64, offset: 3136)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !352, file: !353, line: 109, baseType: !487, size: 64, offset: 3200)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!366, !342}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !352, file: !353, line: 111, baseType: !405, size: 32, offset: 3264)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !352, file: !353, line: 112, baseType: !492, size: 320, offset: 3328)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 320, elements: !538)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!366, !496, !350, !342}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !499)
!499 = !{!500, !501, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !498, file: !10, line: 100, baseType: !405, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !10, line: 101, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !513, !514, !515, !519, !521, !523, !524, !525}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !504, file: !10, line: 84, baseType: !432, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !504, file: !10, line: 85, baseType: !432, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !504, file: !10, line: 86, baseType: !342, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !504, file: !10, line: 87, baseType: !424, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !504, file: !10, line: 88, baseType: !511, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !504, file: !10, line: 89, baseType: !349, size: 8, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !504, file: !10, line: 90, baseType: !432, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !504, file: !10, line: 91, baseType: !516, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !517, line: 46, baseType: !518)
!517 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!518 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !504, file: !10, line: 92, baseType: !520, size: 32, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !10, line: 93, baseType: !522, size: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !10, line: 94, baseType: !502, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !504, file: !10, line: 95, baseType: !432, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !504, file: !10, line: 96, baseType: !342, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !498, file: !10, line: 102, baseType: !432, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !498, file: !10, line: 102, baseType: !432, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !498, file: !10, line: 103, baseType: !432, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !498, file: !10, line: 104, baseType: !343, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !498, file: !10, line: 105, baseType: !520, size: 32, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !498, file: !10, line: 105, baseType: !520, size: 32, offset: 416)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !498, file: !10, line: 105, baseType: !520, size: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !498, file: !10, line: 106, baseType: !350, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !498, file: !10, line: 107, baseType: !535, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!538 = !{!539}
!539 = !DISubrange(count: 5)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !352, file: !353, line: 113, baseType: !541, size: 320, offset: 3648)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !538)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!366, !350, !342}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !352, file: !353, line: 114, baseType: !546, size: 320, offset: 3968)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, elements: !538)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !352, file: !353, line: 115, baseType: !520, size: 32, offset: 4288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !352, file: !353, line: 120, baseType: !535, size: 64, offset: 4352)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !352, file: !353, line: 121, baseType: !520, size: 32, offset: 4416)
!550 = !{i32 7, !"Dwarf Version", i32 4}
!551 = !{i32 2, !"Debug Info Version", i32 3}
!552 = !{i32 1, !"wchar_size", i32 4}
!553 = !{i32 7, !"PIC Level", i32 2}
!554 = !{i32 7, !"uwtable", i32 1}
!555 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!556 = distinct !DISubprogram(name: "SNESMatrixFreeDestroy2_Private", scope: !557, file: !557, line: 30, type: !558, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1329)
!557 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/noise/snesmfj2.c", directory: "/home/users/ndemeye/xSDK")
!558 = !DISubroutineType(types: !559)
!559 = !{!366, !560}
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !563, line: 436, size: 23424, elements: !564)
!563 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!564 = !{!565, !567, !1072, !1092, !1093, !1094, !1096, !1097, !1098, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1225, !1226, !1242, !1243, !1244, !1245, !1246, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1281, !1301, !1302, !1304, !1305, !1306, !1307, !1308, !1309, !1327, !1328}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !562, file: !563, line: 437, baseType: !566, size: 4480)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !353, line: 122, baseType: !352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !562, file: !563, line: 437, baseType: !568, size: 9472, offset: 4480)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 9472, elements: !401)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !563, line: 32, size: 9472, elements: !570)
!570 = !{!571, !580, !584, !585, !592, !596, !597, !598, !599, !600, !601, !602, !626, !630, !635, !641, !660, !665, !669, !670, !675, !680, !681, !686, !688, !692, !696, !700, !704, !705, !706, !707, !708, !712, !713, !718, !719, !720, !721, !722, !727, !734, !739, !743, !747, !751, !755, !756, !760, !761, !768, !773, !774, !775, !776, !838, !846, !847, !851, !852, !856, !857, !861, !866, !867, !871, !875, !882, !883, !884, !885, !886, !887, !892, !893, !897, !901, !905, !906, !907, !911, !921, !922, !926, !927, !931, !932, !936, !937, !942, !943, !947, !951, !952, !953, !954, !955, !956, !957, !961, !962, !963, !964, !965, !966, !970, !971, !972, !973, !974, !975, !976, !977, !981, !985, !986, !987, !991, !992, !993, !994, !995, !996, !997, !1001, !1002, !1003, !1008, !1012, !1013, !1017, !1018, !1019, !1020, !1046, !1050, !1051, !1052, !1053, !1054, !1058, !1059, !1060, !1061, !1062, !1066, !1070, !1071}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !569, file: !563, line: 34, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!366, !560, !405, !575, !405, !575, !577, !579}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !569, file: !563, line: 35, baseType: !581, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!366, !560, !405, !450, !452, !470}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !569, file: !563, line: 36, baseType: !581, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !569, file: !563, line: 37, baseType: !586, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!366, !560, !589, !589}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !569, file: !563, line: 38, baseType: !593, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!366, !560, !589, !589, !589}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !569, file: !563, line: 40, baseType: !586, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !569, file: !563, line: 41, baseType: !593, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !569, file: !563, line: 42, baseType: !586, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !569, file: !563, line: 43, baseType: !593, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !569, file: !563, line: 44, baseType: !586, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !569, file: !563, line: 46, baseType: !593, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !569, file: !563, line: 47, baseType: !603, size: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!366, !560, !606, !606, !610}
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !607, line: 11, baseType: !608)
!607 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !607, line: 11, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !613, file: !36, line: 1227, baseType: !459, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !613, file: !36, line: 1228, baseType: !459, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !613, file: !36, line: 1229, baseType: !459, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !613, file: !36, line: 1230, baseType: !459, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !613, file: !36, line: 1231, baseType: !459, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !613, file: !36, line: 1232, baseType: !459, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !613, file: !36, line: 1233, baseType: !459, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !613, file: !36, line: 1234, baseType: !459, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !613, file: !36, line: 1236, baseType: !459, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !613, file: !36, line: 1237, baseType: !459, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !613, file: !36, line: 1238, baseType: !459, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !569, file: !563, line: 48, baseType: !627, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!366, !560, !606, !610}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !569, file: !563, line: 49, baseType: !631, size: 64, offset: 832)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!366, !560, !589, !459, !634, !459, !405, !405, !589}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !569, file: !563, line: 50, baseType: !636, size: 64, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!366, !560, !639, !640}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !569, file: !563, line: 52, baseType: !642, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!366, !560, !645, !646}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !648, file: !36, line: 593, baseType: !407, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !648, file: !36, line: 594, baseType: !407, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !648, file: !36, line: 594, baseType: !407, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !648, file: !36, line: 594, baseType: !407, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !648, file: !36, line: 595, baseType: !407, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !648, file: !36, line: 596, baseType: !407, size: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !648, file: !36, line: 597, baseType: !407, size: 64, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !648, file: !36, line: 598, baseType: !407, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !648, file: !36, line: 598, baseType: !407, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !648, file: !36, line: 599, baseType: !407, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !569, file: !563, line: 53, baseType: !661, size: 64, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!366, !560, !560, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !569, file: !563, line: 54, baseType: !666, size: 64, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!366, !560, !589}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !569, file: !563, line: 55, baseType: !586, size: 64, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !569, file: !563, line: 56, baseType: !671, size: 64, offset: 1216)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!366, !560, !674, !458}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !569, file: !563, line: 58, baseType: !676, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!366, !560, !679}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !569, file: !563, line: 59, baseType: !676, size: 64, offset: 1344)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !569, file: !563, line: 60, baseType: !682, size: 64, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!366, !560, !685, !520}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !569, file: !563, line: 61, baseType: !687, size: 64, offset: 1472)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !569, file: !563, line: 63, baseType: !689, size: 64, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!366, !560, !405, !575, !468, !589, !589}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !569, file: !563, line: 64, baseType: !693, size: 64, offset: 1600)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!366, !560, !560, !606, !606, !610}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !569, file: !563, line: 65, baseType: !697, size: 64, offset: 1664)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!366, !560, !560, !610}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !569, file: !563, line: 66, baseType: !701, size: 64, offset: 1728)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!366, !560, !560, !606, !610}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !569, file: !563, line: 67, baseType: !697, size: 64, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !569, file: !563, line: 69, baseType: !687, size: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !569, file: !563, line: 70, baseType: !693, size: 64, offset: 1920)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !569, file: !563, line: 71, baseType: !701, size: 64, offset: 1984)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !569, file: !563, line: 72, baseType: !709, size: 64, offset: 2048)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!366, !560, !640}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !569, file: !563, line: 73, baseType: !687, size: 64, offset: 2112)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !569, file: !563, line: 75, baseType: !714, size: 64, offset: 2176)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!366, !560, !717, !640}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !569, file: !563, line: 76, baseType: !586, size: 64, offset: 2240)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !569, file: !563, line: 77, baseType: !586, size: 64, offset: 2304)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !569, file: !563, line: 78, baseType: !603, size: 64, offset: 2368)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !569, file: !563, line: 79, baseType: !627, size: 64, offset: 2432)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !569, file: !563, line: 81, baseType: !723, size: 64, offset: 2496)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!366, !560, !468, !560, !726}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !569, file: !563, line: 82, baseType: !728, size: 64, offset: 2560)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!366, !560, !405, !731, !731, !639, !733}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !569, file: !563, line: 83, baseType: !735, size: 64, offset: 2624)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!366, !560, !405, !738, !405}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !569, file: !563, line: 84, baseType: !740, size: 64, offset: 2688)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!366, !560, !405, !575, !405, !575, !467}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !569, file: !563, line: 85, baseType: !744, size: 64, offset: 2752)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!366, !560, !560, !726}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !569, file: !563, line: 87, baseType: !748, size: 64, offset: 2816)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!366, !560, !589, !450}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !569, file: !563, line: 88, baseType: !752, size: 64, offset: 2880)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!366, !560, !468}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !569, file: !563, line: 89, baseType: !752, size: 64, offset: 2944)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !569, file: !563, line: 90, baseType: !757, size: 64, offset: 3008)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!366, !560, !589, !579}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !569, file: !563, line: 91, baseType: !689, size: 64, offset: 3072)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !569, file: !563, line: 93, baseType: !762, size: 64, offset: 3136)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!366, !560, !765}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !569, file: !563, line: 94, baseType: !769, size: 64, offset: 3200)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!366, !560, !405, !520, !520, !450, !772, !772, !664}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !569, file: !563, line: 95, baseType: !769, size: 64, offset: 3264)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !569, file: !563, line: 96, baseType: !769, size: 64, offset: 3328)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !569, file: !563, line: 97, baseType: !769, size: 64, offset: 3392)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !569, file: !563, line: 99, baseType: !777, size: 64, offset: 3456)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!366, !560, !780, !783}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !607, line: 51, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !607, line: 51, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !563, line: 609, size: 6208, elements: !786)
!786 = !{!787, !788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !807, !814, !815, !816, !817, !818, !819, !820, !821, !825, !826, !827, !828, !829, !831, !832, !833, !834, !835, !836, !837}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !785, file: !563, line: 610, baseType: !566, size: 4480)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !785, file: !563, line: 610, baseType: !789, size: 32, offset: 4480)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !401)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !785, file: !563, line: 611, baseType: !405, size: 32, offset: 4512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !785, file: !563, line: 611, baseType: !405, size: 32, offset: 4544)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !785, file: !563, line: 611, baseType: !405, size: 32, offset: 4576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !785, file: !563, line: 612, baseType: !405, size: 32, offset: 4608)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !785, file: !563, line: 613, baseType: !405, size: 32, offset: 4640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !785, file: !563, line: 614, baseType: !450, size: 64, offset: 4672)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !785, file: !563, line: 615, baseType: !452, size: 64, offset: 4736)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !785, file: !563, line: 616, baseType: !738, size: 64, offset: 4800)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !785, file: !563, line: 617, baseType: !450, size: 64, offset: 4864)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !785, file: !563, line: 618, baseType: !800, size: 64, offset: 4928)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !563, line: 602, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 598, size: 128, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !802, file: !563, line: 599, baseType: !405, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !802, file: !563, line: 600, baseType: !405, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !802, file: !563, line: 601, baseType: !467, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !785, file: !563, line: 619, baseType: !808, size: 64, offset: 4992)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !563, line: 607, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 604, size: 128, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !810, file: !563, line: 605, baseType: !405, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !810, file: !563, line: 606, baseType: !467, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !785, file: !563, line: 620, baseType: !467, size: 64, offset: 5056)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !785, file: !563, line: 621, baseType: !459, size: 64, offset: 5120)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !785, file: !563, line: 622, baseType: !459, size: 64, offset: 5184)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !785, file: !563, line: 623, baseType: !589, size: 64, offset: 5248)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !785, file: !563, line: 623, baseType: !589, size: 64, offset: 5312)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !785, file: !563, line: 623, baseType: !589, size: 64, offset: 5376)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !785, file: !563, line: 624, baseType: !520, size: 32, offset: 5440)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !785, file: !563, line: 625, baseType: !822, size: 64, offset: 5504)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!366}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !785, file: !563, line: 626, baseType: !342, size: 64, offset: 5568)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !785, file: !563, line: 627, baseType: !589, size: 64, offset: 5632)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !785, file: !563, line: 628, baseType: !405, size: 32, offset: 5696)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !785, file: !563, line: 629, baseType: !347, size: 64, offset: 5760)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !785, file: !563, line: 630, baseType: !830, size: 32, offset: 5824)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !785, file: !563, line: 631, baseType: !405, size: 32, offset: 5856)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !785, file: !563, line: 631, baseType: !405, size: 32, offset: 5888)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !785, file: !563, line: 632, baseType: !520, size: 32, offset: 5920)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !785, file: !563, line: 633, baseType: !520, size: 32, offset: 5952)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !785, file: !563, line: 634, baseType: !393, size: 64, offset: 6016)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !785, file: !563, line: 634, baseType: !342, size: 64, offset: 6080)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !785, file: !563, line: 635, baseType: !413, size: 64, offset: 6144)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !569, file: !563, line: 100, baseType: !839, size: 64, offset: 3520)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!366, !560, !405, !405, !842, !845}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !844)
!844 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !569, file: !563, line: 101, baseType: !687, size: 64, offset: 3584)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !569, file: !563, line: 102, baseType: !848, size: 64, offset: 3648)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!366, !560, !606, !606, !640}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !569, file: !563, line: 103, baseType: !572, size: 64, offset: 3712)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !569, file: !563, line: 105, baseType: !853, size: 64, offset: 3776)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!366, !560, !606, !606, !639, !640}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !569, file: !563, line: 106, baseType: !687, size: 64, offset: 3840)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !569, file: !563, line: 107, baseType: !858, size: 64, offset: 3904)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!366, !560, !372}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !569, file: !563, line: 108, baseType: !862, size: 64, offset: 3968)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!366, !560, !865, !639, !640}
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !347)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !569, file: !563, line: 109, baseType: !822, size: 64, offset: 4032)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !569, file: !563, line: 111, baseType: !868, size: 64, offset: 4096)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!366, !560, !560, !560, !459, !560}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !569, file: !563, line: 112, baseType: !872, size: 64, offset: 4160)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!366, !560, !560, !560, !560}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !569, file: !563, line: 113, baseType: !876, size: 64, offset: 4224)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!366, !560, !879, !879}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !607, line: 30, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !607, line: 30, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !569, file: !563, line: 114, baseType: !572, size: 64, offset: 4288)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !569, file: !563, line: 115, baseType: !689, size: 64, offset: 4352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !569, file: !563, line: 117, baseType: !748, size: 64, offset: 4416)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !569, file: !563, line: 118, baseType: !748, size: 64, offset: 4480)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !569, file: !563, line: 119, baseType: !862, size: 64, offset: 4544)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !569, file: !563, line: 120, baseType: !888, size: 64, offset: 4608)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!366, !560, !891, !664}
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !569, file: !563, line: 121, baseType: !822, size: 64, offset: 4672)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !569, file: !563, line: 123, baseType: !894, size: 64, offset: 4736)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!366, !560, !405, !342}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !569, file: !563, line: 124, baseType: !898, size: 64, offset: 4800)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!366, !560, !783, !589, !342}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !569, file: !563, line: 125, baseType: !902, size: 64, offset: 4864)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!366, !496, !560}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !569, file: !563, line: 126, baseType: !586, size: 64, offset: 4928)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !569, file: !563, line: 127, baseType: !586, size: 64, offset: 4992)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !569, file: !563, line: 129, baseType: !908, size: 64, offset: 5056)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!366, !560, !738}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !569, file: !563, line: 130, baseType: !912, size: 64, offset: 5120)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!366, !560, !915, !915}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !917, file: !60, line: 653, baseType: !405, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !917, file: !60, line: 653, baseType: !589, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !569, file: !563, line: 131, baseType: !912, size: 64, offset: 5184)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !569, file: !563, line: 132, baseType: !923, size: 64, offset: 5248)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!366, !560, !450, !450, !450}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !569, file: !563, line: 133, baseType: !858, size: 64, offset: 5312)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !569, file: !563, line: 135, baseType: !928, size: 64, offset: 5376)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!366, !560, !459, !664}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !569, file: !563, line: 136, baseType: !928, size: 64, offset: 5440)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !569, file: !563, line: 137, baseType: !933, size: 64, offset: 5504)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!366, !560, !664}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !569, file: !563, line: 138, baseType: !572, size: 64, offset: 5568)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !569, file: !563, line: 139, baseType: !938, size: 64, offset: 5632)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!366, !560, !941, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !569, file: !563, line: 141, baseType: !822, size: 64, offset: 5696)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !569, file: !563, line: 142, baseType: !944, size: 64, offset: 5760)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!366, !560, !560, !459, !560}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !569, file: !563, line: 143, baseType: !948, size: 64, offset: 5824)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!366, !560, !560, !560}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !569, file: !563, line: 144, baseType: !822, size: 64, offset: 5888)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !569, file: !563, line: 145, baseType: !944, size: 64, offset: 5952)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !569, file: !563, line: 147, baseType: !948, size: 64, offset: 6016)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !569, file: !563, line: 148, baseType: !822, size: 64, offset: 6080)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !569, file: !563, line: 149, baseType: !944, size: 64, offset: 6144)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !569, file: !563, line: 150, baseType: !948, size: 64, offset: 6208)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !569, file: !563, line: 151, baseType: !958, size: 64, offset: 6272)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!366, !560, !520}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !569, file: !563, line: 153, baseType: !687, size: 64, offset: 6336)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !569, file: !563, line: 154, baseType: !687, size: 64, offset: 6400)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !569, file: !563, line: 155, baseType: !687, size: 64, offset: 6464)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !569, file: !563, line: 156, baseType: !687, size: 64, offset: 6528)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !569, file: !563, line: 157, baseType: !858, size: 64, offset: 6592)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !569, file: !563, line: 159, baseType: !967, size: 64, offset: 6656)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!366, !560, !405, !577}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !569, file: !563, line: 160, baseType: !687, size: 64, offset: 6720)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !569, file: !563, line: 161, baseType: !687, size: 64, offset: 6784)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !569, file: !563, line: 162, baseType: !687, size: 64, offset: 6848)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !569, file: !563, line: 163, baseType: !687, size: 64, offset: 6912)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !569, file: !563, line: 165, baseType: !948, size: 64, offset: 6976)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !569, file: !563, line: 166, baseType: !948, size: 64, offset: 7040)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !569, file: !563, line: 167, baseType: !748, size: 64, offset: 7104)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !569, file: !563, line: 168, baseType: !978, size: 64, offset: 7168)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!366, !560, !589, !405}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !569, file: !563, line: 169, baseType: !982, size: 64, offset: 7232)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!366, !560, !664, !450}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !569, file: !563, line: 171, baseType: !709, size: 64, offset: 7296)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !569, file: !563, line: 172, baseType: !687, size: 64, offset: 7360)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !569, file: !563, line: 173, baseType: !988, size: 64, offset: 7424)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!366, !560, !450, !772}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !569, file: !563, line: 174, baseType: !848, size: 64, offset: 7488)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !569, file: !563, line: 175, baseType: !848, size: 64, offset: 7552)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !569, file: !563, line: 177, baseType: !586, size: 64, offset: 7616)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !569, file: !563, line: 178, baseType: !636, size: 64, offset: 7680)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !569, file: !563, line: 179, baseType: !586, size: 64, offset: 7744)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !569, file: !563, line: 180, baseType: !593, size: 64, offset: 7808)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !569, file: !563, line: 181, baseType: !998, size: 64, offset: 7872)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!366, !560, !343, !639, !640}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !569, file: !563, line: 183, baseType: !908, size: 64, offset: 7936)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !569, file: !563, line: 184, baseType: !671, size: 64, offset: 8000)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !569, file: !563, line: 185, baseType: !1004, size: 64, offset: 8064)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!366, !560, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !569, file: !563, line: 186, baseType: !1009, size: 64, offset: 8128)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!366, !560, !405, !575, !467}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !569, file: !563, line: 187, baseType: !728, size: 64, offset: 8192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !569, file: !563, line: 189, baseType: !1014, size: 64, offset: 8256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!366, !560, !405, !405, !450, !577}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !569, file: !563, line: 190, baseType: !822, size: 64, offset: 8320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !569, file: !563, line: 191, baseType: !944, size: 64, offset: 8384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !569, file: !563, line: 192, baseType: !948, size: 64, offset: 8448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !569, file: !563, line: 193, baseType: !1021, size: 64, offset: 8512)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!366, !560, !780, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !563, line: 660, size: 5312, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1026, file: !563, line: 661, baseType: !566, size: 4480)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1026, file: !563, line: 661, baseType: !789, size: 32, offset: 4480)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1026, file: !563, line: 662, baseType: !405, size: 32, offset: 4512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1026, file: !563, line: 662, baseType: !405, size: 32, offset: 4544)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1026, file: !563, line: 662, baseType: !405, size: 32, offset: 4576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1026, file: !563, line: 663, baseType: !405, size: 32, offset: 4608)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1026, file: !563, line: 664, baseType: !405, size: 32, offset: 4640)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1026, file: !563, line: 665, baseType: !450, size: 64, offset: 4672)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1026, file: !563, line: 666, baseType: !450, size: 64, offset: 4736)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1026, file: !563, line: 667, baseType: !405, size: 32, offset: 4800)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1026, file: !563, line: 668, baseType: !830, size: 32, offset: 4832)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1026, file: !563, line: 670, baseType: !450, size: 64, offset: 4864)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1026, file: !563, line: 670, baseType: !450, size: 64, offset: 4928)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1026, file: !563, line: 671, baseType: !450, size: 64, offset: 4992)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1026, file: !563, line: 672, baseType: !450, size: 64, offset: 5056)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1026, file: !563, line: 673, baseType: !450, size: 64, offset: 5120)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1026, file: !563, line: 674, baseType: !405, size: 32, offset: 5184)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1026, file: !563, line: 675, baseType: !450, size: 64, offset: 5248)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !569, file: !563, line: 195, baseType: !1047, size: 64, offset: 8576)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!366, !1024, !560, !560}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !569, file: !563, line: 196, baseType: !1047, size: 64, offset: 8640)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !569, file: !563, line: 197, baseType: !822, size: 64, offset: 8704)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !569, file: !563, line: 198, baseType: !944, size: 64, offset: 8768)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !569, file: !563, line: 199, baseType: !948, size: 64, offset: 8832)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !569, file: !563, line: 201, baseType: !1055, size: 64, offset: 8896)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!366, !560, !405, !405}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !569, file: !563, line: 202, baseType: !723, size: 64, offset: 8960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !569, file: !563, line: 203, baseType: !593, size: 64, offset: 9024)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !569, file: !563, line: 204, baseType: !777, size: 64, offset: 9088)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !569, file: !563, line: 205, baseType: !908, size: 64, offset: 9152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !569, file: !563, line: 206, baseType: !1063, size: 64, offset: 9216)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!366, !343, !560, !405, !639, !640}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !569, file: !563, line: 208, baseType: !1067, size: 64, offset: 9280)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!366, !405, !733}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !569, file: !563, line: 209, baseType: !948, size: 64, offset: 9344)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !569, file: !563, line: 210, baseType: !740, size: 64, offset: 9408)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !562, file: !563, line: 438, baseType: !1073, size: 64, offset: 13952)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !607, line: 60, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1075, file: !114, line: 241, baseType: !343, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1075, file: !114, line: 242, baseType: !422, size: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1075, file: !114, line: 243, baseType: !405, size: 32, offset: 96)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1075, file: !114, line: 243, baseType: !405, size: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1075, file: !114, line: 244, baseType: !405, size: 32, offset: 160)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1075, file: !114, line: 244, baseType: !405, size: 32, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1075, file: !114, line: 245, baseType: !450, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1075, file: !114, line: 246, baseType: !520, size: 32, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1075, file: !114, line: 247, baseType: !405, size: 32, offset: 352)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1075, file: !114, line: 251, baseType: !405, size: 32, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1075, file: !114, line: 252, baseType: !879, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1075, file: !114, line: 253, baseType: !520, size: 32, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1075, file: !114, line: 254, baseType: !405, size: 32, offset: 544)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1075, file: !114, line: 254, baseType: !405, size: 32, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1075, file: !114, line: 255, baseType: !405, size: 32, offset: 608)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !562, file: !563, line: 438, baseType: !1073, size: 64, offset: 14016)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !563, line: 439, baseType: !342, size: 64, offset: 14080)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !562, file: !563, line: 440, baseType: !1095, size: 32, offset: 14144)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !562, file: !563, line: 441, baseType: !520, size: 32, offset: 14176)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !562, file: !563, line: 442, baseType: !520, size: 32, offset: 14208)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !562, file: !563, line: 443, baseType: !1099, size: 448, offset: 14272)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 448, elements: !1101)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !347)
!1101 = !{!1102}
!1102 = !DISubrange(count: 7)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !562, file: !563, line: 444, baseType: !520, size: 32, offset: 14720)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !562, file: !563, line: 445, baseType: !520, size: 32, offset: 14752)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !562, file: !563, line: 446, baseType: !405, size: 32, offset: 14784)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !562, file: !563, line: 447, baseType: !443, size: 64, offset: 14848)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !562, file: !563, line: 448, baseType: !443, size: 64, offset: 14912)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !562, file: !563, line: 449, baseType: !647, size: 640, offset: 14976)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !562, file: !563, line: 450, baseType: !579, size: 32, offset: 15616)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !562, file: !563, line: 451, baseType: !1111, size: 2880, offset: 15680)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !563, line: 318, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !563, line: 319, size: 2880, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1133, !1134, !1139, !1144, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1159, !1160, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1192, !1193, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1216, !1217, !1218, !1222, !1223}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1112, file: !563, line: 320, baseType: !405, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1112, file: !563, line: 321, baseType: !405, size: 32, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1112, file: !563, line: 322, baseType: !405, size: 32, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1112, file: !563, line: 323, baseType: !405, size: 32, offset: 96)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1112, file: !563, line: 324, baseType: !405, size: 32, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1112, file: !563, line: 325, baseType: !405, size: 32, offset: 160)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1112, file: !563, line: 326, baseType: !1121, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !563, line: 293, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !563, line: 295, size: 448, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1123, file: !563, line: 296, baseType: !1121, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1123, file: !563, line: 297, baseType: !467, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1123, file: !563, line: 297, baseType: !467, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1123, file: !563, line: 298, baseType: !450, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1123, file: !563, line: 298, baseType: !450, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1123, file: !563, line: 299, baseType: !405, size: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1123, file: !563, line: 300, baseType: !405, size: 32, offset: 352)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1123, file: !563, line: 301, baseType: !405, size: 32, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1112, file: !563, line: 326, baseType: !1121, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1112, file: !563, line: 328, baseType: !1135, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!366, !560, !1138, !450}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1112, file: !563, line: 329, baseType: !1140, size: 64, offset: 384)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!366, !1138, !1143, !452, !452, !470, !450}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1112, file: !563, line: 330, baseType: !1145, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!366, !1138}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1112, file: !563, line: 331, baseType: !1145, size: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1112, file: !563, line: 334, baseType: !343, size: 64, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !563, line: 335, baseType: !422, size: 32, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1112, file: !563, line: 335, baseType: !422, size: 32, offset: 672)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1112, file: !563, line: 336, baseType: !422, size: 32, offset: 704)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1112, file: !563, line: 336, baseType: !422, size: 32, offset: 736)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1112, file: !563, line: 337, baseType: !1155, size: 64, offset: 768)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !344, line: 339, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !344, line: 339, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1112, file: !563, line: 338, baseType: !1155, size: 64, offset: 832)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1112, file: !563, line: 339, baseType: !1161, size: 64, offset: 896)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !344, line: 341, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !344, line: 351, size: 192, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1163, file: !344, line: 354, baseType: !72, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1163, file: !344, line: 355, baseType: !72, size: 32, offset: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1163, file: !344, line: 356, baseType: !72, size: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1163, file: !344, line: 361, baseType: !72, size: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1163, file: !344, line: 362, baseType: !516, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1112, file: !563, line: 340, baseType: !405, size: 32, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1112, file: !563, line: 340, baseType: !405, size: 32, offset: 992)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1112, file: !563, line: 341, baseType: !467, size: 64, offset: 1024)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1112, file: !563, line: 342, baseType: !450, size: 64, offset: 1088)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1112, file: !563, line: 343, baseType: !470, size: 64, offset: 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1112, file: !563, line: 344, baseType: !452, size: 64, offset: 1216)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1112, file: !563, line: 345, baseType: !405, size: 32, offset: 1280)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1112, file: !563, line: 346, baseType: !1143, size: 64, offset: 1344)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1112, file: !563, line: 347, baseType: !520, size: 32, offset: 1408)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1112, file: !563, line: 348, baseType: !405, size: 32, offset: 1440)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1112, file: !563, line: 351, baseType: !520, size: 32, offset: 1472)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1112, file: !563, line: 352, baseType: !520, size: 32, offset: 1504)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1112, file: !563, line: 353, baseType: !422, size: 32, offset: 1536)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1112, file: !563, line: 354, baseType: !422, size: 32, offset: 1568)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1112, file: !563, line: 355, baseType: !1143, size: 64, offset: 1600)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1112, file: !563, line: 356, baseType: !1143, size: 64, offset: 1664)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1112, file: !563, line: 357, baseType: !1187, size: 64, offset: 1728)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !563, line: 310, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 308, size: 32, elements: !1190)
!1190 = !{!1191}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1189, file: !563, line: 309, baseType: !405, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1112, file: !563, line: 357, baseType: !1187, size: 64, offset: 1792)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1112, file: !563, line: 358, baseType: !1194, size: 64, offset: 1856)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !563, line: 316, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 312, size: 128, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1196, file: !563, line: 313, baseType: !342, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1196, file: !563, line: 314, baseType: !405, size: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1196, file: !563, line: 315, baseType: !349, size: 8, offset: 96)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1112, file: !563, line: 359, baseType: !1194, size: 64, offset: 1920)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1112, file: !563, line: 360, baseType: !1194, size: 64, offset: 1984)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1112, file: !563, line: 361, baseType: !405, size: 32, offset: 2048)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1112, file: !563, line: 362, baseType: !422, size: 32, offset: 2080)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1112, file: !563, line: 363, baseType: !405, size: 32, offset: 2112)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1112, file: !563, line: 364, baseType: !1143, size: 64, offset: 2176)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1112, file: !563, line: 365, baseType: !1161, size: 64, offset: 2240)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1112, file: !563, line: 366, baseType: !422, size: 32, offset: 2304)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1112, file: !563, line: 367, baseType: !422, size: 32, offset: 2336)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1112, file: !563, line: 368, baseType: !1155, size: 64, offset: 2368)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1112, file: !563, line: 369, baseType: !1155, size: 64, offset: 2432)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1112, file: !563, line: 370, baseType: !1213, size: 64, offset: 2496)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1112, file: !563, line: 371, baseType: !1213, size: 64, offset: 2560)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1112, file: !563, line: 372, baseType: !1213, size: 64, offset: 2624)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1112, file: !563, line: 373, baseType: !1219, size: 64, offset: 2688)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !344, line: 331, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !344, line: 331, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1112, file: !563, line: 374, baseType: !516, size: 64, offset: 2752)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1112, file: !563, line: 375, baseType: !1224, size: 64, offset: 2816)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !562, file: !563, line: 451, baseType: !1111, size: 2880, offset: 18560)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !562, file: !563, line: 452, baseType: !1227, size: 64, offset: 21440)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !563, line: 681, size: 4864, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1229, file: !563, line: 682, baseType: !566, size: 4480)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1229, file: !563, line: 682, baseType: !789, size: 32, offset: 4480)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1229, file: !563, line: 683, baseType: !520, size: 32, offset: 4512)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1229, file: !563, line: 684, baseType: !405, size: 32, offset: 4544)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1229, file: !563, line: 685, baseType: !941, size: 64, offset: 4608)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1229, file: !563, line: 686, baseType: !467, size: 64, offset: 4672)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1229, file: !563, line: 687, baseType: !1238, size: 64, offset: 4736)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!366, !1227, !589, !342}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1229, file: !563, line: 688, baseType: !342, size: 64, offset: 4800)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !562, file: !563, line: 453, baseType: !1227, size: 64, offset: 21504)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !562, file: !563, line: 454, baseType: !1227, size: 64, offset: 21568)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !562, file: !563, line: 455, baseType: !405, size: 32, offset: 21632)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !562, file: !563, line: 456, baseType: !520, size: 32, offset: 21664)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !562, file: !563, line: 457, baseType: !1247, size: 320, offset: 21696)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !563, line: 399, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 394, size: 320, elements: !1249)
!1249 = !{!1250, !1251, !1255, !1256}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1248, file: !563, line: 395, baseType: !405, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1248, file: !563, line: 396, baseType: !1252, size: 128, offset: 32)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 128, elements: !1253)
!1253 = !{!1254}
!1254 = !DISubrange(count: 4)
