; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!351 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 624, baseType: !7, size: 32, elements: !353)
!352 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!353 = !{!354, !355, !356, !357}
!354 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!369 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 657, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIEnumerator(name: "PETSC_SUBCOMM_GENERAL", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_SUBCOMM_CONTIGUOUS", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_SUBCOMM_INTERLACED", value: 2, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 180, baseType: !7, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382}
!377 = !DIEnumerator(name: "PC_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!378 = !DIEnumerator(name: "PC_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "PC_COMPOSITE_SYMMETRIC_MULTIPLICATIVE", value: 2, isUnsigned: true)
!380 = !DIEnumerator(name: "PC_COMPOSITE_SPECIAL", value: 3, isUnsigned: true)
!381 = !DIEnumerator(name: "PC_COMPOSITE_SCHUR", value: 4, isUnsigned: true)
!382 = !DIEnumerator(name: "PC_COMPOSITE_GKB", value: 5, isUnsigned: true)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 198, baseType: !7, size: 32, elements: !384)
!384 = !{!385, !386, !387, !388}
!385 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_FACT_DIAG", value: 0, isUnsigned: true)
!386 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_FACT_LOWER", value: 1, isUnsigned: true)
!387 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_FACT_UPPER", value: 2, isUnsigned: true)
!388 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_FACT_FULL", value: 3, isUnsigned: true)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 189, baseType: !7, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_PRE_SELF", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_PRE_SELFP", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_PRE_A11", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_PRE_USER", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "PC_FIELDSPLIT_SCHUR_PRE_FULL", value: 4, isUnsigned: true)
!396 = !{!397, !444, !523, !1787, !1788, !464, !441, !503, !1282, !1789, !513, !74, !1792, !1795, !602, !1820, !459, !598, !1793, !7, !408, !835, !532, !475, !1821}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BDDC", file: !399, line: 191, baseType: !400)
!399 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bddc/bddc.h", directory: "/home/users/ndemeye/xSDK")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 25, size: 9664, elements: !401)
!401 = !{!402, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1551, !1552, !1553, !1554, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1619, !1620, !1621, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pcis", scope: !400, file: !399, line: 27, baseType: !403, size: 2432)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !404, line: 78, baseType: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 2432, elements: !406)
!406 = !{!407, !409, !410, !415, !416, !417, !418, !1392, !1393, !1394, !1395, !1396, !1397, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !405, file: !404, line: 24, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !405, file: !404, line: 25, baseType: !408, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !405, file: !404, line: 26, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !412, line: 11, baseType: !413)
!412 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !412, line: 11, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !405, file: !404, line: 27, baseType: !411, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !405, file: !404, line: 28, baseType: !411, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !405, file: !404, line: 29, baseType: !411, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !405, file: !404, line: 31, baseType: !419, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !422, line: 436, size: 23424, elements: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!423 = !{!424, !632, !1135, !1155, !1156, !1157, !1159, !1160, !1161, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1288, !1289, !1305, !1306, !1307, !1308, !1309, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1344, !1364, !1365, !1367, !1368, !1369, !1370, !1371, !1372, !1390, !1391}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !421, file: !422, line: 437, baseType: !425, size: 4480)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !426, line: 122, baseType: !427)
!426 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !426, line: 73, size: 4480, elements: !428)
!428 = !{!429, !431, !485, !486, !487, !490, !491, !492, !493, !501, !502, !504, !508, !512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !524, !526, !527, !528, !530, !531, !533, !535, !536, !537, !538, !539, !542, !544, !545, !546, !547, !548, !551, !553, !554, !555, !565, !567, !568, !572, !573, !622, !627, !629, !630, !631}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !427, file: !426, line: 74, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !427, file: !426, line: 75, baseType: !432, size: 448, offset: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 448, elements: !483)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !426, line: 53, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 45, size: 448, elements: !435)
!435 = !{!436, !447, !455, !460, !467, !471, !478}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !434, file: !426, line: 46, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !441, !443}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !352, line: 330, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !352, line: 330, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !434, file: !426, line: 47, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!440, !441, !451}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !452, line: 16, baseType: !453)
!452 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !452, line: 16, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !434, file: !426, line: 48, baseType: !456, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!440, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !434, file: !426, line: 49, baseType: !461, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!440, !441, !464, !441}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !434, file: !426, line: 50, baseType: !468, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!440, !441, !464, !459}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !434, file: !426, line: 51, baseType: !472, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!440, !441, !464, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !434, file: !426, line: 52, baseType: !479, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!440, !441, !464, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!483 = !{!484}
!484 = !DISubrange(count: 1)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !427, file: !426, line: 76, baseType: !444, size: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !426, line: 77, baseType: !408, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !427, file: !426, line: 78, baseType: !488, size: 64, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !489)
!489 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !427, file: !426, line: 78, baseType: !488, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !427, file: !426, line: 78, baseType: !488, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !427, file: !426, line: 78, baseType: !488, size: 64, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !427, file: !426, line: 79, baseType: !494, size: 64, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !497, line: 27, baseType: !498)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !499, line: 43, baseType: !500)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!500 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !427, file: !426, line: 80, baseType: !408, size: 32, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !427, file: !426, line: 81, baseType: !503, size: 32, offset: 992)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !427, file: !426, line: 82, baseType: !505, size: 64, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !427, file: !426, line: 83, baseType: !509, size: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !427, file: !426, line: 84, baseType: !513, size: 64, offset: 1152)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !427, file: !426, line: 85, baseType: !513, size: 64, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !427, file: !426, line: 86, baseType: !513, size: 64, offset: 1280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !427, file: !426, line: 87, baseType: !513, size: 64, offset: 1344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !427, file: !426, line: 88, baseType: !441, size: 64, offset: 1408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !427, file: !426, line: 89, baseType: !494, size: 64, offset: 1472)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !426, line: 90, baseType: !513, size: 64, offset: 1536)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !427, file: !426, line: 91, baseType: !513, size: 64, offset: 1600)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !427, file: !426, line: 92, baseType: !408, size: 32, offset: 1664)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !427, file: !426, line: 93, baseType: !523, size: 64, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !426, line: 94, baseType: !525, size: 64, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !495)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !427, file: !426, line: 95, baseType: !408, size: 32, offset: 1856)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !427, file: !426, line: 95, baseType: !408, size: 32, offset: 1888)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !427, file: !426, line: 96, baseType: !529, size: 64, offset: 1920)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !427, file: !426, line: 96, baseType: !529, size: 64, offset: 1984)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !427, file: !426, line: 97, baseType: !532, size: 64, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !427, file: !426, line: 97, baseType: !534, size: 64, offset: 2112)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !427, file: !426, line: 98, baseType: !408, size: 32, offset: 2176)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !427, file: !426, line: 98, baseType: !408, size: 32, offset: 2208)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !427, file: !426, line: 99, baseType: !529, size: 64, offset: 2240)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !427, file: !426, line: 99, baseType: !529, size: 64, offset: 2304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !427, file: !426, line: 100, baseType: !540, size: 64, offset: 2368)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !489)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !427, file: !426, line: 100, baseType: !543, size: 64, offset: 2432)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !427, file: !426, line: 101, baseType: !408, size: 32, offset: 2496)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !427, file: !426, line: 101, baseType: !408, size: 32, offset: 2528)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !427, file: !426, line: 102, baseType: !529, size: 64, offset: 2560)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !427, file: !426, line: 102, baseType: !529, size: 64, offset: 2624)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !427, file: !426, line: 103, baseType: !549, size: 64, offset: 2688)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !541)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !427, file: !426, line: 103, baseType: !552, size: 64, offset: 2752)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !427, file: !426, line: 104, baseType: !482, size: 64, offset: 2816)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !427, file: !426, line: 105, baseType: !408, size: 32, offset: 2880)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !427, file: !426, line: 106, baseType: !556, size: 128, offset: 2944)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 128, elements: !563)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !426, line: 64, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 61, size: 128, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !559, file: !426, line: 62, baseType: !475, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !559, file: !426, line: 63, baseType: !523, size: 64, offset: 64)
!563 = !{!564}
!564 = !DISubrange(count: 2)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !427, file: !426, line: 107, baseType: !566, size: 64, offset: 3072)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 64, elements: !563)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !427, file: !426, line: 108, baseType: !523, size: 64, offset: 3136)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !427, file: !426, line: 109, baseType: !569, size: 64, offset: 3200)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!440, !523}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !427, file: !426, line: 111, baseType: !408, size: 32, offset: 3264)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !427, file: !426, line: 112, baseType: !574, size: 320, offset: 3328)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !620)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!440, !578, !441, !523}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !581)
!581 = !{!582, !583, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !580, file: !12, line: 100, baseType: !408, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !12, line: 101, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !595, !596, !597, !601, !603, !605, !606, !607}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !586, file: !12, line: 84, baseType: !513, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !586, file: !12, line: 85, baseType: !513, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !12, line: 86, baseType: !523, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !586, file: !12, line: 87, baseType: !505, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !586, file: !12, line: 88, baseType: !593, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !586, file: !12, line: 89, baseType: !466, size: 8, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !586, file: !12, line: 90, baseType: !513, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !586, file: !12, line: 91, baseType: !598, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !599, line: 46, baseType: !600)
!599 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!600 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !586, file: !12, line: 92, baseType: !602, size: 32, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !12, line: 93, baseType: !604, size: 32, offset: 544)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !12, line: 94, baseType: !584, size: 64, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !586, file: !12, line: 95, baseType: !513, size: 64, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !586, file: !12, line: 96, baseType: !523, size: 64, offset: 704)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !580, file: !12, line: 102, baseType: !513, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !580, file: !12, line: 102, baseType: !513, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !580, file: !12, line: 103, baseType: !513, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !580, file: !12, line: 104, baseType: !444, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !580, file: !12, line: 105, baseType: !602, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !580, file: !12, line: 105, baseType: !602, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !580, file: !12, line: 105, baseType: !602, size: 32, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !580, file: !12, line: 106, baseType: !441, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !580, file: !12, line: 107, baseType: !617, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!620 = !{!621}
!621 = !DISubrange(count: 5)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !427, file: !426, line: 113, baseType: !623, size: 320, offset: 3648)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 320, elements: !620)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!440, !441, !523}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !427, file: !426, line: 114, baseType: !628, size: 320, offset: 3968)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !620)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !427, file: !426, line: 115, baseType: !602, size: 32, offset: 4288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !427, file: !426, line: 120, baseType: !617, size: 64, offset: 4352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !427, file: !426, line: 121, baseType: !602, size: 32, offset: 4416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !421, file: !422, line: 437, baseType: !633, size: 9472, offset: 4480)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 9472, elements: !483)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !422, line: 32, size: 9472, elements: !635)
!635 = !{!636, !645, !649, !650, !657, !661, !662, !663, !664, !665, !666, !667, !687, !691, !696, !702, !721, !726, !730, !731, !736, !741, !742, !747, !751, !755, !759, !763, !767, !768, !769, !770, !771, !775, !776, !781, !782, !783, !784, !785, !790, !797, !802, !806, !810, !814, !818, !819, !823, !824, !831, !836, !837, !838, !839, !901, !909, !910, !914, !915, !919, !920, !924, !929, !930, !934, !938, !945, !946, !947, !948, !949, !950, !955, !956, !960, !964, !968, !969, !970, !974, !984, !985, !989, !990, !994, !995, !999, !1000, !1005, !1006, !1010, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1044, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1064, !1065, !1066, !1071, !1075, !1076, !1080, !1081, !1082, !1083, !1109, !1113, !1114, !1115, !1116, !1117, !1121, !1122, !1123, !1124, !1125, !1129, !1133, !1134}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !634, file: !422, line: 34, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!440, !419, !408, !640, !408, !640, !642, !644}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !634, file: !422, line: 35, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!440, !419, !408, !532, !534, !552}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !634, file: !422, line: 36, baseType: !646, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !634, file: !422, line: 37, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!440, !419, !654, !654}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !634, file: !422, line: 38, baseType: !658, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!440, !419, !654, !654, !654}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !634, file: !422, line: 40, baseType: !651, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !634, file: !422, line: 41, baseType: !658, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !634, file: !422, line: 42, baseType: !651, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !634, file: !422, line: 43, baseType: !658, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !634, file: !422, line: 44, baseType: !651, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !634, file: !422, line: 46, baseType: !658, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !634, file: !422, line: 47, baseType: !668, size: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!440, !419, !411, !411, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !674, file: !38, line: 1227, baseType: !541, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !674, file: !38, line: 1228, baseType: !541, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !674, file: !38, line: 1229, baseType: !541, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !674, file: !38, line: 1230, baseType: !541, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !674, file: !38, line: 1231, baseType: !541, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !674, file: !38, line: 1232, baseType: !541, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !674, file: !38, line: 1233, baseType: !541, size: 64, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !674, file: !38, line: 1234, baseType: !541, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !674, file: !38, line: 1236, baseType: !541, size: 64, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !674, file: !38, line: 1237, baseType: !541, size: 64, offset: 576)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !674, file: !38, line: 1238, baseType: !541, size: 64, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !634, file: !422, line: 48, baseType: !688, size: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!440, !419, !411, !671}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !634, file: !422, line: 49, baseType: !692, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!440, !419, !654, !541, !695, !541, !408, !408, !654}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !634, file: !422, line: 50, baseType: !697, size: 64, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!440, !419, !700, !701}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !634, file: !422, line: 52, baseType: !703, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!440, !419, !706, !707}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !709, file: !38, line: 593, baseType: !488, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !709, file: !38, line: 594, baseType: !488, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !709, file: !38, line: 594, baseType: !488, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !709, file: !38, line: 594, baseType: !488, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !709, file: !38, line: 595, baseType: !488, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !709, file: !38, line: 596, baseType: !488, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !709, file: !38, line: 597, baseType: !488, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !709, file: !38, line: 598, baseType: !488, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !709, file: !38, line: 598, baseType: !488, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !709, file: !38, line: 599, baseType: !488, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !634, file: !422, line: 53, baseType: !722, size: 64, offset: 1024)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!440, !419, !419, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !634, file: !422, line: 54, baseType: !727, size: 64, offset: 1088)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!440, !419, !654}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !634, file: !422, line: 55, baseType: !651, size: 64, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !634, file: !422, line: 56, baseType: !732, size: 64, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!440, !419, !735, !540}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !634, file: !422, line: 58, baseType: !737, size: 64, offset: 1280)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!440, !419, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !634, file: !422, line: 59, baseType: !737, size: 64, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !634, file: !422, line: 60, baseType: !743, size: 64, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!440, !419, !746, !602}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !634, file: !422, line: 61, baseType: !748, size: 64, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!440, !419}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !634, file: !422, line: 63, baseType: !752, size: 64, offset: 1536)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!440, !419, !408, !640, !550, !654, !654}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !634, file: !422, line: 64, baseType: !756, size: 64, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!440, !419, !419, !411, !411, !671}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !634, file: !422, line: 65, baseType: !760, size: 64, offset: 1664)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!440, !419, !419, !671}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !634, file: !422, line: 66, baseType: !764, size: 64, offset: 1728)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!440, !419, !419, !411, !671}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !634, file: !422, line: 67, baseType: !760, size: 64, offset: 1792)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !634, file: !422, line: 69, baseType: !748, size: 64, offset: 1856)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !634, file: !422, line: 70, baseType: !756, size: 64, offset: 1920)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !634, file: !422, line: 71, baseType: !764, size: 64, offset: 1984)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !634, file: !422, line: 72, baseType: !772, size: 64, offset: 2048)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!440, !419, !701}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !634, file: !422, line: 73, baseType: !748, size: 64, offset: 2112)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !634, file: !422, line: 75, baseType: !777, size: 64, offset: 2176)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!440, !419, !780, !701}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !634, file: !422, line: 76, baseType: !651, size: 64, offset: 2240)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !634, file: !422, line: 77, baseType: !651, size: 64, offset: 2304)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !634, file: !422, line: 78, baseType: !668, size: 64, offset: 2368)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !634, file: !422, line: 79, baseType: !688, size: 64, offset: 2432)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !634, file: !422, line: 81, baseType: !786, size: 64, offset: 2496)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!440, !419, !550, !419, !789}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !634, file: !422, line: 82, baseType: !791, size: 64, offset: 2560)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!440, !419, !408, !794, !794, !700, !796}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !634, file: !422, line: 83, baseType: !798, size: 64, offset: 2624)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!440, !419, !408, !801, !408}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !634, file: !422, line: 84, baseType: !803, size: 64, offset: 2688)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!440, !419, !408, !640, !408, !640, !549}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !634, file: !422, line: 85, baseType: !807, size: 64, offset: 2752)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!440, !419, !419, !789}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !634, file: !422, line: 87, baseType: !811, size: 64, offset: 2816)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!440, !419, !654, !532}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !634, file: !422, line: 88, baseType: !815, size: 64, offset: 2880)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!440, !419, !550}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !634, file: !422, line: 89, baseType: !815, size: 64, offset: 2944)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !634, file: !422, line: 90, baseType: !820, size: 64, offset: 3008)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!440, !419, !654, !644}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !634, file: !422, line: 91, baseType: !752, size: 64, offset: 3072)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !634, file: !422, line: 93, baseType: !825, size: 64, offset: 3136)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!440, !419, !828}
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !634, file: !422, line: 94, baseType: !832, size: 64, offset: 3200)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!440, !419, !408, !602, !602, !532, !835, !835, !725}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !634, file: !422, line: 95, baseType: !832, size: 64, offset: 3264)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !634, file: !422, line: 96, baseType: !832, size: 64, offset: 3328)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !634, file: !422, line: 97, baseType: !832, size: 64, offset: 3392)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !634, file: !422, line: 99, baseType: !840, size: 64, offset: 3456)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!440, !419, !843, !846}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !412, line: 51, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !412, line: 51, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !422, line: 609, size: 6208, elements: !849)
!849 = !{!850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !870, !877, !878, !879, !880, !881, !882, !883, !884, !888, !889, !890, !891, !892, !894, !895, !896, !897, !898, !899, !900}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !848, file: !422, line: 610, baseType: !425, size: 4480)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !848, file: !422, line: 610, baseType: !852, size: 32, offset: 4480)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !483)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !848, file: !422, line: 611, baseType: !408, size: 32, offset: 4512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !848, file: !422, line: 611, baseType: !408, size: 32, offset: 4544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !848, file: !422, line: 611, baseType: !408, size: 32, offset: 4576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !848, file: !422, line: 612, baseType: !408, size: 32, offset: 4608)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !848, file: !422, line: 613, baseType: !408, size: 32, offset: 4640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !848, file: !422, line: 614, baseType: !532, size: 64, offset: 4672)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !848, file: !422, line: 615, baseType: !534, size: 64, offset: 4736)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !848, file: !422, line: 616, baseType: !801, size: 64, offset: 4800)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !848, file: !422, line: 617, baseType: !532, size: 64, offset: 4864)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !848, file: !422, line: 618, baseType: !863, size: 64, offset: 4928)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !422, line: 602, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 598, size: 128, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !865, file: !422, line: 599, baseType: !408, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !865, file: !422, line: 600, baseType: !408, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !865, file: !422, line: 601, baseType: !549, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !848, file: !422, line: 619, baseType: !871, size: 64, offset: 4992)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !422, line: 607, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 604, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !873, file: !422, line: 605, baseType: !408, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !873, file: !422, line: 606, baseType: !549, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !848, file: !422, line: 620, baseType: !549, size: 64, offset: 5056)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !848, file: !422, line: 621, baseType: !541, size: 64, offset: 5120)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !848, file: !422, line: 622, baseType: !541, size: 64, offset: 5184)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !848, file: !422, line: 623, baseType: !654, size: 64, offset: 5248)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !848, file: !422, line: 623, baseType: !654, size: 64, offset: 5312)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !848, file: !422, line: 623, baseType: !654, size: 64, offset: 5376)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !848, file: !422, line: 624, baseType: !602, size: 32, offset: 5440)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !848, file: !422, line: 625, baseType: !885, size: 64, offset: 5504)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!440}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !848, file: !422, line: 626, baseType: !523, size: 64, offset: 5568)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !848, file: !422, line: 627, baseType: !654, size: 64, offset: 5632)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !848, file: !422, line: 628, baseType: !408, size: 32, offset: 5696)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !848, file: !422, line: 629, baseType: !464, size: 64, offset: 5760)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !848, file: !422, line: 630, baseType: !893, size: 32, offset: 5824)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !848, file: !422, line: 631, baseType: !408, size: 32, offset: 5856)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !848, file: !422, line: 631, baseType: !408, size: 32, offset: 5888)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !848, file: !422, line: 632, baseType: !602, size: 32, offset: 5920)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !848, file: !422, line: 633, baseType: !602, size: 32, offset: 5952)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !848, file: !422, line: 634, baseType: !475, size: 64, offset: 6016)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !848, file: !422, line: 634, baseType: !523, size: 64, offset: 6080)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !848, file: !422, line: 635, baseType: !494, size: 64, offset: 6144)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !634, file: !422, line: 100, baseType: !902, size: 64, offset: 3520)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!440, !419, !408, !408, !905, !908}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !907)
!907 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !634, file: !422, line: 101, baseType: !748, size: 64, offset: 3584)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !634, file: !422, line: 102, baseType: !911, size: 64, offset: 3648)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!440, !419, !411, !411, !701}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !634, file: !422, line: 103, baseType: !637, size: 64, offset: 3712)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !634, file: !422, line: 105, baseType: !916, size: 64, offset: 3776)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!440, !419, !411, !411, !700, !701}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !634, file: !422, line: 106, baseType: !748, size: 64, offset: 3840)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !634, file: !422, line: 107, baseType: !921, size: 64, offset: 3904)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!440, !419, !451}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !634, file: !422, line: 108, baseType: !925, size: 64, offset: 3968)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!440, !419, !928, !700, !701}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !464)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !634, file: !422, line: 109, baseType: !885, size: 64, offset: 4032)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !634, file: !422, line: 111, baseType: !931, size: 64, offset: 4096)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!440, !419, !419, !419, !541, !419}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !634, file: !422, line: 112, baseType: !935, size: 64, offset: 4160)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!440, !419, !419, !419, !419}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !634, file: !422, line: 113, baseType: !939, size: 64, offset: 4224)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!440, !419, !942, !942}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !412, line: 30, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !412, line: 30, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !634, file: !422, line: 114, baseType: !637, size: 64, offset: 4288)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !634, file: !422, line: 115, baseType: !752, size: 64, offset: 4352)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !634, file: !422, line: 117, baseType: !811, size: 64, offset: 4416)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !634, file: !422, line: 118, baseType: !811, size: 64, offset: 4480)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !634, file: !422, line: 119, baseType: !925, size: 64, offset: 4544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !634, file: !422, line: 120, baseType: !951, size: 64, offset: 4608)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!440, !419, !954, !725}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !634, file: !422, line: 121, baseType: !885, size: 64, offset: 4672)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !634, file: !422, line: 123, baseType: !957, size: 64, offset: 4736)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!440, !419, !408, !523}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !634, file: !422, line: 124, baseType: !961, size: 64, offset: 4800)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!440, !419, !846, !654, !523}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !634, file: !422, line: 125, baseType: !965, size: 64, offset: 4864)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!440, !578, !419}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !634, file: !422, line: 126, baseType: !651, size: 64, offset: 4928)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !634, file: !422, line: 127, baseType: !651, size: 64, offset: 4992)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !634, file: !422, line: 129, baseType: !971, size: 64, offset: 5056)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!440, !419, !801}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !634, file: !422, line: 130, baseType: !975, size: 64, offset: 5120)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!440, !419, !978, !978}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !980, file: !62, line: 653, baseType: !408, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !980, file: !62, line: 653, baseType: !654, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !634, file: !422, line: 131, baseType: !975, size: 64, offset: 5184)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !634, file: !422, line: 132, baseType: !986, size: 64, offset: 5248)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!440, !419, !532, !532, !532}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !634, file: !422, line: 133, baseType: !921, size: 64, offset: 5312)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !634, file: !422, line: 135, baseType: !991, size: 64, offset: 5376)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!440, !419, !541, !725}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !634, file: !422, line: 136, baseType: !991, size: 64, offset: 5440)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !634, file: !422, line: 137, baseType: !996, size: 64, offset: 5504)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!440, !419, !725}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !634, file: !422, line: 138, baseType: !637, size: 64, offset: 5568)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !634, file: !422, line: 139, baseType: !1001, size: 64, offset: 5632)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!440, !419, !1004, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !634, file: !422, line: 141, baseType: !885, size: 64, offset: 5696)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !634, file: !422, line: 142, baseType: !1007, size: 64, offset: 5760)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!440, !419, !419, !541, !419}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !634, file: !422, line: 143, baseType: !1011, size: 64, offset: 5824)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!440, !419, !419, !419}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !634, file: !422, line: 144, baseType: !885, size: 64, offset: 5888)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !634, file: !422, line: 145, baseType: !1007, size: 64, offset: 5952)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !634, file: !422, line: 147, baseType: !1011, size: 64, offset: 6016)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !634, file: !422, line: 148, baseType: !885, size: 64, offset: 6080)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !634, file: !422, line: 149, baseType: !1007, size: 64, offset: 6144)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !634, file: !422, line: 150, baseType: !1011, size: 64, offset: 6208)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !634, file: !422, line: 151, baseType: !1021, size: 64, offset: 6272)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!440, !419, !602}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !634, file: !422, line: 153, baseType: !748, size: 64, offset: 6336)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !634, file: !422, line: 154, baseType: !748, size: 64, offset: 6400)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !634, file: !422, line: 155, baseType: !748, size: 64, offset: 6464)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !634, file: !422, line: 156, baseType: !748, size: 64, offset: 6528)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !634, file: !422, line: 157, baseType: !921, size: 64, offset: 6592)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !634, file: !422, line: 159, baseType: !1030, size: 64, offset: 6656)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!440, !419, !408, !642}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !634, file: !422, line: 160, baseType: !748, size: 64, offset: 6720)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !634, file: !422, line: 161, baseType: !748, size: 64, offset: 6784)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !634, file: !422, line: 162, baseType: !748, size: 64, offset: 6848)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !634, file: !422, line: 163, baseType: !748, size: 64, offset: 6912)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !634, file: !422, line: 165, baseType: !1011, size: 64, offset: 6976)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !634, file: !422, line: 166, baseType: !1011, size: 64, offset: 7040)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !634, file: !422, line: 167, baseType: !811, size: 64, offset: 7104)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !634, file: !422, line: 168, baseType: !1041, size: 64, offset: 7168)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!440, !419, !654, !408}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !634, file: !422, line: 169, baseType: !1045, size: 64, offset: 7232)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!440, !419, !725, !532}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !634, file: !422, line: 171, baseType: !772, size: 64, offset: 7296)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !634, file: !422, line: 172, baseType: !748, size: 64, offset: 7360)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !634, file: !422, line: 173, baseType: !1051, size: 64, offset: 7424)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!440, !419, !532, !835}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !634, file: !422, line: 174, baseType: !911, size: 64, offset: 7488)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !634, file: !422, line: 175, baseType: !911, size: 64, offset: 7552)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !634, file: !422, line: 177, baseType: !651, size: 64, offset: 7616)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !634, file: !422, line: 178, baseType: !697, size: 64, offset: 7680)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !634, file: !422, line: 179, baseType: !651, size: 64, offset: 7744)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !634, file: !422, line: 180, baseType: !658, size: 64, offset: 7808)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !634, file: !422, line: 181, baseType: !1061, size: 64, offset: 7872)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!440, !419, !444, !700, !701}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !634, file: !422, line: 183, baseType: !971, size: 64, offset: 7936)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !634, file: !422, line: 184, baseType: !732, size: 64, offset: 8000)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !634, file: !422, line: 185, baseType: !1067, size: 64, offset: 8064)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!440, !419, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !634, file: !422, line: 186, baseType: !1072, size: 64, offset: 8128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!440, !419, !408, !640, !549}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !634, file: !422, line: 187, baseType: !791, size: 64, offset: 8192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !634, file: !422, line: 189, baseType: !1077, size: 64, offset: 8256)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!440, !419, !408, !408, !532, !642}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !634, file: !422, line: 190, baseType: !885, size: 64, offset: 8320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !634, file: !422, line: 191, baseType: !1007, size: 64, offset: 8384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !634, file: !422, line: 192, baseType: !1011, size: 64, offset: 8448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !634, file: !422, line: 193, baseType: !1084, size: 64, offset: 8512)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!440, !419, !843, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !422, line: 660, size: 5312, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1089, file: !422, line: 661, baseType: !425, size: 4480)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1089, file: !422, line: 661, baseType: !852, size: 32, offset: 4480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1089, file: !422, line: 662, baseType: !408, size: 32, offset: 4512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1089, file: !422, line: 662, baseType: !408, size: 32, offset: 4544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1089, file: !422, line: 662, baseType: !408, size: 32, offset: 4576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1089, file: !422, line: 663, baseType: !408, size: 32, offset: 4608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1089, file: !422, line: 664, baseType: !408, size: 32, offset: 4640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1089, file: !422, line: 665, baseType: !532, size: 64, offset: 4672)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1089, file: !422, line: 666, baseType: !532, size: 64, offset: 4736)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1089, file: !422, line: 667, baseType: !408, size: 32, offset: 4800)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1089, file: !422, line: 668, baseType: !893, size: 32, offset: 4832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1089, file: !422, line: 670, baseType: !532, size: 64, offset: 4864)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1089, file: !422, line: 670, baseType: !532, size: 64, offset: 4928)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1089, file: !422, line: 671, baseType: !532, size: 64, offset: 4992)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1089, file: !422, line: 672, baseType: !532, size: 64, offset: 5056)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1089, file: !422, line: 673, baseType: !532, size: 64, offset: 5120)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1089, file: !422, line: 674, baseType: !408, size: 32, offset: 5184)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1089, file: !422, line: 675, baseType: !532, size: 64, offset: 5248)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !634, file: !422, line: 195, baseType: !1110, size: 64, offset: 8576)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!440, !1087, !419, !419}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !634, file: !422, line: 196, baseType: !1110, size: 64, offset: 8640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !634, file: !422, line: 197, baseType: !885, size: 64, offset: 8704)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !634, file: !422, line: 198, baseType: !1007, size: 64, offset: 8768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !634, file: !422, line: 199, baseType: !1011, size: 64, offset: 8832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !634, file: !422, line: 201, baseType: !1118, size: 64, offset: 8896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!440, !419, !408, !408}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !634, file: !422, line: 202, baseType: !786, size: 64, offset: 8960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !634, file: !422, line: 203, baseType: !658, size: 64, offset: 9024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !634, file: !422, line: 204, baseType: !840, size: 64, offset: 9088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !634, file: !422, line: 205, baseType: !971, size: 64, offset: 9152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !634, file: !422, line: 206, baseType: !1126, size: 64, offset: 9216)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!440, !444, !419, !408, !700, !701}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !634, file: !422, line: 208, baseType: !1130, size: 64, offset: 9280)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!440, !408, !796}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !634, file: !422, line: 209, baseType: !1011, size: 64, offset: 9344)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !634, file: !422, line: 210, baseType: !803, size: 64, offset: 9408)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !421, file: !422, line: 438, baseType: !1136, size: 64, offset: 13952)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !412, line: 60, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1138, file: !116, line: 241, baseType: !444, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !116, line: 242, baseType: !503, size: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1138, file: !116, line: 243, baseType: !408, size: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1138, file: !116, line: 243, baseType: !408, size: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1138, file: !116, line: 244, baseType: !408, size: 32, offset: 160)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1138, file: !116, line: 244, baseType: !408, size: 32, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1138, file: !116, line: 245, baseType: !532, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1138, file: !116, line: 246, baseType: !602, size: 32, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1138, file: !116, line: 247, baseType: !408, size: 32, offset: 352)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1138, file: !116, line: 251, baseType: !408, size: 32, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1138, file: !116, line: 252, baseType: !942, size: 64, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1138, file: !116, line: 253, baseType: !602, size: 32, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1138, file: !116, line: 254, baseType: !408, size: 32, offset: 544)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1138, file: !116, line: 254, baseType: !408, size: 32, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1138, file: !116, line: 255, baseType: !408, size: 32, offset: 608)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !421, file: !422, line: 438, baseType: !1136, size: 64, offset: 14016)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !422, line: 439, baseType: !523, size: 64, offset: 14080)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !421, file: !422, line: 440, baseType: !1158, size: 32, offset: 14144)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !421, file: !422, line: 441, baseType: !602, size: 32, offset: 14176)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !421, file: !422, line: 442, baseType: !602, size: 32, offset: 14208)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !421, file: !422, line: 443, baseType: !1162, size: 448, offset: 14272)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 448, elements: !1164)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !464)
!1164 = !{!1165}
!1165 = !DISubrange(count: 7)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !421, file: !422, line: 444, baseType: !602, size: 32, offset: 14720)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !421, file: !422, line: 445, baseType: !602, size: 32, offset: 14752)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !421, file: !422, line: 446, baseType: !408, size: 32, offset: 14784)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !421, file: !422, line: 447, baseType: !525, size: 64, offset: 14848)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !421, file: !422, line: 448, baseType: !525, size: 64, offset: 14912)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !421, file: !422, line: 449, baseType: !708, size: 640, offset: 14976)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !421, file: !422, line: 450, baseType: !644, size: 32, offset: 15616)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !421, file: !422, line: 451, baseType: !1174, size: 2880, offset: 15680)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !422, line: 318, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !422, line: 319, size: 2880, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1196, !1197, !1202, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1222, !1223, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1255, !1256, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1279, !1280, !1281, !1285, !1286}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1175, file: !422, line: 320, baseType: !408, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1175, file: !422, line: 321, baseType: !408, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1175, file: !422, line: 322, baseType: !408, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1175, file: !422, line: 323, baseType: !408, size: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1175, file: !422, line: 324, baseType: !408, size: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1175, file: !422, line: 325, baseType: !408, size: 32, offset: 160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1175, file: !422, line: 326, baseType: !1184, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !422, line: 293, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !422, line: 295, size: 448, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1186, file: !422, line: 296, baseType: !1184, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1186, file: !422, line: 297, baseType: !549, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1186, file: !422, line: 297, baseType: !549, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1186, file: !422, line: 298, baseType: !532, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1186, file: !422, line: 298, baseType: !532, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1186, file: !422, line: 299, baseType: !408, size: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1186, file: !422, line: 300, baseType: !408, size: 32, offset: 352)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1186, file: !422, line: 301, baseType: !408, size: 32, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1175, file: !422, line: 326, baseType: !1184, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1175, file: !422, line: 328, baseType: !1198, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!440, !419, !1201, !532}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1175, file: !422, line: 329, baseType: !1203, size: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!440, !1201, !1206, !534, !534, !552, !532}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1175, file: !422, line: 330, baseType: !1208, size: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!440, !1201}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1175, file: !422, line: 331, baseType: !1208, size: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1175, file: !422, line: 334, baseType: !444, size: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !422, line: 335, baseType: !503, size: 32, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1175, file: !422, line: 335, baseType: !503, size: 32, offset: 672)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1175, file: !422, line: 336, baseType: !503, size: 32, offset: 704)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1175, file: !422, line: 336, baseType: !503, size: 32, offset: 736)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1175, file: !422, line: 337, baseType: !1218, size: 64, offset: 768)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !352, line: 339, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !352, line: 339, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1175, file: !422, line: 338, baseType: !1218, size: 64, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1175, file: !422, line: 339, baseType: !1224, size: 64, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !352, line: 341, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !352, line: 351, size: 192, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1226, file: !352, line: 354, baseType: !74, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1226, file: !352, line: 355, baseType: !74, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1226, file: !352, line: 356, baseType: !74, size: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1226, file: !352, line: 361, baseType: !74, size: 32, offset: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1226, file: !352, line: 362, baseType: !598, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1175, file: !422, line: 340, baseType: !408, size: 32, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1175, file: !422, line: 340, baseType: !408, size: 32, offset: 992)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1175, file: !422, line: 341, baseType: !549, size: 64, offset: 1024)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1175, file: !422, line: 342, baseType: !532, size: 64, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1175, file: !422, line: 343, baseType: !552, size: 64, offset: 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1175, file: !422, line: 344, baseType: !534, size: 64, offset: 1216)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1175, file: !422, line: 345, baseType: !408, size: 32, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1175, file: !422, line: 346, baseType: !1206, size: 64, offset: 1344)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1175, file: !422, line: 347, baseType: !602, size: 32, offset: 1408)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1175, file: !422, line: 348, baseType: !408, size: 32, offset: 1440)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1175, file: !422, line: 351, baseType: !602, size: 32, offset: 1472)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1175, file: !422, line: 352, baseType: !602, size: 32, offset: 1504)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1175, file: !422, line: 353, baseType: !503, size: 32, offset: 1536)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1175, file: !422, line: 354, baseType: !503, size: 32, offset: 1568)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1175, file: !422, line: 355, baseType: !1206, size: 64, offset: 1600)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1175, file: !422, line: 356, baseType: !1206, size: 64, offset: 1664)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1175, file: !422, line: 357, baseType: !1250, size: 64, offset: 1728)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !422, line: 310, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 308, size: 32, elements: !1253)
!1253 = !{!1254}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1252, file: !422, line: 309, baseType: !408, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1175, file: !422, line: 357, baseType: !1250, size: 64, offset: 1792)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1175, file: !422, line: 358, baseType: !1257, size: 64, offset: 1856)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !422, line: 316, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 312, size: 128, elements: !1260)
!1260 = !{!1261, !1262, !1263}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1259, file: !422, line: 313, baseType: !523, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1259, file: !422, line: 314, baseType: !408, size: 32, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1259, file: !422, line: 315, baseType: !466, size: 8, offset: 96)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1175, file: !422, line: 359, baseType: !1257, size: 64, offset: 1920)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1175, file: !422, line: 360, baseType: !1257, size: 64, offset: 1984)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1175, file: !422, line: 361, baseType: !408, size: 32, offset: 2048)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1175, file: !422, line: 362, baseType: !503, size: 32, offset: 2080)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1175, file: !422, line: 363, baseType: !408, size: 32, offset: 2112)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1175, file: !422, line: 364, baseType: !1206, size: 64, offset: 2176)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1175, file: !422, line: 365, baseType: !1224, size: 64, offset: 2240)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1175, file: !422, line: 366, baseType: !503, size: 32, offset: 2304)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1175, file: !422, line: 367, baseType: !503, size: 32, offset: 2336)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1175, file: !422, line: 368, baseType: !1218, size: 64, offset: 2368)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1175, file: !422, line: 369, baseType: !1218, size: 64, offset: 2432)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1175, file: !422, line: 370, baseType: !1276, size: 64, offset: 2496)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1175, file: !422, line: 371, baseType: !1276, size: 64, offset: 2560)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1175, file: !422, line: 372, baseType: !1276, size: 64, offset: 2624)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1175, file: !422, line: 373, baseType: !1282, size: 64, offset: 2688)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !352, line: 331, baseType: !1283)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !352, line: 331, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1175, file: !422, line: 374, baseType: !598, size: 64, offset: 2752)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1175, file: !422, line: 375, baseType: !1287, size: 64, offset: 2816)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !421, file: !422, line: 451, baseType: !1174, size: 2880, offset: 18560)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !421, file: !422, line: 452, baseType: !1290, size: 64, offset: 21440)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1291)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !422, line: 681, size: 4864, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1292, file: !422, line: 682, baseType: !425, size: 4480)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1292, file: !422, line: 682, baseType: !852, size: 32, offset: 4480)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1292, file: !422, line: 683, baseType: !602, size: 32, offset: 4512)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1292, file: !422, line: 684, baseType: !408, size: 32, offset: 4544)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1292, file: !422, line: 685, baseType: !1004, size: 64, offset: 4608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1292, file: !422, line: 686, baseType: !549, size: 64, offset: 4672)
