; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcfetidp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcfetidp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!341 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 119, baseType: !5, size: 32, elements: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!345 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!377 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!378 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!379 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!380 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!381 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!382 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!383 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!384 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!385 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!386 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!387 = !{!388, !391, !395, !396, !431, !596, !597, !1421, !1781, !481, !72, !426, !454, !1058, !1270, !456, !1212, !442, !1806, !471, !1808}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !389, line: 46, baseType: !390)
!389 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!390 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !392, line: 330, baseType: !393)
!392 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !392, line: 330, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !399, line: 73, size: 4480, elements: !400)
!399 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!400 = !{!401, !403, !452, !453, !455, !458, !459, !460, !461, !469, !470, !472, !476, !480, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !494, !495, !497, !498, !500, !502, !503, !504, !505, !506, !509, !511, !512, !513, !514, !515, !518, !520, !521, !522, !532, !534, !535, !539, !540, !586, !591, !593, !594, !595}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !398, file: !399, line: 74, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !398, file: !399, line: 75, baseType: !404, size: 448, offset: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 448, elements: !450)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !399, line: 53, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 45, size: 448, elements: !407)
!407 = !{!408, !414, !422, !427, !434, !438, !445}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !406, file: !399, line: 46, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !396, !413}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !406, file: !399, line: 47, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!412, !396, !418}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !419, line: 16, baseType: !420)
!419 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !419, line: 16, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !406, file: !399, line: 48, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!412, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !406, file: !399, line: 49, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!412, !396, !431, !396}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !406, file: !399, line: 50, baseType: !435, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!412, !396, !431, !426}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !406, file: !399, line: 51, baseType: !439, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!412, !396, !431, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !406, file: !399, line: 52, baseType: !446, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!412, !396, !431, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!450 = !{!451}
!451 = !DISubrange(count: 1)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !398, file: !399, line: 76, baseType: !391, size: 64, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !399, line: 77, baseType: !454, size: 32, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !398, file: !399, line: 78, baseType: !456, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !457)
!457 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !398, file: !399, line: 78, baseType: !456, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !398, file: !399, line: 78, baseType: !456, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !398, file: !399, line: 78, baseType: !456, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !399, line: 79, baseType: !462, size: 64, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !465, line: 27, baseType: !466)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !467, line: 43, baseType: !468)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!468 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !398, file: !399, line: 80, baseType: !454, size: 32, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !398, file: !399, line: 81, baseType: !471, size: 32, offset: 992)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !398, file: !399, line: 82, baseType: !473, size: 64, offset: 1024)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !398, file: !399, line: 83, baseType: !477, size: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !398, file: !399, line: 84, baseType: !481, size: 64, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !398, file: !399, line: 85, baseType: !481, size: 64, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !398, file: !399, line: 86, baseType: !481, size: 64, offset: 1280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !398, file: !399, line: 87, baseType: !481, size: 64, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !398, file: !399, line: 88, baseType: !396, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !398, file: !399, line: 89, baseType: !462, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 90, baseType: !481, size: 64, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !398, file: !399, line: 91, baseType: !481, size: 64, offset: 1600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !398, file: !399, line: 92, baseType: !454, size: 32, offset: 1664)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !398, file: !399, line: 93, baseType: !395, size: 64, offset: 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !398, file: !399, line: 94, baseType: !492, size: 64, offset: 1792)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !463)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !398, file: !399, line: 95, baseType: !454, size: 32, offset: 1856)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !398, file: !399, line: 95, baseType: !454, size: 32, offset: 1888)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !398, file: !399, line: 96, baseType: !496, size: 64, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !398, file: !399, line: 96, baseType: !496, size: 64, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !398, file: !399, line: 97, baseType: !499, size: 64, offset: 2048)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !398, file: !399, line: 97, baseType: !501, size: 64, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !398, file: !399, line: 98, baseType: !454, size: 32, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !398, file: !399, line: 98, baseType: !454, size: 32, offset: 2208)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !398, file: !399, line: 99, baseType: !496, size: 64, offset: 2240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !398, file: !399, line: 99, baseType: !496, size: 64, offset: 2304)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !398, file: !399, line: 100, baseType: !507, size: 64, offset: 2368)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !457)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !398, file: !399, line: 100, baseType: !510, size: 64, offset: 2432)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !398, file: !399, line: 101, baseType: !454, size: 32, offset: 2496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !398, file: !399, line: 101, baseType: !454, size: 32, offset: 2528)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !398, file: !399, line: 102, baseType: !496, size: 64, offset: 2560)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !398, file: !399, line: 102, baseType: !496, size: 64, offset: 2624)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !398, file: !399, line: 103, baseType: !516, size: 64, offset: 2688)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !508)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !398, file: !399, line: 103, baseType: !519, size: 64, offset: 2752)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !398, file: !399, line: 104, baseType: !449, size: 64, offset: 2816)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !398, file: !399, line: 105, baseType: !454, size: 32, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !398, file: !399, line: 106, baseType: !523, size: 128, offset: 2944)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 128, elements: !530)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !399, line: 64, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 61, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !526, file: !399, line: 62, baseType: !442, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !526, file: !399, line: 63, baseType: !395, size: 64, offset: 64)
!530 = !{!531}
!531 = !DISubrange(count: 2)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !398, file: !399, line: 107, baseType: !533, size: 64, offset: 3072)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 64, elements: !530)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !398, file: !399, line: 108, baseType: !395, size: 64, offset: 3136)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !398, file: !399, line: 109, baseType: !536, size: 64, offset: 3200)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!412, !395}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !398, file: !399, line: 111, baseType: !454, size: 32, offset: 3264)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !398, file: !399, line: 112, baseType: !541, size: 320, offset: 3328)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !584)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!412, !545, !396, !395}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !548)
!548 = !{!549, !550, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !547, file: !10, line: 100, baseType: !454, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !10, line: 101, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !562, !563, !564, !565, !567, !569, !570, !571}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !553, file: !10, line: 84, baseType: !481, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !553, file: !10, line: 85, baseType: !481, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !10, line: 86, baseType: !395, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !553, file: !10, line: 87, baseType: !473, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !553, file: !10, line: 88, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !553, file: !10, line: 89, baseType: !433, size: 8, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !553, file: !10, line: 90, baseType: !481, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !553, file: !10, line: 91, baseType: !388, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !553, file: !10, line: 92, baseType: !566, size: 32, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !10, line: 93, baseType: !568, size: 32, offset: 544)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !10, line: 94, baseType: !551, size: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !553, file: !10, line: 95, baseType: !481, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !553, file: !10, line: 96, baseType: !395, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !547, file: !10, line: 102, baseType: !481, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !547, file: !10, line: 102, baseType: !481, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !547, file: !10, line: 103, baseType: !481, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !547, file: !10, line: 104, baseType: !391, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !547, file: !10, line: 105, baseType: !566, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !547, file: !10, line: 105, baseType: !566, size: 32, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !547, file: !10, line: 105, baseType: !566, size: 32, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !547, file: !10, line: 106, baseType: !396, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !547, file: !10, line: 107, baseType: !581, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!584 = !{!585}
!585 = !DISubrange(count: 5)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !398, file: !399, line: 113, baseType: !587, size: 320, offset: 3648)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !584)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!412, !396, !395}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !398, file: !399, line: 114, baseType: !592, size: 320, offset: 3968)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 320, elements: !584)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !398, file: !399, line: 115, baseType: !566, size: 32, offset: 4288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !398, file: !399, line: 120, baseType: !581, size: 64, offset: 4352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !398, file: !399, line: 121, baseType: !566, size: 32, offset: 4416)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !599, line: 78, baseType: !600)
!599 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 13, size: 2432, elements: !601)
!601 = !{!602, !603, !604, !609, !610, !611, !612, !1380, !1381, !1382, !1383, !1384, !1385, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !600, file: !599, line: 24, baseType: !454, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !600, file: !599, line: 25, baseType: !454, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !600, file: !599, line: 26, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !606, line: 11, baseType: !607)
!606 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !606, line: 11, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !600, file: !599, line: 27, baseType: !605, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !600, file: !599, line: 28, baseType: !605, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !600, file: !599, line: 29, baseType: !605, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !600, file: !599, line: 31, baseType: !613, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !616, line: 436, size: 23424, elements: !617)
!616 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!617 = !{!618, !620, !1123, !1143, !1144, !1145, !1147, !1148, !1149, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1276, !1277, !1293, !1294, !1295, !1296, !1297, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1332, !1352, !1353, !1355, !1356, !1357, !1358, !1359, !1360, !1378, !1379}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !615, file: !616, line: 437, baseType: !619, size: 4480)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !399, line: 122, baseType: !398)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !615, file: !616, line: 437, baseType: !621, size: 9472, offset: 4480)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 9472, elements: !450)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !616, line: 32, size: 9472, elements: !623)
!623 = !{!624, !633, !637, !638, !645, !649, !650, !651, !652, !653, !654, !655, !675, !679, !684, !690, !709, !714, !718, !719, !724, !729, !730, !735, !739, !743, !747, !751, !755, !756, !757, !758, !759, !763, !764, !769, !770, !771, !772, !773, !778, !785, !790, !794, !798, !802, !806, !807, !811, !812, !819, !824, !825, !826, !827, !889, !897, !898, !902, !903, !907, !908, !912, !917, !918, !922, !926, !933, !934, !935, !936, !937, !938, !943, !944, !948, !952, !956, !957, !958, !962, !972, !973, !977, !978, !982, !983, !987, !988, !993, !994, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1013, !1014, !1015, !1016, !1017, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1032, !1036, !1037, !1038, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1052, !1053, !1054, !1059, !1063, !1064, !1068, !1069, !1070, !1071, !1097, !1101, !1102, !1103, !1104, !1105, !1109, !1110, !1111, !1112, !1113, !1117, !1121, !1122}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !622, file: !616, line: 34, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!412, !613, !454, !628, !454, !628, !630, !632}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !622, file: !616, line: 35, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!412, !613, !454, !499, !501, !519}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !622, file: !616, line: 36, baseType: !634, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !622, file: !616, line: 37, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!412, !613, !642, !642}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !622, file: !616, line: 38, baseType: !646, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!412, !613, !642, !642, !642}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !622, file: !616, line: 40, baseType: !639, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !622, file: !616, line: 41, baseType: !646, size: 64, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !622, file: !616, line: 42, baseType: !639, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !622, file: !616, line: 43, baseType: !646, size: 64, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !622, file: !616, line: 44, baseType: !639, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !622, file: !616, line: 46, baseType: !646, size: 64, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !622, file: !616, line: 47, baseType: !656, size: 64, offset: 704)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!412, !613, !605, !605, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !662, file: !36, line: 1227, baseType: !508, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !662, file: !36, line: 1228, baseType: !508, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !662, file: !36, line: 1229, baseType: !508, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !662, file: !36, line: 1230, baseType: !508, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !662, file: !36, line: 1231, baseType: !508, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !662, file: !36, line: 1232, baseType: !508, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !662, file: !36, line: 1233, baseType: !508, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !662, file: !36, line: 1234, baseType: !508, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !662, file: !36, line: 1236, baseType: !508, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !662, file: !36, line: 1237, baseType: !508, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !662, file: !36, line: 1238, baseType: !508, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !622, file: !616, line: 48, baseType: !676, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!412, !613, !605, !659}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !622, file: !616, line: 49, baseType: !680, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!412, !613, !642, !508, !683, !508, !454, !454, !642}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !622, file: !616, line: 50, baseType: !685, size: 64, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!412, !613, !688, !689}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !622, file: !616, line: 52, baseType: !691, size: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!412, !613, !694, !695}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !697, file: !36, line: 593, baseType: !456, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !697, file: !36, line: 594, baseType: !456, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !697, file: !36, line: 594, baseType: !456, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !697, file: !36, line: 594, baseType: !456, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !697, file: !36, line: 595, baseType: !456, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !697, file: !36, line: 596, baseType: !456, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !697, file: !36, line: 597, baseType: !456, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !697, file: !36, line: 598, baseType: !456, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !697, file: !36, line: 598, baseType: !456, size: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !697, file: !36, line: 599, baseType: !456, size: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !622, file: !616, line: 53, baseType: !710, size: 64, offset: 1024)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!412, !613, !613, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !622, file: !616, line: 54, baseType: !715, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!412, !613, !642}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !622, file: !616, line: 55, baseType: !639, size: 64, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !622, file: !616, line: 56, baseType: !720, size: 64, offset: 1216)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!412, !613, !723, !507}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !622, file: !616, line: 58, baseType: !725, size: 64, offset: 1280)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!412, !613, !728}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !622, file: !616, line: 59, baseType: !725, size: 64, offset: 1344)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !622, file: !616, line: 60, baseType: !731, size: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!412, !613, !734, !566}
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !622, file: !616, line: 61, baseType: !736, size: 64, offset: 1472)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!412, !613}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !622, file: !616, line: 63, baseType: !740, size: 64, offset: 1536)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!412, !613, !454, !628, !517, !642, !642}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !622, file: !616, line: 64, baseType: !744, size: 64, offset: 1600)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!412, !613, !613, !605, !605, !659}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !622, file: !616, line: 65, baseType: !748, size: 64, offset: 1664)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!412, !613, !613, !659}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !622, file: !616, line: 66, baseType: !752, size: 64, offset: 1728)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!412, !613, !613, !605, !659}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !622, file: !616, line: 67, baseType: !748, size: 64, offset: 1792)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !622, file: !616, line: 69, baseType: !736, size: 64, offset: 1856)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !622, file: !616, line: 70, baseType: !744, size: 64, offset: 1920)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !622, file: !616, line: 71, baseType: !752, size: 64, offset: 1984)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !622, file: !616, line: 72, baseType: !760, size: 64, offset: 2048)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!412, !613, !689}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !622, file: !616, line: 73, baseType: !736, size: 64, offset: 2112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !622, file: !616, line: 75, baseType: !765, size: 64, offset: 2176)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!412, !613, !768, !689}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !622, file: !616, line: 76, baseType: !639, size: 64, offset: 2240)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !622, file: !616, line: 77, baseType: !639, size: 64, offset: 2304)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !622, file: !616, line: 78, baseType: !656, size: 64, offset: 2368)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !622, file: !616, line: 79, baseType: !676, size: 64, offset: 2432)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !622, file: !616, line: 81, baseType: !774, size: 64, offset: 2496)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!412, !613, !517, !613, !777}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !622, file: !616, line: 82, baseType: !779, size: 64, offset: 2560)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!412, !613, !454, !782, !782, !688, !784}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !622, file: !616, line: 83, baseType: !786, size: 64, offset: 2624)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!412, !613, !454, !789, !454}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !622, file: !616, line: 84, baseType: !791, size: 64, offset: 2688)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!412, !613, !454, !628, !454, !628, !516}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !622, file: !616, line: 85, baseType: !795, size: 64, offset: 2752)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!412, !613, !613, !777}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !622, file: !616, line: 87, baseType: !799, size: 64, offset: 2816)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!412, !613, !642, !499}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !622, file: !616, line: 88, baseType: !803, size: 64, offset: 2880)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!412, !613, !517}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !622, file: !616, line: 89, baseType: !803, size: 64, offset: 2944)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !622, file: !616, line: 90, baseType: !808, size: 64, offset: 3008)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!412, !613, !642, !632}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !622, file: !616, line: 91, baseType: !740, size: 64, offset: 3072)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !622, file: !616, line: 93, baseType: !813, size: 64, offset: 3136)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!412, !613, !816}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !622, file: !616, line: 94, baseType: !820, size: 64, offset: 3200)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!412, !613, !454, !566, !566, !499, !823, !823, !713}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !622, file: !616, line: 95, baseType: !820, size: 64, offset: 3264)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !622, file: !616, line: 96, baseType: !820, size: 64, offset: 3328)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !622, file: !616, line: 97, baseType: !820, size: 64, offset: 3392)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !622, file: !616, line: 99, baseType: !828, size: 64, offset: 3456)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!412, !613, !831, !834}
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !606, line: 51, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !606, line: 51, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !616, line: 609, size: 6208, elements: !837)
!837 = !{!838, !839, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !858, !865, !866, !867, !868, !869, !870, !871, !872, !876, !877, !878, !879, !880, !882, !883, !884, !885, !886, !887, !888}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !836, file: !616, line: 610, baseType: !619, size: 4480)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !836, file: !616, line: 610, baseType: !840, size: 32, offset: 4480)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !450)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !836, file: !616, line: 611, baseType: !454, size: 32, offset: 4512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !836, file: !616, line: 611, baseType: !454, size: 32, offset: 4544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !836, file: !616, line: 611, baseType: !454, size: 32, offset: 4576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !836, file: !616, line: 612, baseType: !454, size: 32, offset: 4608)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !836, file: !616, line: 613, baseType: !454, size: 32, offset: 4640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !836, file: !616, line: 614, baseType: !499, size: 64, offset: 4672)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !836, file: !616, line: 615, baseType: !501, size: 64, offset: 4736)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !836, file: !616, line: 616, baseType: !789, size: 64, offset: 4800)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !836, file: !616, line: 617, baseType: !499, size: 64, offset: 4864)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !836, file: !616, line: 618, baseType: !851, size: 64, offset: 4928)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !616, line: 602, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 598, size: 128, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !853, file: !616, line: 599, baseType: !454, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !853, file: !616, line: 600, baseType: !454, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !853, file: !616, line: 601, baseType: !516, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !836, file: !616, line: 619, baseType: !859, size: 64, offset: 4992)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !616, line: 607, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 604, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !861, file: !616, line: 605, baseType: !454, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !861, file: !616, line: 606, baseType: !516, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !836, file: !616, line: 620, baseType: !516, size: 64, offset: 5056)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !836, file: !616, line: 621, baseType: !508, size: 64, offset: 5120)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !836, file: !616, line: 622, baseType: !508, size: 64, offset: 5184)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !836, file: !616, line: 623, baseType: !642, size: 64, offset: 5248)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !836, file: !616, line: 623, baseType: !642, size: 64, offset: 5312)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !836, file: !616, line: 623, baseType: !642, size: 64, offset: 5376)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !836, file: !616, line: 624, baseType: !566, size: 32, offset: 5440)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !836, file: !616, line: 625, baseType: !873, size: 64, offset: 5504)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!412}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !836, file: !616, line: 626, baseType: !395, size: 64, offset: 5568)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !836, file: !616, line: 627, baseType: !642, size: 64, offset: 5632)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !836, file: !616, line: 628, baseType: !454, size: 32, offset: 5696)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !836, file: !616, line: 629, baseType: !431, size: 64, offset: 5760)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !836, file: !616, line: 630, baseType: !881, size: 32, offset: 5824)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !836, file: !616, line: 631, baseType: !454, size: 32, offset: 5856)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !836, file: !616, line: 631, baseType: !454, size: 32, offset: 5888)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !836, file: !616, line: 632, baseType: !566, size: 32, offset: 5920)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !836, file: !616, line: 633, baseType: !566, size: 32, offset: 5952)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !836, file: !616, line: 634, baseType: !442, size: 64, offset: 6016)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !836, file: !616, line: 634, baseType: !395, size: 64, offset: 6080)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !836, file: !616, line: 635, baseType: !462, size: 64, offset: 6144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !622, file: !616, line: 100, baseType: !890, size: 64, offset: 3520)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!412, !613, !454, !454, !893, !896}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !895)
!895 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !622, file: !616, line: 101, baseType: !736, size: 64, offset: 3584)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !622, file: !616, line: 102, baseType: !899, size: 64, offset: 3648)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!412, !613, !605, !605, !689}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !622, file: !616, line: 103, baseType: !625, size: 64, offset: 3712)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !622, file: !616, line: 105, baseType: !904, size: 64, offset: 3776)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!412, !613, !605, !605, !688, !689}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !622, file: !616, line: 106, baseType: !736, size: 64, offset: 3840)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !622, file: !616, line: 107, baseType: !909, size: 64, offset: 3904)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!412, !613, !418}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !622, file: !616, line: 108, baseType: !913, size: 64, offset: 3968)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!412, !613, !916, !688, !689}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !431)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !622, file: !616, line: 109, baseType: !873, size: 64, offset: 4032)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !622, file: !616, line: 111, baseType: !919, size: 64, offset: 4096)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!412, !613, !613, !613, !508, !613}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !622, file: !616, line: 112, baseType: !923, size: 64, offset: 4160)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!412, !613, !613, !613, !613}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !622, file: !616, line: 113, baseType: !927, size: 64, offset: 4224)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!412, !613, !930, !930}
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !606, line: 30, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !606, line: 30, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !622, file: !616, line: 114, baseType: !625, size: 64, offset: 4288)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !622, file: !616, line: 115, baseType: !740, size: 64, offset: 4352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !622, file: !616, line: 117, baseType: !799, size: 64, offset: 4416)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !622, file: !616, line: 118, baseType: !799, size: 64, offset: 4480)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !622, file: !616, line: 119, baseType: !913, size: 64, offset: 4544)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !622, file: !616, line: 120, baseType: !939, size: 64, offset: 4608)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!412, !613, !942, !713}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !622, file: !616, line: 121, baseType: !873, size: 64, offset: 4672)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !622, file: !616, line: 123, baseType: !945, size: 64, offset: 4736)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!412, !613, !454, !395}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !622, file: !616, line: 124, baseType: !949, size: 64, offset: 4800)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!412, !613, !834, !642, !395}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !622, file: !616, line: 125, baseType: !953, size: 64, offset: 4864)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!412, !545, !613}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !622, file: !616, line: 126, baseType: !639, size: 64, offset: 4928)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !622, file: !616, line: 127, baseType: !639, size: 64, offset: 4992)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !622, file: !616, line: 129, baseType: !959, size: 64, offset: 5056)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!412, !613, !789}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !622, file: !616, line: 130, baseType: !963, size: 64, offset: 5120)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!412, !613, !966, !966}
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !968, file: !60, line: 653, baseType: !454, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !968, file: !60, line: 653, baseType: !642, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !622, file: !616, line: 131, baseType: !963, size: 64, offset: 5184)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !622, file: !616, line: 132, baseType: !974, size: 64, offset: 5248)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!412, !613, !499, !499, !499}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !622, file: !616, line: 133, baseType: !909, size: 64, offset: 5312)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !622, file: !616, line: 135, baseType: !979, size: 64, offset: 5376)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!412, !613, !508, !713}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !622, file: !616, line: 136, baseType: !979, size: 64, offset: 5440)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !622, file: !616, line: 137, baseType: !984, size: 64, offset: 5504)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!412, !613, !713}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !622, file: !616, line: 138, baseType: !625, size: 64, offset: 5568)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !622, file: !616, line: 139, baseType: !989, size: 64, offset: 5632)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!412, !613, !992, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !622, file: !616, line: 141, baseType: !873, size: 64, offset: 5696)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !622, file: !616, line: 142, baseType: !995, size: 64, offset: 5760)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!412, !613, !613, !508, !613}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !622, file: !616, line: 143, baseType: !999, size: 64, offset: 5824)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!412, !613, !613, !613}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !622, file: !616, line: 144, baseType: !873, size: 64, offset: 5888)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !622, file: !616, line: 145, baseType: !995, size: 64, offset: 5952)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !622, file: !616, line: 147, baseType: !999, size: 64, offset: 6016)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !622, file: !616, line: 148, baseType: !873, size: 64, offset: 6080)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !622, file: !616, line: 149, baseType: !995, size: 64, offset: 6144)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !622, file: !616, line: 150, baseType: !999, size: 64, offset: 6208)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !622, file: !616, line: 151, baseType: !1009, size: 64, offset: 6272)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!412, !613, !566}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !622, file: !616, line: 153, baseType: !736, size: 64, offset: 6336)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !622, file: !616, line: 154, baseType: !736, size: 64, offset: 6400)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !622, file: !616, line: 155, baseType: !736, size: 64, offset: 6464)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !622, file: !616, line: 156, baseType: !736, size: 64, offset: 6528)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !622, file: !616, line: 157, baseType: !909, size: 64, offset: 6592)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !622, file: !616, line: 159, baseType: !1018, size: 64, offset: 6656)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!412, !613, !454, !630}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !622, file: !616, line: 160, baseType: !736, size: 64, offset: 6720)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !622, file: !616, line: 161, baseType: !736, size: 64, offset: 6784)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !622, file: !616, line: 162, baseType: !736, size: 64, offset: 6848)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !622, file: !616, line: 163, baseType: !736, size: 64, offset: 6912)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !622, file: !616, line: 165, baseType: !999, size: 64, offset: 6976)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !622, file: !616, line: 166, baseType: !999, size: 64, offset: 7040)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !622, file: !616, line: 167, baseType: !799, size: 64, offset: 7104)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !622, file: !616, line: 168, baseType: !1029, size: 64, offset: 7168)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!412, !613, !642, !454}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !622, file: !616, line: 169, baseType: !1033, size: 64, offset: 7232)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!412, !613, !713, !499}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !622, file: !616, line: 171, baseType: !760, size: 64, offset: 7296)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !622, file: !616, line: 172, baseType: !736, size: 64, offset: 7360)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !622, file: !616, line: 173, baseType: !1039, size: 64, offset: 7424)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!412, !613, !499, !823}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !622, file: !616, line: 174, baseType: !899, size: 64, offset: 7488)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !622, file: !616, line: 175, baseType: !899, size: 64, offset: 7552)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !622, file: !616, line: 177, baseType: !639, size: 64, offset: 7616)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !622, file: !616, line: 178, baseType: !685, size: 64, offset: 7680)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !622, file: !616, line: 179, baseType: !639, size: 64, offset: 7744)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !622, file: !616, line: 180, baseType: !646, size: 64, offset: 7808)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !622, file: !616, line: 181, baseType: !1049, size: 64, offset: 7872)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!412, !613, !391, !688, !689}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !622, file: !616, line: 183, baseType: !959, size: 64, offset: 7936)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !622, file: !616, line: 184, baseType: !720, size: 64, offset: 8000)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !622, file: !616, line: 185, baseType: !1055, size: 64, offset: 8064)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!412, !613, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !622, file: !616, line: 186, baseType: !1060, size: 64, offset: 8128)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!412, !613, !454, !628, !516}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !622, file: !616, line: 187, baseType: !779, size: 64, offset: 8192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !622, file: !616, line: 189, baseType: !1065, size: 64, offset: 8256)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!412, !613, !454, !454, !499, !630}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !622, file: !616, line: 190, baseType: !873, size: 64, offset: 8320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !622, file: !616, line: 191, baseType: !995, size: 64, offset: 8384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !622, file: !616, line: 192, baseType: !999, size: 64, offset: 8448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !622, file: !616, line: 193, baseType: !1072, size: 64, offset: 8512)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!412, !613, !831, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !616, line: 660, size: 5312, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1077, file: !616, line: 661, baseType: !619, size: 4480)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1077, file: !616, line: 661, baseType: !840, size: 32, offset: 4480)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1077, file: !616, line: 662, baseType: !454, size: 32, offset: 4512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1077, file: !616, line: 662, baseType: !454, size: 32, offset: 4544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1077, file: !616, line: 662, baseType: !454, size: 32, offset: 4576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1077, file: !616, line: 663, baseType: !454, size: 32, offset: 4608)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1077, file: !616, line: 664, baseType: !454, size: 32, offset: 4640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1077, file: !616, line: 665, baseType: !499, size: 64, offset: 4672)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1077, file: !616, line: 666, baseType: !499, size: 64, offset: 4736)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1077, file: !616, line: 667, baseType: !454, size: 32, offset: 4800)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1077, file: !616, line: 668, baseType: !881, size: 32, offset: 4832)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1077, file: !616, line: 670, baseType: !499, size: 64, offset: 4864)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1077, file: !616, line: 670, baseType: !499, size: 64, offset: 4928)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1077, file: !616, line: 671, baseType: !499, size: 64, offset: 4992)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1077, file: !616, line: 672, baseType: !499, size: 64, offset: 5056)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1077, file: !616, line: 673, baseType: !499, size: 64, offset: 5120)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1077, file: !616, line: 674, baseType: !454, size: 32, offset: 5184)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1077, file: !616, line: 675, baseType: !499, size: 64, offset: 5248)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !622, file: !616, line: 195, baseType: !1098, size: 64, offset: 8576)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!412, !1075, !613, !613}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !622, file: !616, line: 196, baseType: !1098, size: 64, offset: 8640)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !622, file: !616, line: 197, baseType: !873, size: 64, offset: 8704)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !622, file: !616, line: 198, baseType: !995, size: 64, offset: 8768)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !622, file: !616, line: 199, baseType: !999, size: 64, offset: 8832)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !622, file: !616, line: 201, baseType: !1106, size: 64, offset: 8896)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!412, !613, !454, !454}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !622, file: !616, line: 202, baseType: !774, size: 64, offset: 8960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !622, file: !616, line: 203, baseType: !646, size: 64, offset: 9024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !622, file: !616, line: 204, baseType: !828, size: 64, offset: 9088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !622, file: !616, line: 205, baseType: !959, size: 64, offset: 9152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !622, file: !616, line: 206, baseType: !1114, size: 64, offset: 9216)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!412, !391, !613, !454, !688, !689}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !622, file: !616, line: 208, baseType: !1118, size: 64, offset: 9280)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!412, !454, !784}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !622, file: !616, line: 209, baseType: !999, size: 64, offset: 9344)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !622, file: !616, line: 210, baseType: !791, size: 64, offset: 9408)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !615, file: !616, line: 438, baseType: !1124, size: 64, offset: 13952)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !606, line: 60, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1126, file: !114, line: 241, baseType: !391, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !114, line: 242, baseType: !471, size: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1126, file: !114, line: 243, baseType: !454, size: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1126, file: !114, line: 243, baseType: !454, size: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1126, file: !114, line: 244, baseType: !454, size: 32, offset: 160)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1126, file: !114, line: 244, baseType: !454, size: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1126, file: !114, line: 245, baseType: !499, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1126, file: !114, line: 246, baseType: !566, size: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1126, file: !114, line: 247, baseType: !454, size: 32, offset: 352)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1126, file: !114, line: 251, baseType: !454, size: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1126, file: !114, line: 252, baseType: !930, size: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1126, file: !114, line: 253, baseType: !566, size: 32, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1126, file: !114, line: 254, baseType: !454, size: 32, offset: 544)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1126, file: !114, line: 254, baseType: !454, size: 32, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1126, file: !114, line: 255, baseType: !454, size: 32, offset: 608)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !615, file: !616, line: 438, baseType: !1124, size: 64, offset: 14016)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !615, file: !616, line: 439, baseType: !395, size: 64, offset: 14080)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !615, file: !616, line: 440, baseType: !1146, size: 32, offset: 14144)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !615, file: !616, line: 441, baseType: !566, size: 32, offset: 14176)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !615, file: !616, line: 442, baseType: !566, size: 32, offset: 14208)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !615, file: !616, line: 443, baseType: !1150, size: 448, offset: 14272)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 448, elements: !1152)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !431)
!1152 = !{!1153}
!1153 = !DISubrange(count: 7)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !615, file: !616, line: 444, baseType: !566, size: 32, offset: 14720)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !615, file: !616, line: 445, baseType: !566, size: 32, offset: 14752)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !615, file: !616, line: 446, baseType: !454, size: 32, offset: 14784)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !615, file: !616, line: 447, baseType: !492, size: 64, offset: 14848)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !615, file: !616, line: 448, baseType: !492, size: 64, offset: 14912)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !615, file: !616, line: 449, baseType: !696, size: 640, offset: 14976)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !615, file: !616, line: 450, baseType: !632, size: 32, offset: 15616)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !615, file: !616, line: 451, baseType: !1162, size: 2880, offset: 15680)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !616, line: 318, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !616, line: 319, size: 2880, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1171, !1184, !1185, !1190, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1210, !1211, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1243, !1244, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1267, !1268, !1269, !1273, !1274}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1163, file: !616, line: 320, baseType: !454, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1163, file: !616, line: 321, baseType: !454, size: 32, offset: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1163, file: !616, line: 322, baseType: !454, size: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1163, file: !616, line: 323, baseType: !454, size: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1163, file: !616, line: 324, baseType: !454, size: 32, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1163, file: !616, line: 325, baseType: !454, size: 32, offset: 160)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1163, file: !616, line: 326, baseType: !1172, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !616, line: 293, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !616, line: 295, size: 448, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1174, file: !616, line: 296, baseType: !1172, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1174, file: !616, line: 297, baseType: !516, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1174, file: !616, line: 297, baseType: !516, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1174, file: !616, line: 298, baseType: !499, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1174, file: !616, line: 298, baseType: !499, size: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1174, file: !616, line: 299, baseType: !454, size: 32, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1174, file: !616, line: 300, baseType: !454, size: 32, offset: 352)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1174, file: !616, line: 301, baseType: !454, size: 32, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1163, file: !616, line: 326, baseType: !1172, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1163, file: !616, line: 328, baseType: !1186, size: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!412, !613, !1189, !499}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1163, file: !616, line: 329, baseType: !1191, size: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!412, !1189, !1194, !501, !501, !519, !499}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1163, file: !616, line: 330, baseType: !1196, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!412, !1189}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1163, file: !616, line: 331, baseType: !1196, size: 64, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1163, file: !616, line: 334, baseType: !391, size: 64, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1163, file: !616, line: 335, baseType: !471, size: 32, offset: 640)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1163, file: !616, line: 335, baseType: !471, size: 32, offset: 672)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1163, file: !616, line: 336, baseType: !471, size: 32, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1163, file: !616, line: 336, baseType: !471, size: 32, offset: 736)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1163, file: !616, line: 337, baseType: !1206, size: 64, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !392, line: 339, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !392, line: 339, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1163, file: !616, line: 338, baseType: !1206, size: 64, offset: 832)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1163, file: !616, line: 339, baseType: !1212, size: 64, offset: 896)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !392, line: 341, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !392, line: 351, size: 192, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1214, file: !392, line: 354, baseType: !72, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1214, file: !392, line: 355, baseType: !72, size: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1214, file: !392, line: 356, baseType: !72, size: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1214, file: !392, line: 361, baseType: !72, size: 32, offset: 96)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1214, file: !392, line: 362, baseType: !388, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1163, file: !616, line: 340, baseType: !454, size: 32, offset: 960)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1163, file: !616, line: 340, baseType: !454, size: 32, offset: 992)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1163, file: !616, line: 341, baseType: !516, size: 64, offset: 1024)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1163, file: !616, line: 342, baseType: !499, size: 64, offset: 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1163, file: !616, line: 343, baseType: !519, size: 64, offset: 1152)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1163, file: !616, line: 344, baseType: !501, size: 64, offset: 1216)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1163, file: !616, line: 345, baseType: !454, size: 32, offset: 1280)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1163, file: !616, line: 346, baseType: !1194, size: 64, offset: 1344)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1163, file: !616, line: 347, baseType: !566, size: 32, offset: 1408)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1163, file: !616, line: 348, baseType: !454, size: 32, offset: 1440)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1163, file: !616, line: 351, baseType: !566, size: 32, offset: 1472)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1163, file: !616, line: 352, baseType: !566, size: 32, offset: 1504)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1163, file: !616, line: 353, baseType: !471, size: 32, offset: 1536)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1163, file: !616, line: 354, baseType: !471, size: 32, offset: 1568)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1163, file: !616, line: 355, baseType: !1194, size: 64, offset: 1600)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1163, file: !616, line: 356, baseType: !1194, size: 64, offset: 1664)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1163, file: !616, line: 357, baseType: !1238, size: 64, offset: 1728)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !616, line: 310, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 308, size: 32, elements: !1241)
!1241 = !{!1242}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1240, file: !616, line: 309, baseType: !454, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1163, file: !616, line: 357, baseType: !1238, size: 64, offset: 1792)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1163, file: !616, line: 358, baseType: !1245, size: 64, offset: 1856)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !616, line: 316, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 312, size: 128, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1247, file: !616, line: 313, baseType: !395, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1247, file: !616, line: 314, baseType: !454, size: 32, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1247, file: !616, line: 315, baseType: !433, size: 8, offset: 96)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1163, file: !616, line: 359, baseType: !1245, size: 64, offset: 1920)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1163, file: !616, line: 360, baseType: !1245, size: 64, offset: 1984)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1163, file: !616, line: 361, baseType: !454, size: 32, offset: 2048)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1163, file: !616, line: 362, baseType: !471, size: 32, offset: 2080)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1163, file: !616, line: 363, baseType: !454, size: 32, offset: 2112)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1163, file: !616, line: 364, baseType: !1194, size: 64, offset: 2176)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1163, file: !616, line: 365, baseType: !1212, size: 64, offset: 2240)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1163, file: !616, line: 366, baseType: !471, size: 32, offset: 2304)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1163, file: !616, line: 367, baseType: !471, size: 32, offset: 2336)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1163, file: !616, line: 368, baseType: !1206, size: 64, offset: 2368)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1163, file: !616, line: 369, baseType: !1206, size: 64, offset: 2432)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1163, file: !616, line: 370, baseType: !1264, size: 64, offset: 2496)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1163, file: !616, line: 371, baseType: !1264, size: 64, offset: 2560)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1163, file: !616, line: 372, baseType: !1264, size: 64, offset: 2624)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1163, file: !616, line: 373, baseType: !1270, size: 64, offset: 2688)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !392, line: 331, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !392, line: 331, flags: DIFlagFwdDecl)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1163, file: !616, line: 374, baseType: !388, size: 64, offset: 2752)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1163, file: !616, line: 375, baseType: !1275, size: 64, offset: 2816)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !615, file: !616, line: 451, baseType: !1162, size: 2880, offset: 18560)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !615, file: !616, line: 452, baseType: !1278, size: 64, offset: 21440)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !616, line: 681, size: 4864, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1280, file: !616, line: 682, baseType: !619, size: 4480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1280, file: !616, line: 682, baseType: !840, size: 32, offset: 4480)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1280, file: !616, line: 683, baseType: !566, size: 32, offset: 4512)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1280, file: !616, line: 684, baseType: !454, size: 32, offset: 4544)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1280, file: !616, line: 685, baseType: !992, size: 64, offset: 4608)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1280, file: !616, line: 686, baseType: !516, size: 64, offset: 4672)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1280, file: !616, line: 687, baseType: !1289, size: 64, offset: 4736)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!412, !1278, !642, !395}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1280, file: !616, line: 688, baseType: !395, size: 64, offset: 4800)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !615, file: !616, line: 453, baseType: !1278, size: 64, offset: 21504)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !615, file: !616, line: 454, baseType: !1278, size: 64, offset: 21568)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !615, file: !616, line: 455, baseType: !454, size: 32, offset: 21632)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !615, file: !616, line: 456, baseType: !566, size: 32, offset: 21664)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !615, file: !616, line: 457, baseType: !1298, size: 320, offset: 21696)
