; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vecreg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vecreg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!31 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!43 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!44 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 475, baseType: !7, size: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 701, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 472, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!72 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!90 = !{!91, !95, !96, !132, !182, !103, !300, !301}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !92, line: 330, baseType: !93)
!92 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !92, line: 330, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !99, line: 73, size: 4480, elements: !100)
!99 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!100 = !{!101, !104, !153, !154, !156, !159, !160, !161, !162, !170, !171, !173, !177, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !194, !195, !196, !198, !199, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !215, !216, !219, !221, !222, !223, !233, !235, !236, !240, !241, !290, !295, !297, !298, !299}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !98, file: !99, line: 74, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !103)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !98, file: !99, line: 75, baseType: !105, size: 448, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 448, elements: !151)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !99, line: 53, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 45, size: 448, elements: !108)
!108 = !{!109, !115, !123, !128, !135, !139, !146}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !107, file: !99, line: 46, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !96, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !103)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !107, file: !99, line: 47, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!113, !96, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !120, line: 16, baseType: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !120, line: 16, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !107, file: !99, line: 48, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!113, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !107, file: !99, line: 49, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!113, !96, !132, !96}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !107, file: !99, line: 50, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!113, !96, !132, !127}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !107, file: !99, line: 51, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!113, !96, !132, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !107, file: !99, line: 52, baseType: !147, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!113, !96, !132, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !98, file: !99, line: 76, baseType: !91, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !99, line: 77, baseType: !155, size: 32, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !103)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !98, file: !99, line: 78, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !158)
!158 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !98, file: !99, line: 78, baseType: !157, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !98, file: !99, line: 78, baseType: !157, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !98, file: !99, line: 78, baseType: !157, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !98, file: !99, line: 79, baseType: !163, size: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !166, line: 27, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !168, line: 43, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!169 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !98, file: !99, line: 80, baseType: !155, size: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !98, file: !99, line: 81, baseType: !172, size: 32, offset: 992)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !103)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !98, file: !99, line: 82, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !98, file: !99, line: 83, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !98, file: !99, line: 84, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !98, file: !99, line: 85, baseType: !182, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !98, file: !99, line: 86, baseType: !182, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !98, file: !99, line: 87, baseType: !182, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !98, file: !99, line: 88, baseType: !96, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !98, file: !99, line: 89, baseType: !163, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !99, line: 90, baseType: !182, size: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !98, file: !99, line: 91, baseType: !182, size: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !98, file: !99, line: 92, baseType: !155, size: 32, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !98, file: !99, line: 93, baseType: !95, size: 64, offset: 1728)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !98, file: !99, line: 94, baseType: !193, size: 64, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !164)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !98, file: !99, line: 95, baseType: !155, size: 32, offset: 1856)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !98, file: !99, line: 95, baseType: !155, size: 32, offset: 1888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !98, file: !99, line: 96, baseType: !197, size: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !98, file: !99, line: 96, baseType: !197, size: 64, offset: 1984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !98, file: !99, line: 97, baseType: !200, size: 64, offset: 2048)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !98, file: !99, line: 97, baseType: !202, size: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !98, file: !99, line: 98, baseType: !155, size: 32, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !98, file: !99, line: 98, baseType: !155, size: 32, offset: 2208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !98, file: !99, line: 99, baseType: !197, size: 64, offset: 2240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !98, file: !99, line: 99, baseType: !197, size: 64, offset: 2304)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !98, file: !99, line: 100, baseType: !208, size: 64, offset: 2368)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !158)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !98, file: !99, line: 100, baseType: !211, size: 64, offset: 2432)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !98, file: !99, line: 101, baseType: !155, size: 32, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !98, file: !99, line: 101, baseType: !155, size: 32, offset: 2528)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !98, file: !99, line: 102, baseType: !197, size: 64, offset: 2560)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !98, file: !99, line: 102, baseType: !197, size: 64, offset: 2624)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !98, file: !99, line: 103, baseType: !217, size: 64, offset: 2688)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !98, file: !99, line: 103, baseType: !220, size: 64, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !98, file: !99, line: 104, baseType: !150, size: 64, offset: 2816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !98, file: !99, line: 105, baseType: !155, size: 32, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !98, file: !99, line: 106, baseType: !224, size: 128, offset: 2944)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !231)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !99, line: 64, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 61, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !227, file: !99, line: 62, baseType: !143, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !227, file: !99, line: 63, baseType: !95, size: 64, offset: 64)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !98, file: !99, line: 107, baseType: !234, size: 64, offset: 3072)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !231)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !98, file: !99, line: 108, baseType: !95, size: 64, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !98, file: !99, line: 109, baseType: !237, size: 64, offset: 3200)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!113, !95}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !98, file: !99, line: 111, baseType: !155, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !98, file: !99, line: 112, baseType: !242, size: 320, offset: 3328)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !288)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!113, !246, !96, !95}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !249)
!249 = !{!250, !251, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !248, file: !12, line: 100, baseType: !155, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !12, line: 101, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !263, !264, !265, !269, !271, !273, !274, !275}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !254, file: !12, line: 84, baseType: !182, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !254, file: !12, line: 85, baseType: !182, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !12, line: 86, baseType: !95, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !254, file: !12, line: 87, baseType: !174, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !254, file: !12, line: 88, baseType: !261, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !254, file: !12, line: 89, baseType: !134, size: 8, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !254, file: !12, line: 90, baseType: !182, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !254, file: !12, line: 91, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !267, line: 46, baseType: !268)
!267 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!268 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !254, file: !12, line: 92, baseType: !270, size: 32, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !12, line: 93, baseType: !272, size: 32, offset: 544)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !12, line: 94, baseType: !252, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !254, file: !12, line: 95, baseType: !182, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !254, file: !12, line: 96, baseType: !95, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !248, file: !12, line: 102, baseType: !182, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !248, file: !12, line: 102, baseType: !182, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !248, file: !12, line: 103, baseType: !182, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !248, file: !12, line: 104, baseType: !91, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !248, file: !12, line: 105, baseType: !270, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !248, file: !12, line: 105, baseType: !270, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !248, file: !12, line: 105, baseType: !270, size: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !248, file: !12, line: 106, baseType: !96, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !248, file: !12, line: 107, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!288 = !{!289}
!289 = !DISubrange(count: 5)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !98, file: !99, line: 113, baseType: !291, size: 320, offset: 3648)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!113, !96, !95}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !98, file: !99, line: 114, baseType: !296, size: 320, offset: 3968)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 320, elements: !288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !98, file: !99, line: 115, baseType: !270, size: 32, offset: 4288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !98, file: !99, line: 120, baseType: !285, size: 64, offset: 4352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !98, file: !99, line: 121, baseType: !270, size: 32, offset: 4416)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !302, line: 1451, baseType: !143)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!303 = !{!0, !304}
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "VecRegisterAllCalled", scope: !2, file: !306, line: 5, type: !270, isLocal: false, isDefinition: true)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vecreg.c", directory: "/home/users/ndemeye/xSDK")
!307 = !{i32 7, !"Dwarf Version", i32 4}
!308 = !{i32 2, !"Debug Info Version", i32 3}
!309 = !{i32 1, !"wchar_size", i32 4}
!310 = !{i32 7, !"PIC Level", i32 2}
!311 = !{i32 7, !"uwtable", i32 1}
!312 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!313 = distinct !DISubprogram(name: "VecSetType", scope: !306, file: !306, line: 29, type: !314, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !619)
!314 = !DISubroutineType(types: !315)
!315 = !{!113, !316, !618}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !319, line: 142, size: 12800, elements: !320)
!319 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!320 = !{!321, !323, !543, !564, !565, !566, !612, !613, !614, !615, !617}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !318, file: !319, line: 143, baseType: !322, size: 4480)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !99, line: 122, baseType: !98)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !318, file: !319, line: 143, baseType: !324, size: 5248, offset: 4480)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 5248, elements: !151)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !319, line: 23, size: 5248, elements: !326)
!326 = !{!327, !332, !337, !341, !345, !351, !356, !357, !358, !362, !366, !367, !368, !372, !376, !382, !383, !387, !391, !395, !396, !403, !407, !408, !412, !416, !417, !418, !422, !423, !430, !435, !436, !437, !441, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !462, !463, !464, !468, !472, !473, !474, !475, !479, !480, !481, !482, !483, !484, !485, !489, !490, !494, !501, !502, !507, !508, !512, !513, !514, !515, !516, !517, !518, !519, !523, !524, !525, !531, !535, !536, !537}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !325, file: !319, line: 24, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!113, !316, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !325, file: !319, line: 25, baseType: !333, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!113, !316, !155, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !325, file: !319, line: 26, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!113, !155, !331}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !325, file: !319, line: 27, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!113, !316, !316, !217}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !325, file: !319, line: 28, baseType: !346, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!113, !316, !155, !349, !217}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !325, file: !319, line: 29, baseType: !352, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!113, !316, !355, !208}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !325, file: !319, line: 30, baseType: !342, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !325, file: !319, line: 31, baseType: !346, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !325, file: !319, line: 32, baseType: !359, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!113, !316, !218}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !325, file: !319, line: 33, baseType: !363, size: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!113, !316, !316}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !325, file: !319, line: 34, baseType: !359, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !325, file: !319, line: 35, baseType: !363, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !325, file: !319, line: 36, baseType: !369, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!113, !316, !218, !316}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !325, file: !319, line: 37, baseType: !373, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!113, !316, !218, !218, !316}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !325, file: !319, line: 38, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!113, !316, !155, !380, !331}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !325, file: !319, line: 39, baseType: !369, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !325, file: !319, line: 40, baseType: !384, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!113, !316, !218, !316, !316}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !325, file: !319, line: 41, baseType: !388, size: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!113, !316, !218, !218, !218, !316, !316}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !325, file: !319, line: 42, baseType: !392, size: 64, offset: 1152)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!113, !316, !316, !316}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !325, file: !319, line: 43, baseType: !392, size: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !325, file: !319, line: 44, baseType: !397, size: 64, offset: 1280)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!113, !316, !155, !400, !380, !402}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !325, file: !319, line: 45, baseType: !404, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!113, !316}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !325, file: !319, line: 46, baseType: !404, size: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !325, file: !319, line: 47, baseType: !409, size: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!113, !316, !220}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !325, file: !319, line: 48, baseType: !413, size: 64, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!113, !316, !200}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !325, file: !319, line: 49, baseType: !413, size: 64, offset: 1600)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !325, file: !319, line: 50, baseType: !409, size: 64, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !325, file: !319, line: 51, baseType: !419, size: 64, offset: 1728)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!113, !316, !200, !208}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !325, file: !319, line: 52, baseType: !419, size: 64, offset: 1792)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !325, file: !319, line: 53, baseType: !424, size: 64, offset: 1856)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!113, !316, !427}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !325, file: !319, line: 54, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!113, !316, !434, !270}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !325, file: !319, line: 55, baseType: !397, size: 64, offset: 1984)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !325, file: !319, line: 56, baseType: !404, size: 64, offset: 2048)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !325, file: !319, line: 57, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!113, !316, !119}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !325, file: !319, line: 58, baseType: !442, size: 64, offset: 2176)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!113, !316, !380}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !325, file: !319, line: 59, baseType: !442, size: 64, offset: 2240)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !325, file: !319, line: 60, baseType: !342, size: 64, offset: 2304)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !325, file: !319, line: 61, baseType: !342, size: 64, offset: 2368)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !325, file: !319, line: 62, baseType: !352, size: 64, offset: 2432)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !325, file: !319, line: 63, baseType: !346, size: 64, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !325, file: !319, line: 64, baseType: !346, size: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !325, file: !319, line: 65, baseType: !438, size: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !325, file: !319, line: 66, baseType: !404, size: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !325, file: !319, line: 67, baseType: !404, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !325, file: !319, line: 68, baseType: !455, size: 64, offset: 2816)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!113, !316, !458}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !459, line: 30, baseType: !460)
!459 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !459, line: 30, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !325, file: !319, line: 69, baseType: !397, size: 64, offset: 2880)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !325, file: !319, line: 70, baseType: !404, size: 64, offset: 2944)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !325, file: !319, line: 71, baseType: !465, size: 64, offset: 3008)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!113, !246, !316}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !325, file: !319, line: 72, baseType: !469, size: 64, offset: 3072)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!113, !316, !316, !208}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !325, file: !319, line: 73, baseType: !392, size: 64, offset: 3136)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !325, file: !319, line: 74, baseType: !392, size: 64, offset: 3200)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !325, file: !319, line: 75, baseType: !392, size: 64, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !325, file: !319, line: 76, baseType: !476, size: 64, offset: 3328)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!113, !316, !155, !400, !217}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !325, file: !319, line: 77, baseType: !404, size: 64, offset: 3392)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !325, file: !319, line: 78, baseType: !404, size: 64, offset: 3456)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !325, file: !319, line: 79, baseType: !404, size: 64, offset: 3520)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !325, file: !319, line: 80, baseType: !404, size: 64, offset: 3584)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !325, file: !319, line: 81, baseType: !359, size: 64, offset: 3648)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !325, file: !319, line: 82, baseType: !404, size: 64, offset: 3712)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !325, file: !319, line: 83, baseType: !486, size: 64, offset: 3776)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!113, !316, !155, !316, !402}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !325, file: !319, line: 84, baseType: !486, size: 64, offset: 3840)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !325, file: !319, line: 85, baseType: !491, size: 64, offset: 3904)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!113, !316, !316, !217, !217}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !325, file: !319, line: 86, baseType: !495, size: 64, offset: 3968)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!113, !316, !498, !331}
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !459, line: 11, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !459, line: 11, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !325, file: !319, line: 87, baseType: !495, size: 64, offset: 4032)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !325, file: !319, line: 88, baseType: !503, size: 64, offset: 4096)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!113, !316, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !325, file: !319, line: 89, baseType: !503, size: 64, offset: 4160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !325, file: !319, line: 90, baseType: !509, size: 64, offset: 4224)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!113, !316, !155, !400, !400, !316, !402}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !325, file: !319, line: 91, baseType: !509, size: 64, offset: 4288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !325, file: !319, line: 92, baseType: !438, size: 64, offset: 4352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !325, file: !319, line: 93, baseType: !438, size: 64, offset: 4416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !325, file: !319, line: 94, baseType: !363, size: 64, offset: 4480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !325, file: !319, line: 95, baseType: !363, size: 64, offset: 4544)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !325, file: !319, line: 96, baseType: !363, size: 64, offset: 4608)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !325, file: !319, line: 97, baseType: !363, size: 64, offset: 4672)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !325, file: !319, line: 98, baseType: !520, size: 64, offset: 4736)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!113, !316, !270}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !325, file: !319, line: 99, baseType: !409, size: 64, offset: 4800)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !325, file: !319, line: 100, baseType: !409, size: 64, offset: 4864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !325, file: !319, line: 101, baseType: !526, size: 64, offset: 4928)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!113, !316, !220, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !325, file: !319, line: 102, baseType: !532, size: 64, offset: 4992)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!113, !316, !506, !529}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !325, file: !319, line: 103, baseType: !409, size: 64, offset: 5056)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !325, file: !319, line: 104, baseType: !503, size: 64, offset: 5120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !325, file: !319, line: 105, baseType: !538, size: 64, offset: 5184)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!113, !155, !349, !331, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !318, file: !319, line: 144, baseType: !544, size: 64, offset: 9728)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !459, line: 60, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !547, line: 240, size: 640, elements: !548)
!547 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !546, file: !547, line: 241, baseType: !91, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !546, file: !547, line: 242, baseType: !172, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !546, file: !547, line: 243, baseType: !155, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !546, file: !547, line: 243, baseType: !155, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !546, file: !547, line: 244, baseType: !155, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !546, file: !547, line: 244, baseType: !155, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !546, file: !547, line: 245, baseType: !200, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !546, file: !547, line: 246, baseType: !270, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !546, file: !547, line: 247, baseType: !155, size: 32, offset: 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !546, file: !547, line: 251, baseType: !155, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !546, file: !547, line: 252, baseType: !458, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !546, file: !547, line: 253, baseType: !270, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !546, file: !547, line: 254, baseType: !155, size: 32, offset: 544)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !546, file: !547, line: 254, baseType: !155, size: 32, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !546, file: !547, line: 255, baseType: !155, size: 32, offset: 608)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 145, baseType: !95, size: 64, offset: 9792)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !318, file: !319, line: 146, baseType: !270, size: 32, offset: 9856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !318, file: !319, line: 147, baseType: !567, size: 1344, offset: 9920)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !319, line: 140, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 114, size: 1344, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !588, !589, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !568, file: !319, line: 115, baseType: !155, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !568, file: !319, line: 116, baseType: !155, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !568, file: !319, line: 117, baseType: !155, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !568, file: !319, line: 118, baseType: !155, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !568, file: !319, line: 119, baseType: !155, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !568, file: !319, line: 120, baseType: !155, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !568, file: !319, line: 121, baseType: !200, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !568, file: !319, line: 122, baseType: !217, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !568, file: !319, line: 124, baseType: !91, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !319, line: 125, baseType: !172, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !568, file: !319, line: 125, baseType: !172, size: 32, offset: 416)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !568, file: !319, line: 126, baseType: !172, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !568, file: !319, line: 126, baseType: !172, size: 32, offset: 480)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !568, file: !319, line: 127, baseType: !584, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !92, line: 339, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !92, line: 339, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !568, file: !319, line: 128, baseType: !584, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !568, file: !319, line: 129, baseType: !590, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !92, line: 341, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !92, line: 351, size: 192, elements: !593)
!593 = !{!594, !595, !596, !597, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !592, file: !92, line: 354, baseType: !103, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !592, file: !92, line: 355, baseType: !103, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !592, file: !92, line: 356, baseType: !103, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !592, file: !92, line: 361, baseType: !103, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !592, file: !92, line: 362, baseType: !266, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !568, file: !319, line: 130, baseType: !155, size: 32, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !568, file: !319, line: 130, baseType: !155, size: 32, offset: 736)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !568, file: !319, line: 131, baseType: !217, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !568, file: !319, line: 131, baseType: !217, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !568, file: !319, line: 132, baseType: !200, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !568, file: !319, line: 132, baseType: !200, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !568, file: !319, line: 133, baseType: !155, size: 32, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !568, file: !319, line: 134, baseType: !200, size: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !568, file: !319, line: 135, baseType: !155, size: 32, offset: 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !568, file: !319, line: 136, baseType: !270, size: 32, offset: 1184)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !568, file: !319, line: 137, baseType: !270, size: 32, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !568, file: !319, line: 138, baseType: !402, size: 32, offset: 1248)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !568, file: !319, line: 139, baseType: !200, size: 64, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !318, file: !319, line: 147, baseType: !567, size: 1344, offset: 11264)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !318, file: !319, line: 148, baseType: !270, size: 32, offset: 12608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !318, file: !319, line: 149, baseType: !155, size: 32, offset: 12640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !318, file: !319, line: 150, baseType: !616, size: 32, offset: 12672)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !318, file: !319, line: 157, baseType: !182, size: 64, offset: 12736)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !27, line: 83, baseType: !132)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !628, !630, !636, !637, !639, !643, !645, !649, !651, !653, !655}
!620 = !DILocalVariable(name: "vec", arg: 1, scope: !313, file: !306, line: 29, type: !316)
!621 = !DILocalVariable(name: "method", arg: 2, scope: !313, file: !306, line: 29, type: !618)
!622 = !DILocalVariable(name: "r", scope: !313, file: !306, line: 31, type: !404)
!623 = !DILocalVariable(name: "match", scope: !313, file: !306, line: 32, type: !270)
!624 = !DILocalVariable(name: "size", scope: !313, file: !306, line: 33, type: !172)
!625 = !DILocalVariable(name: "ierr", scope: !313, file: !306, line: 34, type: !113)
!626 = !DILocalVariable(name: "ierr__", scope: !627, file: !306, line: 38, type: !113)
!627 = distinct !DILexicalBlock(scope: !313, file: !306, line: 38, column: 68)
!628 = !DILocalVariable(name: "_7_errorcode", scope: !629, file: !306, line: 44, type: !113)
!629 = distinct !DILexicalBlock(scope: !313, file: !306, line: 44, column: 65)
!630 = !DILocalVariable(name: "_7_errorstring", scope: !631, file: !306, line: 44, type: !633)
!631 = distinct !DILexicalBlock(scope: !632, file: !306, line: 44, column: 65)
!632 = distinct !DILexicalBlock(scope: !629, file: !306, line: 44, column: 65)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 2048, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 256)
!636 = !DILocalVariable(name: "_7_resultlen", scope: !631, file: !306, line: 44, type: !172)
!637 = !DILocalVariable(name: "ierr__", scope: !638, file: !306, line: 45, type: !113)
!638 = distinct !DILexicalBlock(scope: !313, file: !306, line: 45, column: 49)
!639 = !DILocalVariable(name: "ierr__", scope: !640, file: !306, line: 48, type: !113)
!640 = distinct !DILexicalBlock(scope: !641, file: !306, line: 48, column: 90)
!641 = distinct !DILexicalBlock(scope: !642, file: !306, line: 46, column: 14)
!642 = distinct !DILexicalBlock(scope: !313, file: !306, line: 46, column: 7)
!643 = !DILocalVariable(name: "ierr__", scope: !644, file: !306, line: 80, type: !113)
!644 = distinct !DILexicalBlock(scope: !313, file: !306, line: 80, column: 51)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !306, line: 83, type: !113)
!646 = distinct !DILexicalBlock(scope: !647, file: !306, line: 83, column: 38)
!647 = distinct !DILexicalBlock(scope: !648, file: !306, line: 82, column: 26)
!648 = distinct !DILexicalBlock(scope: !313, file: !306, line: 82, column: 7)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !306, line: 86, type: !113)
!650 = distinct !DILexicalBlock(scope: !313, file: !306, line: 86, column: 56)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !306, line: 87, type: !113)
!652 = distinct !DILexicalBlock(scope: !313, file: !306, line: 87, column: 42)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !306, line: 88, type: !113)
!654 = distinct !DILexicalBlock(scope: !313, file: !306, line: 88, column: 63)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !306, line: 93, type: !113)
!656 = distinct !DILexicalBlock(scope: !657, file: !306, line: 93, column: 22)
!657 = distinct !DILexicalBlock(scope: !658, file: !306, line: 92, column: 10)
!658 = distinct !DILexicalBlock(scope: !313, file: !306, line: 89, column: 7)
!659 = !DILocation(line: 0, scope: !313)
!660 = !DILocation(line: 31, column: 3, scope: !313)
!661 = !DILocation(line: 32, column: 3, scope: !313)
!662 = !DILocation(line: 33, column: 3, scope: !313)
!663 = !DILocation(line: 36, column: 3, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !306, line: 36, column: 3)
!665 = distinct !DILexicalBlock(scope: !666, file: !306, line: 36, column: 3)
!666 = distinct !DILexicalBlock(scope: !313, file: !306, line: 36, column: 3)
!667 = !{!668, !668, i64 0}
