; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/tikz/tikz.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/tikz/tikz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!1 = distinct !DIGlobalVariable(name: "DvOps", scope: !2, file: !262, line: 187, type: !329, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !323, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/tikz/tikz.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !38, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 204, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 141, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 663, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!50 = !{!51, !55, !56, !59, !95, !145, !260, !121, !320, !66}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !52, line: 330, baseType: !53)
!52 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !52, line: 330, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!58 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !62, line: 73, size: 4480, elements: !63)
!62 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!63 = !{!64, !67, !116, !117, !119, !122, !123, !124, !125, !133, !134, !136, !140, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !161, !162, !164, !166, !167, !168, !169, !170, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !196, !198, !199, !203, !204, !250, !255, !257, !258, !259}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !61, file: !62, line: 74, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !66)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !61, file: !62, line: 75, baseType: !68, size: 448, offset: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 448, elements: !114)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !62, line: 53, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 45, size: 448, elements: !71)
!71 = !{!72, !78, !86, !91, !98, !102, !109}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !70, file: !62, line: 46, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !59, !77}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !66)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !70, file: !62, line: 47, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!76, !59, !82}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !83, line: 16, baseType: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !83, line: 16, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !70, file: !62, line: 48, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!76, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !70, file: !62, line: 49, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!76, !59, !95, !59}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !70, file: !62, line: 50, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!76, !59, !95, !90}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !70, file: !62, line: 51, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!76, !59, !95, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !70, file: !62, line: 52, baseType: !110, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!76, !59, !95, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !61, file: !62, line: 76, baseType: !51, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !62, line: 77, baseType: !118, size: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !66)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !61, file: !62, line: 78, baseType: !120, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !121)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !61, file: !62, line: 78, baseType: !120, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !61, file: !62, line: 78, baseType: !120, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !61, file: !62, line: 78, baseType: !120, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !61, file: !62, line: 79, baseType: !126, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !129, line: 27, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !61, file: !62, line: 80, baseType: !118, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !61, file: !62, line: 81, baseType: !135, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !66)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !61, file: !62, line: 82, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !61, file: !62, line: 83, baseType: !141, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !61, file: !62, line: 84, baseType: !145, size: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !61, file: !62, line: 85, baseType: !145, size: 64, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !61, file: !62, line: 86, baseType: !145, size: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !61, file: !62, line: 87, baseType: !145, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !61, file: !62, line: 88, baseType: !59, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !61, file: !62, line: 89, baseType: !126, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !62, line: 90, baseType: !145, size: 64, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !61, file: !62, line: 91, baseType: !145, size: 64, offset: 1600)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !61, file: !62, line: 92, baseType: !118, size: 32, offset: 1664)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !61, file: !62, line: 93, baseType: !55, size: 64, offset: 1728)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !61, file: !62, line: 94, baseType: !156, size: 64, offset: 1792)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !127)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !61, file: !62, line: 95, baseType: !118, size: 32, offset: 1856)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !61, file: !62, line: 95, baseType: !118, size: 32, offset: 1888)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !61, file: !62, line: 96, baseType: !160, size: 64, offset: 1920)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !61, file: !62, line: 96, baseType: !160, size: 64, offset: 1984)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !61, file: !62, line: 97, baseType: !163, size: 64, offset: 2048)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !61, file: !62, line: 97, baseType: !165, size: 64, offset: 2112)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !61, file: !62, line: 98, baseType: !118, size: 32, offset: 2176)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !61, file: !62, line: 98, baseType: !118, size: 32, offset: 2208)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !61, file: !62, line: 99, baseType: !160, size: 64, offset: 2240)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !61, file: !62, line: 99, baseType: !160, size: 64, offset: 2304)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !61, file: !62, line: 100, baseType: !171, size: 64, offset: 2368)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !121)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !61, file: !62, line: 100, baseType: !174, size: 64, offset: 2432)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !61, file: !62, line: 101, baseType: !118, size: 32, offset: 2496)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !61, file: !62, line: 101, baseType: !118, size: 32, offset: 2528)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !61, file: !62, line: 102, baseType: !160, size: 64, offset: 2560)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !61, file: !62, line: 102, baseType: !160, size: 64, offset: 2624)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !61, file: !62, line: 103, baseType: !180, size: 64, offset: 2688)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !172)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !61, file: !62, line: 103, baseType: !183, size: 64, offset: 2752)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !61, file: !62, line: 104, baseType: !113, size: 64, offset: 2816)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !61, file: !62, line: 105, baseType: !118, size: 32, offset: 2880)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !61, file: !62, line: 106, baseType: !187, size: 128, offset: 2944)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !194)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !62, line: 64, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 61, size: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !190, file: !62, line: 62, baseType: !106, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !190, file: !62, line: 63, baseType: !55, size: 64, offset: 64)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !61, file: !62, line: 107, baseType: !197, size: 64, offset: 3072)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !194)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !61, file: !62, line: 108, baseType: !55, size: 64, offset: 3136)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !61, file: !62, line: 109, baseType: !200, size: 64, offset: 3200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!76, !55}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !61, file: !62, line: 111, baseType: !118, size: 32, offset: 3264)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !61, file: !62, line: 112, baseType: !205, size: 320, offset: 3328)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 320, elements: !248)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!76, !209, !59, !55}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !212)
!212 = !{!213, !214, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !211, file: !12, line: 100, baseType: !118, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !12, line: 101, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !226, !227, !228, !229, !231, !233, !234, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !217, file: !12, line: 84, baseType: !145, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !217, file: !12, line: 85, baseType: !145, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !12, line: 86, baseType: !55, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !217, file: !12, line: 87, baseType: !137, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !217, file: !12, line: 88, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !217, file: !12, line: 89, baseType: !97, size: 8, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !217, file: !12, line: 90, baseType: !145, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !217, file: !12, line: 91, baseType: !56, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !217, file: !12, line: 92, baseType: !230, size: 32, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !12, line: 93, baseType: !232, size: 32, offset: 544)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !12, line: 94, baseType: !215, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !217, file: !12, line: 95, baseType: !145, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !217, file: !12, line: 96, baseType: !55, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !211, file: !12, line: 102, baseType: !145, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !211, file: !12, line: 102, baseType: !145, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !211, file: !12, line: 103, baseType: !145, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !211, file: !12, line: 104, baseType: !51, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !211, file: !12, line: 105, baseType: !230, size: 32, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !211, file: !12, line: 105, baseType: !230, size: 32, offset: 416)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !211, file: !12, line: 105, baseType: !230, size: 32, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !211, file: !12, line: 106, baseType: !59, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !211, file: !12, line: 107, baseType: !245, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!248 = !{!249}
!249 = !DISubrange(count: 5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !61, file: !62, line: 113, baseType: !251, size: 320, offset: 3648)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 320, elements: !248)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!76, !59, !55}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !61, file: !62, line: 114, baseType: !256, size: 320, offset: 3968)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320, elements: !248)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !61, file: !62, line: 115, baseType: !230, size: 32, offset: 4288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !61, file: !62, line: 120, baseType: !245, size: 64, offset: 4352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !61, file: !62, line: 121, baseType: !230, size: 32, offset: 4416)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_TikZ", file: !262, line: 11, baseType: !263)
!262 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/tikz/tikz.c", directory: "/home/users/ndemeye/xSDK")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 7, size: 192, elements: !264)
!264 = !{!265, !266, !319}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !263, file: !262, line: 8, baseType: !145, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !263, file: !262, line: 9, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !269, line: 7, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !271, line: 245, size: 1728, elements: !272)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !293, !294, !295, !296, !298, !300, !302, !304, !307, !309, !310, !311, !312, !313, !314, !315}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !270, file: !271, line: 246, baseType: !66, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !270, file: !271, line: 251, baseType: !145, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !270, file: !271, line: 252, baseType: !145, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !270, file: !271, line: 253, baseType: !145, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !270, file: !271, line: 254, baseType: !145, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !270, file: !271, line: 255, baseType: !145, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !270, file: !271, line: 256, baseType: !145, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !270, file: !271, line: 257, baseType: !145, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !270, file: !271, line: 258, baseType: !145, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !270, file: !271, line: 260, baseType: !145, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !270, file: !271, line: 261, baseType: !145, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !270, file: !271, line: 262, baseType: !145, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !270, file: !271, line: 264, baseType: !286, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !271, line: 160, size: 192, elements: !288)
!288 = !{!289, !290, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !287, file: !271, line: 161, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !287, file: !271, line: 162, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !287, file: !271, line: 166, baseType: !66, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !270, file: !271, line: 266, baseType: !291, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !270, file: !271, line: 268, baseType: !66, size: 32, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !270, file: !271, line: 272, baseType: !66, size: 32, offset: 928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !270, file: !271, line: 274, baseType: !297, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !131, line: 140, baseType: !132)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !270, file: !271, line: 278, baseType: !299, size: 16, offset: 1024)
!299 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !270, file: !271, line: 279, baseType: !301, size: 8, offset: 1040)
!301 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !270, file: !271, line: 280, baseType: !303, size: 8, offset: 1048)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 8, elements: !114)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !270, file: !271, line: 284, baseType: !305, size: 64, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !271, line: 154, baseType: null)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !270, file: !271, line: 293, baseType: !308, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !131, line: 141, baseType: !132)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !270, file: !271, line: 301, baseType: !55, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !270, file: !271, line: 302, baseType: !55, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !270, file: !271, line: 303, baseType: !55, size: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !270, file: !271, line: 304, baseType: !55, size: 64, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !270, file: !271, line: 306, baseType: !56, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !270, file: !271, line: 307, baseType: !66, size: 32, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !270, file: !271, line: 309, baseType: !316, size: 160, offset: 1568)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 160, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 20)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !263, file: !262, line: 10, baseType: !230, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !52, line: 338, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !52, line: 338, flags: DIFlagFwdDecl)
!323 = !{!0, !324}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "TikZColors", scope: !2, file: !262, line: 56, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1024, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !330, line: 14, size: 2304, elements: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!331 = !{!332, !381, !382, !386, !390, !394, !398, !399, !403, !404, !408, !412, !416, !417, !421, !425, !426, !432, !433, !434, !435, !440, !444, !445, !449, !450, !454, !455, !456, !457, !469, !470, !471, !476, !480, !484}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !329, file: !330, line: 15, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!76, !336}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !337, line: 25, baseType: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !330, line: 53, size: 11072, elements: !340)
!340 = !{!341, !343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !356, !357, !358, !359, !360, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !339, file: !330, line: 54, baseType: !342, size: 4480)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !62, line: 122, baseType: !61)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !339, file: !330, line: 54, baseType: !344, size: 2304, offset: 4480)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 2304, elements: !114)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !339, file: !330, line: 55, baseType: !172, size: 64, offset: 6784)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !339, file: !330, line: 56, baseType: !172, size: 64, offset: 6848)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !339, file: !330, line: 56, baseType: !172, size: 64, offset: 6912)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !339, file: !330, line: 56, baseType: !172, size: 64, offset: 6976)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !339, file: !330, line: 56, baseType: !172, size: 64, offset: 7040)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !339, file: !330, line: 57, baseType: !172, size: 64, offset: 7104)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !339, file: !330, line: 57, baseType: !172, size: 64, offset: 7168)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !339, file: !330, line: 57, baseType: !172, size: 64, offset: 7232)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !339, file: !330, line: 57, baseType: !172, size: 64, offset: 7296)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !339, file: !330, line: 58, baseType: !355, size: 1280, offset: 7360)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 1280, elements: !317)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !339, file: !330, line: 58, baseType: !355, size: 1280, offset: 8640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !339, file: !330, line: 59, baseType: !172, size: 64, offset: 9920)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !339, file: !330, line: 59, baseType: !172, size: 64, offset: 9984)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !339, file: !330, line: 59, baseType: !172, size: 64, offset: 10048)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !339, file: !330, line: 59, baseType: !172, size: 64, offset: 10112)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !339, file: !330, line: 60, baseType: !118, size: 32, offset: 10176)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !339, file: !330, line: 61, baseType: !363, size: 32, offset: 10208)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !27, line: 141, baseType: !38)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !339, file: !330, line: 62, baseType: !145, size: 64, offset: 10240)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !339, file: !330, line: 63, baseType: !145, size: 64, offset: 10304)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !339, file: !330, line: 64, baseType: !336, size: 64, offset: 10368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !339, file: !330, line: 65, baseType: !66, size: 32, offset: 10432)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !339, file: !330, line: 65, baseType: !66, size: 32, offset: 10464)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !339, file: !330, line: 65, baseType: !66, size: 32, offset: 10496)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !339, file: !330, line: 65, baseType: !66, size: 32, offset: 10528)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !339, file: !330, line: 66, baseType: !145, size: 64, offset: 10560)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !339, file: !330, line: 67, baseType: !145, size: 64, offset: 10624)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !339, file: !330, line: 68, baseType: !145, size: 64, offset: 10688)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !339, file: !330, line: 69, baseType: !118, size: 32, offset: 10752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !339, file: !330, line: 70, baseType: !230, size: 32, offset: 10784)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !339, file: !330, line: 71, baseType: !118, size: 32, offset: 10816)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !339, file: !330, line: 72, baseType: !145, size: 64, offset: 10880)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !339, file: !330, line: 73, baseType: !230, size: 32, offset: 10944)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !339, file: !330, line: 74, baseType: !230, size: 32, offset: 10976)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !330, line: 75, baseType: !55, size: 64, offset: 11008)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !329, file: !330, line: 16, baseType: !333, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !329, file: !330, line: 17, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!76, !336, !172, !172, !172, !172, !66}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !329, file: !330, line: 18, baseType: !387, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!76, !336, !172}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !329, file: !330, line: 19, baseType: !391, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!76, !336, !171}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !329, file: !330, line: 20, baseType: !395, size: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!76, !336, !172, !172, !66}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !329, file: !330, line: 21, baseType: !387, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !329, file: !330, line: 22, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!76, !336, !172, !172, !66, !95}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !329, file: !330, line: 23, baseType: !400, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !329, file: !330, line: 24, baseType: !405, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!76, !336, !172, !172}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !329, file: !330, line: 25, baseType: !409, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!76, !336, !171, !171}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !329, file: !330, line: 26, baseType: !413, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!76, !336, !172, !172, !172, !172}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !329, file: !330, line: 27, baseType: !333, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !329, file: !330, line: 28, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!76, !336, !172, !172, !172, !172, !66, !66, !66, !66}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !329, file: !330, line: 29, baseType: !422, size: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!76, !336, !172, !172, !172, !172, !172, !172, !66, !66, !66}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !329, file: !330, line: 30, baseType: !383, size: 64, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !329, file: !330, line: 31, baseType: !427, size: 64, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!76, !336, !430, !171, !171, !171, !171}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !27, line: 207, baseType: !26)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !329, file: !330, line: 32, baseType: !333, size: 64, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !329, file: !330, line: 33, baseType: !333, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !329, file: !330, line: 34, baseType: !333, size: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !329, file: !330, line: 35, baseType: !436, size: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!76, !336, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !329, file: !330, line: 36, baseType: !441, size: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!76, !336, !95}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !329, file: !330, line: 37, baseType: !333, size: 64, offset: 1408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !329, file: !330, line: 38, baseType: !446, size: 64, offset: 1472)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!76, !336, !66, !66}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !330, line: 39, baseType: !333, size: 64, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !330, line: 40, baseType: !451, size: 64, offset: 1600)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!76, !336, !82}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !329, file: !330, line: 41, baseType: !436, size: 64, offset: 1664)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !329, file: !330, line: 42, baseType: !436, size: 64, offset: 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !329, file: !330, line: 43, baseType: !333, size: 64, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !329, file: !330, line: 44, baseType: !458, size: 64, offset: 1856)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!76, !336, !461, !466, !466, !467}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 24, elements: !464)
!463 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!464 = !{!465}
!465 = !DISubrange(count: 3)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !329, file: !330, line: 45, baseType: !413, size: 64, offset: 1920)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !329, file: !330, line: 46, baseType: !383, size: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !329, file: !330, line: 47, baseType: !472, size: 64, offset: 2048)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!76, !336, !172, !172, !475, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !329, file: !330, line: 48, baseType: !477, size: 64, offset: 2112)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!76, !336, !66, !66, !171, !171}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !329, file: !330, line: 49, baseType: !481, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!76, !336, !66, !66, !66}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !329, file: !330, line: 50, baseType: !485, size: 64, offset: 2240)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!76, !336, !172, !172, !66, !66, !95, !171, !171}
!488 = !{i32 7, !"Dwarf Version", i32 4}
!489 = !{i32 2, !"Debug Info Version", i32 3}
!490 = !{i32 1, !"wchar_size", i32 4}
!491 = !{i32 7, !"PIC Level", i32 2}
!492 = !{i32 7, !"uwtable", i32 1}
!493 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!494 = distinct !DISubprogram(name: "PetscDrawCreate_TikZ", scope: !262, file: !262, line: 224, type: !334, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !495)
!495 = !{!496, !497, !498, !499, !501, !503, !505, !509, !511, !513, !515, !517, !519}
!496 = !DILocalVariable(name: "draw", arg: 1, scope: !494, file: !262, line: 224, type: !336)
!497 = !DILocalVariable(name: "win", scope: !494, file: !262, line: 226, type: !260)
!498 = !DILocalVariable(name: "ierr", scope: !494, file: !262, line: 227, type: !76)
!499 = !DILocalVariable(name: "ierr__", scope: !500, file: !262, line: 230, type: !76)
!500 = distinct !DILexicalBlock(scope: !494, file: !262, line: 230, column: 54)
!501 = !DILocalVariable(name: "ierr__", scope: !502, file: !262, line: 231, type: !76)
!502 = distinct !DILexicalBlock(scope: !494, file: !262, line: 231, column: 25)
!503 = !DILocalVariable(name: "ierr__", scope: !504, file: !262, line: 232, type: !76)
!504 = distinct !DILexicalBlock(scope: !494, file: !262, line: 232, column: 73)
!505 = !DILocalVariable(name: "ierr__", scope: !506, file: !262, line: 237, type: !76)
!506 = distinct !DILexicalBlock(scope: !507, file: !262, line: 237, column: 56)
!507 = distinct !DILexicalBlock(scope: !508, file: !262, line: 236, column: 20)
!508 = distinct !DILexicalBlock(scope: !494, file: !262, line: 236, column: 7)
!509 = !DILocalVariable(name: "fname", scope: !510, file: !262, line: 239, type: !95)
!510 = distinct !DILexicalBlock(scope: !508, file: !262, line: 238, column: 10)
!511 = !DILocalVariable(name: "ierr__", scope: !512, file: !262, line: 240, type: !76)
!512 = distinct !DILexicalBlock(scope: !510, file: !262, line: 240, column: 57)
!513 = !DILocalVariable(name: "ierr__", scope: !514, file: !262, line: 241, type: !76)
!514 = distinct !DILexicalBlock(scope: !510, file: !262, line: 241, column: 50)
!515 = !DILocalVariable(name: "ierr__", scope: !516, file: !262, line: 243, type: !76)
!516 = distinct !DILexicalBlock(scope: !494, file: !262, line: 243, column: 84)
!517 = !DILocalVariable(name: "ierr__", scope: !518, file: !262, line: 244, type: !76)
!518 = distinct !DILexicalBlock(scope: !494, file: !262, line: 244, column: 87)
!519 = !DILocalVariable(name: "ierr__", scope: !520, file: !262, line: 245, type: !76)
!520 = distinct !DILexicalBlock(scope: !494, file: !262, line: 245, column: 84)
!521 = !DILocation(line: 0, scope: !494)
!522 = !DILocation(line: 226, column: 3, scope: !494)
!523 = !DILocation(line: 229, column: 3, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !262, line: 229, column: 3)
!525 = distinct !DILexicalBlock(scope: !526, file: !262, line: 229, column: 3)
!526 = distinct !DILexicalBlock(scope: !494, file: !262, line: 229, column: 3)
!527 = !{!528, !528, i64 0}
!528 = !{!"any pointer", !529, i64 0}
!529 = !{!"omnipotent char", !530, i64 0}
!530 = !{!"Simple C/C++ TBAA"}
!531 = !DILocation(line: 229, column: 3, scope: !525)
!532 = !DILocation(line: 229, column: 3, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !262, line: 229, column: 3)
!534 = distinct !DILexicalBlock(scope: !524, file: !262, line: 229, column: 3)
!535 = !{!536, !537, i64 1536}
!536 = !{!"", !529, i64 0, !529, i64 512, !529, i64 1024, !529, i64 1280, !537, i64 1536, !537, i64 1540, !529, i64 1544}
