; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpoint.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpoint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!34 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !{!93, !97, !98, !134, !302, !222}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !94, line: 330, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !94, line: 330, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !101, line: 73, size: 4480, elements: !102)
!101 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!102 = !{!103, !106, !155, !156, !158, !161, !162, !163, !164, !172, !173, !175, !179, !183, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !196, !197, !198, !200, !201, !203, !205, !206, !207, !208, !209, !212, !214, !215, !216, !217, !218, !221, !223, !224, !225, !235, !237, !238, !242, !243, !292, !297, !299, !300, !301}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !100, file: !101, line: 74, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !105)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !100, file: !101, line: 75, baseType: !107, size: 448, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 448, elements: !153)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !101, line: 53, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 45, size: 448, elements: !110)
!110 = !{!111, !117, !125, !130, !137, !141, !148}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !109, file: !101, line: 46, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !98, !116}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !105)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !109, file: !101, line: 47, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!115, !98, !121}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !122, line: 16, baseType: !123)
!122 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !122, line: 16, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !109, file: !101, line: 48, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!115, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !109, file: !101, line: 49, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!115, !98, !134, !98}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !109, file: !101, line: 50, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!115, !98, !134, !129}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !109, file: !101, line: 51, baseType: !142, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!115, !98, !134, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !109, file: !101, line: 52, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!115, !98, !134, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !100, file: !101, line: 76, baseType: !93, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !101, line: 77, baseType: !157, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !105)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !100, file: !101, line: 78, baseType: !159, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !160)
!160 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !100, file: !101, line: 78, baseType: !159, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !100, file: !101, line: 78, baseType: !159, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !100, file: !101, line: 78, baseType: !159, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !100, file: !101, line: 79, baseType: !165, size: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !168, line: 27, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !170, line: 43, baseType: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!171 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !100, file: !101, line: 80, baseType: !157, size: 32, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !100, file: !101, line: 81, baseType: !174, size: 32, offset: 992)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !105)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !100, file: !101, line: 82, baseType: !176, size: 64, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !100, file: !101, line: 83, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !100, file: !101, line: 84, baseType: !184, size: 64, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !100, file: !101, line: 85, baseType: !184, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !100, file: !101, line: 86, baseType: !184, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !100, file: !101, line: 87, baseType: !184, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !100, file: !101, line: 88, baseType: !98, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !100, file: !101, line: 89, baseType: !165, size: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !101, line: 90, baseType: !184, size: 64, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !100, file: !101, line: 91, baseType: !184, size: 64, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !100, file: !101, line: 92, baseType: !157, size: 32, offset: 1664)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !100, file: !101, line: 93, baseType: !97, size: 64, offset: 1728)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !100, file: !101, line: 94, baseType: !195, size: 64, offset: 1792)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !166)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !100, file: !101, line: 95, baseType: !157, size: 32, offset: 1856)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !100, file: !101, line: 95, baseType: !157, size: 32, offset: 1888)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !100, file: !101, line: 96, baseType: !199, size: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !100, file: !101, line: 96, baseType: !199, size: 64, offset: 1984)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !100, file: !101, line: 97, baseType: !202, size: 64, offset: 2048)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !100, file: !101, line: 97, baseType: !204, size: 64, offset: 2112)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !100, file: !101, line: 98, baseType: !157, size: 32, offset: 2176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !100, file: !101, line: 98, baseType: !157, size: 32, offset: 2208)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !100, file: !101, line: 99, baseType: !199, size: 64, offset: 2240)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !100, file: !101, line: 99, baseType: !199, size: 64, offset: 2304)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !100, file: !101, line: 100, baseType: !210, size: 64, offset: 2368)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !100, file: !101, line: 100, baseType: !213, size: 64, offset: 2432)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !100, file: !101, line: 101, baseType: !157, size: 32, offset: 2496)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !100, file: !101, line: 101, baseType: !157, size: 32, offset: 2528)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !100, file: !101, line: 102, baseType: !199, size: 64, offset: 2560)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !100, file: !101, line: 102, baseType: !199, size: 64, offset: 2624)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !100, file: !101, line: 103, baseType: !219, size: 64, offset: 2688)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !211)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !100, file: !101, line: 103, baseType: !222, size: 64, offset: 2752)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !100, file: !101, line: 104, baseType: !152, size: 64, offset: 2816)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !100, file: !101, line: 105, baseType: !157, size: 32, offset: 2880)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !100, file: !101, line: 106, baseType: !226, size: 128, offset: 2944)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 128, elements: !233)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !101, line: 64, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 61, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !229, file: !101, line: 62, baseType: !145, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !229, file: !101, line: 63, baseType: !97, size: 64, offset: 64)
!233 = !{!234}
!234 = !DISubrange(count: 2)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !100, file: !101, line: 107, baseType: !236, size: 64, offset: 3072)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !233)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !100, file: !101, line: 108, baseType: !97, size: 64, offset: 3136)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !100, file: !101, line: 109, baseType: !239, size: 64, offset: 3200)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!115, !97}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !100, file: !101, line: 111, baseType: !157, size: 32, offset: 3264)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !100, file: !101, line: 112, baseType: !244, size: 320, offset: 3328)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 320, elements: !290)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!115, !248, !98, !97}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !251)
!251 = !{!252, !253, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !250, file: !10, line: 100, baseType: !157, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !10, line: 101, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !265, !266, !267, !271, !273, !275, !276, !277}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !256, file: !10, line: 84, baseType: !184, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !256, file: !10, line: 85, baseType: !184, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !10, line: 86, baseType: !97, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !256, file: !10, line: 87, baseType: !176, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !256, file: !10, line: 88, baseType: !263, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !256, file: !10, line: 89, baseType: !136, size: 8, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !256, file: !10, line: 90, baseType: !184, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !256, file: !10, line: 91, baseType: !268, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !269, line: 46, baseType: !270)
!269 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!270 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !256, file: !10, line: 92, baseType: !272, size: 32, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !10, line: 93, baseType: !274, size: 32, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !10, line: 94, baseType: !254, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !256, file: !10, line: 95, baseType: !184, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !256, file: !10, line: 96, baseType: !97, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !250, file: !10, line: 102, baseType: !184, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !250, file: !10, line: 102, baseType: !184, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !250, file: !10, line: 103, baseType: !184, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !250, file: !10, line: 104, baseType: !93, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 416)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !250, file: !10, line: 106, baseType: !98, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !250, file: !10, line: 107, baseType: !287, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!290 = !{!291}
!291 = !DISubrange(count: 5)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !100, file: !101, line: 113, baseType: !293, size: 320, offset: 3648)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!115, !98, !97}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !100, file: !101, line: 114, baseType: !298, size: 320, offset: 3968)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 320, elements: !290)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !100, file: !101, line: 115, baseType: !272, size: 32, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !100, file: !101, line: 120, baseType: !287, size: 64, offset: 4352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !100, file: !101, line: 121, baseType: !272, size: 32, offset: 4416)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!305 = !{i32 7, !"Dwarf Version", i32 4}
!306 = !{i32 2, !"Debug Info Version", i32 3}
!307 = !{i32 1, !"wchar_size", i32 4}
!308 = !{i32 7, !"PIC Level", i32 2}
!309 = !{i32 7, !"uwtable", i32 1}
!310 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!311 = distinct !DISubprogram(name: "DMPlexGetPointLocal", scope: !312, file: !312, line: 22, type: !313, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1058)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpoint.c", directory: "/home/users/ndemeye/xSDK")
!313 = !DISubroutineType(types: !314)
!314 = !{!115, !315, !157, !202, !202}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !318)
!318 = !{!319, !321, !554, !558, !559, !560, !561, !571, !572, !580, !581, !589, !590, !591, !592, !596, !597, !601, !603, !605, !606, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !634, !646, !658, !670, !679, !680, !703, !704, !705, !706, !707, !708, !710, !800, !801, !821, !822, !823, !824, !825, !826, !830, !831, !835, !836, !837, !838, !839, !840, !841, !842, !843, !846, !858, !859, !860, !869, !957, !958, !1046, !1047, !1048, !1049, !1051, !1053, !1054, !1055, !1056, !1057}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !317, file: !47, line: 203, baseType: !320, size: 4480)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !101, line: 122, baseType: !100)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !317, file: !47, line: 203, baseType: !322, size: 3456, offset: 4480)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 3456, elements: !153)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !324)
!324 = !{!325, !329, !330, !335, !339, !343, !344, !345, !354, !355, !356, !368, !369, !377, !386, !395, !399, !403, !404, !409, !410, !414, !415, !419, !420, !428, !432, !437, !438, !439, !440, !441, !442, !443, !447, !453, !457, !462, !466, !477, !479, !484, !491, !495, !496, !502, !513, !517, !525, !529, !537, !541, !549, !550}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !323, file: !47, line: 31, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!115, !315, !121}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !323, file: !47, line: 32, baseType: !326, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !323, file: !47, line: 33, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!115, !315, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !323, file: !47, line: 34, baseType: !336, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!115, !248, !315}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !323, file: !47, line: 35, baseType: !340, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!115, !315}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !323, file: !47, line: 36, baseType: !340, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !323, file: !47, line: 37, baseType: !340, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !323, file: !47, line: 38, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!115, !315, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !351, line: 21, baseType: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !351, line: 21, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !323, file: !47, line: 39, baseType: !346, size: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !323, file: !47, line: 40, baseType: !340, size: 64, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !323, file: !47, line: 41, baseType: !357, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!115, !315, !202, !360, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !365, line: 11, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !365, line: 11, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !323, file: !47, line: 42, baseType: !331, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !323, file: !47, line: 43, baseType: !370, size: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!115, !315, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !323, file: !47, line: 45, baseType: !378, size: 64, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!115, !315, !381, !382}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !365, line: 51, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !365, line: 51, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !323, file: !47, line: 46, baseType: !387, size: 64, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!115, !315, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !392, line: 16, baseType: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !392, line: 16, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !323, file: !47, line: 47, baseType: !396, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!115, !315, !315, !390, !349}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !323, file: !47, line: 48, baseType: !400, size: 64, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!115, !315, !315, !390}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !323, file: !47, line: 49, baseType: !400, size: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !323, file: !47, line: 50, baseType: !405, size: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!115, !315, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !323, file: !47, line: 51, baseType: !400, size: 64, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !323, file: !47, line: 53, baseType: !411, size: 64, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!115, !315, !93, !334}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !323, file: !47, line: 54, baseType: !411, size: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !323, file: !47, line: 55, baseType: !416, size: 64, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!115, !315, !157, !334}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !323, file: !47, line: 56, baseType: !416, size: 64, offset: 1472)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !323, file: !47, line: 57, baseType: !421, size: 64, offset: 1536)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!115, !315, !424, !334}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !425, line: 12, baseType: !426)
!425 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !425, line: 12, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !323, file: !47, line: 58, baseType: !429, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!115, !315, !350, !424, !334}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !323, file: !47, line: 60, baseType: !433, size: 64, offset: 1664)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!115, !315, !350, !436, !350}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !323, file: !47, line: 61, baseType: !433, size: 64, offset: 1728)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !323, file: !47, line: 62, baseType: !433, size: 64, offset: 1792)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !323, file: !47, line: 63, baseType: !433, size: 64, offset: 1856)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !323, file: !47, line: 64, baseType: !433, size: 64, offset: 1920)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !323, file: !47, line: 65, baseType: !433, size: 64, offset: 1984)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !323, file: !47, line: 67, baseType: !340, size: 64, offset: 2048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !323, file: !47, line: 69, baseType: !444, size: 64, offset: 2112)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!115, !315, !350, !350}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !323, file: !47, line: 71, baseType: !448, size: 64, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!115, !315, !157, !451, !363, !334}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !323, file: !47, line: 72, baseType: !454, size: 64, offset: 2240)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!115, !334, !157, !362, !334}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !323, file: !47, line: 73, baseType: !458, size: 64, offset: 2304)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!115, !315, !202, !360, !362, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !323, file: !47, line: 74, baseType: !463, size: 64, offset: 2368)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!115, !315, !202, !360, !362, !362, !461}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !323, file: !47, line: 75, baseType: !467, size: 64, offset: 2432)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!115, !315, !157, !334, !470, !470, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !473, line: 59, baseType: !474)
!473 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !473, line: 15, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !473, line: 15, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !323, file: !47, line: 77, baseType: !478, size: 64, offset: 2496)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !323, file: !47, line: 78, baseType: !480, size: 64, offset: 2560)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!115, !315, !350, !483, !474}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !323, file: !47, line: 79, baseType: !485, size: 64, offset: 2624)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!115, !315, !202, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !323, file: !47, line: 80, baseType: !492, size: 64, offset: 2688)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!115, !315, !210, !210}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !323, file: !47, line: 81, baseType: !492, size: 64, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !323, file: !47, line: 82, baseType: !497, size: 64, offset: 2816)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!115, !315, !350, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !323, file: !47, line: 84, baseType: !503, size: 64, offset: 2880)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!115, !315, !211, !506, !512, !436, !350}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!115, !157, !211, !510, !157, !219, !97}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !323, file: !47, line: 85, baseType: !514, size: 64, offset: 2944)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!115, !315, !211, !424, !157, !451, !157, !451, !506, !512, !436, !350}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !323, file: !47, line: 86, baseType: !518, size: 64, offset: 3008)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!115, !315, !211, !350, !521, !436, !350}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !157, !157, !157, !451, !451, !303, !303, !303, !451, !451, !303, !303, !303, !211, !510, !157, !303, !219}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !323, file: !47, line: 87, baseType: !526, size: 64, offset: 3072)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!115, !315, !211, !424, !157, !451, !157, !451, !350, !521, !436, !350}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !323, file: !47, line: 88, baseType: !530, size: 64, offset: 3136)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!115, !315, !211, !424, !157, !451, !157, !451, !350, !533, !436, !350}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !157, !157, !157, !451, !451, !303, !303, !303, !451, !451, !303, !303, !303, !211, !510, !510, !157, !303, !219}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !323, file: !47, line: 89, baseType: !538, size: 64, offset: 3200)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!115, !315, !211, !506, !512, !350, !210}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !323, file: !47, line: 90, baseType: !542, size: 64, offset: 3264)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!115, !315, !211, !545, !512, !350, !510, !210}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!115, !157, !211, !510, !510, !157, !219, !97}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !323, file: !47, line: 91, baseType: !538, size: 64, offset: 3328)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !323, file: !47, line: 93, baseType: !551, size: 64, offset: 3392)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!115, !315, !315, !408, !408}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !317, file: !47, line: 204, baseType: !555, size: 6400, offset: 7936)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 6400, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 100)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !317, file: !47, line: 204, baseType: !555, size: 6400, offset: 14336)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !317, file: !47, line: 205, baseType: !555, size: 6400, offset: 20736)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !317, file: !47, line: 205, baseType: !555, size: 6400, offset: 27136)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !317, file: !47, line: 206, baseType: !562, size: 64, offset: 33536)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !565)
!565 = !{!566, !567, !568, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !564, file: !47, line: 143, baseType: !350, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !47, line: 144, baseType: !184, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !564, file: !47, line: 145, baseType: !569, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !47, line: 146, baseType: !562, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !317, file: !47, line: 207, baseType: !562, size: 64, offset: 33600)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !317, file: !47, line: 208, baseType: !573, size: 64, offset: 33664)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !575, file: !47, line: 151, baseType: !268, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !575, file: !47, line: 152, baseType: !97, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !47, line: 153, baseType: !573, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !317, file: !47, line: 208, baseType: !573, size: 64, offset: 33728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !317, file: !47, line: 209, baseType: !582, size: 64, offset: 33792)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !584, file: !47, line: 159, baseType: !424, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !584, file: !47, line: 160, baseType: !272, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !47, line: 161, baseType: !583, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !317, file: !47, line: 210, baseType: !424, size: 64, offset: 33856)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !317, file: !47, line: 211, baseType: !424, size: 64, offset: 33920)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !317, file: !47, line: 212, baseType: !97, size: 64, offset: 33984)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !317, file: !47, line: 213, baseType: !593, size: 64, offset: 34048)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!115, !512}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !317, file: !47, line: 214, baseType: !381, size: 32, offset: 34112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !317, file: !47, line: 215, baseType: !598, size: 64, offset: 34176)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !392, line: 1378, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !392, line: 1378, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !317, file: !47, line: 216, baseType: !602, size: 64, offset: 34240)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !351, line: 83, baseType: !134)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !317, file: !47, line: 217, baseType: !604, size: 64, offset: 34304)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !392, line: 25, baseType: !134)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !317, file: !47, line: 218, baseType: !157, size: 32, offset: 34368)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !317, file: !47, line: 219, baseType: !607, size: 64, offset: 34432)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !365, line: 30, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !365, line: 30, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !317, file: !47, line: 220, baseType: !272, size: 32, offset: 34496)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !317, file: !47, line: 221, baseType: !272, size: 32, offset: 34528)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !317, file: !47, line: 222, baseType: !157, size: 32, offset: 34560)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !317, file: !47, line: 222, baseType: !157, size: 32, offset: 34592)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !317, file: !47, line: 223, baseType: !272, size: 32, offset: 34624)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !317, file: !47, line: 224, baseType: !272, size: 32, offset: 34656)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !47, line: 225, baseType: !97, size: 64, offset: 34688)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !317, file: !47, line: 227, baseType: !315, size: 64, offset: 34752)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !317, file: !47, line: 228, baseType: !315, size: 64, offset: 34816)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !317, file: !47, line: 229, baseType: !620, size: 64, offset: 34880)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !623)
!623 = !{!624, !628, !632, !633}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !622, file: !47, line: 102, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!115, !315, !315, !97}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !622, file: !47, line: 103, baseType: !629, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!115, !315, !391, !350, !391, !315, !97}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !622, file: !47, line: 104, baseType: !97, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !622, file: !47, line: 105, baseType: !620, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !317, file: !47, line: 230, baseType: !635, size: 64, offset: 34944)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !638)
!638 = !{!639, !640, !644, !645}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !637, file: !47, line: 110, baseType: !625, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !637, file: !47, line: 111, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!115, !315, !391, !315, !97}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !637, file: !47, line: 112, baseType: !97, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !47, line: 113, baseType: !635, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !317, file: !47, line: 231, baseType: !647, size: 64, offset: 35008)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !650)
!650 = !{!651, !652, !656, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !649, file: !47, line: 118, baseType: !625, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !649, file: !47, line: 119, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!115, !315, !472, !472, !315, !97}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !649, file: !47, line: 120, baseType: !97, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !47, line: 121, baseType: !647, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !317, file: !47, line: 232, baseType: !659, size: 64, offset: 35072)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !662)
!662 = !{!663, !667, !668, !669}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !661, file: !47, line: 126, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!115, !315, !350, !436, !350, !97}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !661, file: !47, line: 127, baseType: !664, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !661, file: !47, line: 128, baseType: !97, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !47, line: 129, baseType: !659, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !317, file: !47, line: 233, baseType: !671, size: 64, offset: 35136)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !673, file: !47, line: 134, baseType: !664, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !673, file: !47, line: 135, baseType: !664, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !673, file: !47, line: 136, baseType: !97, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !47, line: 137, baseType: !671, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !317, file: !47, line: 235, baseType: !157, size: 32, offset: 35200)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !317, file: !47, line: 237, baseType: !681, size: 64, offset: 35264)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !685)
!685 = !{!686, !690, !691, !692, !693, !695, !702}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !684, file: !47, line: 27, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !688, line: 166, baseType: !689)
!688 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !688, line: 139, baseType: !5)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !684, file: !47, line: 27, baseType: !687, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !684, file: !47, line: 27, baseType: !687, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !684, file: !47, line: 27, baseType: !687, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !684, file: !47, line: 27, baseType: !694, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !684, file: !47, line: 27, baseType: !696, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !698, file: !47, line: 19, baseType: !424, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !698, file: !47, line: 20, baseType: !157, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !684, file: !47, line: 27, baseType: !349, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !317, file: !47, line: 239, baseType: !474, size: 64, offset: 35328)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !317, file: !47, line: 240, baseType: !474, size: 64, offset: 35392)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !317, file: !47, line: 241, baseType: !474, size: 64, offset: 35456)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !317, file: !47, line: 242, baseType: !474, size: 64, offset: 35520)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !317, file: !47, line: 243, baseType: !272, size: 32, offset: 35584)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !317, file: !47, line: 245, baseType: !709, size: 64, offset: 35616)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !233)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !317, file: !47, line: 246, baseType: !711, size: 64, offset: 35712)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !712, line: 18, baseType: !713)
!712 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !715, line: 29, size: 5760, elements: !716)
!715 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!716 = !{!717, !718, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !737, !738, !739, !764, !765, !766}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !714, file: !715, line: 30, baseType: !320, size: 4480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !714, file: !715, line: 30, baseType: !719, size: 32, offset: 4480)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 32, elements: !153)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !714, file: !715, line: 31, baseType: !157, size: 32, offset: 4512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !714, file: !715, line: 31, baseType: !157, size: 32, offset: 4544)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !714, file: !715, line: 32, baseType: !364, size: 64, offset: 4608)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !714, file: !715, line: 33, baseType: !272, size: 32, offset: 4672)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !714, file: !715, line: 34, baseType: !272, size: 32, offset: 4704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !714, file: !715, line: 35, baseType: !202, size: 64, offset: 4736)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !714, file: !715, line: 36, baseType: !202, size: 64, offset: 4800)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !714, file: !715, line: 37, baseType: !157, size: 32, offset: 4864)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !714, file: !715, line: 38, baseType: !711, size: 64, offset: 4928)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !714, file: !715, line: 39, baseType: !202, size: 64, offset: 4992)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !714, file: !715, line: 40, baseType: !272, size: 32, offset: 5056)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !714, file: !715, line: 42, baseType: !157, size: 32, offset: 5088)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !714, file: !715, line: 43, baseType: !361, size: 64, offset: 5120)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !714, file: !715, line: 44, baseType: !202, size: 64, offset: 5184)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !714, file: !715, line: 45, baseType: !735, size: 64, offset: 5248)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !714, file: !715, line: 46, baseType: !272, size: 32, offset: 5312)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !714, file: !715, line: 47, baseType: !360, size: 64, offset: 5376)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !714, file: !715, line: 49, baseType: !98, size: 64, offset: 5440)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !714, file: !715, line: 50, baseType: !740, size: 64, offset: 5504)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !715, line: 27, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !715, line: 27, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !715, line: 27, size: 320, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !757}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !743, file: !715, line: 27, baseType: !687, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !715, line: 27, baseType: !687, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !743, file: !715, line: 27, baseType: !687, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !743, file: !715, line: 27, baseType: !687, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !743, file: !715, line: 27, baseType: !694, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !743, file: !715, line: 27, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !715, line: 10, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !715, line: 8, size: 64, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !753, file: !715, line: 9, baseType: !157, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !715, line: 9, baseType: !157, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !743, file: !715, line: 27, baseType: !758, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !715, line: 14, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 12, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !760, file: !715, line: 13, baseType: !202, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !760, file: !715, line: 13, baseType: !202, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !714, file: !715, line: 51, baseType: !711, size: 64, offset: 5568)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !714, file: !715, line: 52, baseType: !364, size: 64, offset: 5632)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !714, file: !715, line: 53, baseType: !767, size: 64, offset: 5696)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !712, line: 33, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !715, line: 72, size: 4864, elements: !770)
!770 = !{!771, !772, !789, !790, !799}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !769, file: !715, line: 73, baseType: !320, size: 4480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !769, file: !715, line: 73, baseType: !773, size: 192, offset: 4480)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 192, elements: !153)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !715, line: 56, size: 192, elements: !775)
!775 = !{!776, !781, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !774, file: !715, line: 57, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!115, !767, !711, !157, !451, !780, !302}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !774, file: !715, line: 58, baseType: !782, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!115, !767}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !774, file: !715, line: 59, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!115, !767, !121}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !769, file: !715, line: 74, baseType: !97, size: 64, offset: 4672)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !769, file: !715, line: 75, baseType: !791, size: 64, offset: 4736)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !715, line: 62, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !715, line: 64, size: 256, elements: !794)
!794 = !{!795, !796, !797, !798}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !715, line: 66, baseType: !791, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !793, file: !715, line: 67, baseType: !780, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !793, file: !715, line: 68, baseType: !302, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !793, file: !715, line: 69, baseType: !157, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !769, file: !715, line: 76, baseType: !791, size: 64, offset: 4800)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !317, file: !47, line: 247, baseType: !711, size: 64, offset: 35776)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !317, file: !47, line: 248, baseType: !802, size: 64, offset: 35840)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !365, line: 60, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !804, file: !25, line: 241, baseType: !93, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !25, line: 242, baseType: !174, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !804, file: !25, line: 243, baseType: !157, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !804, file: !25, line: 243, baseType: !157, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !804, file: !25, line: 244, baseType: !157, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !804, file: !25, line: 244, baseType: !157, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !804, file: !25, line: 245, baseType: !202, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !804, file: !25, line: 246, baseType: !272, size: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !804, file: !25, line: 247, baseType: !157, size: 32, offset: 352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !804, file: !25, line: 251, baseType: !157, size: 32, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !804, file: !25, line: 252, baseType: !607, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !804, file: !25, line: 253, baseType: !272, size: 32, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !804, file: !25, line: 254, baseType: !157, size: 32, offset: 544)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !804, file: !25, line: 254, baseType: !157, size: 32, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !804, file: !25, line: 255, baseType: !157, size: 32, offset: 608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !317, file: !47, line: 250, baseType: !711, size: 64, offset: 35904)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !317, file: !47, line: 251, baseType: !391, size: 64, offset: 35968)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !317, file: !47, line: 253, baseType: !315, size: 64, offset: 36032)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !317, file: !47, line: 254, baseType: !350, size: 64, offset: 36096)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !317, file: !47, line: 255, baseType: !97, size: 64, offset: 36160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !317, file: !47, line: 256, baseType: !827, size: 64, offset: 36224)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!115, !315, !97}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !317, file: !47, line: 257, baseType: !827, size: 64, offset: 36288)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !317, file: !47, line: 258, baseType: !832, size: 64, offset: 36352)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!115, !315, !510, !272, !302, !97}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !317, file: !47, line: 260, baseType: !157, size: 32, offset: 36416)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !317, file: !47, line: 261, baseType: !315, size: 64, offset: 36480)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !317, file: !47, line: 262, baseType: !350, size: 64, offset: 36544)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !317, file: !47, line: 263, baseType: !350, size: 64, offset: 36608)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !317, file: !47, line: 264, baseType: !272, size: 32, offset: 36672)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !317, file: !47, line: 265, baseType: !374, size: 64, offset: 36736)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !317, file: !47, line: 266, baseType: !210, size: 64, offset: 36800)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !317, file: !47, line: 266, baseType: !210, size: 64, offset: 36864)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !317, file: !47, line: 267, baseType: !844, size: 64, offset: 36928)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !317, file: !47, line: 269, baseType: !847, size: 640, offset: 36992)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 640, elements: !856)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!115, !315, !157, !157, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !392, line: 1723, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !392, line: 1723, flags: DIFlagFwdDecl)
!856 = !{!857}
!857 = !DISubrange(count: 10)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !317, file: !47, line: 270, baseType: !847, size: 640, offset: 37632)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !317, file: !47, line: 272, baseType: !157, size: 32, offset: 38272)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !317, file: !47, line: 273, baseType: !861, size: 64, offset: 38336)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !863, file: !47, line: 174, baseType: !98, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !863, file: !47, line: 175, baseType: !424, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !863, file: !47, line: 176, baseType: !709, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !863, file: !47, line: 177, baseType: !272, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !317, file: !47, line: 274, baseType: !870, size: 64, offset: 38400)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !873)
!873 = !{!874, !955, !956}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !872, file: !47, line: 168, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !876, line: 11, baseType: !877)
!876 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !876, line: 13, size: 832, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !946, !948, !949, !950, !951, !952, !953, !954}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !878, file: !876, line: 14, baseType: !134, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !878, file: !876, line: 15, baseType: !424, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !878, file: !876, line: 16, baseType: !134, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !878, file: !876, line: 17, baseType: !157, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !878, file: !876, line: 18, baseType: !202, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !878, file: !876, line: 19, baseType: !886, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !887, line: 22, baseType: !888)
!887 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !876, line: 81, size: 4992, elements: !890)
!890 = !{!891, !892, !906, !907, !908, !917}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !889, file: !876, line: 82, baseType: !320, size: 4480)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !889, file: !876, line: 82, baseType: !893, size: 256, offset: 4480)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, elements: !153)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !876, line: 74, size: 256, elements: !895)
!895 = !{!896, !900, !901, !905}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !894, file: !876, line: 75, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!115, !886}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !894, file: !876, line: 76, baseType: !897, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !894, file: !876, line: 77, baseType: !902, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!115, !886, !121}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !894, file: !876, line: 78, baseType: !897, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !889, file: !876, line: 83, baseType: !97, size: 64, offset: 4736)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !889, file: !876, line: 85, baseType: !157, size: 32, offset: 4800)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !889, file: !876, line: 86, baseType: !909, size: 64, offset: 4864)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !876, line: 41, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !876, line: 36, size: 256, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !911, file: !876, line: 37, baseType: !268, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !911, file: !876, line: 38, baseType: !268, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !911, file: !876, line: 39, baseType: !268, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !911, file: !876, line: 40, baseType: !184, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !889, file: !876, line: 87, baseType: !918, size: 64, offset: 4928)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !876, line: 54, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !876, line: 54, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !876, line: 54, size: 320, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !938}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !922, file: !876, line: 54, baseType: !687, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !922, file: !876, line: 54, baseType: !687, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !922, file: !876, line: 54, baseType: !687, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !922, file: !876, line: 54, baseType: !687, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !922, file: !876, line: 54, baseType: !694, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !922, file: !876, line: 54, baseType: !930, size: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !887, line: 41, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !887, line: 35, size: 192, elements: !933)
!933 = !{!934, !935, !936, !937}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !932, file: !887, line: 37, baseType: !424, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !932, file: !887, line: 38, baseType: !157, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !932, file: !887, line: 39, baseType: !157, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !932, file: !887, line: 40, baseType: !157, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !922, file: !876, line: 54, baseType: !939, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !876, line: 34, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !876, line: 30, size: 96, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !941, file: !876, line: 31, baseType: !157, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !941, file: !876, line: 32, baseType: !157, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !941, file: !876, line: 33, baseType: !157, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !878, file: !876, line: 20, baseType: !947, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !878, file: !876, line: 21, baseType: !157, size: 32, offset: 416)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !878, file: !876, line: 22, baseType: !157, size: 32, offset: 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !878, file: !876, line: 23, baseType: !202, size: 64, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !878, file: !876, line: 24, baseType: !145, size: 64, offset: 576)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !878, file: !876, line: 25, baseType: !145, size: 64, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !878, file: !876, line: 26, baseType: !97, size: 64, offset: 704)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !878, file: !876, line: 27, baseType: !875, size: 64, offset: 768)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !872, file: !47, line: 169, baseType: !424, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !47, line: 170, baseType: !870, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !317, file: !47, line: 275, baseType: !157, size: 32, offset: 38464)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !317, file: !47, line: 276, baseType: !959, size: 64, offset: 38528)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !962)
!962 = !{!963, !1044, !1045}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !961, file: !47, line: 181, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !887, line: 13, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !876, line: 98, size: 7232, elements: !967)
!967 = !{!968, !969, !983, !984, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !1000, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !966, file: !876, line: 99, baseType: !320, size: 4480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !966, file: !876, line: 99, baseType: !970, size: 256, offset: 4480)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, elements: !153)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !876, line: 91, size: 256, elements: !972)
!972 = !{!973, !977, !978, !982}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !971, file: !876, line: 92, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!115, !964}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !971, file: !876, line: 93, baseType: !974, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !971, file: !876, line: 94, baseType: !979, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!115, !964, !121}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !971, file: !876, line: 95, baseType: !974, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !966, file: !876, line: 100, baseType: !97, size: 64, offset: 4736)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !966, file: !876, line: 101, baseType: !985, size: 64, offset: 4800)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !966, file: !876, line: 102, baseType: !272, size: 32, offset: 4864)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !966, file: !876, line: 103, baseType: !272, size: 32, offset: 4896)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !966, file: !876, line: 104, baseType: !157, size: 32, offset: 4928)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !966, file: !876, line: 105, baseType: !157, size: 32, offset: 4960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !966, file: !876, line: 106, baseType: !129, size: 64, offset: 4992)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !966, file: !876, line: 108, baseType: !875, size: 64, offset: 5056)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !966, file: !876, line: 109, baseType: !272, size: 32, offset: 5120)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !966, file: !876, line: 110, baseType: !408, size: 64, offset: 5184)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !966, file: !876, line: 111, baseType: !202, size: 64, offset: 5248)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !966, file: !876, line: 112, baseType: !886, size: 64, offset: 5312)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !966, file: !876, line: 113, baseType: !997, size: 64, offset: 5376)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !999, line: 563, baseType: !522)
!999 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !966, file: !876, line: 114, baseType: !1001, size: 64, offset: 5440)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !999, line: 580, baseType: !507)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !966, file: !876, line: 115, baseType: !512, size: 64, offset: 5504)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !966, file: !876, line: 116, baseType: !1001, size: 64, offset: 5568)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !966, file: !876, line: 117, baseType: !512, size: 64, offset: 5632)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !966, file: !876, line: 118, baseType: !157, size: 32, offset: 5696)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !966, file: !876, line: 119, baseType: !219, size: 64, offset: 5760)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !966, file: !876, line: 120, baseType: !512, size: 64, offset: 5824)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !966, file: !876, line: 122, baseType: !157, size: 32, offset: 5888)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !966, file: !876, line: 123, baseType: !157, size: 32, offset: 5920)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !966, file: !876, line: 124, baseType: !202, size: 64, offset: 5952)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !966, file: !876, line: 125, baseType: !202, size: 64, offset: 6016)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !966, file: !876, line: 126, baseType: !202, size: 64, offset: 6080)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !966, file: !876, line: 127, baseType: !202, size: 64, offset: 6144)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !966, file: !876, line: 128, baseType: !1016, size: 64, offset: 6208)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1018, line: 481, baseType: !1019)
!1018 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1018, line: 469, size: 256, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1020, file: !1018, line: 470, baseType: !157, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1020, file: !1018, line: 471, baseType: !157, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1020, file: !1018, line: 472, baseType: !157, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1020, file: !1018, line: 473, baseType: !157, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1020, file: !1018, line: 474, baseType: !157, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !1020, file: !1018, line: 475, baseType: !157, size: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !1020, file: !1018, line: 476, baseType: !213, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Tf", scope: !966, file: !876, line: 129, baseType: !1016, size: 64, offset: 6272)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !966, file: !876, line: 131, baseType: !219, size: 64, offset: 6336)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "u_t", scope: !966, file: !876, line: 132, baseType: !219, size: 64, offset: 6400)
