; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipeprcg/pipeprcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipeprcg/pipeprcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !{!129, !133, !134, !137, !172, !222, !337}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !130, line: 330, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !130, line: 330, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 46, baseType: !136)
!135 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!136 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !140, line: 73, size: 4480, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !144, !193, !194, !196, !199, !200, !201, !202, !210, !211, !213, !217, !221, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !234, !235, !236, !238, !239, !241, !243, !244, !245, !246, !247, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !273, !275, !276, !280, !281, !327, !332, !334, !335, !336}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !139, file: !140, line: 74, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !139, file: !140, line: 75, baseType: !145, size: 448, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 448, elements: !191)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !140, line: 53, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 45, size: 448, elements: !148)
!148 = !{!149, !155, !163, !168, !175, !179, !186}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !147, file: !140, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !147, file: !140, line: 47, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!153, !137, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !160, line: 16, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !160, line: 16, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !140, line: 48, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!153, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !147, file: !140, line: 49, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!153, !137, !172, !137}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !147, file: !140, line: 50, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!153, !137, !172, !167}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !147, file: !140, line: 51, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!153, !137, !172, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !147, file: !140, line: 52, baseType: !187, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!153, !137, !172, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!191 = !{!192}
!192 = !DISubrange(count: 1)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !139, file: !140, line: 76, baseType: !129, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !140, line: 77, baseType: !195, size: 32, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !198)
!198 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 79, baseType: !203, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !206, line: 27, baseType: !207)
!206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !208, line: 43, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!209 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !139, file: !140, line: 80, baseType: !195, size: 32, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !140, line: 81, baseType: !212, size: 32, offset: 992)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !139, file: !140, line: 82, baseType: !214, size: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !139, file: !140, line: 83, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !140, line: 84, baseType: !222, size: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !140, line: 85, baseType: !222, size: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !139, file: !140, line: 86, baseType: !222, size: 64, offset: 1280)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !139, file: !140, line: 87, baseType: !222, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 88, baseType: !137, size: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !139, file: !140, line: 89, baseType: !203, size: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 90, baseType: !222, size: 64, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !139, file: !140, line: 91, baseType: !222, size: 64, offset: 1600)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !139, file: !140, line: 92, baseType: !195, size: 32, offset: 1664)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !139, file: !140, line: 93, baseType: !133, size: 64, offset: 1728)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 94, baseType: !233, size: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !204)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !139, file: !140, line: 95, baseType: !195, size: 32, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !139, file: !140, line: 95, baseType: !195, size: 32, offset: 1888)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !139, file: !140, line: 96, baseType: !237, size: 64, offset: 1920)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !139, file: !140, line: 96, baseType: !237, size: 64, offset: 1984)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !139, file: !140, line: 97, baseType: !240, size: 64, offset: 2048)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !139, file: !140, line: 97, baseType: !242, size: 64, offset: 2112)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !139, file: !140, line: 98, baseType: !195, size: 32, offset: 2176)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !139, file: !140, line: 98, baseType: !195, size: 32, offset: 2208)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !139, file: !140, line: 99, baseType: !237, size: 64, offset: 2240)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !139, file: !140, line: 99, baseType: !237, size: 64, offset: 2304)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !139, file: !140, line: 100, baseType: !248, size: 64, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !198)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !139, file: !140, line: 100, baseType: !251, size: 64, offset: 2432)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !139, file: !140, line: 101, baseType: !195, size: 32, offset: 2496)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !139, file: !140, line: 101, baseType: !195, size: 32, offset: 2528)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !139, file: !140, line: 102, baseType: !237, size: 64, offset: 2560)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !139, file: !140, line: 102, baseType: !237, size: 64, offset: 2624)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !139, file: !140, line: 103, baseType: !257, size: 64, offset: 2688)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !249)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !139, file: !140, line: 103, baseType: !260, size: 64, offset: 2752)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !139, file: !140, line: 104, baseType: !190, size: 64, offset: 2816)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !139, file: !140, line: 105, baseType: !195, size: 32, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !139, file: !140, line: 106, baseType: !264, size: 128, offset: 2944)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 128, elements: !271)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !140, line: 64, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 61, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !267, file: !140, line: 62, baseType: !183, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !267, file: !140, line: 63, baseType: !133, size: 64, offset: 64)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !139, file: !140, line: 107, baseType: !274, size: 64, offset: 3072)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !139, file: !140, line: 108, baseType: !133, size: 64, offset: 3136)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !139, file: !140, line: 109, baseType: !277, size: 64, offset: 3200)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!153, !133}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !139, file: !140, line: 111, baseType: !195, size: 32, offset: 3264)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !139, file: !140, line: 112, baseType: !282, size: 320, offset: 3328)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !325)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!153, !286, !137, !133}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !289)
!289 = !{!290, !291, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !288, file: !10, line: 100, baseType: !195, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 101, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !303, !304, !305, !306, !308, !310, !311, !312}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !294, file: !10, line: 84, baseType: !222, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !294, file: !10, line: 85, baseType: !222, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !10, line: 86, baseType: !133, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !294, file: !10, line: 87, baseType: !214, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !294, file: !10, line: 88, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !294, file: !10, line: 89, baseType: !174, size: 8, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !294, file: !10, line: 90, baseType: !222, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !294, file: !10, line: 91, baseType: !134, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !294, file: !10, line: 92, baseType: !307, size: 32, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !10, line: 93, baseType: !309, size: 32, offset: 544)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !10, line: 94, baseType: !292, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !294, file: !10, line: 95, baseType: !222, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !294, file: !10, line: 96, baseType: !133, size: 64, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !288, file: !10, line: 102, baseType: !222, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !288, file: !10, line: 102, baseType: !222, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !288, file: !10, line: 103, baseType: !222, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !288, file: !10, line: 104, baseType: !129, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 416)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !288, file: !10, line: 106, baseType: !137, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !288, file: !10, line: 107, baseType: !322, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!325 = !{!326}
!326 = !DISubrange(count: 5)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !139, file: !140, line: 113, baseType: !328, size: 320, offset: 3648)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !325)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!153, !137, !133}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !139, file: !140, line: 114, baseType: !333, size: 320, offset: 3968)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 320, elements: !325)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !139, file: !140, line: 115, baseType: !307, size: 32, offset: 4288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 120, baseType: !322, size: 64, offset: 4352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !139, file: !140, line: 121, baseType: !307, size: 32, offset: 4416)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_CG_PIPE_PR", file: !339, line: 3, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/pipeprcg/pipeprcg.c", directory: "/home/users/ndemeye/xSDK")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KSP_CG_PIPE_PR_s", file: !339, line: 4, size: 32, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rc_w_q", scope: !340, file: !339, line: 5, baseType: !307, size: 32)
!343 = !{i32 7, !"Dwarf Version", i32 4}
!344 = !{i32 2, !"Debug Info Version", i32 3}
!345 = !{i32 1, !"wchar_size", i32 4}
!346 = !{i32 7, !"PIC Level", i32 2}
!347 = !{i32 7, !"uwtable", i32 1}
!348 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!349 = distinct !DISubprogram(name: "KSPCreate_PIPEPRCG", scope: !339, file: !339, line: 201, type: !350, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !594)
!350 = !DISubroutineType(types: !351)
!351 = !{!153, !352}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !355)
!355 = !{!356, !358, !409, !414, !415, !416, !417, !447, !448, !449, !450, !451, !453, !458, !459, !460, !461, !462, !463, !464, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !487, !493, !494, !495, !496, !501, !502, !503, !504, !509, !510, !511, !512, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !564, !565, !566, !567, !568, !575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !591, !592, !593}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !354, file: !102, line: 76, baseType: !357, size: 4480)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !140, line: 122, baseType: !139)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !354, file: !102, line: 76, baseType: !359, size: 896, offset: 4480)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 896, elements: !191)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !361)
!361 = !{!362, !370, !374, !376, !384, !385, !389, !390, !394, !398, !402, !403, !407, !408}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !360, file: !102, line: 19, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!153, !352, !366, !369}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !360, file: !102, line: 22, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!153, !352, !366, !366, !369}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !360, file: !102, line: 25, baseType: !375, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !360, file: !102, line: 26, baseType: !377, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!153, !352, !380, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !381, line: 16, baseType: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !381, line: 16, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !360, file: !102, line: 27, baseType: !375, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !360, file: !102, line: 28, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!153, !286, !352}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !360, file: !102, line: 29, baseType: !375, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !360, file: !102, line: 30, baseType: !391, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!153, !352, !248, !248}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !360, file: !102, line: 31, baseType: !395, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!153, !352, !195, !248, !248, !240}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !360, file: !102, line: 32, baseType: !399, size: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!153, !352, !307, !307, !240, !369, !248, !248}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !360, file: !102, line: 33, baseType: !375, size: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !360, file: !102, line: 34, baseType: !404, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!153, !352, !159}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !360, file: !102, line: 35, baseType: !375, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !360, file: !102, line: 36, baseType: !404, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !354, file: !102, line: 77, baseType: !410, size: 64, offset: 5376)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !411, line: 14, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !411, line: 14, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !354, file: !102, line: 78, baseType: !307, size: 32, offset: 5440)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !354, file: !102, line: 79, baseType: !307, size: 32, offset: 5472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !354, file: !102, line: 81, baseType: !195, size: 32, offset: 5504)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !354, file: !102, line: 82, baseType: !418, size: 64, offset: 5568)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !421)
!421 = !{!422, !423, !443, !444, !445, !446}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !420, file: !102, line: 55, baseType: !357, size: 4480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !420, file: !102, line: 55, baseType: !424, size: 448, offset: 4480)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 448, elements: !191)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !426)
!426 = !{!427, !431, !432, !436, !437, !438, !442}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !425, file: !102, line: 42, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!153, !418, !366, !366}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !425, file: !102, line: 43, baseType: !428, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !425, file: !102, line: 44, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!153, !418}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !425, file: !102, line: 45, baseType: !433, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !425, file: !102, line: 46, baseType: !433, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !425, file: !102, line: 47, baseType: !439, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!153, !418, !159}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !425, file: !102, line: 48, baseType: !433, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !420, file: !102, line: 56, baseType: !352, size: 64, offset: 4928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !420, file: !102, line: 57, baseType: !380, size: 64, offset: 4992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !420, file: !102, line: 58, baseType: !233, size: 64, offset: 5056)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !420, file: !102, line: 59, baseType: !133, size: 64, offset: 5120)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !354, file: !102, line: 83, baseType: !307, size: 32, offset: 5632)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !354, file: !102, line: 84, baseType: !307, size: 32, offset: 5664)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !354, file: !102, line: 85, baseType: !307, size: 32, offset: 5696)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !354, file: !102, line: 86, baseType: !307, size: 32, offset: 5728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !354, file: !102, line: 87, baseType: !452, size: 32, offset: 5760)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !354, file: !102, line: 88, baseType: !454, size: 384, offset: 5792)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 384, elements: !455)
!455 = !{!456, !457}
!456 = !DISubrange(count: 4)
!457 = !DISubrange(count: 3)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !354, file: !102, line: 89, baseType: !249, size: 64, offset: 6208)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !354, file: !102, line: 90, baseType: !249, size: 64, offset: 6272)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !354, file: !102, line: 91, baseType: !249, size: 64, offset: 6336)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !354, file: !102, line: 92, baseType: !249, size: 64, offset: 6400)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !354, file: !102, line: 93, baseType: !249, size: 64, offset: 6464)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !354, file: !102, line: 94, baseType: !249, size: 64, offset: 6528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !354, file: !102, line: 95, baseType: !465, size: 32, offset: 6592)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !354, file: !102, line: 96, baseType: !307, size: 32, offset: 6624)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !354, file: !102, line: 98, baseType: !366, size: 64, offset: 6656)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !354, file: !102, line: 98, baseType: !366, size: 64, offset: 6720)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !354, file: !102, line: 102, baseType: !248, size: 64, offset: 6784)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !354, file: !102, line: 103, baseType: !248, size: 64, offset: 6848)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !354, file: !102, line: 104, baseType: !195, size: 32, offset: 6912)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !354, file: !102, line: 105, baseType: !195, size: 32, offset: 6944)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !354, file: !102, line: 106, baseType: !307, size: 32, offset: 6976)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !354, file: !102, line: 107, baseType: !248, size: 64, offset: 7040)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !354, file: !102, line: 108, baseType: !248, size: 64, offset: 7104)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !354, file: !102, line: 109, baseType: !195, size: 32, offset: 7168)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !354, file: !102, line: 110, baseType: !195, size: 32, offset: 7200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !354, file: !102, line: 111, baseType: !307, size: 32, offset: 7232)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !354, file: !102, line: 113, baseType: !195, size: 32, offset: 7264)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !354, file: !102, line: 114, baseType: !307, size: 32, offset: 7296)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !354, file: !102, line: 117, baseType: !195, size: 32, offset: 7328)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !354, file: !102, line: 120, baseType: !483, size: 320, offset: 7360)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 320, elements: !325)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!153, !352, !195, !249, !133}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !354, file: !102, line: 121, baseType: !488, size: 320, offset: 7680)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !325)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!153, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !354, file: !102, line: 122, baseType: !333, size: 320, offset: 8000)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !354, file: !102, line: 123, baseType: !195, size: 32, offset: 8320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !354, file: !102, line: 124, baseType: !307, size: 32, offset: 8352)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !354, file: !102, line: 126, baseType: !497, size: 320, offset: 8384)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 320, elements: !325)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!153, !352, !133}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !354, file: !102, line: 127, baseType: !488, size: 320, offset: 8704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !354, file: !102, line: 128, baseType: !333, size: 320, offset: 9024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !354, file: !102, line: 129, baseType: !195, size: 32, offset: 9344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !354, file: !102, line: 131, baseType: !505, size: 64, offset: 9408)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!153, !352, !195, !249, !508, !133}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !354, file: !102, line: 132, baseType: !277, size: 64, offset: 9472)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !354, file: !102, line: 133, baseType: !133, size: 64, offset: 9536)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !354, file: !102, line: 135, baseType: !133, size: 64, offset: 9600)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !354, file: !102, line: 137, baseType: !513, size: 64, offset: 9664)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !102, line: 139, baseType: !133, size: 64, offset: 9728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9792)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9824)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9888)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9952)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 9984)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10016)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10048)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10080)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10112)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10144)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10176)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !354, file: !102, line: 142, baseType: !307, size: 32, offset: 10208)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10240)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10304)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10368)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10432)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10496)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10560)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10624)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10688)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10752)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10816)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10880)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 10944)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 11008)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !354, file: !102, line: 143, baseType: !159, size: 64, offset: 11072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11136)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11168)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11200)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11232)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11264)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11296)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11328)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11360)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11392)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11424)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11456)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11488)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11520)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !354, file: !102, line: 144, baseType: !546, size: 32, offset: 11552)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !354, file: !102, line: 147, baseType: !195, size: 32, offset: 11584)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !354, file: !102, line: 148, baseType: !369, size: 64, offset: 11648)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !354, file: !102, line: 150, baseType: !563, size: 32, offset: 11712)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !354, file: !102, line: 151, baseType: !307, size: 32, offset: 11744)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !354, file: !102, line: 153, baseType: !195, size: 32, offset: 11776)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !354, file: !102, line: 154, baseType: !195, size: 32, offset: 11808)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !354, file: !102, line: 156, baseType: !307, size: 32, offset: 11840)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !354, file: !102, line: 161, baseType: !569, size: 192, offset: 11904)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !102, line: 157, size: 192, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !569, file: !102, line: 158, baseType: !380, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !569, file: !102, line: 158, baseType: !380, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !569, file: !102, line: 159, baseType: !307, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !569, file: !102, line: 160, baseType: !307, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !354, file: !102, line: 163, baseType: !576, size: 32, offset: 12096)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !354, file: !102, line: 165, baseType: !452, size: 32, offset: 12128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !354, file: !102, line: 166, baseType: !576, size: 32, offset: 12160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !354, file: !102, line: 171, baseType: !307, size: 32, offset: 12192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !354, file: !102, line: 172, baseType: !307, size: 32, offset: 12224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !354, file: !102, line: 173, baseType: !307, size: 32, offset: 12256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !354, file: !102, line: 174, baseType: !366, size: 64, offset: 12288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !354, file: !102, line: 175, baseType: !366, size: 64, offset: 12352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !354, file: !102, line: 177, baseType: !195, size: 32, offset: 12416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !354, file: !102, line: 178, baseType: !307, size: 32, offset: 12448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !354, file: !102, line: 180, baseType: !159, size: 64, offset: 12480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !354, file: !102, line: 182, baseType: !588, size: 64, offset: 12544)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!153, !352, !366, !366, !133}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !354, file: !102, line: 183, baseType: !588, size: 64, offset: 12608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !354, file: !102, line: 184, baseType: !133, size: 64, offset: 12672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !354, file: !102, line: 184, baseType: !133, size: 64, offset: 12736)
!594 = !{!595, !596, !597, !598, !599, !601, !603, !605, !607, !609}
!595 = !DILocalVariable(name: "ksp", arg: 1, scope: !349, file: !339, line: 201, type: !352)
!596 = !DILocalVariable(name: "ierr", scope: !349, file: !339, line: 203, type: !153)
!597 = !DILocalVariable(name: "prcg", scope: !349, file: !339, line: 204, type: !337)
!598 = !DILocalVariable(name: "cite", scope: !349, file: !339, line: 205, type: !307)
!599 = !DILocalVariable(name: "ierr__", scope: !600, file: !339, line: 209, type: !153)
!600 = distinct !DILexicalBlock(scope: !349, file: !339, line: 209, column: 304)
!601 = !DILocalVariable(name: "ierr__", scope: !602, file: !339, line: 211, type: !153)
!602 = distinct !DILexicalBlock(scope: !349, file: !339, line: 211, column: 33)
!603 = !DILocalVariable(name: "ierr__", scope: !604, file: !339, line: 214, type: !153)
!604 = distinct !DILexicalBlock(scope: !349, file: !339, line: 214, column: 71)
!605 = !DILocalVariable(name: "ierr__", scope: !606, file: !339, line: 215, type: !153)
!606 = distinct !DILexicalBlock(scope: !349, file: !339, line: 215, column: 69)
!607 = !DILocalVariable(name: "ierr__", scope: !608, file: !339, line: 216, type: !153)
!608 = distinct !DILexicalBlock(scope: !349, file: !339, line: 216, column: 62)
!609 = !DILocalVariable(name: "ierr__", scope: !610, file: !339, line: 217, type: !153)
!610 = distinct !DILexicalBlock(scope: !349, file: !339, line: 217, column: 59)
!611 = !DILocation(line: 0, scope: !349)
!612 = !DILocation(line: 204, column: 3, scope: !349)
!613 = !DILocation(line: 204, column: 19, scope: !349)
!614 = !{!615, !615, i64 0}
!615 = !{!"any pointer", !616, i64 0}
!616 = !{!"omnipotent char", !617, i64 0}
!617 = !{!"Simple C/C++ TBAA"}
!618 = !DILocation(line: 207, column: 3, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !339, line: 207, column: 3)
!620 = distinct !DILexicalBlock(scope: !621, file: !339, line: 207, column: 3)
!621 = distinct !DILexicalBlock(scope: !349, file: !339, line: 207, column: 3)
!622 = !DILocation(line: 207, column: 3, scope: !620)
!623 = !DILocalVariable(name: "cit", arg: 1, scope: !624, file: !625, line: 2743, type: !172)
!624 = distinct !DISubprogram(name: "PetscCitationsRegister", scope: !625, file: !625, line: 2743, type: !626, scopeLine: 2744, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !629)
!625 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!626 = !DISubroutineType(types: !627)
!627 = !{!153, !172, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!629 = !{!623, !630, !631, !632, !633, !634, !636, !638}
!630 = !DILocalVariable(name: "set", arg: 2, scope: !624, file: !625, line: 2743, type: !628)
!631 = !DILocalVariable(name: "len", scope: !624, file: !625, line: 2745, type: !134)
!632 = !DILocalVariable(name: "vstring", scope: !624, file: !625, line: 2746, type: !222)
!633 = !DILocalVariable(name: "ierr", scope: !624, file: !625, line: 2747, type: !153)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !625, line: 2751, type: !153)
!635 = distinct !DILexicalBlock(scope: !624, file: !625, line: 2751, column: 32)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !625, line: 2752, type: !153)
!637 = distinct !DILexicalBlock(scope: !624, file: !625, line: 2752, column: 61)
!638 = !DILocalVariable(name: "ierr__", scope: !639, file: !625, line: 2753, type: !153)
!639 = distinct !DILexicalBlock(scope: !624, file: !625, line: 2753, column: 41)
!640 = !DILocation(line: 0, scope: !624, inlinedAt: !641)
!641 = distinct !DILocation(line: 209, column: 10, scope: !349)
!642 = !DILocation(line: 2745, column: 3, scope: !624, inlinedAt: !641)
!643 = !DILocation(line: 2746, column: 3, scope: !624, inlinedAt: !641)
