; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpimatmatmatmult.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpimatmatmatmult.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !{!301, !305, !306, !341, !509, !475}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !302, line: 330, baseType: !303)
!302 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !302, line: 330, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !309, line: 73, size: 4480, elements: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!310 = !{!311, !313, !362, !363, !365, !368, !369, !370, !371, !379, !380, !382, !386, !390, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !403, !404, !405, !407, !408, !410, !412, !413, !414, !415, !416, !419, !421, !422, !423, !424, !425, !428, !430, !431, !432, !442, !444, !445, !449, !450, !499, !504, !506, !507, !508}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !308, file: !309, line: 74, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !308, file: !309, line: 75, baseType: !314, size: 448, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 448, elements: !360)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !309, line: 53, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 45, size: 448, elements: !317)
!317 = !{!318, !324, !332, !337, !344, !348, !355}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !316, file: !309, line: 46, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !306, !323}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !316, file: !309, line: 47, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!322, !306, !328}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !329, line: 16, baseType: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !329, line: 16, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !316, file: !309, line: 48, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!322, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !316, file: !309, line: 49, baseType: !338, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!322, !306, !341, !306}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !316, file: !309, line: 50, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!322, !306, !341, !336}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !316, file: !309, line: 51, baseType: !349, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!322, !306, !341, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !316, file: !309, line: 52, baseType: !356, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!322, !306, !341, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!360 = !{!361}
!361 = !DISubrange(count: 1)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !308, file: !309, line: 76, baseType: !301, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 77, baseType: !364, size: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !308, file: !309, line: 78, baseType: !366, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !367)
!367 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !308, file: !309, line: 78, baseType: !366, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !308, file: !309, line: 78, baseType: !366, size: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !308, file: !309, line: 78, baseType: !366, size: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 79, baseType: !372, size: 64, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !375, line: 27, baseType: !376)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !377, line: 43, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!378 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !308, file: !309, line: 80, baseType: !364, size: 32, offset: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !308, file: !309, line: 81, baseType: !381, size: 32, offset: 992)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !308, file: !309, line: 82, baseType: !383, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !308, file: !309, line: 83, baseType: !387, size: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !308, file: !309, line: 84, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !308, file: !309, line: 85, baseType: !391, size: 64, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !308, file: !309, line: 86, baseType: !391, size: 64, offset: 1280)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !308, file: !309, line: 87, baseType: !391, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 88, baseType: !306, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !308, file: !309, line: 89, baseType: !372, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 90, baseType: !391, size: 64, offset: 1536)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !309, line: 91, baseType: !391, size: 64, offset: 1600)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !308, file: !309, line: 92, baseType: !364, size: 32, offset: 1664)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !308, file: !309, line: 93, baseType: !305, size: 64, offset: 1728)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !309, line: 94, baseType: !402, size: 64, offset: 1792)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !373)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !308, file: !309, line: 95, baseType: !364, size: 32, offset: 1856)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !308, file: !309, line: 95, baseType: !364, size: 32, offset: 1888)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !308, file: !309, line: 96, baseType: !406, size: 64, offset: 1920)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !308, file: !309, line: 96, baseType: !406, size: 64, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !308, file: !309, line: 97, baseType: !409, size: 64, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !308, file: !309, line: 97, baseType: !411, size: 64, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !308, file: !309, line: 98, baseType: !364, size: 32, offset: 2176)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !308, file: !309, line: 98, baseType: !364, size: 32, offset: 2208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !308, file: !309, line: 99, baseType: !406, size: 64, offset: 2240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !308, file: !309, line: 99, baseType: !406, size: 64, offset: 2304)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !308, file: !309, line: 100, baseType: !417, size: 64, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !367)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !308, file: !309, line: 100, baseType: !420, size: 64, offset: 2432)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !308, file: !309, line: 101, baseType: !364, size: 32, offset: 2496)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !308, file: !309, line: 101, baseType: !364, size: 32, offset: 2528)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !308, file: !309, line: 102, baseType: !406, size: 64, offset: 2560)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !308, file: !309, line: 102, baseType: !406, size: 64, offset: 2624)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !308, file: !309, line: 103, baseType: !426, size: 64, offset: 2688)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !418)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !308, file: !309, line: 103, baseType: !429, size: 64, offset: 2752)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !308, file: !309, line: 104, baseType: !359, size: 64, offset: 2816)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !308, file: !309, line: 105, baseType: !364, size: 32, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !308, file: !309, line: 106, baseType: !433, size: 128, offset: 2944)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 128, elements: !440)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !309, line: 64, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 61, size: 128, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !436, file: !309, line: 62, baseType: !352, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !436, file: !309, line: 63, baseType: !305, size: 64, offset: 64)
!440 = !{!441}
!441 = !DISubrange(count: 2)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !308, file: !309, line: 107, baseType: !443, size: 64, offset: 3072)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !440)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !308, file: !309, line: 108, baseType: !305, size: 64, offset: 3136)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !308, file: !309, line: 109, baseType: !446, size: 64, offset: 3200)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!322, !305}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !308, file: !309, line: 111, baseType: !364, size: 32, offset: 3264)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !308, file: !309, line: 112, baseType: !451, size: 320, offset: 3328)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 320, elements: !497)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!322, !455, !306, !305}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !458)
!458 = !{!459, !460, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !457, file: !10, line: 100, baseType: !364, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !10, line: 101, baseType: !461, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !472, !473, !474, !478, !480, !482, !483, !484}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !463, file: !10, line: 84, baseType: !391, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !463, file: !10, line: 85, baseType: !391, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !10, line: 86, baseType: !305, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !463, file: !10, line: 87, baseType: !383, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !463, file: !10, line: 88, baseType: !470, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !463, file: !10, line: 89, baseType: !343, size: 8, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !463, file: !10, line: 90, baseType: !391, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !463, file: !10, line: 91, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !476, line: 46, baseType: !477)
!476 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!477 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !463, file: !10, line: 92, baseType: !479, size: 32, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !10, line: 93, baseType: !481, size: 32, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !10, line: 94, baseType: !461, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !463, file: !10, line: 95, baseType: !391, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !463, file: !10, line: 96, baseType: !305, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !457, file: !10, line: 102, baseType: !391, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !457, file: !10, line: 102, baseType: !391, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !457, file: !10, line: 103, baseType: !391, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !457, file: !10, line: 104, baseType: !301, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 416)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !457, file: !10, line: 106, baseType: !306, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !457, file: !10, line: 107, baseType: !494, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!497 = !{!498}
!498 = !DISubrange(count: 5)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !308, file: !309, line: 113, baseType: !500, size: 320, offset: 3648)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !497)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!322, !306, !305}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !308, file: !309, line: 114, baseType: !505, size: 320, offset: 3968)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 320, elements: !497)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !308, file: !309, line: 115, baseType: !479, size: 32, offset: 4288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !309, line: 120, baseType: !494, size: 64, offset: 4352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !308, file: !309, line: 121, baseType: !479, size: 32, offset: 4416)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_RARt", file: !511, line: 74, baseType: !512)
!511 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 65, size: 448, elements: !513)
!513 = !{!514, !541, !1287, !1288, !1289, !1293, !1294}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "matcoloring", scope: !512, file: !511, line: 66, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !518, line: 660, size: 5312, elements: !519)
!518 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!519 = !{!520, !522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !534, !535, !536, !537, !538, !539, !540}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !517, file: !518, line: 661, baseType: !521, size: 4480)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !309, line: 122, baseType: !308)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !517, file: !518, line: 661, baseType: !523, size: 32, offset: 4480)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !360)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !517, file: !518, line: 662, baseType: !364, size: 32, offset: 4512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !517, file: !518, line: 662, baseType: !364, size: 32, offset: 4544)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !517, file: !518, line: 662, baseType: !364, size: 32, offset: 4576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !517, file: !518, line: 663, baseType: !364, size: 32, offset: 4608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !517, file: !518, line: 664, baseType: !364, size: 32, offset: 4640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !517, file: !518, line: 665, baseType: !409, size: 64, offset: 4672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !517, file: !518, line: 666, baseType: !409, size: 64, offset: 4736)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !517, file: !518, line: 667, baseType: !364, size: 32, offset: 4800)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !517, file: !518, line: 668, baseType: !533, size: 32, offset: 4832)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !517, file: !518, line: 670, baseType: !409, size: 64, offset: 4864)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !517, file: !518, line: 670, baseType: !409, size: 64, offset: 4928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !517, file: !518, line: 671, baseType: !409, size: 64, offset: 4992)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !517, file: !518, line: 672, baseType: !409, size: 64, offset: 5056)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !517, file: !518, line: 673, baseType: !409, size: 64, offset: 5120)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !517, file: !518, line: 674, baseType: !364, size: 32, offset: 5184)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !517, file: !518, line: 675, baseType: !409, size: 64, offset: 5248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Rt", scope: !512, file: !511, line: 67, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !518, line: 436, size: 23424, elements: !545)
!545 = !{!546, !547, !1030, !1050, !1051, !1052, !1054, !1055, !1056, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1183, !1184, !1200, !1201, !1202, !1203, !1204, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1239, !1259, !1260, !1262, !1263, !1264, !1265, !1266, !1267, !1285, !1286}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !544, file: !518, line: 437, baseType: !521, size: 4480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !544, file: !518, line: 437, baseType: !548, size: 9472, offset: 4480)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 9472, elements: !360)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !518, line: 32, size: 9472, elements: !550)
!550 = !{!551, !560, !564, !565, !572, !576, !577, !578, !579, !580, !581, !582, !606, !610, !615, !621, !640, !645, !649, !650, !655, !660, !661, !666, !670, !674, !678, !682, !686, !687, !688, !689, !690, !694, !695, !700, !701, !702, !703, !704, !709, !716, !721, !725, !729, !733, !737, !738, !742, !743, !750, !755, !756, !757, !758, !818, !826, !827, !831, !832, !836, !837, !841, !846, !847, !851, !855, !862, !863, !864, !865, !866, !867, !872, !873, !877, !881, !885, !886, !887, !891, !901, !902, !906, !907, !911, !912, !916, !917, !922, !923, !927, !931, !932, !933, !934, !935, !936, !937, !941, !942, !943, !944, !945, !946, !950, !951, !952, !953, !954, !955, !956, !957, !961, !965, !966, !967, !971, !972, !973, !974, !975, !976, !977, !981, !982, !983, !988, !992, !993, !997, !998, !999, !1000, !1004, !1008, !1009, !1010, !1011, !1012, !1016, !1017, !1018, !1019, !1020, !1024, !1028, !1029}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !549, file: !518, line: 34, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!322, !542, !364, !555, !364, !555, !557, !559}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !549, file: !518, line: 35, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!322, !542, !364, !409, !411, !429}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !549, file: !518, line: 36, baseType: !561, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !549, file: !518, line: 37, baseType: !566, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!322, !542, !569, !569}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !549, file: !518, line: 38, baseType: !573, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!322, !542, !569, !569, !569}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !549, file: !518, line: 40, baseType: !566, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !549, file: !518, line: 41, baseType: !573, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !549, file: !518, line: 42, baseType: !566, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !549, file: !518, line: 43, baseType: !573, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !549, file: !518, line: 44, baseType: !566, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !549, file: !518, line: 46, baseType: !573, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !549, file: !518, line: 47, baseType: !583, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!322, !542, !586, !586, !590}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !587, line: 11, baseType: !588)
!587 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !587, line: 11, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !593, file: !36, line: 1227, baseType: !418, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !593, file: !36, line: 1228, baseType: !418, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !593, file: !36, line: 1229, baseType: !418, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !593, file: !36, line: 1230, baseType: !418, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !593, file: !36, line: 1231, baseType: !418, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !593, file: !36, line: 1232, baseType: !418, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !593, file: !36, line: 1233, baseType: !418, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !593, file: !36, line: 1234, baseType: !418, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !593, file: !36, line: 1236, baseType: !418, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !593, file: !36, line: 1237, baseType: !418, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !593, file: !36, line: 1238, baseType: !418, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !549, file: !518, line: 48, baseType: !607, size: 64, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!322, !542, !586, !590}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !549, file: !518, line: 49, baseType: !611, size: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!322, !542, !569, !418, !614, !418, !364, !364, !569}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !549, file: !518, line: 50, baseType: !616, size: 64, offset: 896)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!322, !542, !619, !620}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !549, file: !518, line: 52, baseType: !622, size: 64, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!322, !542, !625, !626}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !628, file: !36, line: 593, baseType: !366, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !628, file: !36, line: 594, baseType: !366, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !628, file: !36, line: 594, baseType: !366, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !628, file: !36, line: 594, baseType: !366, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !628, file: !36, line: 595, baseType: !366, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !628, file: !36, line: 596, baseType: !366, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !628, file: !36, line: 597, baseType: !366, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !628, file: !36, line: 598, baseType: !366, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !628, file: !36, line: 598, baseType: !366, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !628, file: !36, line: 599, baseType: !366, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !549, file: !518, line: 53, baseType: !641, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!322, !542, !542, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !549, file: !518, line: 54, baseType: !646, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!322, !542, !569}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !549, file: !518, line: 55, baseType: !566, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !549, file: !518, line: 56, baseType: !651, size: 64, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!322, !542, !654, !417}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !549, file: !518, line: 58, baseType: !656, size: 64, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!322, !542, !659}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !549, file: !518, line: 59, baseType: !656, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !549, file: !518, line: 60, baseType: !662, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!322, !542, !665, !479}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !549, file: !518, line: 61, baseType: !667, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!322, !542}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !549, file: !518, line: 63, baseType: !671, size: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!322, !542, !364, !555, !427, !569, !569}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !549, file: !518, line: 64, baseType: !675, size: 64, offset: 1600)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!322, !542, !542, !586, !586, !590}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !549, file: !518, line: 65, baseType: !679, size: 64, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!322, !542, !542, !590}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !549, file: !518, line: 66, baseType: !683, size: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!322, !542, !542, !586, !590}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !549, file: !518, line: 67, baseType: !679, size: 64, offset: 1792)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !549, file: !518, line: 69, baseType: !667, size: 64, offset: 1856)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !549, file: !518, line: 70, baseType: !675, size: 64, offset: 1920)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !549, file: !518, line: 71, baseType: !683, size: 64, offset: 1984)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !549, file: !518, line: 72, baseType: !691, size: 64, offset: 2048)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!322, !542, !620}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !549, file: !518, line: 73, baseType: !667, size: 64, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !549, file: !518, line: 75, baseType: !696, size: 64, offset: 2176)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!322, !542, !699, !620}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !549, file: !518, line: 76, baseType: !566, size: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !549, file: !518, line: 77, baseType: !566, size: 64, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !549, file: !518, line: 78, baseType: !583, size: 64, offset: 2368)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !549, file: !518, line: 79, baseType: !607, size: 64, offset: 2432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !549, file: !518, line: 81, baseType: !705, size: 64, offset: 2496)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!322, !542, !427, !542, !708}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !549, file: !518, line: 82, baseType: !710, size: 64, offset: 2560)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!322, !542, !364, !713, !713, !619, !715}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !549, file: !518, line: 83, baseType: !717, size: 64, offset: 2624)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!322, !542, !364, !720, !364}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !549, file: !518, line: 84, baseType: !722, size: 64, offset: 2688)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!322, !542, !364, !555, !364, !555, !426}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !549, file: !518, line: 85, baseType: !726, size: 64, offset: 2752)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!322, !542, !542, !708}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !549, file: !518, line: 87, baseType: !730, size: 64, offset: 2816)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!322, !542, !569, !409}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !549, file: !518, line: 88, baseType: !734, size: 64, offset: 2880)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!322, !542, !427}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !549, file: !518, line: 89, baseType: !734, size: 64, offset: 2944)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !549, file: !518, line: 90, baseType: !739, size: 64, offset: 3008)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!322, !542, !569, !559}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !549, file: !518, line: 91, baseType: !671, size: 64, offset: 3072)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !549, file: !518, line: 93, baseType: !744, size: 64, offset: 3136)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!322, !542, !747}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !549, file: !518, line: 94, baseType: !751, size: 64, offset: 3200)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!322, !542, !364, !479, !479, !409, !754, !754, !644}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !549, file: !518, line: 95, baseType: !751, size: 64, offset: 3264)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !549, file: !518, line: 96, baseType: !751, size: 64, offset: 3328)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !549, file: !518, line: 97, baseType: !751, size: 64, offset: 3392)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !549, file: !518, line: 99, baseType: !759, size: 64, offset: 3456)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!322, !542, !762, !765}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !587, line: 51, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !587, line: 51, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !518, line: 609, size: 6208, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !788, !795, !796, !797, !798, !799, !800, !801, !802, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !767, file: !518, line: 610, baseType: !521, size: 4480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !767, file: !518, line: 610, baseType: !523, size: 32, offset: 4480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !767, file: !518, line: 611, baseType: !364, size: 32, offset: 4512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !767, file: !518, line: 611, baseType: !364, size: 32, offset: 4544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !767, file: !518, line: 611, baseType: !364, size: 32, offset: 4576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !767, file: !518, line: 612, baseType: !364, size: 32, offset: 4608)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !767, file: !518, line: 613, baseType: !364, size: 32, offset: 4640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !767, file: !518, line: 614, baseType: !409, size: 64, offset: 4672)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !767, file: !518, line: 615, baseType: !411, size: 64, offset: 4736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !767, file: !518, line: 616, baseType: !720, size: 64, offset: 4800)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !767, file: !518, line: 617, baseType: !409, size: 64, offset: 4864)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !767, file: !518, line: 618, baseType: !781, size: 64, offset: 4928)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !518, line: 602, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 598, size: 128, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !783, file: !518, line: 599, baseType: !364, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !783, file: !518, line: 600, baseType: !364, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !783, file: !518, line: 601, baseType: !426, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !767, file: !518, line: 619, baseType: !789, size: 64, offset: 4992)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !518, line: 607, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 604, size: 128, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !791, file: !518, line: 605, baseType: !364, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !791, file: !518, line: 606, baseType: !426, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !767, file: !518, line: 620, baseType: !426, size: 64, offset: 5056)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !767, file: !518, line: 621, baseType: !418, size: 64, offset: 5120)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !767, file: !518, line: 622, baseType: !418, size: 64, offset: 5184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !767, file: !518, line: 623, baseType: !569, size: 64, offset: 5248)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !767, file: !518, line: 623, baseType: !569, size: 64, offset: 5312)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !767, file: !518, line: 623, baseType: !569, size: 64, offset: 5376)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !767, file: !518, line: 624, baseType: !479, size: 32, offset: 5440)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !767, file: !518, line: 625, baseType: !803, size: 64, offset: 5504)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!322}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !767, file: !518, line: 626, baseType: !305, size: 64, offset: 5568)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !767, file: !518, line: 627, baseType: !569, size: 64, offset: 5632)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !767, file: !518, line: 628, baseType: !364, size: 32, offset: 5696)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !767, file: !518, line: 629, baseType: !341, size: 64, offset: 5760)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !767, file: !518, line: 630, baseType: !533, size: 32, offset: 5824)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !767, file: !518, line: 631, baseType: !364, size: 32, offset: 5856)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !767, file: !518, line: 631, baseType: !364, size: 32, offset: 5888)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !767, file: !518, line: 632, baseType: !479, size: 32, offset: 5920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !767, file: !518, line: 633, baseType: !479, size: 32, offset: 5952)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !767, file: !518, line: 634, baseType: !352, size: 64, offset: 6016)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !767, file: !518, line: 634, baseType: !305, size: 64, offset: 6080)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !767, file: !518, line: 635, baseType: !372, size: 64, offset: 6144)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !549, file: !518, line: 100, baseType: !819, size: 64, offset: 3520)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!322, !542, !364, !364, !822, !825}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !824)
!824 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !549, file: !518, line: 101, baseType: !667, size: 64, offset: 3584)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !549, file: !518, line: 102, baseType: !828, size: 64, offset: 3648)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!322, !542, !586, !586, !620}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !549, file: !518, line: 103, baseType: !552, size: 64, offset: 3712)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !549, file: !518, line: 105, baseType: !833, size: 64, offset: 3776)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!322, !542, !586, !586, !619, !620}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !549, file: !518, line: 106, baseType: !667, size: 64, offset: 3840)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !549, file: !518, line: 107, baseType: !838, size: 64, offset: 3904)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!322, !542, !328}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !549, file: !518, line: 108, baseType: !842, size: 64, offset: 3968)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!322, !542, !845, !619, !620}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !341)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !549, file: !518, line: 109, baseType: !803, size: 64, offset: 4032)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !549, file: !518, line: 111, baseType: !848, size: 64, offset: 4096)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!322, !542, !542, !542, !418, !542}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !549, file: !518, line: 112, baseType: !852, size: 64, offset: 4160)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!322, !542, !542, !542, !542}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !549, file: !518, line: 113, baseType: !856, size: 64, offset: 4224)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!322, !542, !859, !859}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !587, line: 30, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !587, line: 30, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !549, file: !518, line: 114, baseType: !552, size: 64, offset: 4288)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !549, file: !518, line: 115, baseType: !671, size: 64, offset: 4352)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !549, file: !518, line: 117, baseType: !730, size: 64, offset: 4416)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !549, file: !518, line: 118, baseType: !730, size: 64, offset: 4480)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !549, file: !518, line: 119, baseType: !842, size: 64, offset: 4544)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !549, file: !518, line: 120, baseType: !868, size: 64, offset: 4608)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!322, !542, !871, !644}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !549, file: !518, line: 121, baseType: !803, size: 64, offset: 4672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !549, file: !518, line: 123, baseType: !874, size: 64, offset: 4736)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!322, !542, !364, !305}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !549, file: !518, line: 124, baseType: !878, size: 64, offset: 4800)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!322, !542, !765, !569, !305}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !549, file: !518, line: 125, baseType: !882, size: 64, offset: 4864)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!322, !455, !542}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !549, file: !518, line: 126, baseType: !566, size: 64, offset: 4928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !549, file: !518, line: 127, baseType: !566, size: 64, offset: 4992)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !549, file: !518, line: 129, baseType: !888, size: 64, offset: 5056)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!322, !542, !720}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !549, file: !518, line: 130, baseType: !892, size: 64, offset: 5120)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!322, !542, !895, !895}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !897, file: !60, line: 653, baseType: !364, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !897, file: !60, line: 653, baseType: !569, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !549, file: !518, line: 131, baseType: !892, size: 64, offset: 5184)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !549, file: !518, line: 132, baseType: !903, size: 64, offset: 5248)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!322, !542, !409, !409, !409}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !549, file: !518, line: 133, baseType: !838, size: 64, offset: 5312)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !549, file: !518, line: 135, baseType: !908, size: 64, offset: 5376)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!322, !542, !418, !644}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !549, file: !518, line: 136, baseType: !908, size: 64, offset: 5440)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !549, file: !518, line: 137, baseType: !913, size: 64, offset: 5504)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!322, !542, !644}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !549, file: !518, line: 138, baseType: !552, size: 64, offset: 5568)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !549, file: !518, line: 139, baseType: !918, size: 64, offset: 5632)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!322, !542, !921, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !549, file: !518, line: 141, baseType: !803, size: 64, offset: 5696)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !549, file: !518, line: 142, baseType: !924, size: 64, offset: 5760)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!322, !542, !542, !418, !542}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !549, file: !518, line: 143, baseType: !928, size: 64, offset: 5824)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!322, !542, !542, !542}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !549, file: !518, line: 144, baseType: !803, size: 64, offset: 5888)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !549, file: !518, line: 145, baseType: !924, size: 64, offset: 5952)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !549, file: !518, line: 147, baseType: !928, size: 64, offset: 6016)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !549, file: !518, line: 148, baseType: !803, size: 64, offset: 6080)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !549, file: !518, line: 149, baseType: !924, size: 64, offset: 6144)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !549, file: !518, line: 150, baseType: !928, size: 64, offset: 6208)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !549, file: !518, line: 151, baseType: !938, size: 64, offset: 6272)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!322, !542, !479}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !549, file: !518, line: 153, baseType: !667, size: 64, offset: 6336)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !549, file: !518, line: 154, baseType: !667, size: 64, offset: 6400)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !549, file: !518, line: 155, baseType: !667, size: 64, offset: 6464)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !549, file: !518, line: 156, baseType: !667, size: 64, offset: 6528)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !549, file: !518, line: 157, baseType: !838, size: 64, offset: 6592)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !549, file: !518, line: 159, baseType: !947, size: 64, offset: 6656)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!322, !542, !364, !557}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !549, file: !518, line: 160, baseType: !667, size: 64, offset: 6720)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !549, file: !518, line: 161, baseType: !667, size: 64, offset: 6784)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !549, file: !518, line: 162, baseType: !667, size: 64, offset: 6848)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !549, file: !518, line: 163, baseType: !667, size: 64, offset: 6912)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !549, file: !518, line: 165, baseType: !928, size: 64, offset: 6976)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !549, file: !518, line: 166, baseType: !928, size: 64, offset: 7040)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !549, file: !518, line: 167, baseType: !730, size: 64, offset: 7104)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !549, file: !518, line: 168, baseType: !958, size: 64, offset: 7168)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!322, !542, !569, !364}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !549, file: !518, line: 169, baseType: !962, size: 64, offset: 7232)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!322, !542, !644, !409}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !549, file: !518, line: 171, baseType: !691, size: 64, offset: 7296)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !549, file: !518, line: 172, baseType: !667, size: 64, offset: 7360)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !549, file: !518, line: 173, baseType: !968, size: 64, offset: 7424)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!322, !542, !409, !754}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !549, file: !518, line: 174, baseType: !828, size: 64, offset: 7488)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !549, file: !518, line: 175, baseType: !828, size: 64, offset: 7552)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !549, file: !518, line: 177, baseType: !566, size: 64, offset: 7616)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !549, file: !518, line: 178, baseType: !616, size: 64, offset: 7680)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !549, file: !518, line: 179, baseType: !566, size: 64, offset: 7744)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !549, file: !518, line: 180, baseType: !573, size: 64, offset: 7808)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !549, file: !518, line: 181, baseType: !978, size: 64, offset: 7872)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!322, !542, !301, !619, !620}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !549, file: !518, line: 183, baseType: !888, size: 64, offset: 7936)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !549, file: !518, line: 184, baseType: !651, size: 64, offset: 8000)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !549, file: !518, line: 185, baseType: !984, size: 64, offset: 8064)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!322, !542, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !549, file: !518, line: 186, baseType: !989, size: 64, offset: 8128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!322, !542, !364, !555, !426}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !549, file: !518, line: 187, baseType: !710, size: 64, offset: 8192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !549, file: !518, line: 189, baseType: !994, size: 64, offset: 8256)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!322, !542, !364, !364, !409, !557}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !549, file: !518, line: 190, baseType: !803, size: 64, offset: 8320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !549, file: !518, line: 191, baseType: !924, size: 64, offset: 8384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !549, file: !518, line: 192, baseType: !928, size: 64, offset: 8448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !549, file: !518, line: 193, baseType: !1001, size: 64, offset: 8512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!322, !542, !762, !515}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !549, file: !518, line: 195, baseType: !1005, size: 64, offset: 8576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!322, !515, !542, !542}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !549, file: !518, line: 196, baseType: !1005, size: 64, offset: 8640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !549, file: !518, line: 197, baseType: !803, size: 64, offset: 8704)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !549, file: !518, line: 198, baseType: !924, size: 64, offset: 8768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !549, file: !518, line: 199, baseType: !928, size: 64, offset: 8832)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !549, file: !518, line: 201, baseType: !1013, size: 64, offset: 8896)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!322, !542, !364, !364}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !549, file: !518, line: 202, baseType: !705, size: 64, offset: 8960)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !549, file: !518, line: 203, baseType: !573, size: 64, offset: 9024)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !549, file: !518, line: 204, baseType: !759, size: 64, offset: 9088)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !549, file: !518, line: 205, baseType: !888, size: 64, offset: 9152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !549, file: !518, line: 206, baseType: !1021, size: 64, offset: 9216)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!322, !301, !542, !364, !619, !620}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !549, file: !518, line: 208, baseType: !1025, size: 64, offset: 9280)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!322, !364, !715}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !549, file: !518, line: 209, baseType: !928, size: 64, offset: 9344)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !549, file: !518, line: 210, baseType: !722, size: 64, offset: 9408)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !544, file: !518, line: 438, baseType: !1031, size: 64, offset: 13952)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !587, line: 60, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1033, file: !114, line: 241, baseType: !301, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !114, line: 242, baseType: !381, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1033, file: !114, line: 243, baseType: !364, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1033, file: !114, line: 243, baseType: !364, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1033, file: !114, line: 244, baseType: !364, size: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1033, file: !114, line: 244, baseType: !364, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1033, file: !114, line: 245, baseType: !409, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1033, file: !114, line: 246, baseType: !479, size: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1033, file: !114, line: 247, baseType: !364, size: 32, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1033, file: !114, line: 251, baseType: !364, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1033, file: !114, line: 252, baseType: !859, size: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1033, file: !114, line: 253, baseType: !479, size: 32, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1033, file: !114, line: 254, baseType: !364, size: 32, offset: 544)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1033, file: !114, line: 254, baseType: !364, size: 32, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1033, file: !114, line: 255, baseType: !364, size: 32, offset: 608)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !544, file: !518, line: 438, baseType: !1031, size: 64, offset: 14016)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !518, line: 439, baseType: !305, size: 64, offset: 14080)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !544, file: !518, line: 440, baseType: !1053, size: 32, offset: 14144)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !544, file: !518, line: 441, baseType: !479, size: 32, offset: 14176)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !544, file: !518, line: 442, baseType: !479, size: 32, offset: 14208)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !544, file: !518, line: 443, baseType: !1057, size: 448, offset: 14272)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 448, elements: !1059)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !341)
!1059 = !{!1060}
!1060 = !DISubrange(count: 7)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !544, file: !518, line: 444, baseType: !479, size: 32, offset: 14720)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !544, file: !518, line: 445, baseType: !479, size: 32, offset: 14752)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !544, file: !518, line: 446, baseType: !364, size: 32, offset: 14784)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !544, file: !518, line: 447, baseType: !402, size: 64, offset: 14848)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !544, file: !518, line: 448, baseType: !402, size: 64, offset: 14912)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !544, file: !518, line: 449, baseType: !627, size: 640, offset: 14976)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !544, file: !518, line: 450, baseType: !559, size: 32, offset: 15616)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !544, file: !518, line: 451, baseType: !1069, size: 2880, offset: 15680)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !518, line: 318, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !518, line: 319, size: 2880, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1091, !1092, !1097, !1102, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1117, !1118, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1150, !1151, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1174, !1175, !1176, !1180, !1181}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1070, file: !518, line: 320, baseType: !364, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1070, file: !518, line: 321, baseType: !364, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1070, file: !518, line: 322, baseType: !364, size: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1070, file: !518, line: 323, baseType: !364, size: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1070, file: !518, line: 324, baseType: !364, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1070, file: !518, line: 325, baseType: !364, size: 32, offset: 160)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1070, file: !518, line: 326, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !518, line: 293, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !518, line: 295, size: 448, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !518, line: 296, baseType: !1079, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1081, file: !518, line: 297, baseType: !426, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1081, file: !518, line: 297, baseType: !426, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1081, file: !518, line: 298, baseType: !409, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1081, file: !518, line: 298, baseType: !409, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1081, file: !518, line: 299, baseType: !364, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1081, file: !518, line: 300, baseType: !364, size: 32, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1081, file: !518, line: 301, baseType: !364, size: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1070, file: !518, line: 326, baseType: !1079, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1070, file: !518, line: 328, baseType: !1093, size: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!322, !542, !1096, !409}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1070, file: !518, line: 329, baseType: !1098, size: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!322, !1096, !1101, !411, !411, !429, !409}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1070, file: !518, line: 330, baseType: !1103, size: 64, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!322, !1096}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1070, file: !518, line: 331, baseType: !1103, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1070, file: !518, line: 334, baseType: !301, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !518, line: 335, baseType: !381, size: 32, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1070, file: !518, line: 335, baseType: !381, size: 32, offset: 672)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1070, file: !518, line: 336, baseType: !381, size: 32, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1070, file: !518, line: 336, baseType: !381, size: 32, offset: 736)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1070, file: !518, line: 337, baseType: !1113, size: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !302, line: 339, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !302, line: 339, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1070, file: !518, line: 338, baseType: !1113, size: 64, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1070, file: !518, line: 339, baseType: !1119, size: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !302, line: 341, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !302, line: 351, size: 192, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1121, file: !302, line: 354, baseType: !72, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1121, file: !302, line: 355, baseType: !72, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1121, file: !302, line: 356, baseType: !72, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1121, file: !302, line: 361, baseType: !72, size: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1121, file: !302, line: 362, baseType: !475, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1070, file: !518, line: 340, baseType: !364, size: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1070, file: !518, line: 340, baseType: !364, size: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1070, file: !518, line: 341, baseType: !426, size: 64, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1070, file: !518, line: 342, baseType: !409, size: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1070, file: !518, line: 343, baseType: !429, size: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1070, file: !518, line: 344, baseType: !411, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1070, file: !518, line: 345, baseType: !364, size: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1070, file: !518, line: 346, baseType: !1101, size: 64, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1070, file: !518, line: 347, baseType: !479, size: 32, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1070, file: !518, line: 348, baseType: !364, size: 32, offset: 1440)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1070, file: !518, line: 351, baseType: !479, size: 32, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1070, file: !518, line: 352, baseType: !479, size: 32, offset: 1504)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1070, file: !518, line: 353, baseType: !381, size: 32, offset: 1536)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1070, file: !518, line: 354, baseType: !381, size: 32, offset: 1568)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1070, file: !518, line: 355, baseType: !1101, size: 64, offset: 1600)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1070, file: !518, line: 356, baseType: !1101, size: 64, offset: 1664)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1070, file: !518, line: 357, baseType: !1145, size: 64, offset: 1728)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !518, line: 310, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 308, size: 32, elements: !1148)
!1148 = !{!1149}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1147, file: !518, line: 309, baseType: !364, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1070, file: !518, line: 357, baseType: !1145, size: 64, offset: 1792)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1070, file: !518, line: 358, baseType: !1152, size: 64, offset: 1856)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !518, line: 316, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 312, size: 128, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1154, file: !518, line: 313, baseType: !305, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1154, file: !518, line: 314, baseType: !364, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1154, file: !518, line: 315, baseType: !343, size: 8, offset: 96)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1070, file: !518, line: 359, baseType: !1152, size: 64, offset: 1920)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1070, file: !518, line: 360, baseType: !1152, size: 64, offset: 1984)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1070, file: !518, line: 361, baseType: !364, size: 32, offset: 2048)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1070, file: !518, line: 362, baseType: !381, size: 32, offset: 2080)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1070, file: !518, line: 363, baseType: !364, size: 32, offset: 2112)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1070, file: !518, line: 364, baseType: !1101, size: 64, offset: 2176)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1070, file: !518, line: 365, baseType: !1119, size: 64, offset: 2240)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1070, file: !518, line: 366, baseType: !381, size: 32, offset: 2304)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1070, file: !518, line: 367, baseType: !381, size: 32, offset: 2336)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1070, file: !518, line: 368, baseType: !1113, size: 64, offset: 2368)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1070, file: !518, line: 369, baseType: !1113, size: 64, offset: 2432)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1070, file: !518, line: 370, baseType: !1171, size: 64, offset: 2496)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1070, file: !518, line: 371, baseType: !1171, size: 64, offset: 2560)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1070, file: !518, line: 372, baseType: !1171, size: 64, offset: 2624)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1070, file: !518, line: 373, baseType: !1177, size: 64, offset: 2688)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !302, line: 331, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !302, line: 331, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1070, file: !518, line: 374, baseType: !475, size: 64, offset: 2752)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1070, file: !518, line: 375, baseType: !1182, size: 64, offset: 2816)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !544, file: !518, line: 451, baseType: !1069, size: 2880, offset: 18560)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !544, file: !518, line: 452, baseType: !1185, size: 64, offset: 21440)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !518, line: 681, size: 4864, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1195, !1199}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1187, file: !518, line: 682, baseType: !521, size: 4480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1187, file: !518, line: 682, baseType: !523, size: 32, offset: 4480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1187, file: !518, line: 683, baseType: !479, size: 32, offset: 4512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1187, file: !518, line: 684, baseType: !364, size: 32, offset: 4544)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1187, file: !518, line: 685, baseType: !921, size: 64, offset: 4608)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1187, file: !518, line: 686, baseType: !426, size: 64, offset: 4672)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1187, file: !518, line: 687, baseType: !1196, size: 64, offset: 4736)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!322, !1185, !569, !305}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1187, file: !518, line: 688, baseType: !305, size: 64, offset: 4800)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !544, file: !518, line: 453, baseType: !1185, size: 64, offset: 21504)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !544, file: !518, line: 454, baseType: !1185, size: 64, offset: 21568)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !544, file: !518, line: 455, baseType: !364, size: 32, offset: 21632)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !544, file: !518, line: 456, baseType: !479, size: 32, offset: 21664)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !544, file: !518, line: 457, baseType: !1205, size: 320, offset: 21696)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !518, line: 399, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 394, size: 320, elements: !1207)
!1207 = !{!1208, !1209, !1213, !1214}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1206, file: !518, line: 395, baseType: !364, size: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1206, file: !518, line: 396, baseType: !1210, size: 128, offset: 32)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 128, elements: !1211)
!1211 = !{!1212}
!1212 = !DISubrange(count: 4)
