; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpits.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpits.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !273, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpits.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !13, !20, !23, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 562, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "PETSC_BUILDTWOSIDED_NOTSET", value: -1)
!10 = !DIEnumerator(name: "PETSC_BUILDTWOSIDED_ALLREDUCE", value: 0)
!11 = !DIEnumerator(name: "PETSC_BUILDTWOSIDED_IBARRIER", value: 1)
!12 = !DIEnumerator(name: "PETSC_BUILDTWOSIDED_REDSCATTER", value: 2)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 663, baseType: !15, size: 32, elements: !16)
!14 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !15, size: 32, elements: !21)
!21 = !{!22}
!22 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !15, size: 32, elements: !24)
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 81, baseType: !15, size: 32, elements: !29)
!28 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!36 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!37 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!38 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!39 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!40 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!41 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!42 = !{!43, !44, !48, !49, !52, !54, !7, !57, !59, !61, !118, !259, !15, !130, !225, !268, !271, !272}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !45, line: 331, baseType: !46)
!45 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !45, line: 331, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !45, line: 338, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !45, line: 338, flags: DIFlagFwdDecl)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !45, line: 330, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !45, line: 330, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !20)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !64, line: 73, size: 4480, elements: !65)
!64 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!65 = !{!66, !68, !114, !115, !117, !120, !121, !122, !123, !131, !132, !133, !137, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !157, !158, !160, !162, !163, !164, !165, !166, !169, !171, !172, !173, !174, !175, !178, !180, !181, !182, !192, !194, !195, !199, !200, !249, !254, !256, !257, !258}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !63, file: !64, line: 74, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !7)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !63, file: !64, line: 75, baseType: !69, size: 448, offset: 64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 448, elements: !112)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !64, line: 53, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 45, size: 448, elements: !72)
!72 = !{!73, !79, !87, !92, !96, !100, !107}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !71, file: !64, line: 46, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !61, !78}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !7)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !71, file: !64, line: 47, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!77, !61, !83}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !84, line: 16, baseType: !85)
!84 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !84, line: 16, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !71, file: !64, line: 48, baseType: !88, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!77, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !71, file: !64, line: 49, baseType: !93, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!77, !61, !57, !61}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !71, file: !64, line: 50, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!77, !61, !57, !91}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !71, file: !64, line: 51, baseType: !101, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!77, !61, !57, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !71, file: !64, line: 52, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!77, !61, !57, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !63, file: !64, line: 76, baseType: !54, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !64, line: 77, baseType: !116, size: 32, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !7)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !63, file: !64, line: 78, baseType: !118, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !119)
!119 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !63, file: !64, line: 78, baseType: !118, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !63, file: !64, line: 78, baseType: !118, size: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !63, file: !64, line: 78, baseType: !118, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !64, line: 79, baseType: !124, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !127, line: 27, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !129, line: 43, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!130 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !63, file: !64, line: 80, baseType: !116, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !63, file: !64, line: 81, baseType: !43, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !63, file: !64, line: 82, baseType: !134, size: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !63, file: !64, line: 83, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !63, file: !64, line: 84, baseType: !52, size: 64, offset: 1152)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !63, file: !64, line: 85, baseType: !52, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !63, file: !64, line: 86, baseType: !52, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !63, file: !64, line: 87, baseType: !52, size: 64, offset: 1344)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !63, file: !64, line: 88, baseType: !61, size: 64, offset: 1408)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !63, file: !64, line: 89, baseType: !124, size: 64, offset: 1472)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 90, baseType: !52, size: 64, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !63, file: !64, line: 91, baseType: !52, size: 64, offset: 1600)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !63, file: !64, line: 92, baseType: !116, size: 32, offset: 1664)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !63, file: !64, line: 93, baseType: !48, size: 64, offset: 1728)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !63, file: !64, line: 94, baseType: !152, size: 64, offset: 1792)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !125)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !63, file: !64, line: 95, baseType: !116, size: 32, offset: 1856)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !63, file: !64, line: 95, baseType: !116, size: 32, offset: 1888)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !63, file: !64, line: 96, baseType: !156, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !63, file: !64, line: 96, baseType: !156, size: 64, offset: 1984)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !63, file: !64, line: 97, baseType: !159, size: 64, offset: 2048)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !63, file: !64, line: 97, baseType: !161, size: 64, offset: 2112)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !63, file: !64, line: 98, baseType: !116, size: 32, offset: 2176)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !63, file: !64, line: 98, baseType: !116, size: 32, offset: 2208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !63, file: !64, line: 99, baseType: !156, size: 64, offset: 2240)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !63, file: !64, line: 99, baseType: !156, size: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !63, file: !64, line: 100, baseType: !167, size: 64, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !119)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !63, file: !64, line: 100, baseType: !170, size: 64, offset: 2432)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !63, file: !64, line: 101, baseType: !116, size: 32, offset: 2496)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !63, file: !64, line: 101, baseType: !116, size: 32, offset: 2528)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !63, file: !64, line: 102, baseType: !156, size: 64, offset: 2560)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !63, file: !64, line: 102, baseType: !156, size: 64, offset: 2624)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !63, file: !64, line: 103, baseType: !176, size: 64, offset: 2688)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !168)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !63, file: !64, line: 103, baseType: !179, size: 64, offset: 2752)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !63, file: !64, line: 104, baseType: !111, size: 64, offset: 2816)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !63, file: !64, line: 105, baseType: !116, size: 32, offset: 2880)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !63, file: !64, line: 106, baseType: !183, size: 128, offset: 2944)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !190)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !64, line: 64, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 61, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !186, file: !64, line: 62, baseType: !104, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !186, file: !64, line: 63, baseType: !48, size: 64, offset: 64)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !63, file: !64, line: 107, baseType: !193, size: 64, offset: 3072)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !190)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !63, file: !64, line: 108, baseType: !48, size: 64, offset: 3136)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !63, file: !64, line: 109, baseType: !196, size: 64, offset: 3200)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!77, !48}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !63, file: !64, line: 111, baseType: !116, size: 32, offset: 3264)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !63, file: !64, line: 112, baseType: !201, size: 320, offset: 3328)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 320, elements: !247)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!77, !205, !61, !48}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !28, line: 108, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !28, line: 99, size: 640, elements: !208)
!208 = !{!209, !210, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !207, file: !28, line: 100, baseType: !116, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !28, line: 101, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !28, line: 82, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !28, line: 83, size: 768, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !222, !223, !224, !228, !230, !232, !233, !234}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !213, file: !28, line: 84, baseType: !52, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !213, file: !28, line: 85, baseType: !52, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !28, line: 86, baseType: !48, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !213, file: !28, line: 87, baseType: !134, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !213, file: !28, line: 88, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !213, file: !28, line: 89, baseType: !53, size: 8, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !213, file: !28, line: 90, baseType: !52, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !213, file: !28, line: 91, baseType: !225, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 46, baseType: !227)
!226 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!227 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !213, file: !28, line: 92, baseType: !229, size: 32, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !23)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !28, line: 93, baseType: !231, size: 32, offset: 544)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !28, line: 81, baseType: !27)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !28, line: 94, baseType: !211, size: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !213, file: !28, line: 95, baseType: !52, size: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !213, file: !28, line: 96, baseType: !48, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !207, file: !28, line: 102, baseType: !52, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !207, file: !28, line: 102, baseType: !52, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !207, file: !28, line: 103, baseType: !52, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !207, file: !28, line: 104, baseType: !54, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !207, file: !28, line: 105, baseType: !229, size: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !207, file: !28, line: 105, baseType: !229, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !207, file: !28, line: 105, baseType: !229, size: 32, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !207, file: !28, line: 106, baseType: !61, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !207, file: !28, line: 107, baseType: !244, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !28, line: 10, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !28, line: 10, flags: DIFlagFwdDecl)
!247 = !{!248}
!248 = !DISubrange(count: 5)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !63, file: !64, line: 113, baseType: !250, size: 320, offset: 3648)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !247)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!77, !61, !48}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !63, file: !64, line: 114, baseType: !255, size: 320, offset: 3968)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 320, elements: !247)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !63, file: !64, line: 115, baseType: !229, size: 32, offset: 4288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !63, file: !64, line: 120, baseType: !244, size: 64, offset: 4352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !63, file: !64, line: 121, baseType: !229, size: 32, offset: 4416)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !45, line: 341, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !45, line: 351, size: 192, elements: !262)
!262 = !{!263, !264, !265, !266, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !261, file: !45, line: 354, baseType: !7, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !261, file: !45, line: 355, baseType: !7, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !261, file: !45, line: 356, baseType: !7, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !261, file: !45, line: 361, baseType: !7, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !261, file: !45, line: 362, baseType: !225, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !45, line: 339, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !45, line: 339, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!273 = !{!0, !274, !279, !281}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "PETSC_BuildTwoSided", scope: !2, file: !276, line: 4, type: !277, isLocal: false, isDefinition: true)
!276 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpits.c", directory: "/home/users/ndemeye/xSDK")
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !278, line: 80, baseType: !7)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "PETSC_BuildTwoSidedF", scope: !2, file: !276, line: 5, type: !277, isLocal: false, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "_twosided_type", scope: !2, file: !276, line: 16, type: !283, isLocal: true, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBuildTwoSidedType", file: !6, line: 568, baseType: !5)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 384, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 6)
!287 = !{i32 7, !"Dwarf Version", i32 4}
!288 = !{i32 2, !"Debug Info Version", i32 3}
!289 = !{i32 1, !"wchar_size", i32 4}
!290 = !{i32 7, !"PIC Level", i32 2}
!291 = !{i32 7, !"uwtable", i32 1}
!292 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!293 = distinct !DISubprogram(name: "PetscCommBuildTwoSidedSetType", scope: !276, file: !276, line: 34, type: !294, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{!77, !54, !283}
!296 = !{!297, !298, !299, !302, !304, !305, !307, !309, !310, !312, !318, !319, !321, !324, !325, !327, !330}
!297 = !DILocalVariable(name: "comm", arg: 1, scope: !293, file: !276, line: 34, type: !54)
!298 = !DILocalVariable(name: "twosided", arg: 2, scope: !293, file: !276, line: 34, type: !283)
!299 = !DILocalVariable(name: "ierr", scope: !300, file: !276, line: 38, type: !43)
!300 = distinct !DILexicalBlock(scope: !301, file: !276, line: 37, column: 32)
!301 = distinct !DILexicalBlock(scope: !293, file: !276, line: 37, column: 7)
!302 = !DILocalVariable(name: "b1", scope: !300, file: !276, line: 39, type: !303)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !190)
!304 = !DILocalVariable(name: "b2", scope: !300, file: !276, line: 39, type: !303)
!305 = !DILocalVariable(name: "_4_ierr", scope: !306, file: !276, line: 42, type: !77)
!306 = distinct !DILexicalBlock(scope: !300, file: !276, line: 42, column: 13)
!307 = !DILocalVariable(name: "a_b1", scope: !306, file: !276, line: 42, type: !308)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 192, elements: !285)
!309 = !DILocalVariable(name: "a_b2", scope: !306, file: !276, line: 42, type: !308)
!310 = !DILocalVariable(name: "_7_errorcode", scope: !311, file: !276, line: 42, type: !77)
!311 = distinct !DILexicalBlock(scope: !306, file: !276, line: 42, column: 13)
!312 = !DILocalVariable(name: "_7_errorstring", scope: !313, file: !276, line: 42, type: !315)
!313 = distinct !DILexicalBlock(scope: !314, file: !276, line: 42, column: 13)
!314 = distinct !DILexicalBlock(scope: !311, file: !276, line: 42, column: 13)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 256)
!318 = !DILocalVariable(name: "_7_resultlen", scope: !313, file: !276, line: 42, type: !43)
!319 = !DILocalVariable(name: "_7_errorcode", scope: !320, file: !276, line: 42, type: !77)
!320 = distinct !DILexicalBlock(scope: !306, file: !276, line: 42, column: 13)
!321 = !DILocalVariable(name: "_7_errorstring", scope: !322, file: !276, line: 42, type: !315)
!322 = distinct !DILexicalBlock(scope: !323, file: !276, line: 42, column: 13)
!323 = distinct !DILexicalBlock(scope: !320, file: !276, line: 42, column: 13)
!324 = !DILocalVariable(name: "_7_resultlen", scope: !322, file: !276, line: 42, type: !43)
!325 = !DILocalVariable(name: "_7_errorcode", scope: !326, file: !276, line: 42, type: !77)
!326 = distinct !DILexicalBlock(scope: !300, file: !276, line: 42, column: 58)
!327 = !DILocalVariable(name: "_7_errorstring", scope: !328, file: !276, line: 42, type: !315)
!328 = distinct !DILexicalBlock(scope: !329, file: !276, line: 42, column: 58)
!329 = distinct !DILexicalBlock(scope: !326, file: !276, line: 42, column: 58)
!330 = !DILocalVariable(name: "_7_resultlen", scope: !328, file: !276, line: 42, type: !43)
!331 = !DILocation(line: 0, scope: !293)
!332 = !DILocation(line: 36, column: 3, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !276, line: 36, column: 3)
!334 = distinct !DILexicalBlock(scope: !335, file: !276, line: 36, column: 3)
!335 = distinct !DILexicalBlock(scope: !293, file: !276, line: 36, column: 3)
!336 = !{!337, !337, i64 0}
!337 = !{!"any pointer", !338, i64 0}
!338 = !{!"omnipotent char", !339, i64 0}
!339 = !{!"Simple C/C++ TBAA"}
!340 = !DILocation(line: 36, column: 3, scope: !334)
!341 = !DILocation(line: 36, column: 3, scope: !342)
!342 = distinct !DILexicalBlock(scope: !343, file: !276, line: 36, column: 3)
!343 = distinct !DILexicalBlock(scope: !333, file: !276, line: 36, column: 3)
!344 = !{!345, !346, i64 1536}
!345 = !{!"", !338, i64 0, !338, i64 512, !338, i64 1024, !338, i64 1280, !346, i64 1536, !346, i64 1540, !338, i64 1544}
!346 = !{!"int", !338, i64 0}
!347 = !DILocation(line: 36, column: 3, scope: !343)
!348 = !DILocation(line: 36, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !342, file: !276, line: 36, column: 3)
!350 = !{!346, !346, i64 0}
!351 = !{!345, !346, i64 1540}
!352 = !DILocation(line: 39, column: 5, scope: !300)
!353 = !DILocation(line: 39, column: 17, scope: !300)
!354 = !DILocation(line: 39, column: 23, scope: !300)
!355 = !DILocation(line: 40, column: 13, scope: !300)
!356 = !DILocation(line: 40, column: 5, scope: !300)
!357 = !DILocation(line: 40, column: 11, scope: !300)
!358 = !DILocation(line: 41, column: 5, scope: !300)
!359 = !DILocation(line: 41, column: 11, scope: !300)
!360 = !DILocation(line: 0, scope: !300)
!361 = !DILocation(line: 42, column: 13, scope: !306)
!362 = !DILocalVariable(name: "comm", arg: 1, scope: !363, file: !278, line: 498, type: !54)
!363 = distinct !DISubprogram(name: "PetscMPIParallelComm", scope: !278, file: !278, line: 498, type: !364, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!7, !54}
!366 = !{!362, !367}
!367 = !DILocalVariable(name: "size", scope: !363, file: !278, line: 500, type: !43)
!368 = !DILocation(line: 0, scope: !363, inlinedAt: !369)
!369 = distinct !DILocation(line: 42, column: 13, scope: !306)
!370 = !DILocation(line: 500, column: 3, scope: !363, inlinedAt: !369)
!371 = !DILocation(line: 500, column: 21, scope: !363, inlinedAt: !369)
!372 = !DILocation(line: 500, column: 55, scope: !363, inlinedAt: !369)
!373 = !DILocation(line: 500, column: 60, scope: !363, inlinedAt: !369)
!374 = !DILocation(line: 501, column: 1, scope: !363, inlinedAt: !369)
!375 = !{!376, !376, i64 0}
!376 = !{!"double", !338, i64 0}
!377 = !DILocation(line: 0, scope: !306)
!378 = !DILocation(line: 0, scope: !311)
!379 = !DILocation(line: 42, column: 13, scope: !314)
!380 = !DILocation(line: 42, column: 13, scope: !311)
!381 = !{!"branch_weights", i32 2000, i32 1}
!382 = !DILocation(line: 42, column: 13, scope: !313)
!383 = !DILocation(line: 0, scope: !313)
!384 = !DILocation(line: 42, column: 13, scope: !385)
!385 = distinct !DILexicalBlock(scope: !306, file: !276, line: 42, column: 13)
!386 = !DILocation(line: 42, column: 13, scope: !387)
!387 = distinct !DILexicalBlock(scope: !306, file: !276, line: 42, column: 13)
!388 = !DILocation(line: 42, column: 13, scope: !389)
!389 = distinct !DILexicalBlock(scope: !306, file: !276, line: 42, column: 13)
!390 = !DILocation(line: 0, scope: !363, inlinedAt: !391)
!391 = distinct !DILocation(line: 42, column: 13, scope: !306)
!392 = !DILocation(line: 500, column: 3, scope: !363, inlinedAt: !391)
!393 = !DILocation(line: 500, column: 21, scope: !363, inlinedAt: !391)
!394 = !DILocation(line: 500, column: 55, scope: !363, inlinedAt: !391)
!395 = !DILocation(line: 500, column: 60, scope: !363, inlinedAt: !391)
!396 = !DILocation(line: 501, column: 1, scope: !363, inlinedAt: !391)
!397 = !DILocation(line: 0, scope: !320)
!398 = !DILocation(line: 42, column: 13, scope: !323)
!399 = !DILocation(line: 42, column: 13, scope: !320)
!400 = !DILocation(line: 42, column: 13, scope: !322)
!401 = !DILocation(line: 0, scope: !322)
!402 = !DILocation(line: 42, column: 13, scope: !300)
!403 = !DILocation(line: 43, column: 10, scope: !404)
!404 = distinct !DILexicalBlock(scope: !300, file: !276, line: 43, column: 9)
!405 = !DILocation(line: 43, column: 9, scope: !404)
!406 = !DILocation(line: 43, column: 19, scope: !404)
!407 = !DILocation(line: 43, column: 16, scope: !404)
!408 = !DILocation(line: 43, column: 9, scope: !300)
!409 = !DILocation(line: 43, column: 26, scope: !404)
!410 = !DILocation(line: 44, column: 3, scope: !301)
!411 = !DILocation(line: 45, column: 18, scope: !293)
!412 = !{!338, !338, i64 0}
!413 = !DILocation(line: 46, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !276, line: 46, column: 3)
!415 = distinct !DILexicalBlock(scope: !416, file: !276, line: 46, column: 3)
!416 = distinct !DILexicalBlock(scope: !293, file: !276, line: 46, column: 3)
!417 = !DILocation(line: 46, column: 3, scope: !415)
!418 = !DILocation(line: 46, column: 3, scope: !419)
!419 = distinct !DILexicalBlock(scope: !420, file: !276, line: 46, column: 3)
!420 = distinct !DILexicalBlock(scope: !414, file: !276, line: 46, column: 3)
!421 = !DILocation(line: 46, column: 3, scope: !420)
!422 = !DILocation(line: 46, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !276, line: 46, column: 3)
!424 = distinct !DILexicalBlock(scope: !419, file: !276, line: 46, column: 3)
!425 = !{!345, !338, i64 1544}
!426 = !DILocation(line: 46, column: 3, scope: !424)
!427 = !DILocation(line: 46, column: 3, scope: !428)
!428 = distinct !DILexicalBlock(scope: !423, file: !276, line: 46, column: 3)
!429 = !DILocation(line: 46, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !419, file: !276, line: 46, column: 3)
!431 = !DILocation(line: 46, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !430, file: !276, line: 46, column: 3)
!433 = !DILocation(line: 46, column: 3, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !276, line: 46, column: 3)
!435 = distinct !DILexicalBlock(scope: !432, file: !276, line: 46, column: 3)
!436 = !DILocation(line: 46, column: 3, scope: !435)
!437 = !DILocation(line: 46, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !276, line: 46, column: 3)
!439 = !DILocation(line: 47, column: 1, scope: !293)
!440 = !DISubprogram(name: "MPI_Allreduce", scope: !45, file: !45, line: 1218, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!441 = !DISubroutineType(types: !442)
!442 = !{!7, !443, !48, !7, !46, !50, !55}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!445 = !{}
!446 = !DISubprogram(name: "MPI_Error_string", scope: !45, file: !45, line: 1357, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!447 = !DISubroutineType(types: !448)
!448 = !{!7, !7, !52, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!450 = !DISubprogram(name: "PetscError", scope: !14, file: !14, line: 668, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!451 = !DISubroutineType(types: !452)
!452 = !{!77, !55, !7, !57, !57, !7, !13, !57, null}
!453 = distinct !DISubprogram(name: "PetscCommBuildTwoSidedGetType", scope: !276, file: !276, line: 62, type: !454, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !457)
!454 = !DISubroutineType(types: !455)
!455 = !{!77, !54, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!457 = !{!458, !459, !460, !461, !462, !466, !469, !470}
!458 = !DILocalVariable(name: "comm", arg: 1, scope: !453, file: !276, line: 62, type: !54)
!459 = !DILocalVariable(name: "twosided", arg: 2, scope: !453, file: !276, line: 62, type: !456)
!460 = !DILocalVariable(name: "ierr", scope: !453, file: !276, line: 64, type: !77)
!461 = !DILocalVariable(name: "size", scope: !453, file: !276, line: 65, type: !43)
!462 = !DILocalVariable(name: "_7_errorcode", scope: !463, file: !276, line: 70, type: !77)
!463 = distinct !DILexicalBlock(scope: !464, file: !276, line: 70, column: 38)
!464 = distinct !DILexicalBlock(scope: !465, file: !276, line: 69, column: 53)
!465 = distinct !DILexicalBlock(scope: !453, file: !276, line: 69, column: 7)
!466 = !DILocalVariable(name: "_7_errorstring", scope: !467, file: !276, line: 70, type: !315)
!467 = distinct !DILexicalBlock(scope: !468, file: !276, line: 70, column: 38)
!468 = distinct !DILexicalBlock(scope: !463, file: !276, line: 70, column: 38)
!469 = !DILocalVariable(name: "_7_resultlen", scope: !467, file: !276, line: 70, type: !43)
!470 = !DILocalVariable(name: "ierr__", scope: !471, file: !276, line: 75, type: !77)
!471 = distinct !DILexicalBlock(scope: !464, file: !276, line: 75, column: 118)
!472 = !DILocation(line: 0, scope: !453)
!473 = !DILocation(line: 65, column: 3, scope: !453)
!474 = !DILocation(line: 67, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !276, line: 67, column: 3)
!476 = distinct !DILexicalBlock(scope: !477, file: !276, line: 67, column: 3)
!477 = distinct !DILexicalBlock(scope: !453, file: !276, line: 67, column: 3)
!478 = !DILocation(line: 67, column: 3, scope: !476)
!479 = !DILocation(line: 67, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !276, line: 67, column: 3)
!481 = distinct !DILexicalBlock(scope: !475, file: !276, line: 67, column: 3)
!482 = !DILocation(line: 67, column: 3, scope: !481)
!483 = !DILocation(line: 67, column: 3, scope: !484)
!484 = distinct !DILexicalBlock(scope: !480, file: !276, line: 67, column: 3)
!485 = !DILocation(line: 68, column: 13, scope: !453)
!486 = !DILocation(line: 69, column: 7, scope: !465)
!487 = !DILocation(line: 69, column: 22, scope: !465)
!488 = !DILocation(line: 69, column: 7, scope: !453)
!489 = !DILocation(line: 70, column: 12, scope: !464)
!490 = !DILocation(line: 0, scope: !463)
!491 = !DILocation(line: 70, column: 38, scope: !468)
!492 = !DILocation(line: 70, column: 38, scope: !463)
!493 = !DILocation(line: 70, column: 38, scope: !467)
!494 = !DILocation(line: 0, scope: !467)
!495 = !DILocation(line: 73, column: 9, scope: !496)
!496 = distinct !DILexicalBlock(scope: !464, file: !276, line: 73, column: 9)
!497 = !DILocation(line: 73, column: 14, scope: !496)
!498 = !DILocation(line: 73, column: 9, scope: !464)
!499 = !DILocation(line: 0, scope: !464)
!500 = !DILocation(line: 75, column: 12, scope: !464)
!501 = !DILocation(line: 0, scope: !471)
!502 = !DILocation(line: 75, column: 118, scope: !503)
!503 = distinct !DILexicalBlock(scope: !471, file: !276, line: 75, column: 118)
!504 = !DILocation(line: 75, column: 118, scope: !471)
!505 = !DILocation(line: 77, column: 15, scope: !453)
!506 = !DILocation(line: 77, column: 13, scope: !453)
!507 = !DILocation(line: 78, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !276, line: 78, column: 3)
!509 = distinct !DILexicalBlock(scope: !510, file: !276, line: 78, column: 3)
!510 = distinct !DILexicalBlock(scope: !453, file: !276, line: 78, column: 3)
!511 = !DILocation(line: 78, column: 3, scope: !509)
!512 = !DILocation(line: 78, column: 3, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !276, line: 78, column: 3)
!514 = distinct !DILexicalBlock(scope: !508, file: !276, line: 78, column: 3)
!515 = !DILocation(line: 78, column: 3, scope: !514)
!516 = !DILocation(line: 78, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !276, line: 78, column: 3)
!518 = distinct !DILexicalBlock(scope: !513, file: !276, line: 78, column: 3)
!519 = !DILocation(line: 78, column: 3, scope: !518)
!520 = !DILocation(line: 78, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !517, file: !276, line: 78, column: 3)
!522 = !DILocation(line: 78, column: 3, scope: !523)
!523 = distinct !DILexicalBlock(scope: !513, file: !276, line: 78, column: 3)
!524 = !DILocation(line: 78, column: 3, scope: !525)
!525 = distinct !DILexicalBlock(scope: !523, file: !276, line: 78, column: 3)
!526 = !DILocation(line: 78, column: 3, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !276, line: 78, column: 3)
!528 = distinct !DILexicalBlock(scope: !525, file: !276, line: 78, column: 3)
!529 = !DILocation(line: 78, column: 3, scope: !528)
!530 = !DILocation(line: 78, column: 3, scope: !531)
!531 = distinct !DILexicalBlock(scope: !527, file: !276, line: 78, column: 3)
!532 = !DILocation(line: 79, column: 1, scope: !453)
!533 = !DISubprogram(name: "MPI_Comm_size", scope: !45, file: !45, line: 1331, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!534 = !DISubroutineType(types: !535)
!535 = !{!7, !55, !449}
!536 = !DISubprogram(name: "PetscOptionsGetEnum", scope: !28, file: !28, line: 22, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!537 = !DISubroutineType(types: !538)
!538 = !{!7, !245, !57, !57, !220, !539, !540}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!541 = distinct !DISubprogram(name: "PetscCommBuildTwoSided", scope: !276, file: !276, line: 280, type: !542, scopeLine: 281, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !548)
!542 = !DISubroutineType(types: !543)
!543 = !{!77, !54, !43, !44, !43, !544, !443, !546, !547, !48}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !562, !564, !566, !568, !571, !573, !575}
!549 = !DILocalVariable(name: "comm", arg: 1, scope: !541, file: !276, line: 280, type: !54)
!550 = !DILocalVariable(name: "count", arg: 2, scope: !541, file: !276, line: 280, type: !43)
!551 = !DILocalVariable(name: "dtype", arg: 3, scope: !541, file: !276, line: 280, type: !44)
!552 = !DILocalVariable(name: "nto", arg: 4, scope: !541, file: !276, line: 280, type: !43)
!553 = !DILocalVariable(name: "toranks", arg: 5, scope: !541, file: !276, line: 280, type: !544)
!554 = !DILocalVariable(name: "todata", arg: 6, scope: !541, file: !276, line: 280, type: !443)
!555 = !DILocalVariable(name: "nfrom", arg: 7, scope: !541, file: !276, line: 280, type: !546)
!556 = !DILocalVariable(name: "fromranks", arg: 8, scope: !541, file: !276, line: 280, type: !547)
!557 = !DILocalVariable(name: "fromdata", arg: 9, scope: !541, file: !276, line: 280, type: !48)
!558 = !DILocalVariable(name: "ierr", scope: !541, file: !276, line: 282, type: !77)
!559 = !DILocalVariable(name: "buildtype", scope: !541, file: !276, line: 283, type: !283)
!560 = !DILocalVariable(name: "ierr__", scope: !561, file: !276, line: 286, type: !77)
!561 = distinct !DILexicalBlock(scope: !541, file: !276, line: 286, column: 38)
!562 = !DILocalVariable(name: "ierr__", scope: !563, file: !276, line: 287, type: !77)
!563 = distinct !DILexicalBlock(scope: !541, file: !276, line: 287, column: 54)
!564 = !DILocalVariable(name: "ierr__", scope: !565, file: !276, line: 288, type: !77)
!565 = distinct !DILexicalBlock(scope: !541, file: !276, line: 288, column: 58)
!566 = !DILocalVariable(name: "ierr__", scope: !567, file: !276, line: 289, type: !77)
!567 = distinct !DILexicalBlock(scope: !541, file: !276, line: 289, column: 57)
!568 = !DILocalVariable(name: "ierr__", scope: !569, file: !276, line: 293, type: !77)
!569 = distinct !DILexicalBlock(scope: !570, file: !276, line: 293, column: 106)
!570 = distinct !DILexicalBlock(scope: !541, file: !276, line: 290, column: 22)
!571 = !DILocalVariable(name: "ierr__", scope: !572, file: !276, line: 299, type: !77)
!572 = distinct !DILexicalBlock(scope: !570, file: !276, line: 299, column: 107)
!573 = !DILocalVariable(name: "ierr__", scope: !574, file: !276, line: 303, type: !77)
!574 = distinct !DILexicalBlock(scope: !570, file: !276, line: 303, column: 108)
!575 = !DILocalVariable(name: "ierr__", scope: !576, file: !276, line: 310, type: !77)
!576 = distinct !DILexicalBlock(scope: !541, file: !276, line: 310, column: 56)
!577 = !DILocation(line: 0, scope: !541)
!578 = !DILocation(line: 283, column: 3, scope: !541)
!579 = !DILocation(line: 283, column: 26, scope: !541)
!580 = !DILocation(line: 285, column: 3, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !276, line: 285, column: 3)
!582 = distinct !DILexicalBlock(scope: !583, file: !276, line: 285, column: 3)
!583 = distinct !DILexicalBlock(scope: !541, file: !276, line: 285, column: 3)
!584 = !DILocation(line: 285, column: 3, scope: !582)
!585 = !DILocation(line: 285, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !276, line: 285, column: 3)
!587 = distinct !DILexicalBlock(scope: !581, file: !276, line: 285, column: 3)
!588 = !DILocation(line: 285, column: 3, scope: !587)
!589 = !DILocation(line: 285, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !586, file: !276, line: 285, column: 3)
!591 = !DILocation(line: 286, column: 10, scope: !541)
!592 = !DILocation(line: 0, scope: !561)
!593 = !DILocation(line: 286, column: 38, scope: !594)
!594 = distinct !DILexicalBlock(scope: !561, file: !276, line: 286, column: 38)
!595 = !DILocation(line: 286, column: 38, scope: !561)
!596 = !DILocation(line: 287, column: 10, scope: !541)
!597 = !{!598, !337, i64 24}
!598 = !{!"_n_PetscStageLog", !346, i64 0, !346, i64 4, !337, i64 8, !346, i64 16, !337, i64 24, !337, i64 32, !337, i64 40}
!599 = !{!598, !346, i64 16}
!600 = !{!601, !338, i64 20}
!601 = !{!"_PetscStageInfo", !337, i64 0, !338, i64 8, !602, i64 16, !337, i64 280, !337, i64 288}
!602 = !{!"", !346, i64 0, !338, i64 4, !338, i64 8, !346, i64 12, !346, i64 16, !376, i64 24, !376, i64 32, !376, i64 40, !376, i64 48, !376, i64 56, !376, i64 64, !376, i64 72, !338, i64 80, !338, i64 144, !376, i64 208, !376, i64 216, !376, i64 224, !376, i64 232, !376, i64 240, !376, i64 248, !376, i64 256}
!603 = !{!601, !337, i64 280}
!604 = !{!605, !337, i64 8}
!605 = !{!"_n_PetscEventPerfLog", !346, i64 0, !346, i64 4, !337, i64 8}
!606 = !{!602, !338, i64 4}
!607 = !DILocation(line: 0, scope: !563)
!608 = !DILocation(line: 287, column: 54, scope: !609)
!609 = distinct !DILexicalBlock(scope: !563, file: !276, line: 287, column: 54)
!610 = !DILocation(line: 287, column: 54, scope: !563)
!611 = !DILocation(line: 288, column: 10, scope: !541)
!612 = !DILocation(line: 0, scope: !565)
!613 = !DILocation(line: 288, column: 58, scope: !614)
!614 = distinct !DILexicalBlock(scope: !565, file: !276, line: 288, column: 58)
!615 = !DILocation(line: 288, column: 58, scope: !565)
!616 = !DILocation(line: 289, column: 10, scope: !541)
!617 = !DILocation(line: 0, scope: !567)
!618 = !DILocation(line: 289, column: 57, scope: !619)
!619 = distinct !DILexicalBlock(scope: !567, file: !276, line: 289, column: 57)
!620 = !DILocation(line: 289, column: 57, scope: !567)
!621 = !DILocation(line: 290, column: 11, scope: !541)
!622 = !DILocation(line: 290, column: 3, scope: !541)
!623 = !DILocation(line: 293, column: 12, scope: !570)
!624 = !DILocation(line: 0, scope: !569)
!625 = !DILocation(line: 293, column: 106, scope: !626)
!626 = distinct !DILexicalBlock(scope: !569, file: !276, line: 293, column: 106)
!627 = !DILocation(line: 293, column: 106, scope: !569)
!628 = !DILocation(line: 299, column: 12, scope: !570)
!629 = !DILocation(line: 0, scope: !572)
!630 = !DILocation(line: 299, column: 107, scope: !631)
!631 = distinct !DILexicalBlock(scope: !572, file: !276, line: 299, column: 107)
!632 = !DILocation(line: 299, column: 107, scope: !572)
!633 = !DILocation(line: 303, column: 12, scope: !570)
!634 = !DILocation(line: 0, scope: !574)
!635 = !DILocation(line: 303, column: 108, scope: !636)
!636 = distinct !DILexicalBlock(scope: !574, file: !276, line: 303, column: 108)
!637 = !DILocation(line: 303, column: 108, scope: !574)
!638 = !DILocation(line: 308, column: 12, scope: !570)
!639 = !DILocation(line: 310, column: 10, scope: !541)
!640 = !DILocation(line: 0, scope: !576)
!641 = !DILocation(line: 310, column: 56, scope: !642)
!642 = distinct !DILexicalBlock(scope: !576, file: !276, line: 310, column: 56)
!643 = !DILocation(line: 310, column: 56, scope: !576)
!644 = !DILocation(line: 311, column: 3, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !276, line: 311, column: 3)
!646 = distinct !DILexicalBlock(scope: !647, file: !276, line: 311, column: 3)
!647 = distinct !DILexicalBlock(scope: !541, file: !276, line: 311, column: 3)
!648 = !DILocation(line: 311, column: 3, scope: !646)
!649 = !DILocation(line: 311, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !276, line: 311, column: 3)
!651 = distinct !DILexicalBlock(scope: !645, file: !276, line: 311, column: 3)
!652 = !DILocation(line: 311, column: 3, scope: !651)
!653 = !DILocation(line: 311, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !276, line: 311, column: 3)
!655 = distinct !DILexicalBlock(scope: !650, file: !276, line: 311, column: 3)
!656 = !DILocation(line: 311, column: 3, scope: !655)
!657 = !DILocation(line: 311, column: 3, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !276, line: 311, column: 3)
!659 = !DILocation(line: 311, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !650, file: !276, line: 311, column: 3)
!661 = !DILocation(line: 311, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !660, file: !276, line: 311, column: 3)
!663 = !DILocation(line: 311, column: 3, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !276, line: 311, column: 3)
!665 = distinct !DILexicalBlock(scope: !662, file: !276, line: 311, column: 3)
!666 = !DILocation(line: 311, column: 3, scope: !665)
!667 = !DILocation(line: 311, column: 3, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !276, line: 311, column: 3)
!669 = !DILocation(line: 312, column: 1, scope: !541)
!670 = !DISubprogram(name: "PetscSysInitializePackage", scope: !671, file: !671, line: 1437, type: !672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!671 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!672 = !DISubroutineType(types: !673)
!673 = !{!7}
!674 = !DISubprogram(name: "PetscLogEventSynchronize", scope: !278, file: !278, line: 424, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !445)
!675 = !DISubroutineType(types: !676)
!676 = !{!7, !7, !55}
!677 = distinct !DISubprogram(name: "PetscCommBuildTwoSided_Ibarrier", scope: !276, file: !276, line: 82, type: !542, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !696, !697, !698, !700, !701, !705, !706, !707, !709, !711, !714, !715, !717, !722, !725, !726, !728, !730, !734, !735, !737, !740, !741, !744, !745, !747, !749, !751, !754, !755, !758, !759, !761, !763, !766, !767, !771, !774, !775, !777, !780, !783, !784, !786, !788, !790, !792}
!679 = !DILocalVariable(name: "comm", arg: 1, scope: !677, file: !276, line: 82, type: !54)
!680 = !DILocalVariable(name: "count", arg: 2, scope: !677, file: !276, line: 82, type: !43)
!681 = !DILocalVariable(name: "dtype", arg: 3, scope: !677, file: !276, line: 82, type: !44)
!682 = !DILocalVariable(name: "nto", arg: 4, scope: !677, file: !276, line: 82, type: !43)
!683 = !DILocalVariable(name: "toranks", arg: 5, scope: !677, file: !276, line: 82, type: !544)
!684 = !DILocalVariable(name: "todata", arg: 6, scope: !677, file: !276, line: 82, type: !443)
!685 = !DILocalVariable(name: "nfrom", arg: 7, scope: !677, file: !276, line: 82, type: !546)
!686 = !DILocalVariable(name: "fromranks", arg: 8, scope: !677, file: !276, line: 82, type: !547)
!687 = !DILocalVariable(name: "fromdata", arg: 9, scope: !677, file: !276, line: 82, type: !48)
!688 = !DILocalVariable(name: "ierr", scope: !677, file: !276, line: 84, type: !77)
!689 = !DILocalVariable(name: "nrecvs", scope: !677, file: !276, line: 85, type: !43)
!690 = !DILocalVariable(name: "tag", scope: !677, file: !276, line: 85, type: !43)
!691 = !DILocalVariable(name: "done", scope: !677, file: !276, line: 85, type: !43)
!692 = !DILocalVariable(name: "i", scope: !677, file: !276, line: 85, type: !43)
!693 = !DILocalVariable(name: "lb", scope: !677, file: !276, line: 86, type: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Aint", file: !45, line: 327, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !226, line: 35, baseType: !130)
!696 = !DILocalVariable(name: "unitbytes", scope: !677, file: !276, line: 86, type: !694)
!697 = !DILocalVariable(name: "tdata", scope: !677, file: !276, line: 87, type: !52)
!698 = !DILocalVariable(name: "sendreqs", scope: !677, file: !276, line: 88, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!700 = !DILocalVariable(name: "barrier", scope: !677, file: !276, line: 88, type: !268)
!701 = !DILocalVariable(name: "segrank", scope: !677, file: !276, line: 89, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!705 = !DILocalVariable(name: "segdata", scope: !677, file: !276, line: 89, type: !702)
!706 = !DILocalVariable(name: "barrier_started", scope: !677, file: !276, line: 90, type: !229)
!707 = !DILocalVariable(name: "ierr__", scope: !708, file: !276, line: 93, type: !77)
!708 = distinct !DILexicalBlock(scope: !677, file: !276, line: 93, column: 46)
!709 = !DILocalVariable(name: "_7_errorcode", scope: !710, file: !276, line: 94, type: !77)
!710 = distinct !DILexicalBlock(scope: !677, file: !276, line: 94, column: 52)
!711 = !DILocalVariable(name: "_7_errorstring", scope: !712, file: !276, line: 94, type: !315)
!712 = distinct !DILexicalBlock(scope: !713, file: !276, line: 94, column: 52)
!713 = distinct !DILexicalBlock(scope: !710, file: !276, line: 94, column: 52)
!714 = !DILocalVariable(name: "_7_resultlen", scope: !712, file: !276, line: 94, type: !43)
!715 = !DILocalVariable(name: "ierr__", scope: !716, file: !276, line: 97, type: !77)
!716 = distinct !DILexicalBlock(scope: !677, file: !276, line: 97, column: 39)
!717 = !DILocalVariable(name: "_7_errorcode", scope: !718, file: !276, line: 99, type: !77)
!718 = distinct !DILexicalBlock(scope: !719, file: !276, line: 99, column: 100)
!719 = distinct !DILexicalBlock(scope: !720, file: !276, line: 98, column: 25)
!720 = distinct !DILexicalBlock(scope: !721, file: !276, line: 98, column: 3)
!721 = distinct !DILexicalBlock(scope: !677, file: !276, line: 98, column: 3)
!722 = !DILocalVariable(name: "_7_errorstring", scope: !723, file: !276, line: 99, type: !315)
!723 = distinct !DILexicalBlock(scope: !724, file: !276, line: 99, column: 100)
!724 = distinct !DILexicalBlock(scope: !718, file: !276, line: 99, column: 100)
!725 = !DILocalVariable(name: "_7_resultlen", scope: !723, file: !276, line: 99, type: !43)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !276, line: 101, type: !77)
!727 = distinct !DILexicalBlock(scope: !677, file: !276, line: 101, column: 63)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !276, line: 102, type: !77)
!729 = distinct !DILexicalBlock(scope: !677, file: !276, line: 102, column: 59)
!730 = !DILocalVariable(name: "flag", scope: !731, file: !276, line: 110, type: !43)
!731 = distinct !DILexicalBlock(scope: !732, file: !276, line: 109, column: 24)
!732 = distinct !DILexicalBlock(scope: !733, file: !276, line: 109, column: 3)
!733 = distinct !DILexicalBlock(scope: !677, file: !276, line: 109, column: 3)
!734 = !DILocalVariable(name: "status", scope: !731, file: !276, line: 111, type: !260)
!735 = !DILocalVariable(name: "_7_errorcode", scope: !736, file: !276, line: 112, type: !77)
!736 = distinct !DILexicalBlock(scope: !731, file: !276, line: 112, column: 62)
!737 = !DILocalVariable(name: "_7_errorstring", scope: !738, file: !276, line: 112, type: !315)
!738 = distinct !DILexicalBlock(scope: !739, file: !276, line: 112, column: 62)
!739 = distinct !DILexicalBlock(scope: !736, file: !276, line: 112, column: 62)
!740 = !DILocalVariable(name: "_7_resultlen", scope: !738, file: !276, line: 112, type: !43)
!741 = !DILocalVariable(name: "recvrank", scope: !742, file: !276, line: 114, type: !546)
!742 = distinct !DILexicalBlock(scope: !743, file: !276, line: 113, column: 15)
!743 = distinct !DILexicalBlock(scope: !731, file: !276, line: 113, column: 9)
!744 = !DILocalVariable(name: "buf", scope: !742, file: !276, line: 115, type: !48)
!745 = !DILocalVariable(name: "ierr__", scope: !746, file: !276, line: 116, type: !77)
!746 = distinct !DILexicalBlock(scope: !742, file: !276, line: 116, column: 58)
!747 = !DILocalVariable(name: "ierr__", scope: !748, file: !276, line: 117, type: !77)
!748 = distinct !DILexicalBlock(scope: !742, file: !276, line: 117, column: 57)
!749 = !DILocalVariable(name: "_7_errorcode", scope: !750, file: !276, line: 119, type: !77)
!750 = distinct !DILexicalBlock(scope: !742, file: !276, line: 119, column: 90)
!751 = !DILocalVariable(name: "_7_errorstring", scope: !752, file: !276, line: 119, type: !315)
!752 = distinct !DILexicalBlock(scope: !753, file: !276, line: 119, column: 90)
!753 = distinct !DILexicalBlock(scope: !750, file: !276, line: 119, column: 90)
!754 = !DILocalVariable(name: "_7_resultlen", scope: !752, file: !276, line: 119, type: !43)
!755 = !DILocalVariable(name: "sent", scope: !756, file: !276, line: 123, type: !43)
!756 = distinct !DILexicalBlock(scope: !757, file: !276, line: 122, column: 27)
!757 = distinct !DILexicalBlock(scope: !731, file: !276, line: 122, column: 9)
!758 = !DILocalVariable(name: "nsends", scope: !756, file: !276, line: 123, type: !43)
!759 = !DILocalVariable(name: "ierr__", scope: !760, file: !276, line: 124, type: !77)
!760 = distinct !DILexicalBlock(scope: !756, file: !276, line: 124, column: 43)
!761 = !DILocalVariable(name: "_7_errorcode", scope: !762, file: !276, line: 125, type: !77)
!762 = distinct !DILexicalBlock(scope: !756, file: !276, line: 125, column: 69)
!763 = !DILocalVariable(name: "_7_errorstring", scope: !764, file: !276, line: 125, type: !315)
!764 = distinct !DILexicalBlock(scope: !765, file: !276, line: 125, column: 69)
!765 = distinct !DILexicalBlock(scope: !762, file: !276, line: 125, column: 69)
!766 = !DILocalVariable(name: "_7_resultlen", scope: !764, file: !276, line: 125, type: !43)
!767 = !DILocalVariable(name: "_7_errorcode", scope: !768, file: !276, line: 127, type: !77)
!768 = distinct !DILexicalBlock(scope: !769, file: !276, line: 127, column: 44)
!769 = distinct !DILexicalBlock(scope: !770, file: !276, line: 126, column: 17)
!770 = distinct !DILexicalBlock(scope: !756, file: !276, line: 126, column: 11)
!771 = !DILocalVariable(name: "_7_errorstring", scope: !772, file: !276, line: 127, type: !315)
!772 = distinct !DILexicalBlock(scope: !773, file: !276, line: 127, column: 44)
!773 = distinct !DILexicalBlock(scope: !768, file: !276, line: 127, column: 44)
!774 = !DILocalVariable(name: "_7_resultlen", scope: !772, file: !276, line: 127, type: !43)
!775 = !DILocalVariable(name: "ierr__", scope: !776, file: !276, line: 129, type: !77)
!776 = distinct !DILexicalBlock(scope: !769, file: !276, line: 129, column: 36)
!777 = !DILocalVariable(name: "_7_errorcode", scope: !778, file: !276, line: 132, type: !77)
!778 = distinct !DILexicalBlock(scope: !779, file: !276, line: 132, column: 57)
!779 = distinct !DILexicalBlock(scope: !757, file: !276, line: 131, column: 12)
!780 = !DILocalVariable(name: "_7_errorstring", scope: !781, file: !276, line: 132, type: !315)
!781 = distinct !DILexicalBlock(scope: !782, file: !276, line: 132, column: 57)
!782 = distinct !DILexicalBlock(scope: !778, file: !276, line: 132, column: 57)
!783 = !DILocalVariable(name: "_7_resultlen", scope: !781, file: !276, line: 132, type: !43)
!784 = !DILocalVariable(name: "ierr__", scope: !785, file: !276, line: 136, type: !77)
!785 = distinct !DILexicalBlock(scope: !677, file: !276, line: 136, column: 58)
!786 = !DILocalVariable(name: "ierr__", scope: !787, file: !276, line: 137, type: !77)
!787 = distinct !DILexicalBlock(scope: !677, file: !276, line: 137, column: 44)
!788 = !DILocalVariable(name: "ierr__", scope: !789, file: !276, line: 138, type: !77)
!789 = distinct !DILexicalBlock(scope: !677, file: !276, line: 138, column: 57)
!790 = !DILocalVariable(name: "ierr__", scope: !791, file: !276, line: 139, type: !77)
!791 = distinct !DILexicalBlock(scope: !677, file: !276, line: 139, column: 44)
!792 = !DILocalVariable(name: "ierr__", scope: !793, file: !276, line: 140, type: !77)
!793 = distinct !DILexicalBlock(scope: !677, file: !276, line: 140, column: 36)
!794 = !DILocation(line: 0, scope: !677)
!795 = !DILocation(line: 85, column: 3, scope: !677)
!796 = !DILocation(line: 86, column: 3, scope: !677)
!797 = !DILocation(line: 88, column: 3, scope: !677)
!798 = !DILocation(line: 89, column: 3, scope: !677)
!799 = !DILocation(line: 92, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !801, file: !276, line: 92, column: 3)
!801 = distinct !DILexicalBlock(scope: !802, file: !276, line: 92, column: 3)
!802 = distinct !DILexicalBlock(scope: !677, file: !276, line: 92, column: 3)
!803 = !DILocation(line: 92, column: 3, scope: !801)
!804 = !DILocation(line: 92, column: 3, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !276, line: 92, column: 3)
!806 = distinct !DILexicalBlock(scope: !800, file: !276, line: 92, column: 3)
!807 = !DILocation(line: 92, column: 3, scope: !806)
!808 = !DILocation(line: 92, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !805, file: !276, line: 92, column: 3)
!810 = !DILocation(line: 93, column: 29, scope: !677)
!811 = !DILocation(line: 93, column: 10, scope: !677)
!812 = !DILocation(line: 0, scope: !708)
!813 = !DILocation(line: 93, column: 46, scope: !814)
!814 = distinct !DILexicalBlock(scope: !708, file: !276, line: 93, column: 46)
!815 = !DILocation(line: 93, column: 46, scope: !708)
!816 = !DILocation(line: 94, column: 10, scope: !677)
!817 = !DILocation(line: 0, scope: !710)
!818 = !DILocation(line: 94, column: 52, scope: !713)
!819 = !DILocation(line: 94, column: 52, scope: !710)
!820 = !DILocation(line: 94, column: 52, scope: !712)
!821 = !DILocation(line: 0, scope: !712)
!822 = !DILocation(line: 95, column: 7, scope: !823)
!823 = distinct !DILexicalBlock(scope: !677, file: !276, line: 95, column: 7)
!824 = !{!825, !825, i64 0}
!825 = !{!"long", !338, i64 0}
!826 = !DILocation(line: 95, column: 10, scope: !823)
!827 = !DILocation(line: 95, column: 7, scope: !677)
!828 = !DILocation(line: 95, column: 16, scope: !823)
!829 = !DILocation(line: 97, column: 11, scope: !677)
!830 = !DILocation(line: 0, scope: !716)
!831 = !DILocation(line: 97, column: 39, scope: !832)
!832 = distinct !DILexicalBlock(scope: !716, file: !276, line: 97, column: 39)
!833 = !DILocation(line: 97, column: 39, scope: !716)
!834 = !DILocation(line: 98, column: 14, scope: !720)
!835 = !DILocation(line: 98, column: 3, scope: !721)
!836 = distinct !{!836, !835, !837, !838}
!837 = !DILocation(line: 100, column: 3, scope: !721)
!838 = !{!"llvm.loop.mustprogress"}
!839 = !DILocation(line: 99, column: 43, scope: !719)
!840 = !DILocation(line: 99, column: 42, scope: !719)
!841 = !DILocation(line: 99, column: 52, scope: !719)
!842 = !DILocation(line: 99, column: 36, scope: !719)
!843 = !DILocation(line: 99, column: 68, scope: !719)
!844 = !DILocation(line: 99, column: 79, scope: !719)
!845 = !DILocation(line: 99, column: 83, scope: !719)
!846 = !DILocation(line: 99, column: 88, scope: !719)
!847 = !DILocation(line: 99, column: 96, scope: !719)
!848 = !DILocation(line: 99, column: 12, scope: !719)
!849 = !DILocation(line: 0, scope: !718)
!850 = !DILocation(line: 99, column: 100, scope: !724)
!851 = !DILocation(line: 98, column: 21, scope: !720)
!852 = !DILocation(line: 99, column: 100, scope: !718)
!853 = !DILocation(line: 99, column: 100, scope: !723)
!854 = !DILocation(line: 0, scope: !723)
!855 = !DILocation(line: 101, column: 10, scope: !677)
!856 = !DILocation(line: 0, scope: !727)
!857 = !DILocation(line: 101, column: 63, scope: !858)
!858 = distinct !DILexicalBlock(scope: !727, file: !276, line: 101, column: 63)
!859 = !DILocation(line: 101, column: 63, scope: !727)
!860 = !DILocation(line: 102, column: 31, scope: !677)
!861 = !DILocation(line: 102, column: 42, scope: !677)
!862 = !DILocation(line: 102, column: 41, scope: !677)
!863 = !DILocation(line: 102, column: 10, scope: !677)
!864 = !DILocation(line: 0, scope: !729)
!865 = !DILocation(line: 102, column: 59, scope: !866)
!866 = distinct !DILexicalBlock(scope: !729, file: !276, line: 102, column: 59)
!867 = !DILocation(line: 102, column: 59, scope: !729)
!868 = !DILocation(line: 105, column: 11, scope: !677)
!869 = !DILocation(line: 109, column: 12, scope: !733)
!870 = !DILocation(line: 109, column: 3, scope: !733)
!871 = !DILocation(line: 134, column: 3, scope: !732)
!872 = !DILocation(line: 109, column: 17, scope: !732)
!873 = !DILocation(line: 109, column: 16, scope: !732)
!874 = !DILocation(line: 110, column: 5, scope: !731)
!875 = !DILocation(line: 111, column: 5, scope: !731)
!876 = !DILocation(line: 111, column: 17, scope: !731)
!877 = !DILocation(line: 112, column: 38, scope: !731)
!878 = !DILocation(line: 112, column: 42, scope: !731)
!879 = !DILocation(line: 0, scope: !731)
!880 = !DILocation(line: 112, column: 12, scope: !731)
!881 = !DILocation(line: 0, scope: !736)
!882 = !DILocation(line: 112, column: 62, scope: !739)
!883 = !DILocation(line: 112, column: 62, scope: !736)
!884 = !DILocation(line: 112, column: 62, scope: !738)
!885 = !DILocation(line: 0, scope: !738)
!886 = !DILocation(line: 113, column: 9, scope: !743)
!887 = !DILocation(line: 113, column: 9, scope: !731)
!888 = !DILocation(line: 114, column: 7, scope: !742)
!889 = !DILocation(line: 115, column: 7, scope: !742)
!890 = !DILocation(line: 116, column: 37, scope: !742)
!891 = !DILocation(line: 0, scope: !742)
!892 = !DILocation(line: 116, column: 19, scope: !742)
!893 = !DILocation(line: 0, scope: !746)
!894 = !DILocation(line: 116, column: 58, scope: !895)
!895 = distinct !DILexicalBlock(scope: !746, file: !276, line: 116, column: 58)
!896 = !DILocation(line: 116, column: 58, scope: !746)
!897 = !DILocation(line: 117, column: 37, scope: !742)
!898 = !DILocation(line: 117, column: 19, scope: !742)
!899 = !DILocation(line: 0, scope: !748)
!900 = !DILocation(line: 117, column: 57, scope: !901)
!901 = distinct !DILexicalBlock(scope: !748, file: !276, line: 117, column: 57)
!902 = !DILocation(line: 117, column: 57, scope: !748)
!903 = !DILocation(line: 118, column: 26, scope: !742)
!904 = !{!905, !346, i64 0}
!905 = !{!"ompi_status_public_t", !346, i64 0, !346, i64 4, !346, i64 8, !346, i64 12, !825, i64 16}
!906 = !DILocation(line: 118, column: 8, scope: !742)
!907 = !DILocation(line: 118, column: 17, scope: !742)
!908 = !DILocation(line: 119, column: 19, scope: !742)
!909 = !{!"branch_weights", i32 2146410443, i32 1073205}
!910 = !DILocation(line: 0, scope: !750)
!911 = !DILocation(line: 119, column: 90, scope: !750)
!912 = !DILocation(line: 121, column: 5, scope: !743)
!913 = !DILocation(line: 122, column: 10, scope: !757)
!914 = !DILocation(line: 122, column: 9, scope: !731)
!915 = !DILocation(line: 123, column: 7, scope: !756)
!916 = !DILocation(line: 0, scope: !756)
!917 = !DILocation(line: 124, column: 14, scope: !756)
!918 = !DILocation(line: 125, column: 26, scope: !756)
!919 = !DILocation(line: 125, column: 33, scope: !756)
!920 = !DILocation(line: 125, column: 14, scope: !756)
!921 = !DILocation(line: 0, scope: !762)
!922 = !DILocation(line: 125, column: 69, scope: !765)
!923 = !DILocation(line: 125, column: 69, scope: !762)
!924 = !DILocation(line: 125, column: 69, scope: !764)
!925 = !DILocation(line: 0, scope: !764)
!926 = !DILocation(line: 126, column: 11, scope: !770)
!927 = !DILocation(line: 126, column: 11, scope: !756)
!928 = !DILocation(line: 127, column: 29, scope: !769)
!929 = !DILocation(line: 127, column: 16, scope: !769)
!930 = !DILocation(line: 0, scope: !768)
!931 = !DILocation(line: 127, column: 44, scope: !773)
!932 = !DILocation(line: 127, column: 44, scope: !768)
!933 = !DILocation(line: 127, column: 44, scope: !772)
!934 = !DILocation(line: 0, scope: !772)
!935 = !DILocation(line: 129, column: 16, scope: !769)
!936 = !DILocation(line: 0, scope: !776)
!937 = !DILocation(line: 129, column: 36, scope: !938)
!938 = distinct !DILexicalBlock(scope: !776, file: !276, line: 129, column: 36)
!939 = !DILocation(line: 131, column: 5, scope: !757)
!940 = !DILocation(line: 132, column: 14, scope: !779)
!941 = !DILocation(line: 0, scope: !778)
!942 = !DILocation(line: 132, column: 57, scope: !782)
!943 = !DILocation(line: 132, column: 57, scope: !778)
!944 = !DILocation(line: 132, column: 57, scope: !781)
!945 = !DILocation(line: 0, scope: !781)
!946 = !DILocation(line: 119, column: 90, scope: !752)
!947 = !DILocation(line: 0, scope: !752)
!948 = !DILocation(line: 119, column: 90, scope: !753)
!949 = !DILocation(line: 135, column: 10, scope: !677)
!950 = !DILocation(line: 136, column: 39, scope: !677)
!951 = !DILocation(line: 136, column: 47, scope: !677)
!952 = !DILocation(line: 136, column: 12, scope: !677)
!953 = !DILocation(line: 0, scope: !785)
!954 = !DILocation(line: 136, column: 58, scope: !955)
!955 = distinct !DILexicalBlock(scope: !785, file: !276, line: 136, column: 58)
!956 = !DILocation(line: 136, column: 58, scope: !785)
!957 = !DILocation(line: 137, column: 12, scope: !677)
!958 = !DILocation(line: 0, scope: !787)
!959 = !DILocation(line: 137, column: 44, scope: !960)
!960 = distinct !DILexicalBlock(scope: !787, file: !276, line: 137, column: 44)
!961 = !DILocation(line: 137, column: 44, scope: !787)
!962 = !DILocation(line: 138, column: 39, scope: !677)
!963 = !DILocation(line: 138, column: 12, scope: !677)
!964 = !DILocation(line: 0, scope: !789)
!965 = !DILocation(line: 138, column: 57, scope: !966)
!966 = distinct !DILexicalBlock(scope: !789, file: !276, line: 138, column: 57)
!967 = !DILocation(line: 138, column: 57, scope: !789)
!968 = !DILocation(line: 139, column: 12, scope: !677)
!969 = !DILocation(line: 0, scope: !791)
!970 = !DILocation(line: 139, column: 44, scope: !971)
!971 = distinct !DILexicalBlock(scope: !791, file: !276, line: 139, column: 44)
!972 = !DILocation(line: 139, column: 44, scope: !791)
!973 = !DILocation(line: 140, column: 12, scope: !677)
!974 = !DILocation(line: 0, scope: !793)
!975 = !DILocation(line: 140, column: 36, scope: !976)
!976 = distinct !DILexicalBlock(scope: !793, file: !276, line: 140, column: 36)
!977 = !DILocation(line: 140, column: 36, scope: !793)
!978 = !DILocation(line: 141, column: 3, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !276, line: 141, column: 3)
!980 = distinct !DILexicalBlock(scope: !981, file: !276, line: 141, column: 3)
!981 = distinct !DILexicalBlock(scope: !677, file: !276, line: 141, column: 3)
!982 = !DILocation(line: 141, column: 3, scope: !980)
!983 = !DILocation(line: 141, column: 3, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !276, line: 141, column: 3)
!985 = distinct !DILexicalBlock(scope: !979, file: !276, line: 141, column: 3)
!986 = !DILocation(line: 141, column: 3, scope: !985)
!987 = !DILocation(line: 141, column: 3, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !276, line: 141, column: 3)
!989 = distinct !DILexicalBlock(scope: !984, file: !276, line: 141, column: 3)
!990 = !DILocation(line: 141, column: 3, scope: !989)
!991 = !DILocation(line: 141, column: 3, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !276, line: 141, column: 3)
!993 = !DILocation(line: 141, column: 3, scope: !994)
!994 = distinct !DILexicalBlock(scope: !984, file: !276, line: 141, column: 3)
!995 = !DILocation(line: 141, column: 3, scope: !996)
!996 = distinct !DILexicalBlock(scope: !994, file: !276, line: 141, column: 3)
!997 = !DILocation(line: 141, column: 3, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !276, line: 141, column: 3)
!999 = distinct !DILexicalBlock(scope: !996, file: !276, line: 141, column: 3)
!1000 = !DILocation(line: 141, column: 3, scope: !999)
!1001 = !DILocation(line: 141, column: 3, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !998, file: !276, line: 141, column: 3)
!1003 = !DILocation(line: 142, column: 1, scope: !677)
!1004 = distinct !DISubprogram(name: "PetscCommBuildTwoSided_Allreduce", scope: !276, file: !276, line: 145, type: !542, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1040, !1042, !1045, !1046, !1048, !1051, !1052, !1054, !1056, !1059, !1060, !1064, !1067, !1069, !1070, !1071, !1073, !1076, !1077, !1079, !1082, !1083, !1085, !1088, !1089, !1091, !1094, !1095, !1097, !1099, !1104, !1107, !1108, !1113, !1116, !1117, !1119, !1122, !1123, !1125, !1127}
!1006 = !DILocalVariable(name: "comm", arg: 1, scope: !1004, file: !276, line: 145, type: !54)
!1007 = !DILocalVariable(name: "count", arg: 2, scope: !1004, file: !276, line: 145, type: !43)
!1008 = !DILocalVariable(name: "dtype", arg: 3, scope: !1004, file: !276, line: 145, type: !44)
!1009 = !DILocalVariable(name: "nto", arg: 4, scope: !1004, file: !276, line: 145, type: !43)
!1010 = !DILocalVariable(name: "toranks", arg: 5, scope: !1004, file: !276, line: 145, type: !544)
!1011 = !DILocalVariable(name: "todata", arg: 6, scope: !1004, file: !276, line: 145, type: !443)
!1012 = !DILocalVariable(name: "nfrom", arg: 7, scope: !1004, file: !276, line: 145, type: !546)
!1013 = !DILocalVariable(name: "fromranks", arg: 8, scope: !1004, file: !276, line: 145, type: !547)
!1014 = !DILocalVariable(name: "fromdata", arg: 9, scope: !1004, file: !276, line: 145, type: !48)
!1015 = !DILocalVariable(name: "ierr", scope: !1004, file: !276, line: 147, type: !77)
!1016 = !DILocalVariable(name: "size", scope: !1004, file: !276, line: 148, type: !43)
!1017 = !DILocalVariable(name: "rank", scope: !1004, file: !276, line: 148, type: !43)
!1018 = !DILocalVariable(name: "iflags", scope: !1004, file: !276, line: 148, type: !546)
!1019 = !DILocalVariable(name: "nrecvs", scope: !1004, file: !276, line: 148, type: !43)
!1020 = !DILocalVariable(name: "tag", scope: !1004, file: !276, line: 148, type: !43)
!1021 = !DILocalVariable(name: "franks", scope: !1004, file: !276, line: 148, type: !546)
!1022 = !DILocalVariable(name: "i", scope: !1004, file: !276, line: 148, type: !43)
!1023 = !DILocalVariable(name: "flg", scope: !1004, file: !276, line: 148, type: !43)
!1024 = !DILocalVariable(name: "lb", scope: !1004, file: !276, line: 149, type: !694)
!1025 = !DILocalVariable(name: "unitbytes", scope: !1004, file: !276, line: 149, type: !694)
!1026 = !DILocalVariable(name: "tdata", scope: !1004, file: !276, line: 150, type: !52)
!1027 = !DILocalVariable(name: "fdata", scope: !1004, file: !276, line: 150, type: !52)
!1028 = !DILocalVariable(name: "reqs", scope: !1004, file: !276, line: 151, type: !699)
!1029 = !DILocalVariable(name: "sendreqs", scope: !1004, file: !276, line: 151, type: !699)
!1030 = !DILocalVariable(name: "statuses", scope: !1004, file: !276, line: 152, type: !259)
!1031 = !DILocalVariable(name: "counter", scope: !1004, file: !276, line: 153, type: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCommCounter", file: !64, line: 869, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 864, size: 192, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1034, file: !64, line: 865, baseType: !43, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1034, file: !64, line: 866, baseType: !116, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "namecount", scope: !1034, file: !64, line: 867, baseType: !116, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !1034, file: !64, line: 868, baseType: !546, size: 64, offset: 128)
!1040 = !DILocalVariable(name: "_7_errorcode", scope: !1041, file: !276, line: 156, type: !77)
!1041 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 156, column: 36)
!1042 = !DILocalVariable(name: "_7_errorstring", scope: !1043, file: !276, line: 156, type: !315)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !276, line: 156, column: 36)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !276, line: 156, column: 36)
!1045 = !DILocalVariable(name: "_7_resultlen", scope: !1043, file: !276, line: 156, type: !43)
!1046 = !DILocalVariable(name: "_7_errorcode", scope: !1047, file: !276, line: 157, type: !77)
!1047 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 157, column: 36)
!1048 = !DILocalVariable(name: "_7_errorstring", scope: !1049, file: !276, line: 157, type: !315)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !276, line: 157, column: 36)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !276, line: 157, column: 36)
!1051 = !DILocalVariable(name: "_7_resultlen", scope: !1049, file: !276, line: 157, type: !43)
!1052 = !DILocalVariable(name: "ierr__", scope: !1053, file: !276, line: 158, type: !77)
!1053 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 158, column: 46)
!1054 = !DILocalVariable(name: "_7_errorcode", scope: !1055, file: !276, line: 159, type: !77)
!1055 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 159, column: 69)
!1056 = !DILocalVariable(name: "_7_errorstring", scope: !1057, file: !276, line: 159, type: !315)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !276, line: 159, column: 69)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !276, line: 159, column: 69)
!1059 = !DILocalVariable(name: "_7_resultlen", scope: !1057, file: !276, line: 159, type: !43)
!1060 = !DILocalVariable(name: "ierr__", scope: !1061, file: !276, line: 162, type: !77)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !276, line: 162, column: 50)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !276, line: 161, column: 25)
!1063 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 161, column: 7)
!1064 = !DILocalVariable(name: "ierr__", scope: !1065, file: !276, line: 166, type: !77)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !276, line: 166, column: 42)
!1066 = distinct !DILexicalBlock(scope: !1063, file: !276, line: 164, column: 10)
!1067 = !DILocalVariable(name: "_4_ierr", scope: !1068, file: !276, line: 169, type: !77)
!1068 = distinct !DILexicalBlock(scope: !1004, file: !276, line: 169, column: 14)
!1069 = !DILocalVariable(name: "a_b1", scope: !1068, file: !276, line: 169, type: !308)
!1070 = !DILocalVariable(name: "a_b2", scope: !1068, file: !276, line: 169, type: !308)
!1071 = !DILocalVariable(name: "_7_errorcode", scope: !1072, file: !276, line: 169, type: !77)
!1072 = distinct !DILexicalBlock(scope: !1068, file: !276, line: 169, column: 14)
!1073 = !DILocalVariable(name: "_7_errorstring", scope: !1074, file: !276, line: 169, type: !315)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !276, line: 169, column: 14)
!1075 = distinct !DILexicalBlock(scope: !1072, file: !276, line: 169, column: 14)
!1076 = !DILocalVariable(name: "_7_resultlen", scope: !1074, file: !276, line: 169, type: !43)
!1077 = !DILocalVariable(name: "_7_errorcode", scope: !1078, file: !276, line: 169, type: !77)
!1078 = distinct !DILexicalBlock(scope: !1068, file: !276, line: 169, column: 14)
!1079 = !DILocalVariable(name: "_7_errorstring", scope: !1080, file: !276, line: 169, type: !315)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !276, line: 169, column: 14)
!1081 = distinct !DILexicalBlock(scope: !1078, file: !276, line: 169, column: 14)
!1082 = !DILocalVariable(name: "_7_resultlen", scope: !1080, file: !276, line: 169, type: !43)
!1083 = !DILocalVariable(name: "_7_errorcode", scope: !1084, file: !276, line: 169, type: !77)
