; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/impls/memory/trajmemory.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/impls/memory/trajmemory.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 481, baseType: !40, size: 32, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!153 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!154 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!155 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!156 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!157 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!160 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!166 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!167 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!168 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!170 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!171 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!172 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!173 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!174 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!175 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!176 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!178 = !{!179, !182, !186, !187, !222, !387, !245}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 46, baseType: !181)
!180 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!181 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !183, line: 330, baseType: !184)
!183 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !183, line: 330, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !190, line: 73, size: 4480, elements: !191)
!190 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!191 = !{!192, !194, !243, !244, !246, !249, !250, !251, !252, !260, !261, !263, !267, !271, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !284, !285, !286, !288, !289, !291, !293, !294, !295, !296, !297, !300, !302, !303, !304, !305, !306, !309, !311, !312, !313, !323, !325, !326, !330, !331, !377, !382, !384, !385, !386}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !189, file: !190, line: 74, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !189, file: !190, line: 75, baseType: !195, size: 448, offset: 64)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 448, elements: !241)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !190, line: 53, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 45, size: 448, elements: !198)
!198 = !{!199, !205, !213, !218, !225, !229, !236}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !197, file: !190, line: 46, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !187, !204}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !197, file: !190, line: 47, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!203, !187, !209}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !210, line: 16, baseType: !211)
!210 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !210, line: 16, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !197, file: !190, line: 48, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!203, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !197, file: !190, line: 49, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!203, !187, !222, !187}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !197, file: !190, line: 50, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!203, !187, !222, !217}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !197, file: !190, line: 51, baseType: !230, size: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!203, !187, !222, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !197, file: !190, line: 52, baseType: !237, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!203, !187, !222, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!241 = !{!242}
!242 = !DISubrange(count: 1)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !189, file: !190, line: 76, baseType: !182, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !190, line: 77, baseType: !245, size: 32, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !189, file: !190, line: 78, baseType: !247, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !248)
!248 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !189, file: !190, line: 78, baseType: !247, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !189, file: !190, line: 78, baseType: !247, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !189, file: !190, line: 78, baseType: !247, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !190, line: 79, baseType: !253, size: 64, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !256, line: 27, baseType: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !258, line: 43, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!259 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !189, file: !190, line: 80, baseType: !245, size: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !189, file: !190, line: 81, baseType: !262, size: 32, offset: 992)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !189, file: !190, line: 82, baseType: !264, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !189, file: !190, line: 83, baseType: !268, size: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !189, file: !190, line: 84, baseType: !272, size: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !189, file: !190, line: 85, baseType: !272, size: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !189, file: !190, line: 86, baseType: !272, size: 64, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !189, file: !190, line: 87, baseType: !272, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !189, file: !190, line: 88, baseType: !187, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !189, file: !190, line: 89, baseType: !253, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !190, line: 90, baseType: !272, size: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !189, file: !190, line: 91, baseType: !272, size: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !189, file: !190, line: 92, baseType: !245, size: 32, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !189, file: !190, line: 93, baseType: !186, size: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !189, file: !190, line: 94, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !254)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !189, file: !190, line: 95, baseType: !245, size: 32, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !189, file: !190, line: 95, baseType: !245, size: 32, offset: 1888)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !189, file: !190, line: 96, baseType: !287, size: 64, offset: 1920)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !189, file: !190, line: 96, baseType: !287, size: 64, offset: 1984)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !189, file: !190, line: 97, baseType: !290, size: 64, offset: 2048)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !189, file: !190, line: 97, baseType: !292, size: 64, offset: 2112)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !189, file: !190, line: 98, baseType: !245, size: 32, offset: 2176)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !189, file: !190, line: 98, baseType: !245, size: 32, offset: 2208)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !189, file: !190, line: 99, baseType: !287, size: 64, offset: 2240)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !189, file: !190, line: 99, baseType: !287, size: 64, offset: 2304)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !189, file: !190, line: 100, baseType: !298, size: 64, offset: 2368)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !248)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !189, file: !190, line: 100, baseType: !301, size: 64, offset: 2432)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !189, file: !190, line: 101, baseType: !245, size: 32, offset: 2496)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !189, file: !190, line: 101, baseType: !245, size: 32, offset: 2528)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !189, file: !190, line: 102, baseType: !287, size: 64, offset: 2560)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !189, file: !190, line: 102, baseType: !287, size: 64, offset: 2624)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !189, file: !190, line: 103, baseType: !307, size: 64, offset: 2688)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !299)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !189, file: !190, line: 103, baseType: !310, size: 64, offset: 2752)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !189, file: !190, line: 104, baseType: !240, size: 64, offset: 2816)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !189, file: !190, line: 105, baseType: !245, size: 32, offset: 2880)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !189, file: !190, line: 106, baseType: !314, size: 128, offset: 2944)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 128, elements: !321)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !190, line: 64, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 61, size: 128, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !317, file: !190, line: 62, baseType: !233, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !317, file: !190, line: 63, baseType: !186, size: 64, offset: 64)
!321 = !{!322}
!322 = !DISubrange(count: 2)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !189, file: !190, line: 107, baseType: !324, size: 64, offset: 3072)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 64, elements: !321)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !189, file: !190, line: 108, baseType: !186, size: 64, offset: 3136)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !189, file: !190, line: 109, baseType: !327, size: 64, offset: 3200)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!203, !186}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !189, file: !190, line: 111, baseType: !245, size: 32, offset: 3264)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !189, file: !190, line: 112, baseType: !332, size: 320, offset: 3328)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 320, elements: !375)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!203, !336, !187, !186}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !339)
!339 = !{!340, !341, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !338, file: !12, line: 100, baseType: !245, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !12, line: 101, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !353, !354, !355, !356, !358, !360, !361, !362}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !344, file: !12, line: 84, baseType: !272, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !344, file: !12, line: 85, baseType: !272, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !12, line: 86, baseType: !186, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !344, file: !12, line: 87, baseType: !264, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !344, file: !12, line: 88, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !344, file: !12, line: 89, baseType: !224, size: 8, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !344, file: !12, line: 90, baseType: !272, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !344, file: !12, line: 91, baseType: !179, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !344, file: !12, line: 92, baseType: !357, size: 32, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !12, line: 93, baseType: !359, size: 32, offset: 544)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !12, line: 94, baseType: !342, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !344, file: !12, line: 95, baseType: !272, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !344, file: !12, line: 96, baseType: !186, size: 64, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !338, file: !12, line: 102, baseType: !272, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !338, file: !12, line: 102, baseType: !272, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !338, file: !12, line: 103, baseType: !272, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !338, file: !12, line: 104, baseType: !182, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !338, file: !12, line: 105, baseType: !357, size: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !338, file: !12, line: 105, baseType: !357, size: 32, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !338, file: !12, line: 105, baseType: !357, size: 32, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !338, file: !12, line: 106, baseType: !187, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !338, file: !12, line: 107, baseType: !372, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!375 = !{!376}
!376 = !DISubrange(count: 5)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !189, file: !190, line: 113, baseType: !378, size: 320, offset: 3648)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 320, elements: !375)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!203, !187, !186}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !189, file: !190, line: 114, baseType: !383, size: 320, offset: 3968)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 320, elements: !375)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !189, file: !190, line: 115, baseType: !357, size: 32, offset: 4288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !189, file: !190, line: 120, baseType: !372, size: 64, offset: 4352)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !189, file: !190, line: 121, baseType: !357, size: 32, offset: 4416)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "TJScheduler", file: !90, line: 84, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TJScheduler", file: !90, line: 67, size: 704, elements: !390)
!390 = !{!391, !393, !394, !395, !396, !397, !398, !399, !400, !426, !433}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !389, file: !90, line: 68, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "SchedulerType", file: !90, line: 26, baseType: !89)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "recompute", scope: !389, file: !90, line: 74, baseType: !357, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "skip_trajectory", scope: !389, file: !90, line: 75, baseType: !357, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "save_stack", scope: !389, file: !90, line: 76, baseType: !357, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_cps_ram", scope: !389, file: !90, line: 77, baseType: !245, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "max_cps_disk", scope: !389, file: !90, line: 78, baseType: !245, size: 32, offset: 160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !389, file: !90, line: 79, baseType: !245, size: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "total_steps", scope: !389, file: !90, line: 80, baseType: !245, size: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !389, file: !90, line: 81, baseType: !401, size: 256, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "Stack", file: !90, line: 59, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Stack", file: !90, line: 51, size: 256, elements: !403)
!403 = !{!404, !405, !406, !422, !423, !424, !425}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !402, file: !90, line: 52, baseType: !245, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !402, file: !90, line: 53, baseType: !245, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !402, file: !90, line: 54, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackElement", file: !90, line: 35, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StackElement", file: !90, line: 28, size: 384, elements: !411)
!411 = !{!412, !413, !417, !419, !420, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !410, file: !90, line: 29, baseType: !245, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !410, file: !90, line: 30, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !27, line: 21, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !410, file: !90, line: 31, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !410, file: !90, line: 32, baseType: !299, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timeprev", scope: !410, file: !90, line: 33, baseType: !299, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "timenext", scope: !410, file: !90, line: 34, baseType: !299, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nallocated", scope: !402, file: !90, line: 55, baseType: !245, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "numY", scope: !402, file: !90, line: 56, baseType: !245, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !402, file: !90, line: 57, baseType: !357, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "use_dram", scope: !402, file: !90, line: 58, baseType: !357, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "diskstack", scope: !389, file: !90, line: 82, baseType: !427, size: 128, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiskStack", file: !90, line: 65, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DiskStack", file: !90, line: 61, size: 128, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !428, file: !90, line: 62, baseType: !245, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !428, file: !90, line: 63, baseType: !245, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !428, file: !90, line: 64, baseType: !290, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !389, file: !90, line: 83, baseType: !209, size: 64, offset: 640)
!434 = !{!0, !435}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "TSTrajectory_DiskRead", scope: !2, file: !90, line: 23, type: !437, isLocal: false, isDefinition: true)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !438, line: 80, baseType: !40)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!439 = !{i32 7, !"Dwarf Version", i32 4}
!440 = !{i32 2, !"Debug Info Version", i32 3}
!441 = !{i32 1, !"wchar_size", i32 4}
!442 = !{i32 7, !"PIC Level", i32 2}
!443 = !{i32 7, !"uwtable", i32 1}
!444 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!445 = distinct !DISubprogram(name: "TSTrajectoryCreate_Memory", scope: !90, file: !90, line: 1917, type: !446, scopeLine: 1918, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!446 = !DISubroutineType(types: !447)
!447 = !{!203, !448, !471}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !35, line: 293, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !56, line: 89, size: 7040, elements: !451)
!451 = !{!452, !454, !890, !894, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !931, !932, !933, !934, !935, !939, !940, !941}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !450, file: !56, line: 90, baseType: !453, size: 4480)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !190, line: 122, baseType: !189)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !450, file: !56, line: 90, baseType: !455, size: 448, offset: 4480)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 448, elements: !241)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !56, line: 75, size: 448, elements: !457)
!457 = !{!458, !462, !466, !467, !880, !884, !888}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !456, file: !56, line: 76, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!203, !448, !209}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !456, file: !56, line: 77, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!203, !448}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !456, file: !56, line: 78, baseType: !463, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !456, file: !56, line: 79, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!203, !448, !471, !245, !299, !414}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !35, line: 17, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !56, line: 144, size: 17408, elements: !474)
!474 = !{!475, !476, !572, !574, !576, !581, !582, !583, !646, !648, !694, !701, !707, !709, !710, !715, !716, !717, !718, !719, !720, !724, !728, !729, !730, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !758, !762, !766, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !818, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !878, !879}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !473, file: !56, line: 145, baseType: !453, size: 4480)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !473, file: !56, line: 145, baseType: !477, size: 2048, offset: 4480)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 2048, elements: !241)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !56, line: 33, size: 2048, elements: !479)
!479 = !{!480, !488, !495, !499, !500, !501, !505, !510, !515, !519, !520, !524, !525, !529, !530, !531, !536, !537, !538, !539, !540, !541, !542, !543, !544, !550, !554, !558, !562, !566, !567, !568}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !478, file: !56, line: 34, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!203, !484, !414, !414, !471}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !485, line: 18, baseType: !486)
!485 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !485, line: 18, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !478, file: !56, line: 35, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!203, !484, !414, !492, !492, !471}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !64, line: 16, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !64, line: 16, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !478, file: !56, line: 36, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!203, !471}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !478, file: !56, line: 37, baseType: !496, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !478, file: !56, line: 38, baseType: !496, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !478, file: !56, line: 39, baseType: !502, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!203, !471, !299, !414}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !478, file: !56, line: 40, baseType: !506, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!203, !471, !509, !290, !298}
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !478, file: !56, line: 41, baseType: !511, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!203, !471, !245, !414, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !478, file: !56, line: 42, baseType: !516, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!203, !336, !471}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !478, file: !56, line: 43, baseType: !496, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !478, file: !56, line: 44, baseType: !521, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!203, !471, !209}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !478, file: !56, line: 45, baseType: !496, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !478, file: !56, line: 46, baseType: !526, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!203, !471, !299, !299, !298, !298}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !478, file: !56, line: 47, baseType: !521, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !478, file: !56, line: 48, baseType: !496, size: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !478, file: !56, line: 49, baseType: !532, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!203, !471, !290, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !478, file: !56, line: 50, baseType: !496, size: 64, offset: 1024)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !478, file: !56, line: 51, baseType: !496, size: 64, offset: 1088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !478, file: !56, line: 52, baseType: !496, size: 64, offset: 1152)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !478, file: !56, line: 53, baseType: !496, size: 64, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !478, file: !56, line: 54, baseType: !496, size: 64, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !478, file: !56, line: 55, baseType: !496, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !478, file: !56, line: 56, baseType: !496, size: 64, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !478, file: !56, line: 57, baseType: !496, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !478, file: !56, line: 58, baseType: !545, size: 64, offset: 1536)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!203, !471, !290, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !478, file: !56, line: 59, baseType: !551, size: 64, offset: 1600)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!203, !471, !290, !418}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !478, file: !56, line: 60, baseType: !555, size: 64, offset: 1664)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!203, !471, !418}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !478, file: !56, line: 61, baseType: !559, size: 64, offset: 1728)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!203, !471, !245, !418}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !478, file: !56, line: 62, baseType: !563, size: 64, offset: 1792)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!203, !471, !414}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !478, file: !56, line: 63, baseType: !496, size: 64, offset: 1856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !478, file: !56, line: 64, baseType: !563, size: 64, offset: 1920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !478, file: !56, line: 65, baseType: !569, size: 64, offset: 1984)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!203, !471, !414, !414}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !473, file: !56, line: 146, baseType: !573, size: 32, offset: 6528)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !35, line: 57, baseType: !34)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !473, file: !56, line: 147, baseType: !575, size: 32, offset: 6560)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !35, line: 88, baseType: !39)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !473, file: !56, line: 149, baseType: !577, size: 64, offset: 6592)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !578, line: 14, baseType: !579)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !578, line: 14, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !473, file: !56, line: 150, baseType: !414, size: 64, offset: 6656)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !473, file: !56, line: 151, baseType: !414, size: 64, offset: 6720)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !473, file: !56, line: 152, baseType: !584, size: 64, offset: 6784)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !35, line: 686, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !56, line: 319, size: 10112, elements: !587)
!587 = !{!588, !589, !611, !612, !616, !631, !632, !633, !634, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !586, file: !56, line: 320, baseType: !453, size: 4480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !586, file: !56, line: 320, baseType: !590, size: 384, offset: 4480)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 384, elements: !241)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !56, line: 310, size: 384, elements: !592)
!592 = !{!593, !597, !601, !602, !606, !610}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !591, file: !56, line: 311, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!203, !584, !471, !299, !290, !298, !514, !298, !298, !298}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !591, file: !56, line: 312, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!203, !584}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !591, file: !56, line: 313, baseType: !598, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !591, file: !56, line: 314, baseType: !603, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!203, !584, !209}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !591, file: !56, line: 315, baseType: !607, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!203, !336, !584}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !591, file: !56, line: 316, baseType: !603, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !56, line: 321, baseType: !186, size: 64, offset: 4864)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !586, file: !56, line: 322, baseType: !613, size: 64, offset: 4928)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!203, !584, !471, !299, !414, !514}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !586, file: !56, line: 331, baseType: !617, size: 4160, offset: 4992)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !56, line: 323, size: 4160, elements: !618)
!618 = !{!619, !620, !621, !625, !627, !628, !630}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !617, file: !56, line: 324, baseType: !245, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !617, file: !56, line: 325, baseType: !357, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !56, line: 326, baseType: !622, size: 1024, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1024, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !617, file: !56, line: 327, baseType: !626, size: 512, offset: 1088)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 512, elements: !623)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !617, file: !56, line: 328, baseType: !626, size: 512, offset: 1600)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !617, file: !56, line: 329, baseType: !629, size: 1024, offset: 2112)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1024, elements: !623)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !617, file: !56, line: 330, baseType: !629, size: 1024, offset: 3136)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !586, file: !56, line: 332, baseType: !357, size: 32, offset: 9152)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !586, file: !56, line: 333, baseType: !299, size: 64, offset: 9216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !586, file: !56, line: 334, baseType: !299, size: 64, offset: 9280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !586, file: !56, line: 335, baseType: !635, size: 128, offset: 9344)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 128, elements: !321)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !586, file: !56, line: 336, baseType: !299, size: 64, offset: 9472)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !586, file: !56, line: 336, baseType: !299, size: 64, offset: 9536)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !586, file: !56, line: 337, baseType: !299, size: 64, offset: 9600)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !586, file: !56, line: 338, baseType: !357, size: 32, offset: 9664)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !586, file: !56, line: 339, baseType: !299, size: 64, offset: 9728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !586, file: !56, line: 340, baseType: !635, size: 128, offset: 9792)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !586, file: !56, line: 341, baseType: !509, size: 32, offset: 9920)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !586, file: !56, line: 342, baseType: !209, size: 64, offset: 9984)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !586, file: !56, line: 343, baseType: !245, size: 32, offset: 10048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !586, file: !56, line: 344, baseType: !245, size: 32, offset: 10080)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !473, file: !56, line: 153, baseType: !647, size: 64, offset: 6848)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !35, line: 695, baseType: !222)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !473, file: !56, line: 154, baseType: !649, size: 64, offset: 6912)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !56, line: 71, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !56, line: 410, size: 1792, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !669, !673, !674, !675, !676, !677, !678, !679, !680, !682, !683, !684, !692, !693}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !651, file: !56, line: 411, baseType: !307, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !651, file: !56, line: 412, baseType: !307, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !651, file: !56, line: 413, baseType: !299, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !651, file: !56, line: 414, baseType: !299, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !651, file: !56, line: 415, baseType: !299, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !651, file: !56, line: 416, baseType: !307, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !651, file: !56, line: 417, baseType: !290, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !651, file: !56, line: 418, baseType: !299, size: 64, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !651, file: !56, line: 419, baseType: !299, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !651, file: !56, line: 420, baseType: !299, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !651, file: !56, line: 421, baseType: !299, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !651, file: !56, line: 422, baseType: !514, size: 64, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !651, file: !56, line: 423, baseType: !666, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!203, !471, !299, !414, !307, !186}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !651, file: !56, line: 424, baseType: !670, size: 64, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!203, !471, !245, !290, !299, !414, !357, !186}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !651, file: !56, line: 425, baseType: !186, size: 64, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !651, file: !56, line: 426, baseType: !290, size: 64, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !651, file: !56, line: 427, baseType: !514, size: 64, offset: 1024)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !651, file: !56, line: 428, baseType: !245, size: 32, offset: 1088)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !651, file: !56, line: 429, baseType: !245, size: 32, offset: 1120)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !651, file: !56, line: 430, baseType: !290, size: 64, offset: 1152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !651, file: !56, line: 431, baseType: !298, size: 64, offset: 1216)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !651, file: !56, line: 432, baseType: !681, size: 32, offset: 1280)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !56, line: 408, baseType: !55)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !651, file: !56, line: 433, baseType: !245, size: 32, offset: 1312)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !651, file: !56, line: 434, baseType: !209, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !651, file: !56, line: 442, baseType: !685, size: 320, offset: 1408)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !56, line: 436, size: 320, elements: !686)
!686 = !{!687, !688, !689, !690, !691}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !685, file: !56, line: 437, baseType: !245, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !685, file: !56, line: 438, baseType: !298, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !685, file: !56, line: 439, baseType: !290, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !685, file: !56, line: 440, baseType: !290, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !685, file: !56, line: 441, baseType: !292, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !651, file: !56, line: 443, baseType: !245, size: 32, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !651, file: !56, line: 444, baseType: !245, size: 32, offset: 1760)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !473, file: !56, line: 157, baseType: !695, size: 640, offset: 6976)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 640, elements: !699)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!203, !471, !245, !299, !414, !186}
!699 = !{!700}
!700 = !DISubrange(count: 10)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !473, file: !56, line: 158, baseType: !702, size: 640, offset: 7616)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 640, elements: !699)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!203, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !473, file: !56, line: 159, baseType: !708, size: 640, offset: 8256)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 640, elements: !699)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !473, file: !56, line: 160, baseType: !245, size: 32, offset: 8896)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !473, file: !56, line: 161, baseType: !711, size: 640, offset: 8960)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 640, elements: !699)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!203, !471, !245, !299, !414, !245, !418, !418, !186}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !473, file: !56, line: 162, baseType: !702, size: 640, offset: 9600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !473, file: !56, line: 163, baseType: !708, size: 640, offset: 10240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !473, file: !56, line: 164, baseType: !245, size: 32, offset: 10880)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !473, file: !56, line: 165, baseType: !245, size: 32, offset: 10912)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !473, file: !56, line: 167, baseType: !496, size: 64, offset: 10944)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !473, file: !56, line: 168, baseType: !721, size: 64, offset: 11008)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!203, !471, !299}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !473, file: !56, line: 169, baseType: !725, size: 64, offset: 11072)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!203, !471, !299, !245, !418}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !473, file: !56, line: 170, baseType: !496, size: 64, offset: 11136)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !473, file: !56, line: 171, baseType: !496, size: 64, offset: 11200)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !473, file: !56, line: 172, baseType: !731, size: 64, offset: 11264)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!203, !471, !299, !414, !514}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !473, file: !56, line: 175, baseType: !448, size: 64, offset: 11328)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !473, file: !56, line: 176, baseType: !418, size: 64, offset: 11392)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !473, file: !56, line: 177, baseType: !418, size: 64, offset: 11456)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !473, file: !56, line: 178, baseType: !245, size: 32, offset: 11520)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !473, file: !56, line: 179, baseType: !414, size: 64, offset: 11584)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !473, file: !56, line: 180, baseType: !245, size: 32, offset: 11648)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !473, file: !56, line: 181, baseType: !245, size: 32, offset: 11680)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !473, file: !56, line: 182, baseType: !245, size: 32, offset: 11712)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !473, file: !56, line: 183, baseType: !357, size: 32, offset: 11744)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !473, file: !56, line: 184, baseType: !357, size: 32, offset: 11776)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !473, file: !56, line: 185, baseType: !414, size: 64, offset: 11840)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !473, file: !56, line: 186, baseType: !492, size: 64, offset: 11904)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !473, file: !56, line: 186, baseType: !492, size: 64, offset: 11968)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !473, file: !56, line: 187, baseType: !186, size: 64, offset: 12032)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !473, file: !56, line: 187, baseType: !186, size: 64, offset: 12096)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !473, file: !56, line: 188, baseType: !186, size: 64, offset: 12160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !473, file: !56, line: 189, baseType: !418, size: 64, offset: 12224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !473, file: !56, line: 190, baseType: !418, size: 64, offset: 12288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !473, file: !56, line: 191, baseType: !414, size: 64, offset: 12352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !473, file: !56, line: 191, baseType: !414, size: 64, offset: 12416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !473, file: !56, line: 194, baseType: !755, size: 64, offset: 12480)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!203, !471, !299, !414, !492, !186}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !473, file: !56, line: 195, baseType: !759, size: 64, offset: 12544)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!203, !471, !299, !414, !414, !299, !492, !186}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !473, file: !56, line: 196, baseType: !763, size: 64, offset: 12608)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!203, !471, !299, !414, !414, !186}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !473, file: !56, line: 197, baseType: !767, size: 64, offset: 12672)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!203, !471, !299, !414, !418, !186}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !473, file: !56, line: 198, baseType: !767, size: 64, offset: 12736)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !473, file: !56, line: 201, baseType: !418, size: 64, offset: 12800)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !473, file: !56, line: 202, baseType: !418, size: 64, offset: 12864)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !473, file: !56, line: 203, baseType: !414, size: 64, offset: 12928)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !473, file: !56, line: 204, baseType: !418, size: 64, offset: 12992)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !473, file: !56, line: 204, baseType: !418, size: 64, offset: 13056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !473, file: !56, line: 205, baseType: !418, size: 64, offset: 13120)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !473, file: !56, line: 205, baseType: !418, size: 64, offset: 13184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !473, file: !56, line: 206, baseType: !418, size: 64, offset: 13248)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !473, file: !56, line: 206, baseType: !418, size: 64, offset: 13312)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !473, file: !56, line: 207, baseType: !418, size: 64, offset: 13376)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !473, file: !56, line: 207, baseType: !418, size: 64, offset: 13440)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !473, file: !56, line: 208, baseType: !186, size: 64, offset: 13504)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !473, file: !56, line: 208, baseType: !186, size: 64, offset: 13568)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !473, file: !56, line: 209, baseType: !785, size: 64, offset: 13632)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!203, !471, !299, !414, !418, !414, !418, !186}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !473, file: !56, line: 210, baseType: !785, size: 64, offset: 13696)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !473, file: !56, line: 211, baseType: !785, size: 64, offset: 13760)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !473, file: !56, line: 212, baseType: !785, size: 64, offset: 13824)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !473, file: !56, line: 213, baseType: !785, size: 64, offset: 13888)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !473, file: !56, line: 214, baseType: !785, size: 64, offset: 13952)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !473, file: !56, line: 215, baseType: !785, size: 64, offset: 14016)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !473, file: !56, line: 216, baseType: !785, size: 64, offset: 14080)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !473, file: !56, line: 219, baseType: !492, size: 64, offset: 14144)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !473, file: !56, line: 220, baseType: !414, size: 64, offset: 14208)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !473, file: !56, line: 221, baseType: !418, size: 64, offset: 14272)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !473, file: !56, line: 222, baseType: !245, size: 32, offset: 14336)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !473, file: !56, line: 223, baseType: !245, size: 32, offset: 14368)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !473, file: !56, line: 224, baseType: !186, size: 64, offset: 14400)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !473, file: !56, line: 225, baseType: !245, size: 32, offset: 14464)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !473, file: !56, line: 226, baseType: !357, size: 32, offset: 14496)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !473, file: !56, line: 227, baseType: !767, size: 64, offset: 14528)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !473, file: !56, line: 231, baseType: !492, size: 64, offset: 14592)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !473, file: !56, line: 232, baseType: !492, size: 64, offset: 14656)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !473, file: !56, line: 233, baseType: !414, size: 64, offset: 14720)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !473, file: !56, line: 247, baseType: !808, size: 384, offset: 14784)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !56, line: 238, size: 384, elements: !809)
!809 = !{!810, !811, !812, !813, !815, !816, !817}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !808, file: !56, line: 239, baseType: !299, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !808, file: !56, line: 240, baseType: !253, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !808, file: !56, line: 241, baseType: !283, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !808, file: !56, line: 242, baseType: !814, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !64, line: 285, baseType: !63)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !808, file: !56, line: 245, baseType: !357, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !808, file: !56, line: 246, baseType: !299, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !808, file: !56, line: 246, baseType: !299, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !473, file: !56, line: 251, baseType: !819, size: 64, offset: 15168)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !56, line: 249, size: 64, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !819, file: !56, line: 250, baseType: !299, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !473, file: !56, line: 253, baseType: !814, size: 32, offset: 15232)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !473, file: !56, line: 255, baseType: !484, size: 64, offset: 15296)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !473, file: !56, line: 256, baseType: !357, size: 32, offset: 15360)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !473, file: !56, line: 258, baseType: !245, size: 32, offset: 15392)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !473, file: !56, line: 259, baseType: !245, size: 32, offset: 15424)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !473, file: !56, line: 260, baseType: !245, size: 32, offset: 15456)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !473, file: !56, line: 261, baseType: !245, size: 32, offset: 15488)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !473, file: !56, line: 264, baseType: !245, size: 32, offset: 15520)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !473, file: !56, line: 264, baseType: !245, size: 32, offset: 15552)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !473, file: !56, line: 264, baseType: !245, size: 32, offset: 15584)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !473, file: !56, line: 264, baseType: !245, size: 32, offset: 15616)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !473, file: !56, line: 267, baseType: !245, size: 32, offset: 15648)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !473, file: !56, line: 268, baseType: !186, size: 64, offset: 15680)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !473, file: !56, line: 269, baseType: !186, size: 64, offset: 15744)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !473, file: !56, line: 272, baseType: !245, size: 32, offset: 15808)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !473, file: !56, line: 273, baseType: !299, size: 64, offset: 15872)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !473, file: !56, line: 277, baseType: !357, size: 32, offset: 15936)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !473, file: !56, line: 278, baseType: !357, size: 32, offset: 15968)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !473, file: !56, line: 279, baseType: !245, size: 32, offset: 16000)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !473, file: !56, line: 280, baseType: !299, size: 64, offset: 16064)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !473, file: !56, line: 281, baseType: !299, size: 64, offset: 16128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !473, file: !56, line: 282, baseType: !299, size: 64, offset: 16192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !473, file: !56, line: 283, baseType: !299, size: 64, offset: 16256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !473, file: !56, line: 284, baseType: !299, size: 64, offset: 16320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !473, file: !56, line: 286, baseType: !847, size: 32, offset: 16384)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !35, line: 115, baseType: !70)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !473, file: !56, line: 287, baseType: !357, size: 32, offset: 16416)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !473, file: !56, line: 288, baseType: !245, size: 32, offset: 16448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !473, file: !56, line: 288, baseType: !245, size: 32, offset: 16480)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !473, file: !56, line: 289, baseType: !852, size: 32, offset: 16512)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !35, line: 217, baseType: !83)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !473, file: !56, line: 291, baseType: !299, size: 64, offset: 16576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !473, file: !56, line: 291, baseType: !299, size: 64, offset: 16640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !473, file: !56, line: 292, baseType: !414, size: 64, offset: 16704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !473, file: !56, line: 292, baseType: !414, size: 64, offset: 16768)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !473, file: !56, line: 293, baseType: !299, size: 64, offset: 16832)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !473, file: !56, line: 293, baseType: !299, size: 64, offset: 16896)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !473, file: !56, line: 295, baseType: !357, size: 32, offset: 16960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !473, file: !56, line: 296, baseType: !357, size: 32, offset: 16992)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !473, file: !56, line: 298, baseType: !245, size: 32, offset: 17024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !473, file: !56, line: 299, baseType: !418, size: 64, offset: 17088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !473, file: !56, line: 302, baseType: !245, size: 32, offset: 17152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !473, file: !56, line: 303, baseType: !865, size: 64, offset: 17216)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !56, line: 135, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !56, line: 136, size: 320, elements: !868)
!868 = !{!869, !870, !871, !876, !877}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !867, file: !56, line: 137, baseType: !471, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !867, file: !56, line: 138, baseType: !272, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !867, file: !56, line: 139, baseType: !872, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !873, line: 11, baseType: !874)
!873 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !873, line: 11, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !56, line: 140, baseType: !865, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !867, file: !56, line: 141, baseType: !437, size: 32, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !473, file: !56, line: 304, baseType: !357, size: 32, offset: 17280)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !473, file: !56, line: 307, baseType: !471, size: 64, offset: 17344)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !456, file: !56, line: 80, baseType: !881, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!203, !448, !471, !245, !298}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !456, file: !56, line: 81, baseType: !885, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!203, !336, !448}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !456, file: !56, line: 82, baseType: !889, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !450, file: !56, line: 91, baseType: !891, size: 64, offset: 4928)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !56, line: 87, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !56, line: 87, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !450, file: !56, line: 116, baseType: !895, size: 1024, offset: 4992)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !56, line: 93, size: 1024, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !912}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !895, file: !56, line: 94, baseType: !245, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !895, file: !56, line: 95, baseType: !418, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !895, file: !56, line: 96, baseType: !307, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !895, file: !56, line: 97, baseType: !298, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !895, file: !56, line: 98, baseType: !418, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !895, file: !56, line: 99, baseType: !514, size: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !895, file: !56, line: 100, baseType: !298, size: 64, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !895, file: !56, line: 103, baseType: !357, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !895, file: !56, line: 109, baseType: !906, size: 256, offset: 512)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !56, line: 104, size: 256, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !906, file: !56, line: 105, baseType: !253, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !906, file: !56, line: 106, baseType: !283, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !906, file: !56, line: 107, baseType: !299, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !906, file: !56, line: 108, baseType: !245, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !895, file: !56, line: 115, baseType: !913, size: 256, offset: 768)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !56, line: 110, size: 256, elements: !914)
!914 = !{!915, !916, !917, !918}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !913, file: !56, line: 111, baseType: !253, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !913, file: !56, line: 112, baseType: !283, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !913, file: !56, line: 113, baseType: !299, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !913, file: !56, line: 114, baseType: !245, size: 32, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !450, file: !56, line: 117, baseType: !414, size: 64, offset: 6016)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !450, file: !56, line: 117, baseType: !414, size: 64, offset: 6080)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !450, file: !56, line: 118, baseType: !357, size: 32, offset: 6144)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !450, file: !56, line: 119, baseType: !357, size: 32, offset: 6176)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !450, file: !56, line: 120, baseType: !357, size: 32, offset: 6208)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !450, file: !56, line: 121, baseType: !209, size: 64, offset: 6272)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !450, file: !56, line: 122, baseType: !245, size: 32, offset: 6336)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !450, file: !56, line: 123, baseType: !245, size: 32, offset: 6368)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !450, file: !56, line: 124, baseType: !245, size: 32, offset: 6400)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !450, file: !56, line: 124, baseType: !245, size: 32, offset: 6432)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !450, file: !56, line: 125, baseType: !930, size: 64, offset: 6464)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !450, file: !56, line: 126, baseType: !357, size: 32, offset: 6528)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !450, file: !56, line: 127, baseType: !272, size: 64, offset: 6592)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !450, file: !56, line: 127, baseType: !272, size: 64, offset: 6656)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !450, file: !56, line: 128, baseType: !272, size: 64, offset: 6720)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !450, file: !56, line: 129, baseType: !936, size: 64, offset: 6784)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!203, !186, !414, !418}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !450, file: !56, line: 130, baseType: !327, size: 64, offset: 6848)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !450, file: !56, line: 131, baseType: !186, size: 64, offset: 6912)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !56, line: 132, baseType: !186, size: 64, offset: 6976)
!942 = !{!943, !944, !945, !946, !947, !949, !951, !953, !955}
!943 = !DILocalVariable(name: "tj", arg: 1, scope: !445, file: !90, line: 1917, type: !448)
!944 = !DILocalVariable(name: "ts", arg: 2, scope: !445, file: !90, line: 1917, type: !471)
!945 = !DILocalVariable(name: "tjsch", scope: !445, file: !90, line: 1919, type: !387)
!946 = !DILocalVariable(name: "ierr", scope: !445, file: !90, line: 1920, type: !203)
!947 = !DILocalVariable(name: "ierr__", scope: !948, file: !90, line: 1930, type: !203)
!948 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1930, column: 27)
!949 = !DILocalVariable(name: "ierr__", scope: !950, file: !90, line: 1941, type: !203)
!950 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1941, column: 77)
!951 = !DILocalVariable(name: "ierr__", scope: !952, file: !90, line: 1942, type: !203)
!952 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1942, column: 62)
!953 = !DILocalVariable(name: "ierr__", scope: !954, file: !90, line: 1943, type: !203)
!954 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1943, column: 67)
!955 = !DILocalVariable(name: "ierr__", scope: !956, file: !90, line: 1944, type: !203)
!956 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1944, column: 64)
!957 = !DILocation(line: 0, scope: !445)
!958 = !DILocation(line: 1919, column: 3, scope: !445)
!959 = !DILocation(line: 1922, column: 3, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !90, line: 1922, column: 3)
!961 = distinct !DILexicalBlock(scope: !962, file: !90, line: 1922, column: 3)
!962 = distinct !DILexicalBlock(scope: !445, file: !90, line: 1922, column: 3)
!963 = !{!964, !964, i64 0}
!964 = !{!"any pointer", !965, i64 0}
!965 = !{!"omnipotent char", !966, i64 0}
!966 = !{!"Simple C/C++ TBAA"}
!967 = !DILocation(line: 1922, column: 3, scope: !961)
!968 = !DILocation(line: 1922, column: 3, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !90, line: 1922, column: 3)
!970 = distinct !DILexicalBlock(scope: !960, file: !90, line: 1922, column: 3)
!971 = !{!972, !973, i64 1536}
!972 = !{!"", !965, i64 0, !965, i64 512, !965, i64 1024, !965, i64 1280, !973, i64 1536, !973, i64 1540, !965, i64 1544}
!973 = !{!"int", !965, i64 0}
!974 = !DILocation(line: 1922, column: 3, scope: !970)
!975 = !DILocation(line: 1922, column: 3, scope: !976)
!976 = distinct !DILexicalBlock(scope: !969, file: !90, line: 1922, column: 3)
!977 = !{!973, !973, i64 0}
!978 = !{!972, !973, i64 1540}
!979 = !DILocation(line: 1923, column: 12, scope: !445)
!980 = !DILocation(line: 1923, column: 27, scope: !445)
!981 = !{!982, !964, i64 24}
!982 = !{!"_TSTrajectoryOps", !964, i64 0, !964, i64 8, !964, i64 16, !964, i64 24, !964, i64 32, !964, i64 40, !964, i64 48}
!983 = !DILocation(line: 1924, column: 12, scope: !445)
!984 = !DILocation(line: 1924, column: 27, scope: !445)
!985 = !{!982, !964, i64 32}
!986 = !DILocation(line: 1925, column: 12, scope: !445)
!987 = !DILocation(line: 1925, column: 27, scope: !445)
!988 = !{!982, !964, i64 48}
!989 = !DILocation(line: 1926, column: 12, scope: !445)
!990 = !DILocation(line: 1926, column: 27, scope: !445)
!991 = !{!982, !964, i64 40}
!992 = !DILocation(line: 1927, column: 12, scope: !445)
!993 = !DILocation(line: 1927, column: 27, scope: !445)
!994 = !{!982, !964, i64 8}
!995 = !DILocation(line: 1928, column: 12, scope: !445)
!996 = !DILocation(line: 1928, column: 27, scope: !445)
!997 = !{!982, !964, i64 16}
!998 = !DILocation(line: 1930, column: 10, scope: !445)
!999 = !DILocation(line: 0, scope: !948)
!1000 = !DILocation(line: 1930, column: 27, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !948, file: !90, line: 1930, column: 27)
!1002 = !DILocation(line: 1930, column: 27, scope: !948)
!1003 = !{!"branch_weights", i32 2000, i32 1}
!1004 = !DILocation(line: 1931, column: 3, scope: !445)
