; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/impls/da/slda.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/impls/da/slda.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_Characteristic = type { %struct._p_PetscObject, [1 x %struct._CharacteristicOps], i32, i32, i32, %struct._p_DM*, %struct._p_Vec*, %struct._p_Vec*, i32, i32*, i32 (%struct._p_Vec*, double*, i32, i32*, double*, i8*)*, i32 (i8*, double*, i32, i32*, double*, i8*)*, i8*, %struct._p_DM*, %struct._p_Vec*, %struct._p_Vec*, i32, i32*, i32 (%struct._p_Vec*, double*, i32, i32*, double*, i8*)*, i32 (i8*, double*, i32, i32*, double*, i8*)*, i8*, %struct.ompi_datatype_t*, %struct._p_Item*, i32, i32, %struct._p_Item*, i32, i32, %struct._p_Item*, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, %struct.ompi_request_t**, %struct.ompi_status_public_t*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !43, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/impls/da/slda.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !30, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 663, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 42, baseType: !5, size: 32, elements: !32)
!31 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 14, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42}
!41 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!43 = !{!44, !52, !70, !150, !91, !259, !140, !51, !225, !177}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "Characteristic_DA", file: !46, line: 8, baseType: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ts/characteristic/impls/da/slda.h", directory: "/home/users/ndemeye/xSDK")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 6, size: 32, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !47, file: !46, line: 7, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !51)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !55, line: 73, size: 4480, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !59, !112, !113, !114, !117, !118, !119, !120, !128, !129, !131, !135, !139, !141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !153, !154, !155, !157, !158, !160, !162, !163, !164, !165, !166, !169, !171, !172, !173, !174, !175, !178, !180, !181, !182, !192, !194, !195, !199, !200, !249, !254, !256, !257, !258}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !54, file: !55, line: 74, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !51)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !54, file: !55, line: 75, baseType: !60, size: 448, offset: 64)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 448, elements: !110)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !55, line: 53, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 45, size: 448, elements: !63)
!63 = !{!64, !74, !82, !87, !94, !98, !105}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !62, file: !55, line: 46, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !52, !69}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !51)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !71, line: 330, baseType: !72)
!71 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !71, line: 330, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !62, file: !55, line: 47, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!68, !52, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !79, line: 16, baseType: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !79, line: 16, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !62, file: !55, line: 48, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!68, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !62, file: !55, line: 49, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !52, !91, !52}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !62, file: !55, line: 50, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!68, !52, !91, !86}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !62, file: !55, line: 51, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!68, !52, !91, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !62, file: !55, line: 52, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!68, !52, !91, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !54, file: !55, line: 76, baseType: !70, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !55, line: 77, baseType: !50, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !54, file: !55, line: 78, baseType: !115, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !116)
!116 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !54, file: !55, line: 78, baseType: !115, size: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !54, file: !55, line: 78, baseType: !115, size: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !54, file: !55, line: 78, baseType: !115, size: 64, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !54, file: !55, line: 79, baseType: !121, size: 64, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !124, line: 27, baseType: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !126, line: 43, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!127 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !54, file: !55, line: 80, baseType: !50, size: 32, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !54, file: !55, line: 81, baseType: !130, size: 32, offset: 992)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !51)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !54, file: !55, line: 82, baseType: !132, size: 64, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !54, file: !55, line: 83, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !54, file: !55, line: 84, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !54, file: !55, line: 85, baseType: !140, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !54, file: !55, line: 86, baseType: !140, size: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !54, file: !55, line: 87, baseType: !140, size: 64, offset: 1344)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !54, file: !55, line: 88, baseType: !52, size: 64, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !54, file: !55, line: 89, baseType: !121, size: 64, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 90, baseType: !140, size: 64, offset: 1536)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !54, file: !55, line: 91, baseType: !140, size: 64, offset: 1600)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !54, file: !55, line: 92, baseType: !50, size: 32, offset: 1664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !54, file: !55, line: 93, baseType: !150, size: 64, offset: 1728)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !54, file: !55, line: 94, baseType: !152, size: 64, offset: 1792)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !122)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !54, file: !55, line: 95, baseType: !50, size: 32, offset: 1856)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !54, file: !55, line: 95, baseType: !50, size: 32, offset: 1888)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !54, file: !55, line: 96, baseType: !156, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !54, file: !55, line: 96, baseType: !156, size: 64, offset: 1984)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !54, file: !55, line: 97, baseType: !159, size: 64, offset: 2048)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !54, file: !55, line: 97, baseType: !161, size: 64, offset: 2112)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !54, file: !55, line: 98, baseType: !50, size: 32, offset: 2176)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !54, file: !55, line: 98, baseType: !50, size: 32, offset: 2208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !54, file: !55, line: 99, baseType: !156, size: 64, offset: 2240)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !54, file: !55, line: 99, baseType: !156, size: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !54, file: !55, line: 100, baseType: !167, size: 64, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !116)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !54, file: !55, line: 100, baseType: !170, size: 64, offset: 2432)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !54, file: !55, line: 101, baseType: !50, size: 32, offset: 2496)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !54, file: !55, line: 101, baseType: !50, size: 32, offset: 2528)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !54, file: !55, line: 102, baseType: !156, size: 64, offset: 2560)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !54, file: !55, line: 102, baseType: !156, size: 64, offset: 2624)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !54, file: !55, line: 103, baseType: !176, size: 64, offset: 2688)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !168)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !54, file: !55, line: 103, baseType: !179, size: 64, offset: 2752)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !54, file: !55, line: 104, baseType: !109, size: 64, offset: 2816)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !54, file: !55, line: 105, baseType: !50, size: 32, offset: 2880)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !54, file: !55, line: 106, baseType: !183, size: 128, offset: 2944)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !190)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !55, line: 64, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 61, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !186, file: !55, line: 62, baseType: !102, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !186, file: !55, line: 63, baseType: !150, size: 64, offset: 64)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !54, file: !55, line: 107, baseType: !193, size: 64, offset: 3072)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !190)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !54, file: !55, line: 108, baseType: !150, size: 64, offset: 3136)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !54, file: !55, line: 109, baseType: !196, size: 64, offset: 3200)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!68, !150}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !54, file: !55, line: 111, baseType: !50, size: 32, offset: 3264)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !54, file: !55, line: 112, baseType: !201, size: 320, offset: 3328)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 320, elements: !247)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!68, !205, !52, !150}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !208)
!208 = !{!209, !210, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !207, file: !10, line: 100, baseType: !50, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !10, line: 101, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !222, !223, !224, !228, !230, !232, !233, !234}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !213, file: !10, line: 84, baseType: !140, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !213, file: !10, line: 85, baseType: !140, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !10, line: 86, baseType: !150, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !213, file: !10, line: 87, baseType: !132, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !213, file: !10, line: 88, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !213, file: !10, line: 89, baseType: !93, size: 8, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !213, file: !10, line: 90, baseType: !140, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !213, file: !10, line: 91, baseType: !225, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 46, baseType: !227)
!226 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!227 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !213, file: !10, line: 92, baseType: !229, size: 32, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !10, line: 93, baseType: !231, size: 32, offset: 544)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !10, line: 94, baseType: !211, size: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !213, file: !10, line: 95, baseType: !140, size: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !213, file: !10, line: 96, baseType: !150, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !207, file: !10, line: 102, baseType: !140, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !207, file: !10, line: 102, baseType: !140, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !207, file: !10, line: 103, baseType: !140, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !207, file: !10, line: 104, baseType: !70, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !207, file: !10, line: 105, baseType: !229, size: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !207, file: !10, line: 105, baseType: !229, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !207, file: !10, line: 105, baseType: !229, size: 32, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !207, file: !10, line: 106, baseType: !52, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !207, file: !10, line: 107, baseType: !244, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!247 = !{!248}
!248 = !DISubrange(count: 5)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !54, file: !55, line: 113, baseType: !250, size: 320, offset: 3648)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !247)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!68, !52, !150}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !54, file: !55, line: 114, baseType: !255, size: 320, offset: 3968)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 320, elements: !247)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !54, file: !55, line: 115, baseType: !229, size: 32, offset: 4288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !54, file: !55, line: 120, baseType: !244, size: 64, offset: 4352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !54, file: !55, line: 121, baseType: !229, size: 32, offset: 4416)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !71, line: 331, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !71, line: 331, flags: DIFlagFwdDecl)
!262 = !{i32 7, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{i32 7, !"PIC Level", i32 2}
!266 = !{i32 7, !"uwtable", i32 1}
!267 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!268 = distinct !DISubprogram(name: "CharacteristicView_DA", scope: !269, file: !269, line: 5, type: !270, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !372)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/impls/da/slda.c", directory: "/home/users/ndemeye/xSDK")
!270 = !DISubroutineType(types: !271)
!271 = !{!68, !272, !78}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Characteristic", file: !273, line: 19, baseType: !274)
!273 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsccharacteristic.h", directory: "/home/users/ndemeye/xSDK")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Characteristic", file: !276, line: 41, size: 6848, elements: !277)
!276 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/characteristicimpl.h", directory: "/home/users/ndemeye/xSDK")
!277 = !{!278, !280, !291, !292, !293, !294, !298, !303, !304, !305, !306, !310, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !352, !353, !354, !355, !356, !361, !371}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !275, file: !276, line: 42, baseType: !279, size: 4480)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !55, line: 122, baseType: !54)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !275, file: !276, line: 42, baseType: !281, size: 192, offset: 4480)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 192, elements: !110)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CharacteristicOps", file: !276, line: 35, size: 192, elements: !283)
!283 = !{!284, !286, !290}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !282, file: !276, line: 36, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !282, file: !276, line: 37, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!68, !272}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !282, file: !276, line: 38, baseType: !287, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !275, file: !276, line: 43, baseType: !50, size: 32, offset: 4672)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "structured", scope: !275, file: !276, line: 44, baseType: !229, size: 32, offset: 4704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "numIds", scope: !275, file: !276, line: 45, baseType: !50, size: 32, offset: 4736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "velocityDA", scope: !275, file: !276, line: 47, baseType: !295, size: 64, offset: 4800)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !31, line: 14, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !31, line: 14, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !275, file: !276, line: 48, baseType: !299, size: 64, offset: 4864)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !300, line: 21, baseType: !301)
!300 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !300, line: 21, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "velocityOld", scope: !275, file: !276, line: 49, baseType: !299, size: 64, offset: 4928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "numVelocityComp", scope: !275, file: !276, line: 50, baseType: !50, size: 32, offset: 4992)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "velocityComp", scope: !275, file: !276, line: 51, baseType: !159, size: 64, offset: 5056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "velocityInterp", scope: !275, file: !276, line: 52, baseType: !307, size: 64, offset: 5120)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!68, !299, !167, !50, !159, !176, !150}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "velocityInterpLocal", scope: !275, file: !276, line: 53, baseType: !311, size: 64, offset: 5184)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!68, !150, !167, !50, !159, !176, !150}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "velocityCtx", scope: !275, file: !276, line: 54, baseType: !150, size: 64, offset: 5248)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fieldDA", scope: !275, file: !276, line: 56, baseType: !295, size: 64, offset: 5312)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !275, file: !276, line: 57, baseType: !299, size: 64, offset: 5376)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fieldOld", scope: !275, file: !276, line: 58, baseType: !299, size: 64, offset: 5440)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComp", scope: !275, file: !276, line: 59, baseType: !50, size: 32, offset: 5504)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fieldComp", scope: !275, file: !276, line: 60, baseType: !159, size: 64, offset: 5568)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fieldInterp", scope: !275, file: !276, line: 61, baseType: !307, size: 64, offset: 5632)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fieldInterpLocal", scope: !275, file: !276, line: 62, baseType: !311, size: 64, offset: 5696)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fieldCtx", scope: !275, file: !276, line: 63, baseType: !150, size: 64, offset: 5760)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "itemType", scope: !275, file: !276, line: 65, baseType: !259, size: 64, offset: 5824)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !275, file: !276, line: 66, baseType: !325, size: 64, offset: 5888)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "Queue", file: !276, line: 33, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharacteristicPointDA2D", file: !276, line: 31, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Item", file: !276, line: 25, size: 1024, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !328, file: !276, line: 26, baseType: !51, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !328, file: !276, line: 27, baseType: !51, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !328, file: !276, line: 27, baseType: !51, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !328, file: !276, line: 28, baseType: !177, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !328, file: !276, line: 28, baseType: !177, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !328, file: !276, line: 29, baseType: !177, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !328, file: !276, line: 29, baseType: !177, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !328, file: !276, line: 30, baseType: !338, size: 640, offset: 384)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 640, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 10)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "queueSize", scope: !275, file: !276, line: 67, baseType: !50, size: 32, offset: 5952)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "queueMax", scope: !275, file: !276, line: 68, baseType: !50, size: 32, offset: 5984)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocal", scope: !275, file: !276, line: 69, baseType: !325, size: 64, offset: 6016)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocalSize", scope: !275, file: !276, line: 70, baseType: !50, size: 32, offset: 6080)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocalMax", scope: !275, file: !276, line: 71, baseType: !50, size: 32, offset: 6112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemote", scope: !275, file: !276, line: 72, baseType: !325, size: 64, offset: 6144)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemoteSize", scope: !275, file: !276, line: 73, baseType: !50, size: 32, offset: 6208)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemoteMax", scope: !275, file: !276, line: 74, baseType: !50, size: 32, offset: 6240)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "numNeighbors", scope: !275, file: !276, line: 75, baseType: !50, size: 32, offset: 6272)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !275, file: !276, line: 76, baseType: !351, size: 64, offset: 6336)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "needCount", scope: !275, file: !276, line: 77, baseType: !159, size: 64, offset: 6400)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "localOffsets", scope: !275, file: !276, line: 78, baseType: !159, size: 64, offset: 6464)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fillCount", scope: !275, file: !276, line: 79, baseType: !159, size: 64, offset: 6528)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "remoteOffsets", scope: !275, file: !276, line: 80, baseType: !159, size: 64, offset: 6592)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !275, file: !276, line: 81, baseType: !357, size: 64, offset: 6656)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !71, line: 339, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !71, line: 339, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !275, file: !276, line: 82, baseType: !362, size: 64, offset: 6720)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !71, line: 341, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !71, line: 351, size: 192, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !364, file: !71, line: 354, baseType: !51, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !364, file: !71, line: 355, baseType: !51, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !364, file: !71, line: 356, baseType: !51, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !364, file: !71, line: 361, baseType: !51, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !364, file: !71, line: 362, baseType: !225, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 83, baseType: !150, size: 64, offset: 6784)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !381, !383, !387}
!373 = !DILocalVariable(name: "c", arg: 1, scope: !268, file: !269, line: 5, type: !272)
!374 = !DILocalVariable(name: "viewer", arg: 2, scope: !268, file: !269, line: 5, type: !78)
!375 = !DILocalVariable(name: "da", scope: !268, file: !269, line: 7, type: !44)
!376 = !DILocalVariable(name: "iascii", scope: !268, file: !269, line: 8, type: !229)
!377 = !DILocalVariable(name: "isstring", scope: !268, file: !269, line: 8, type: !229)
!378 = !DILocalVariable(name: "ierr", scope: !268, file: !269, line: 9, type: !68)
!379 = !DILocalVariable(name: "ierr__", scope: !380, file: !269, line: 13, type: !68)
!380 = distinct !DILexicalBlock(scope: !268, file: !269, line: 13, column: 82)
!381 = !DILocalVariable(name: "ierr__", scope: !382, file: !269, line: 14, type: !68)
!382 = distinct !DILexicalBlock(scope: !268, file: !269, line: 14, column: 85)
!383 = !DILocalVariable(name: "ierr__", scope: !384, file: !269, line: 16, type: !68)
!384 = distinct !DILexicalBlock(scope: !385, file: !269, line: 16, column: 75)
!385 = distinct !DILexicalBlock(scope: !386, file: !269, line: 15, column: 15)
!386 = distinct !DILexicalBlock(scope: !268, file: !269, line: 15, column: 7)
!387 = !DILocalVariable(name: "ierr__", scope: !388, file: !269, line: 18, type: !68)
!388 = distinct !DILexicalBlock(scope: !389, file: !269, line: 18, column: 67)
!389 = distinct !DILexicalBlock(scope: !390, file: !269, line: 17, column: 24)
!390 = distinct !DILexicalBlock(scope: !386, file: !269, line: 17, column: 14)
!391 = !DILocation(line: 0, scope: !268)
!392 = !DILocation(line: 7, column: 51, scope: !268)
!393 = !{!394, !399, i64 848}
!394 = !{!"_p_Characteristic", !395, i64 0, !397, i64 560, !396, i64 584, !397, i64 588, !396, i64 592, !399, i64 600, !399, i64 608, !399, i64 616, !396, i64 624, !399, i64 632, !399, i64 640, !399, i64 648, !399, i64 656, !399, i64 664, !399, i64 672, !399, i64 680, !396, i64 688, !399, i64 696, !399, i64 704, !399, i64 712, !399, i64 720, !399, i64 728, !399, i64 736, !396, i64 744, !396, i64 748, !399, i64 752, !396, i64 760, !396, i64 764, !399, i64 768, !396, i64 776, !396, i64 780, !396, i64 784, !399, i64 792, !399, i64 800, !399, i64 808, !399, i64 816, !399, i64 824, !399, i64 832, !399, i64 840, !399, i64 848}
!395 = !{!"_p_PetscObject", !396, i64 0, !397, i64 8, !399, i64 64, !396, i64 72, !400, i64 80, !400, i64 88, !400, i64 96, !400, i64 104, !401, i64 112, !396, i64 120, !396, i64 124, !399, i64 128, !399, i64 136, !399, i64 144, !399, i64 152, !399, i64 160, !399, i64 168, !399, i64 176, !401, i64 184, !399, i64 192, !399, i64 200, !396, i64 208, !399, i64 216, !401, i64 224, !396, i64 232, !396, i64 236, !399, i64 240, !399, i64 248, !399, i64 256, !399, i64 264, !396, i64 272, !396, i64 276, !399, i64 280, !399, i64 288, !399, i64 296, !399, i64 304, !396, i64 312, !396, i64 316, !399, i64 320, !399, i64 328, !399, i64 336, !399, i64 344, !399, i64 352, !396, i64 360, !397, i64 368, !397, i64 384, !399, i64 392, !399, i64 400, !396, i64 408, !397, i64 416, !397, i64 456, !397, i64 496, !397, i64 536, !399, i64 544, !397, i64 552}
!396 = !{!"int", !397, i64 0}
!397 = !{!"omnipotent char", !398, i64 0}
!398 = !{!"Simple C/C++ TBAA"}
!399 = !{!"any pointer", !397, i64 0}
!400 = !{!"double", !397, i64 0}
!401 = !{!"long", !397, i64 0}
!402 = !DILocation(line: 8, column: 3, scope: !268)
!403 = !DILocation(line: 11, column: 3, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !269, line: 11, column: 3)
!405 = distinct !DILexicalBlock(scope: !406, file: !269, line: 11, column: 3)
!406 = distinct !DILexicalBlock(scope: !268, file: !269, line: 11, column: 3)
!407 = !{!399, !399, i64 0}
!408 = !DILocation(line: 11, column: 3, scope: !405)
!409 = !DILocation(line: 11, column: 3, scope: !410)
