; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/shell/ftn-custom/zdmshellf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/shell/ftn-custom/zdmshellf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_DM = type opaque
%struct._p_Mat = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_cb", scope: !2, file: !262, line: 35, type: !263, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !49, globals: !261, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/shell/ftn-custom/zdmshellf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !32, !43}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 55, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 663, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!49 = !{!50, !258, !149, !260, !68, !89}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !27, line: 73, size: 4480, elements: !53)
!53 = !{!54, !57, !110, !111, !113, !116, !117, !118, !119, !127, !128, !130, !134, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !150, !152, !153, !154, !156, !157, !159, !161, !162, !163, !164, !165, !168, !170, !171, !172, !173, !174, !177, !179, !180, !181, !191, !193, !194, !198, !199, !248, !253, !255, !256, !257}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !52, file: !27, line: 74, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !56)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !52, file: !27, line: 75, baseType: !58, size: 448, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 448, elements: !108)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !27, line: 53, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 45, size: 448, elements: !61)
!61 = !{!62, !72, !80, !85, !92, !96, !103}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !60, file: !27, line: 46, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !50, !67}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !56)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !69, line: 330, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !69, line: 330, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !60, file: !27, line: 47, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!66, !50, !76}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !77, line: 16, baseType: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !77, line: 16, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !60, file: !27, line: 48, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!66, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !60, file: !27, line: 49, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!66, !50, !89, !50}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !60, file: !27, line: 50, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!66, !50, !89, !84}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !60, file: !27, line: 51, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!66, !50, !89, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !60, file: !27, line: 52, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!66, !50, !89, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!108 = !{!109}
!109 = !DISubrange(count: 1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !52, file: !27, line: 76, baseType: !68, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !27, line: 77, baseType: !112, size: 32, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !56)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !52, file: !27, line: 78, baseType: !114, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !115)
!115 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !52, file: !27, line: 78, baseType: !114, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !52, file: !27, line: 78, baseType: !114, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !52, file: !27, line: 78, baseType: !114, size: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !52, file: !27, line: 79, baseType: !120, size: 64, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !123, line: 27, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !125, line: 43, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !52, file: !27, line: 80, baseType: !112, size: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !52, file: !27, line: 81, baseType: !129, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !56)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !52, file: !27, line: 82, baseType: !131, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !52, file: !27, line: 83, baseType: !135, size: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !52, file: !27, line: 84, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !52, file: !27, line: 85, baseType: !139, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !52, file: !27, line: 86, baseType: !139, size: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !52, file: !27, line: 87, baseType: !139, size: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !52, file: !27, line: 88, baseType: !50, size: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !52, file: !27, line: 89, baseType: !120, size: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !27, line: 90, baseType: !139, size: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !52, file: !27, line: 91, baseType: !139, size: 64, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !52, file: !27, line: 92, baseType: !112, size: 32, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !52, file: !27, line: 93, baseType: !149, size: 64, offset: 1728)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !27, line: 94, baseType: !151, size: 64, offset: 1792)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !121)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !52, file: !27, line: 95, baseType: !112, size: 32, offset: 1856)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !52, file: !27, line: 95, baseType: !112, size: 32, offset: 1888)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !52, file: !27, line: 96, baseType: !155, size: 64, offset: 1920)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !52, file: !27, line: 96, baseType: !155, size: 64, offset: 1984)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !52, file: !27, line: 97, baseType: !158, size: 64, offset: 2048)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !52, file: !27, line: 97, baseType: !160, size: 64, offset: 2112)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !52, file: !27, line: 98, baseType: !112, size: 32, offset: 2176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !52, file: !27, line: 98, baseType: !112, size: 32, offset: 2208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !52, file: !27, line: 99, baseType: !155, size: 64, offset: 2240)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !52, file: !27, line: 99, baseType: !155, size: 64, offset: 2304)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !52, file: !27, line: 100, baseType: !166, size: 64, offset: 2368)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !115)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !52, file: !27, line: 100, baseType: !169, size: 64, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !52, file: !27, line: 101, baseType: !112, size: 32, offset: 2496)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !52, file: !27, line: 101, baseType: !112, size: 32, offset: 2528)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !52, file: !27, line: 102, baseType: !155, size: 64, offset: 2560)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !52, file: !27, line: 102, baseType: !155, size: 64, offset: 2624)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !52, file: !27, line: 103, baseType: !175, size: 64, offset: 2688)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !167)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !52, file: !27, line: 103, baseType: !178, size: 64, offset: 2752)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !52, file: !27, line: 104, baseType: !107, size: 64, offset: 2816)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !52, file: !27, line: 105, baseType: !112, size: 32, offset: 2880)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !52, file: !27, line: 106, baseType: !182, size: 128, offset: 2944)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !189)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !27, line: 64, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 61, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !185, file: !27, line: 62, baseType: !100, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !185, file: !27, line: 63, baseType: !149, size: 64, offset: 64)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !52, file: !27, line: 107, baseType: !192, size: 64, offset: 3072)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !189)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !52, file: !27, line: 108, baseType: !149, size: 64, offset: 3136)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !52, file: !27, line: 109, baseType: !195, size: 64, offset: 3200)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !149}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !52, file: !27, line: 111, baseType: !112, size: 32, offset: 3264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !52, file: !27, line: 112, baseType: !200, size: 320, offset: 3328)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320, elements: !246)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!66, !204, !50, !149}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !207)
!207 = !{!208, !209, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !206, file: !12, line: 100, baseType: !112, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !12, line: 101, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !221, !222, !223, !227, !229, !231, !232, !233}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !212, file: !12, line: 84, baseType: !139, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !212, file: !12, line: 85, baseType: !139, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !12, line: 86, baseType: !149, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !212, file: !12, line: 87, baseType: !131, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !212, file: !12, line: 88, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !212, file: !12, line: 89, baseType: !91, size: 8, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !212, file: !12, line: 90, baseType: !139, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !212, file: !12, line: 91, baseType: !224, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !225, line: 46, baseType: !226)
!225 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!226 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !212, file: !12, line: 92, baseType: !228, size: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !12, line: 93, baseType: !230, size: 32, offset: 544)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !12, line: 94, baseType: !210, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !212, file: !12, line: 95, baseType: !139, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !212, file: !12, line: 96, baseType: !149, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !206, file: !12, line: 102, baseType: !139, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !206, file: !12, line: 102, baseType: !139, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !206, file: !12, line: 103, baseType: !139, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !206, file: !12, line: 104, baseType: !68, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !206, file: !12, line: 105, baseType: !228, size: 32, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !206, file: !12, line: 105, baseType: !228, size: 32, offset: 416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !206, file: !12, line: 105, baseType: !228, size: 32, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !206, file: !12, line: 106, baseType: !50, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !206, file: !12, line: 107, baseType: !243, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!246 = !{!247}
!247 = !DISubrange(count: 5)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !52, file: !27, line: 113, baseType: !249, size: 320, offset: 3648)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !246)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!66, !50, !149}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !52, file: !27, line: 114, baseType: !254, size: 320, offset: 3968)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !246)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !52, file: !27, line: 115, baseType: !228, size: 32, offset: 4288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !52, file: !27, line: 120, baseType: !243, size: 64, offset: 4352)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !52, file: !27, line: 121, baseType: !228, size: 32, offset: 4416)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !259, line: 1451, baseType: !100)
!259 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!261 = !{!0}
!262 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/shell/ftn-custom/zdmshellf.c", directory: "/home/users/ndemeye/xSDK")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 25, size: 288, elements: !264)
!264 = !{!265, !267, !268, !269, !270, !271, !272, !273, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !263, file: !262, line: 26, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !27, line: 56, baseType: !56)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !263, file: !262, line: 27, baseType: !266, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !263, file: !262, line: 28, baseType: !266, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !263, file: !262, line: 29, baseType: !266, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !263, file: !262, line: 30, baseType: !266, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !263, file: !262, line: 31, baseType: !266, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !263, file: !262, line: 32, baseType: !266, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !263, file: !262, line: 33, baseType: !266, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !263, file: !262, line: 34, baseType: !266, size: 32, offset: 256)
!275 = !{i32 7, !"Dwarf Version", i32 4}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{i32 1, !"wchar_size", i32 4}
!278 = !{i32 7, !"PIC Level", i32 2}
!279 = !{i32 7, !"uwtable", i32 1}
!280 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!281 = distinct !DISubprogram(name: "dmshellsetcreatematrix_", scope: !262, file: !262, line: 82, type: !282, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !284, !289, !297}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !286, line: 14, baseType: !287)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !286, line: 14, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !284, !292, !297, !224}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !294, line: 16, baseType: !295)
!294 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !294, line: 16, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!298 = !{!299, !300, !301}
!299 = !DILocalVariable(name: "dm", arg: 1, scope: !281, file: !262, line: 82, type: !284)
!300 = !DILocalVariable(name: "func", arg: 2, scope: !281, file: !262, line: 82, type: !289)
!301 = !DILocalVariable(name: "ierr", arg: 3, scope: !281, file: !262, line: 82, type: !297)
!302 = !DILocation(line: 0, scope: !281)
!303 = !DILocation(line: 84, column: 54, scope: !281)
!304 = !{!305, !305, i64 0}
!305 = !{!"any pointer", !306, i64 0}
!306 = !{!"omnipotent char", !307, i64 0}
!307 = !{!"Simple C/C++ TBAA"}
!308 = !DILocation(line: 84, column: 107, scope: !281)
!309 = !DILocation(line: 84, column: 11, scope: !281)
!310 = !DILocation(line: 84, column: 9, scope: !281)
!311 = !{!312, !312, i64 0}
!312 = !{!"int", !306, i64 0}
!313 = !DILocation(line: 84, column: 141, scope: !314)
!314 = distinct !DILexicalBlock(scope: !281, file: !262, line: 84, column: 141)
!315 = !DILocation(line: 84, column: 141, scope: !281)
!316 = !DILocation(line: 85, column: 34, scope: !281)
!317 = !DILocation(line: 85, column: 11, scope: !281)
!318 = !DILocation(line: 85, column: 9, scope: !281)
!319 = !DILocation(line: 86, column: 1, scope: !281)
!320 = !DISubprogram(name: "PetscObjectSetFortranCallback", scope: !27, file: !27, line: 176, type: !321, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !324)
!321 = !DISubroutineType(types: !322)
!322 = !{!56, !51, !26, !323, !100, !149}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!324 = !{}
!325 = !DISubprogram(name: "DMShellSetCreateMatrix", scope: !326, file: !326, line: 21, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !324)
!326 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmshell.h", directory: "/home/users/ndemeye/xSDK")
!327 = !DISubroutineType(types: !328)
!328 = !{!56, !287, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!56, !287, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
