; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/gamg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/gamg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!437 = !DIEnumerator(name: "GRAPH_SQR", value: 5, isUnsigned: true)
!438 = !DIEnumerator(name: "SET4", value: 6, isUnsigned: true)
!439 = !DIEnumerator(name: "SET5", value: 7, isUnsigned: true)
!440 = !DIEnumerator(name: "SET6", value: 8, isUnsigned: true)
!441 = !DIEnumerator(name: "FIND_V", value: 9, isUnsigned: true)
!442 = !DIEnumerator(name: "SET7", value: 10, isUnsigned: true)
!443 = !DIEnumerator(name: "SET8", value: 11, isUnsigned: true)
!444 = !DIEnumerator(name: "SET9", value: 12, isUnsigned: true)
!445 = !DIEnumerator(name: "SET10", value: 13, isUnsigned: true)
!446 = !DIEnumerator(name: "SET11", value: 14, isUnsigned: true)
!447 = !DIEnumerator(name: "SET12", value: 15, isUnsigned: true)
!448 = !DIEnumerator(name: "SET13", value: 16, isUnsigned: true)
!449 = !DIEnumerator(name: "SET14", value: 17, isUnsigned: true)
!450 = !DIEnumerator(name: "SET15", value: 18, isUnsigned: true)
!451 = !DIEnumerator(name: "SET16", value: 19, isUnsigned: true)
!452 = !DIEnumerator(name: "NUM_SET", value: 20, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 132, baseType: !7, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIEnumerator(name: "PC_ASM_BASIC", value: 3, isUnsigned: true)
!456 = !DIEnumerator(name: "PC_ASM_RESTRICT", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "PC_ASM_INTERPOLATE", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "PC_ASM_NONE", value: 0, isUnsigned: true)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!462 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!463 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!464 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1189, baseType: !7, size: 32, elements: !465)
!465 = !{!466, !467, !468, !469}
!466 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!467 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!468 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!469 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!472 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!473 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!474 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!475 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!476 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!477 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!478 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!479 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!480 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!481 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!482 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!483 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!484 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!485 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!486 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!487 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!488 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!489 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 481, baseType: !74, size: 32, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500}
!495 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!496 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!497 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!498 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!499 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!500 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!504 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!505 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!506 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!507 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!508 = !{!509, !1875, !652, !572, !593, !569, !642, !74, !727, !522, !670, !1969, !618, !1987, !1990, !1991, !1988, !632, !1992, !679, !1993}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !511, line: 79, baseType: !512)
!511 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 53, size: 2240, elements: !513)
!513 = !{!514, !516, !518, !519, !521, !523, !524, !526, !527, !528, !529, !530, !531, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1869, !1870, !1874}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !512, file: !511, line: 54, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !297, line: 264, baseType: !400)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !512, file: !511, line: 55, baseType: !517, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !512, file: !511, line: 56, baseType: !517, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !512, file: !511, line: 57, baseType: !520, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !297, line: 297, baseType: !406)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !512, file: !511, line: 58, baseType: !522, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !512, file: !511, line: 60, baseType: !522, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !512, file: !511, line: 61, baseType: !525, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !297, line: 330, baseType: !413)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !512, file: !511, line: 62, baseType: !517, size: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !512, file: !511, line: 63, baseType: !517, size: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !512, file: !511, line: 64, baseType: !522, size: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !512, file: !511, line: 66, baseType: !522, size: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !512, file: !511, line: 68, baseType: !517, size: 32, offset: 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !512, file: !511, line: 69, baseType: !532, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !511, line: 48, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 14, size: 1600, elements: !536)
!536 = !{!537, !538, !539, !540, !544, !545, !546, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1857, !1858, !1859}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !535, file: !511, line: 15, baseType: !517, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !535, file: !511, line: 16, baseType: !517, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !535, file: !511, line: 17, baseType: !517, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !535, file: !511, line: 18, baseType: !541, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !535, file: !511, line: 19, baseType: !541, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !535, file: !511, line: 20, baseType: !541, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !535, file: !511, line: 21, baseType: !547, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !550, line: 436, size: 23424, elements: !551)
!550 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!551 = !{!552, !760, !1264, !1284, !1285, !1286, !1288, !1289, !1290, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1417, !1418, !1434, !1435, !1436, !1437, !1438, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1473, !1493, !1494, !1496, !1497, !1498, !1499, !1500, !1501, !1519, !1520}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !549, file: !550, line: 437, baseType: !553, size: 4480)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !554, line: 122, baseType: !555)
!554 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !554, line: 73, size: 4480, elements: !556)
!556 = !{!557, !559, !614, !615, !616, !619, !620, !621, !622, !630, !631, !633, !637, !641, !643, !644, !645, !646, !647, !648, !649, !650, !651, !653, !655, !656, !657, !659, !660, !662, !664, !665, !666, !667, !668, !671, !673, !674, !675, !676, !677, !680, !682, !683, !684, !694, !696, !697, !701, !702, !750, !755, !757, !758, !759}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !555, file: !554, line: 74, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !555, file: !554, line: 75, baseType: !560, size: 448, offset: 64)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 448, elements: !612)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !554, line: 53, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 45, size: 448, elements: !563)
!563 = !{!564, !576, !584, !589, !596, !600, !607}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !562, file: !554, line: 46, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !569, !571}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !573, line: 330, baseType: !574)
!573 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !573, line: 330, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !562, file: !554, line: 47, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!568, !569, !580}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !581, line: 16, baseType: !582)
!581 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !581, line: 16, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !562, file: !554, line: 48, baseType: !585, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!568, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !562, file: !554, line: 49, baseType: !590, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!568, !569, !593, !569}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !562, file: !554, line: 50, baseType: !597, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!568, !569, !593, !588}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !562, file: !554, line: 51, baseType: !601, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!568, !569, !593, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !562, file: !554, line: 52, baseType: !608, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!568, !569, !593, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!612 = !{!613}
!613 = !DISubrange(count: 1)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !555, file: !554, line: 76, baseType: !572, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !554, line: 77, baseType: !517, size: 32, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !555, file: !554, line: 78, baseType: !617, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !618)
!618 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !555, file: !554, line: 78, baseType: !617, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !555, file: !554, line: 78, baseType: !617, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !555, file: !554, line: 78, baseType: !617, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !555, file: !554, line: 79, baseType: !623, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !626, line: 27, baseType: !627)
!626 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !628, line: 43, baseType: !629)
!628 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!629 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !555, file: !554, line: 80, baseType: !517, size: 32, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !555, file: !554, line: 81, baseType: !632, size: 32, offset: 992)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !555, file: !554, line: 82, baseType: !634, size: 64, offset: 1024)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !555, file: !554, line: 83, baseType: !638, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !555, file: !554, line: 84, baseType: !642, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !555, file: !554, line: 85, baseType: !642, size: 64, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !555, file: !554, line: 86, baseType: !642, size: 64, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !555, file: !554, line: 87, baseType: !642, size: 64, offset: 1344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !555, file: !554, line: 88, baseType: !569, size: 64, offset: 1408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !555, file: !554, line: 89, baseType: !623, size: 64, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !554, line: 90, baseType: !642, size: 64, offset: 1536)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !555, file: !554, line: 91, baseType: !642, size: 64, offset: 1600)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !555, file: !554, line: 92, baseType: !517, size: 32, offset: 1664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !555, file: !554, line: 93, baseType: !652, size: 64, offset: 1728)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !555, file: !554, line: 94, baseType: !654, size: 64, offset: 1792)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !624)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !555, file: !554, line: 95, baseType: !517, size: 32, offset: 1856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !555, file: !554, line: 95, baseType: !517, size: 32, offset: 1888)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !555, file: !554, line: 96, baseType: !658, size: 64, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !555, file: !554, line: 96, baseType: !658, size: 64, offset: 1984)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !555, file: !554, line: 97, baseType: !661, size: 64, offset: 2048)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !555, file: !554, line: 97, baseType: !663, size: 64, offset: 2112)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !555, file: !554, line: 98, baseType: !517, size: 32, offset: 2176)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !555, file: !554, line: 98, baseType: !517, size: 32, offset: 2208)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !555, file: !554, line: 99, baseType: !658, size: 64, offset: 2240)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !555, file: !554, line: 99, baseType: !658, size: 64, offset: 2304)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !555, file: !554, line: 100, baseType: !669, size: 64, offset: 2368)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !618)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !555, file: !554, line: 100, baseType: !672, size: 64, offset: 2432)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !555, file: !554, line: 101, baseType: !517, size: 32, offset: 2496)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !555, file: !554, line: 101, baseType: !517, size: 32, offset: 2528)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !555, file: !554, line: 102, baseType: !658, size: 64, offset: 2560)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !555, file: !554, line: 102, baseType: !658, size: 64, offset: 2624)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !555, file: !554, line: 103, baseType: !678, size: 64, offset: 2688)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !670)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !555, file: !554, line: 103, baseType: !681, size: 64, offset: 2752)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !555, file: !554, line: 104, baseType: !611, size: 64, offset: 2816)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !555, file: !554, line: 105, baseType: !517, size: 32, offset: 2880)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !555, file: !554, line: 106, baseType: !685, size: 128, offset: 2944)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 128, elements: !692)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !554, line: 64, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 61, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !688, file: !554, line: 62, baseType: !604, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !688, file: !554, line: 63, baseType: !652, size: 64, offset: 64)
!692 = !{!693}
!693 = !DISubrange(count: 2)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !555, file: !554, line: 107, baseType: !695, size: 64, offset: 3072)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 64, elements: !692)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !555, file: !554, line: 108, baseType: !652, size: 64, offset: 3136)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !555, file: !554, line: 109, baseType: !698, size: 64, offset: 3200)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!568, !652}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !555, file: !554, line: 111, baseType: !517, size: 32, offset: 3264)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !555, file: !554, line: 112, baseType: !703, size: 320, offset: 3328)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 320, elements: !748)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!568, !707, !569, !652}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !710)
!710 = !{!711, !712, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !709, file: !12, line: 100, baseType: !517, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !12, line: 101, baseType: !713, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !724, !725, !726, !730, !731, !733, !734, !735}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !715, file: !12, line: 84, baseType: !642, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !715, file: !12, line: 85, baseType: !642, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !715, file: !12, line: 86, baseType: !652, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !715, file: !12, line: 87, baseType: !634, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !715, file: !12, line: 88, baseType: !722, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !715, file: !12, line: 89, baseType: !595, size: 8, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !715, file: !12, line: 90, baseType: !642, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !715, file: !12, line: 91, baseType: !727, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !728, line: 46, baseType: !729)
!728 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!729 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !715, file: !12, line: 92, baseType: !522, size: 32, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !12, line: 93, baseType: !732, size: 32, offset: 544)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !12, line: 94, baseType: !713, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !715, file: !12, line: 95, baseType: !642, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !715, file: !12, line: 96, baseType: !652, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !709, file: !12, line: 102, baseType: !642, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !709, file: !12, line: 102, baseType: !642, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !709, file: !12, line: 103, baseType: !642, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !709, file: !12, line: 104, baseType: !572, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !709, file: !12, line: 105, baseType: !522, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !709, file: !12, line: 105, baseType: !522, size: 32, offset: 416)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !709, file: !12, line: 105, baseType: !522, size: 32, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !709, file: !12, line: 106, baseType: !569, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !709, file: !12, line: 107, baseType: !745, size: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!748 = !{!749}
!749 = !DISubrange(count: 5)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !555, file: !554, line: 113, baseType: !751, size: 320, offset: 3648)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 320, elements: !748)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!568, !569, !652}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !555, file: !554, line: 114, baseType: !756, size: 320, offset: 3968)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 320, elements: !748)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !555, file: !554, line: 115, baseType: !522, size: 32, offset: 4288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !555, file: !554, line: 120, baseType: !745, size: 64, offset: 4352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !555, file: !554, line: 121, baseType: !522, size: 32, offset: 4416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !549, file: !550, line: 437, baseType: !761, size: 9472, offset: 4480)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 9472, elements: !612)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !550, line: 32, size: 9472, elements: !763)
!763 = !{!764, !773, !777, !778, !782, !786, !787, !788, !789, !790, !791, !792, !816, !820, !825, !831, !850, !855, !859, !860, !865, !870, !871, !876, !880, !884, !888, !892, !896, !897, !898, !899, !900, !904, !905, !910, !911, !912, !913, !914, !919, !926, !931, !935, !939, !943, !947, !948, !952, !953, !960, !965, !966, !967, !968, !1030, !1038, !1039, !1043, !1044, !1048, !1049, !1053, !1058, !1059, !1063, !1067, !1074, !1075, !1076, !1077, !1078, !1079, !1084, !1085, !1089, !1093, !1097, !1098, !1099, !1103, !1113, !1114, !1118, !1119, !1123, !1124, !1128, !1129, !1134, !1135, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1153, !1154, !1155, !1156, !1157, !1158, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1173, !1177, !1178, !1179, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1194, !1195, !1200, !1204, !1205, !1209, !1210, !1211, !1212, !1238, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253, !1254, !1258, !1262, !1263}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !762, file: !550, line: 34, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!568, !547, !517, !768, !517, !768, !770, !772}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !762, file: !550, line: 35, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!568, !547, !517, !661, !663, !681}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !762, file: !550, line: 36, baseType: !774, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !762, file: !550, line: 37, baseType: !779, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!568, !547, !541, !541}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !762, file: !550, line: 38, baseType: !783, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!568, !547, !541, !541, !541}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !762, file: !550, line: 40, baseType: !779, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !762, file: !550, line: 41, baseType: !783, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !762, file: !550, line: 42, baseType: !779, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !762, file: !550, line: 43, baseType: !783, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !762, file: !550, line: 44, baseType: !779, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !762, file: !550, line: 46, baseType: !783, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !762, file: !550, line: 47, baseType: !793, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!568, !547, !796, !796, !800}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !797, line: 11, baseType: !798)
!797 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !797, line: 11, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !803, file: !38, line: 1227, baseType: !670, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !803, file: !38, line: 1228, baseType: !670, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !803, file: !38, line: 1229, baseType: !670, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !803, file: !38, line: 1230, baseType: !670, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !803, file: !38, line: 1231, baseType: !670, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !803, file: !38, line: 1232, baseType: !670, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !803, file: !38, line: 1233, baseType: !670, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !803, file: !38, line: 1234, baseType: !670, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !803, file: !38, line: 1236, baseType: !670, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !803, file: !38, line: 1237, baseType: !670, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !803, file: !38, line: 1238, baseType: !670, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !762, file: !550, line: 48, baseType: !817, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!568, !547, !796, !800}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !762, file: !550, line: 49, baseType: !821, size: 64, offset: 832)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!568, !547, !541, !670, !824, !670, !517, !517, !541}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !762, file: !550, line: 50, baseType: !826, size: 64, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!568, !547, !829, !830}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !762, file: !550, line: 52, baseType: !832, size: 64, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!568, !547, !835, !836}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !838, file: !38, line: 593, baseType: !617, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !838, file: !38, line: 594, baseType: !617, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !838, file: !38, line: 594, baseType: !617, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !838, file: !38, line: 594, baseType: !617, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !838, file: !38, line: 595, baseType: !617, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !838, file: !38, line: 596, baseType: !617, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !838, file: !38, line: 597, baseType: !617, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !838, file: !38, line: 598, baseType: !617, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !838, file: !38, line: 598, baseType: !617, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !838, file: !38, line: 599, baseType: !617, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !762, file: !550, line: 53, baseType: !851, size: 64, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!568, !547, !547, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !762, file: !550, line: 54, baseType: !856, size: 64, offset: 1088)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!568, !547, !541}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !762, file: !550, line: 55, baseType: !779, size: 64, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !762, file: !550, line: 56, baseType: !861, size: 64, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!568, !547, !864, !669}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !762, file: !550, line: 58, baseType: !866, size: 64, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!568, !547, !869}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !762, file: !550, line: 59, baseType: !866, size: 64, offset: 1344)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !762, file: !550, line: 60, baseType: !872, size: 64, offset: 1408)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!568, !547, !875, !522}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !762, file: !550, line: 61, baseType: !877, size: 64, offset: 1472)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!568, !547}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !762, file: !550, line: 63, baseType: !881, size: 64, offset: 1536)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!568, !547, !517, !768, !679, !541, !541}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !762, file: !550, line: 64, baseType: !885, size: 64, offset: 1600)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!568, !547, !547, !796, !796, !800}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !762, file: !550, line: 65, baseType: !889, size: 64, offset: 1664)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!568, !547, !547, !800}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !762, file: !550, line: 66, baseType: !893, size: 64, offset: 1728)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!568, !547, !547, !796, !800}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !762, file: !550, line: 67, baseType: !889, size: 64, offset: 1792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !762, file: !550, line: 69, baseType: !877, size: 64, offset: 1856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !762, file: !550, line: 70, baseType: !885, size: 64, offset: 1920)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !762, file: !550, line: 71, baseType: !893, size: 64, offset: 1984)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !762, file: !550, line: 72, baseType: !901, size: 64, offset: 2048)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!568, !547, !830}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !762, file: !550, line: 73, baseType: !877, size: 64, offset: 2112)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !762, file: !550, line: 75, baseType: !906, size: 64, offset: 2176)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!568, !547, !909, !830}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !762, file: !550, line: 76, baseType: !779, size: 64, offset: 2240)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !762, file: !550, line: 77, baseType: !779, size: 64, offset: 2304)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !762, file: !550, line: 78, baseType: !793, size: 64, offset: 2368)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !762, file: !550, line: 79, baseType: !817, size: 64, offset: 2432)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !762, file: !550, line: 81, baseType: !915, size: 64, offset: 2496)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!568, !547, !679, !547, !918}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !762, file: !550, line: 82, baseType: !920, size: 64, offset: 2560)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!568, !547, !517, !923, !923, !829, !925}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !762, file: !550, line: 83, baseType: !927, size: 64, offset: 2624)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!568, !547, !517, !930, !517}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !762, file: !550, line: 84, baseType: !932, size: 64, offset: 2688)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!568, !547, !517, !768, !517, !768, !678}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !762, file: !550, line: 85, baseType: !936, size: 64, offset: 2752)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!568, !547, !547, !918}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !762, file: !550, line: 87, baseType: !940, size: 64, offset: 2816)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!568, !547, !541, !661}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !762, file: !550, line: 88, baseType: !944, size: 64, offset: 2880)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!568, !547, !679}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !762, file: !550, line: 89, baseType: !944, size: 64, offset: 2944)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !762, file: !550, line: 90, baseType: !949, size: 64, offset: 3008)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!568, !547, !541, !772}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !762, file: !550, line: 91, baseType: !881, size: 64, offset: 3072)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !762, file: !550, line: 93, baseType: !954, size: 64, offset: 3136)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!568, !547, !957}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !762, file: !550, line: 94, baseType: !961, size: 64, offset: 3200)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!568, !547, !517, !522, !522, !661, !964, !964, !854}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !762, file: !550, line: 95, baseType: !961, size: 64, offset: 3264)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !762, file: !550, line: 96, baseType: !961, size: 64, offset: 3328)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !762, file: !550, line: 97, baseType: !961, size: 64, offset: 3392)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !762, file: !550, line: 99, baseType: !969, size: 64, offset: 3456)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!568, !547, !972, !975}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !797, line: 51, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !797, line: 51, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !550, line: 609, size: 6208, elements: !978)
!978 = !{!979, !980, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !999, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !977, file: !550, line: 610, baseType: !553, size: 4480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !977, file: !550, line: 610, baseType: !981, size: 32, offset: 4480)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !612)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !977, file: !550, line: 611, baseType: !517, size: 32, offset: 4512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !977, file: !550, line: 611, baseType: !517, size: 32, offset: 4544)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !977, file: !550, line: 611, baseType: !517, size: 32, offset: 4576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !977, file: !550, line: 612, baseType: !517, size: 32, offset: 4608)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !977, file: !550, line: 613, baseType: !517, size: 32, offset: 4640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !977, file: !550, line: 614, baseType: !661, size: 64, offset: 4672)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !977, file: !550, line: 615, baseType: !663, size: 64, offset: 4736)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !977, file: !550, line: 616, baseType: !930, size: 64, offset: 4800)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !977, file: !550, line: 617, baseType: !661, size: 64, offset: 4864)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !977, file: !550, line: 618, baseType: !992, size: 64, offset: 4928)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !550, line: 602, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 598, size: 128, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !994, file: !550, line: 599, baseType: !517, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !994, file: !550, line: 600, baseType: !517, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !994, file: !550, line: 601, baseType: !678, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !977, file: !550, line: 619, baseType: !1000, size: 64, offset: 4992)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !550, line: 607, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 604, size: 128, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1002, file: !550, line: 605, baseType: !517, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1002, file: !550, line: 606, baseType: !678, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !977, file: !550, line: 620, baseType: !678, size: 64, offset: 5056)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !977, file: !550, line: 621, baseType: !670, size: 64, offset: 5120)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !977, file: !550, line: 622, baseType: !670, size: 64, offset: 5184)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !977, file: !550, line: 623, baseType: !541, size: 64, offset: 5248)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !977, file: !550, line: 623, baseType: !541, size: 64, offset: 5312)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !977, file: !550, line: 623, baseType: !541, size: 64, offset: 5376)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !977, file: !550, line: 624, baseType: !522, size: 32, offset: 5440)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !977, file: !550, line: 625, baseType: !1014, size: 64, offset: 5504)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!568}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !977, file: !550, line: 626, baseType: !652, size: 64, offset: 5568)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !977, file: !550, line: 627, baseType: !541, size: 64, offset: 5632)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !977, file: !550, line: 628, baseType: !517, size: 32, offset: 5696)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !977, file: !550, line: 629, baseType: !593, size: 64, offset: 5760)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !977, file: !550, line: 630, baseType: !1022, size: 32, offset: 5824)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !977, file: !550, line: 631, baseType: !517, size: 32, offset: 5856)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !977, file: !550, line: 631, baseType: !517, size: 32, offset: 5888)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !977, file: !550, line: 632, baseType: !522, size: 32, offset: 5920)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !977, file: !550, line: 633, baseType: !522, size: 32, offset: 5952)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !977, file: !550, line: 634, baseType: !604, size: 64, offset: 6016)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !977, file: !550, line: 634, baseType: !652, size: 64, offset: 6080)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !977, file: !550, line: 635, baseType: !623, size: 64, offset: 6144)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !762, file: !550, line: 100, baseType: !1031, size: 64, offset: 3520)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!568, !547, !517, !517, !1034, !1037}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !1036)
!1036 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !762, file: !550, line: 101, baseType: !877, size: 64, offset: 3584)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !762, file: !550, line: 102, baseType: !1040, size: 64, offset: 3648)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!568, !547, !796, !796, !830}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !762, file: !550, line: 103, baseType: !765, size: 64, offset: 3712)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !762, file: !550, line: 105, baseType: !1045, size: 64, offset: 3776)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!568, !547, !796, !796, !829, !830}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !762, file: !550, line: 106, baseType: !877, size: 64, offset: 3840)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !762, file: !550, line: 107, baseType: !1050, size: 64, offset: 3904)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!568, !547, !580}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !762, file: !550, line: 108, baseType: !1054, size: 64, offset: 3968)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!568, !547, !1057, !829, !830}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !593)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !762, file: !550, line: 109, baseType: !1014, size: 64, offset: 4032)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !762, file: !550, line: 111, baseType: !1060, size: 64, offset: 4096)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!568, !547, !547, !547, !670, !547}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !762, file: !550, line: 112, baseType: !1064, size: 64, offset: 4160)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!568, !547, !547, !547, !547}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !762, file: !550, line: 113, baseType: !1068, size: 64, offset: 4224)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!568, !547, !1071, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !797, line: 30, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !797, line: 30, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !762, file: !550, line: 114, baseType: !765, size: 64, offset: 4288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !762, file: !550, line: 115, baseType: !881, size: 64, offset: 4352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !762, file: !550, line: 117, baseType: !940, size: 64, offset: 4416)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !762, file: !550, line: 118, baseType: !940, size: 64, offset: 4480)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !762, file: !550, line: 119, baseType: !1054, size: 64, offset: 4544)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !762, file: !550, line: 120, baseType: !1080, size: 64, offset: 4608)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!568, !547, !1083, !854}
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !762, file: !550, line: 121, baseType: !1014, size: 64, offset: 4672)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !762, file: !550, line: 123, baseType: !1086, size: 64, offset: 4736)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!568, !547, !517, !652}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !762, file: !550, line: 124, baseType: !1090, size: 64, offset: 4800)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!568, !547, !975, !541, !652}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !762, file: !550, line: 125, baseType: !1094, size: 64, offset: 4864)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!568, !707, !547}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !762, file: !550, line: 126, baseType: !779, size: 64, offset: 4928)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !762, file: !550, line: 127, baseType: !779, size: 64, offset: 4992)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !762, file: !550, line: 129, baseType: !1100, size: 64, offset: 5056)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!568, !547, !930}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !762, file: !550, line: 130, baseType: !1104, size: 64, offset: 5120)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!568, !547, !1107, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1109, file: !62, line: 653, baseType: !517, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1109, file: !62, line: 653, baseType: !541, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !762, file: !550, line: 131, baseType: !1104, size: 64, offset: 5184)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !762, file: !550, line: 132, baseType: !1115, size: 64, offset: 5248)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!568, !547, !661, !661, !661}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !762, file: !550, line: 133, baseType: !1050, size: 64, offset: 5312)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !762, file: !550, line: 135, baseType: !1120, size: 64, offset: 5376)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!568, !547, !670, !854}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !762, file: !550, line: 136, baseType: !1120, size: 64, offset: 5440)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !762, file: !550, line: 137, baseType: !1125, size: 64, offset: 5504)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!568, !547, !854}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !762, file: !550, line: 138, baseType: !765, size: 64, offset: 5568)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !762, file: !550, line: 139, baseType: !1130, size: 64, offset: 5632)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!568, !547, !1133, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !762, file: !550, line: 141, baseType: !1014, size: 64, offset: 5696)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !762, file: !550, line: 142, baseType: !1136, size: 64, offset: 5760)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!568, !547, !547, !670, !547}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !762, file: !550, line: 143, baseType: !1140, size: 64, offset: 5824)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!568, !547, !547, !547}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !762, file: !550, line: 144, baseType: !1014, size: 64, offset: 5888)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !762, file: !550, line: 145, baseType: !1136, size: 64, offset: 5952)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !762, file: !550, line: 147, baseType: !1140, size: 64, offset: 6016)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !762, file: !550, line: 148, baseType: !1014, size: 64, offset: 6080)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !762, file: !550, line: 149, baseType: !1136, size: 64, offset: 6144)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !762, file: !550, line: 150, baseType: !1140, size: 64, offset: 6208)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !762, file: !550, line: 151, baseType: !1150, size: 64, offset: 6272)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!568, !547, !522}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !762, file: !550, line: 153, baseType: !877, size: 64, offset: 6336)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !762, file: !550, line: 154, baseType: !877, size: 64, offset: 6400)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !762, file: !550, line: 155, baseType: !877, size: 64, offset: 6464)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !762, file: !550, line: 156, baseType: !877, size: 64, offset: 6528)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !762, file: !550, line: 157, baseType: !1050, size: 64, offset: 6592)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !762, file: !550, line: 159, baseType: !1159, size: 64, offset: 6656)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!568, !547, !517, !770}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !762, file: !550, line: 160, baseType: !877, size: 64, offset: 6720)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !762, file: !550, line: 161, baseType: !877, size: 64, offset: 6784)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !762, file: !550, line: 162, baseType: !877, size: 64, offset: 6848)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !762, file: !550, line: 163, baseType: !877, size: 64, offset: 6912)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !762, file: !550, line: 165, baseType: !1140, size: 64, offset: 6976)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !762, file: !550, line: 166, baseType: !1140, size: 64, offset: 7040)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !762, file: !550, line: 167, baseType: !940, size: 64, offset: 7104)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !762, file: !550, line: 168, baseType: !1170, size: 64, offset: 7168)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!568, !547, !541, !517}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !762, file: !550, line: 169, baseType: !1174, size: 64, offset: 7232)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!568, !547, !854, !661}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !762, file: !550, line: 171, baseType: !901, size: 64, offset: 7296)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !762, file: !550, line: 172, baseType: !877, size: 64, offset: 7360)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !762, file: !550, line: 173, baseType: !1180, size: 64, offset: 7424)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!568, !547, !661, !964}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !762, file: !550, line: 174, baseType: !1040, size: 64, offset: 7488)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !762, file: !550, line: 175, baseType: !1040, size: 64, offset: 7552)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !762, file: !550, line: 177, baseType: !779, size: 64, offset: 7616)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !762, file: !550, line: 178, baseType: !826, size: 64, offset: 7680)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !762, file: !550, line: 179, baseType: !779, size: 64, offset: 7744)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !762, file: !550, line: 180, baseType: !783, size: 64, offset: 7808)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !762, file: !550, line: 181, baseType: !1190, size: 64, offset: 7872)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!568, !547, !572, !829, !830}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !762, file: !550, line: 183, baseType: !1100, size: 64, offset: 7936)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !762, file: !550, line: 184, baseType: !861, size: 64, offset: 8000)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !762, file: !550, line: 185, baseType: !1196, size: 64, offset: 8064)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!568, !547, !1199}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !762, file: !550, line: 186, baseType: !1201, size: 64, offset: 8128)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!568, !547, !517, !768, !678}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !762, file: !550, line: 187, baseType: !920, size: 64, offset: 8192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !762, file: !550, line: 189, baseType: !1206, size: 64, offset: 8256)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!568, !547, !517, !517, !661, !770}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !762, file: !550, line: 190, baseType: !1014, size: 64, offset: 8320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !762, file: !550, line: 191, baseType: !1136, size: 64, offset: 8384)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !762, file: !550, line: 192, baseType: !1140, size: 64, offset: 8448)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !762, file: !550, line: 193, baseType: !1213, size: 64, offset: 8512)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!568, !547, !972, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !550, line: 660, size: 5312, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1218, file: !550, line: 661, baseType: !553, size: 4480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1218, file: !550, line: 661, baseType: !981, size: 32, offset: 4480)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1218, file: !550, line: 662, baseType: !517, size: 32, offset: 4512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1218, file: !550, line: 662, baseType: !517, size: 32, offset: 4544)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1218, file: !550, line: 662, baseType: !517, size: 32, offset: 4576)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1218, file: !550, line: 663, baseType: !517, size: 32, offset: 4608)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1218, file: !550, line: 664, baseType: !517, size: 32, offset: 4640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1218, file: !550, line: 665, baseType: !661, size: 64, offset: 4672)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1218, file: !550, line: 666, baseType: !661, size: 64, offset: 4736)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1218, file: !550, line: 667, baseType: !517, size: 32, offset: 4800)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1218, file: !550, line: 668, baseType: !1022, size: 32, offset: 4832)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1218, file: !550, line: 670, baseType: !661, size: 64, offset: 4864)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1218, file: !550, line: 670, baseType: !661, size: 64, offset: 4928)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1218, file: !550, line: 671, baseType: !661, size: 64, offset: 4992)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1218, file: !550, line: 672, baseType: !661, size: 64, offset: 5056)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1218, file: !550, line: 673, baseType: !661, size: 64, offset: 5120)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1218, file: !550, line: 674, baseType: !517, size: 32, offset: 5184)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1218, file: !550, line: 675, baseType: !661, size: 64, offset: 5248)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !762, file: !550, line: 195, baseType: !1239, size: 64, offset: 8576)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!568, !1216, !547, !547}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !762, file: !550, line: 196, baseType: !1239, size: 64, offset: 8640)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !762, file: !550, line: 197, baseType: !1014, size: 64, offset: 8704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !762, file: !550, line: 198, baseType: !1136, size: 64, offset: 8768)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !762, file: !550, line: 199, baseType: !1140, size: 64, offset: 8832)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !762, file: !550, line: 201, baseType: !1247, size: 64, offset: 8896)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!568, !547, !517, !517}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !762, file: !550, line: 202, baseType: !915, size: 64, offset: 8960)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !762, file: !550, line: 203, baseType: !783, size: 64, offset: 9024)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !762, file: !550, line: 204, baseType: !969, size: 64, offset: 9088)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !762, file: !550, line: 205, baseType: !1100, size: 64, offset: 9152)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !762, file: !550, line: 206, baseType: !1255, size: 64, offset: 9216)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!568, !572, !547, !517, !829, !830}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !762, file: !550, line: 208, baseType: !1259, size: 64, offset: 9280)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!568, !517, !925}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !762, file: !550, line: 209, baseType: !1140, size: 64, offset: 9344)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !762, file: !550, line: 210, baseType: !932, size: 64, offset: 9408)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !549, file: !550, line: 438, baseType: !1265, size: 64, offset: 13952)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !797, line: 60, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1267, file: !116, line: 241, baseType: !572, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1267, file: !116, line: 242, baseType: !632, size: 32, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1267, file: !116, line: 243, baseType: !517, size: 32, offset: 96)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1267, file: !116, line: 243, baseType: !517, size: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1267, file: !116, line: 244, baseType: !517, size: 32, offset: 160)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1267, file: !116, line: 244, baseType: !517, size: 32, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1267, file: !116, line: 245, baseType: !661, size: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1267, file: !116, line: 246, baseType: !522, size: 32, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1267, file: !116, line: 247, baseType: !517, size: 32, offset: 352)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1267, file: !116, line: 251, baseType: !517, size: 32, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1267, file: !116, line: 252, baseType: !1071, size: 64, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1267, file: !116, line: 253, baseType: !522, size: 32, offset: 512)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1267, file: !116, line: 254, baseType: !517, size: 32, offset: 544)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1267, file: !116, line: 254, baseType: !517, size: 32, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1267, file: !116, line: 255, baseType: !517, size: 32, offset: 608)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !549, file: !550, line: 438, baseType: !1265, size: 64, offset: 14016)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !549, file: !550, line: 439, baseType: !652, size: 64, offset: 14080)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !549, file: !550, line: 440, baseType: !1287, size: 32, offset: 14144)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !549, file: !550, line: 441, baseType: !522, size: 32, offset: 14176)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !549, file: !550, line: 442, baseType: !522, size: 32, offset: 14208)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !549, file: !550, line: 443, baseType: !1291, size: 448, offset: 14272)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 448, elements: !1293)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !593)
!1293 = !{!1294}
!1294 = !DISubrange(count: 7)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !549, file: !550, line: 444, baseType: !522, size: 32, offset: 14720)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !549, file: !550, line: 445, baseType: !522, size: 32, offset: 14752)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !549, file: !550, line: 446, baseType: !517, size: 32, offset: 14784)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !549, file: !550, line: 447, baseType: !654, size: 64, offset: 14848)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !549, file: !550, line: 448, baseType: !654, size: 64, offset: 14912)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !549, file: !550, line: 449, baseType: !837, size: 640, offset: 14976)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !549, file: !550, line: 450, baseType: !772, size: 32, offset: 15616)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !549, file: !550, line: 451, baseType: !1303, size: 2880, offset: 15680)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !550, line: 318, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !550, line: 319, size: 2880, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310, !1311, !1312, !1325, !1326, !1331, !1336, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1351, !1352, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1384, !1385, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1408, !1409, !1410, !1414, !1415}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1304, file: !550, line: 320, baseType: !517, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1304, file: !550, line: 321, baseType: !517, size: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1304, file: !550, line: 322, baseType: !517, size: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1304, file: !550, line: 323, baseType: !517, size: 32, offset: 96)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1304, file: !550, line: 324, baseType: !517, size: 32, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1304, file: !550, line: 325, baseType: !517, size: 32, offset: 160)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1304, file: !550, line: 326, baseType: !1313, size: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !550, line: 293, baseType: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !550, line: 295, size: 448, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1315, file: !550, line: 296, baseType: !1313, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1315, file: !550, line: 297, baseType: !678, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1315, file: !550, line: 297, baseType: !678, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1315, file: !550, line: 298, baseType: !661, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1315, file: !550, line: 298, baseType: !661, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1315, file: !550, line: 299, baseType: !517, size: 32, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1315, file: !550, line: 300, baseType: !517, size: 32, offset: 352)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1315, file: !550, line: 301, baseType: !517, size: 32, offset: 384)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1304, file: !550, line: 326, baseType: !1313, size: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1304, file: !550, line: 328, baseType: !1327, size: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!568, !547, !1330, !661}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1304, file: !550, line: 329, baseType: !1332, size: 64, offset: 384)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!568, !1330, !1335, !663, !663, !681, !661}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1304, file: !550, line: 330, baseType: !1337, size: 64, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!568, !1330}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1304, file: !550, line: 331, baseType: !1337, size: 64, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1304, file: !550, line: 334, baseType: !572, size: 64, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1304, file: !550, line: 335, baseType: !632, size: 32, offset: 640)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1304, file: !550, line: 335, baseType: !632, size: 32, offset: 672)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1304, file: !550, line: 336, baseType: !632, size: 32, offset: 704)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1304, file: !550, line: 336, baseType: !632, size: 32, offset: 736)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1304, file: !550, line: 337, baseType: !1347, size: 64, offset: 768)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !573, line: 339, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !573, line: 339, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1304, file: !550, line: 338, baseType: !1347, size: 64, offset: 832)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1304, file: !550, line: 339, baseType: !1353, size: 64, offset: 896)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !573, line: 341, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !573, line: 351, size: 192, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1355, file: !573, line: 354, baseType: !74, size: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1355, file: !573, line: 355, baseType: !74, size: 32, offset: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1355, file: !573, line: 356, baseType: !74, size: 32, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1355, file: !573, line: 361, baseType: !74, size: 32, offset: 96)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1355, file: !573, line: 362, baseType: !727, size: 64, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1304, file: !550, line: 340, baseType: !517, size: 32, offset: 960)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1304, file: !550, line: 340, baseType: !517, size: 32, offset: 992)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1304, file: !550, line: 341, baseType: !678, size: 64, offset: 1024)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1304, file: !550, line: 342, baseType: !661, size: 64, offset: 1088)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1304, file: !550, line: 343, baseType: !681, size: 64, offset: 1152)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1304, file: !550, line: 344, baseType: !663, size: 64, offset: 1216)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1304, file: !550, line: 345, baseType: !517, size: 32, offset: 1280)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1304, file: !550, line: 346, baseType: !1335, size: 64, offset: 1344)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1304, file: !550, line: 347, baseType: !522, size: 32, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1304, file: !550, line: 348, baseType: !517, size: 32, offset: 1440)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1304, file: !550, line: 351, baseType: !522, size: 32, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1304, file: !550, line: 352, baseType: !522, size: 32, offset: 1504)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1304, file: !550, line: 353, baseType: !632, size: 32, offset: 1536)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1304, file: !550, line: 354, baseType: !632, size: 32, offset: 1568)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1304, file: !550, line: 355, baseType: !1335, size: 64, offset: 1600)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1304, file: !550, line: 356, baseType: !1335, size: 64, offset: 1664)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1304, file: !550, line: 357, baseType: !1379, size: 64, offset: 1728)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !550, line: 310, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 308, size: 32, elements: !1382)
!1382 = !{!1383}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1381, file: !550, line: 309, baseType: !517, size: 32)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1304, file: !550, line: 357, baseType: !1379, size: 64, offset: 1792)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1304, file: !550, line: 358, baseType: !1386, size: 64, offset: 1856)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !550, line: 316, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 312, size: 128, elements: !1389)
!1389 = !{!1390, !1391, !1392}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1388, file: !550, line: 313, baseType: !652, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1388, file: !550, line: 314, baseType: !517, size: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1388, file: !550, line: 315, baseType: !595, size: 8, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1304, file: !550, line: 359, baseType: !1386, size: 64, offset: 1920)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1304, file: !550, line: 360, baseType: !1386, size: 64, offset: 1984)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1304, file: !550, line: 361, baseType: !517, size: 32, offset: 2048)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1304, file: !550, line: 362, baseType: !632, size: 32, offset: 2080)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1304, file: !550, line: 363, baseType: !517, size: 32, offset: 2112)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1304, file: !550, line: 364, baseType: !1335, size: 64, offset: 2176)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1304, file: !550, line: 365, baseType: !1353, size: 64, offset: 2240)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1304, file: !550, line: 366, baseType: !632, size: 32, offset: 2304)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1304, file: !550, line: 367, baseType: !632, size: 32, offset: 2336)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1304, file: !550, line: 368, baseType: !1347, size: 64, offset: 2368)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1304, file: !550, line: 369, baseType: !1347, size: 64, offset: 2432)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1304, file: !550, line: 370, baseType: !1405, size: 64, offset: 2496)
