; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snespc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snespc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 624, baseType: !5, size: 32, elements: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 155, baseType: !5, size: 32, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!113 = !{!114, !117, !118, !203, !26, !153}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !121, line: 73, size: 4480, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !125, !174, !175, !177, !180, !181, !182, !183, !191, !192, !194, !198, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !215, !216, !217, !219, !220, !222, !224, !225, !226, !227, !228, !231, !233, !234, !235, !236, !237, !240, !242, !243, !244, !254, !256, !257, !261, !262, !311, !316, !318, !319, !320}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !120, file: !121, line: 74, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !120, file: !121, line: 75, baseType: !126, size: 448, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 448, elements: !172)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !121, line: 53, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 45, size: 448, elements: !129)
!129 = !{!130, !136, !144, !149, !156, !160, !167}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !128, file: !121, line: 46, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !118, !135}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !128, file: !121, line: 47, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!134, !118, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !141, line: 16, baseType: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !141, line: 16, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !128, file: !121, line: 48, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!134, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !128, file: !121, line: 49, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!134, !118, !153, !118}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !128, file: !121, line: 50, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!134, !118, !153, !148}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !128, file: !121, line: 51, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!134, !118, !153, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !128, file: !121, line: 52, baseType: !168, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!134, !118, !153, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !120, file: !121, line: 76, baseType: !114, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !121, line: 77, baseType: !176, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !179)
!179 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !121, line: 79, baseType: !184, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !187, line: 27, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !189, line: 43, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!190 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !120, file: !121, line: 80, baseType: !176, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !120, file: !121, line: 81, baseType: !193, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !120, file: !121, line: 82, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !120, file: !121, line: 83, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !120, file: !121, line: 84, baseType: !203, size: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !120, file: !121, line: 85, baseType: !203, size: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !120, file: !121, line: 86, baseType: !203, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !120, file: !121, line: 87, baseType: !203, size: 64, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !120, file: !121, line: 88, baseType: !118, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !120, file: !121, line: 89, baseType: !184, size: 64, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !121, line: 90, baseType: !203, size: 64, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !120, file: !121, line: 91, baseType: !203, size: 64, offset: 1600)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !120, file: !121, line: 92, baseType: !176, size: 32, offset: 1664)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !120, file: !121, line: 93, baseType: !117, size: 64, offset: 1728)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !121, line: 94, baseType: !214, size: 64, offset: 1792)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !185)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !120, file: !121, line: 95, baseType: !176, size: 32, offset: 1856)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !120, file: !121, line: 95, baseType: !176, size: 32, offset: 1888)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !120, file: !121, line: 96, baseType: !218, size: 64, offset: 1920)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !120, file: !121, line: 96, baseType: !218, size: 64, offset: 1984)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !120, file: !121, line: 97, baseType: !221, size: 64, offset: 2048)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !120, file: !121, line: 97, baseType: !223, size: 64, offset: 2112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !120, file: !121, line: 98, baseType: !176, size: 32, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !120, file: !121, line: 98, baseType: !176, size: 32, offset: 2208)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !120, file: !121, line: 99, baseType: !218, size: 64, offset: 2240)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !120, file: !121, line: 99, baseType: !218, size: 64, offset: 2304)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !120, file: !121, line: 100, baseType: !229, size: 64, offset: 2368)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !179)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !120, file: !121, line: 100, baseType: !232, size: 64, offset: 2432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !120, file: !121, line: 101, baseType: !176, size: 32, offset: 2496)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !120, file: !121, line: 101, baseType: !176, size: 32, offset: 2528)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !120, file: !121, line: 102, baseType: !218, size: 64, offset: 2560)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !120, file: !121, line: 102, baseType: !218, size: 64, offset: 2624)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !120, file: !121, line: 103, baseType: !238, size: 64, offset: 2688)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !230)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !120, file: !121, line: 103, baseType: !241, size: 64, offset: 2752)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !120, file: !121, line: 104, baseType: !171, size: 64, offset: 2816)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !120, file: !121, line: 105, baseType: !176, size: 32, offset: 2880)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !120, file: !121, line: 106, baseType: !245, size: 128, offset: 2944)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, elements: !252)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !121, line: 64, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 61, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !248, file: !121, line: 62, baseType: !164, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !248, file: !121, line: 63, baseType: !117, size: 64, offset: 64)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !120, file: !121, line: 107, baseType: !255, size: 64, offset: 3072)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !252)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !120, file: !121, line: 108, baseType: !117, size: 64, offset: 3136)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !120, file: !121, line: 109, baseType: !258, size: 64, offset: 3200)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!134, !117}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !120, file: !121, line: 111, baseType: !176, size: 32, offset: 3264)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !120, file: !121, line: 112, baseType: !263, size: 320, offset: 3328)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !309)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!134, !267, !118, !117}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !270)
!270 = !{!271, !272, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !269, file: !10, line: 100, baseType: !176, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !10, line: 101, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !284, !285, !286, !290, !292, !294, !295, !296}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !275, file: !10, line: 84, baseType: !203, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !275, file: !10, line: 85, baseType: !203, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !10, line: 86, baseType: !117, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !275, file: !10, line: 87, baseType: !195, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !275, file: !10, line: 88, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !275, file: !10, line: 89, baseType: !155, size: 8, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !275, file: !10, line: 90, baseType: !203, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !275, file: !10, line: 91, baseType: !287, size: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !288, line: 46, baseType: !289)
!288 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!289 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !275, file: !10, line: 92, baseType: !291, size: 32, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !10, line: 93, baseType: !293, size: 32, offset: 544)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !10, line: 94, baseType: !273, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !275, file: !10, line: 95, baseType: !203, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !275, file: !10, line: 96, baseType: !117, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !269, file: !10, line: 102, baseType: !203, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !269, file: !10, line: 102, baseType: !203, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !269, file: !10, line: 103, baseType: !203, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !269, file: !10, line: 104, baseType: !114, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !269, file: !10, line: 106, baseType: !118, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !269, file: !10, line: 107, baseType: !306, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!309 = !{!310}
!310 = !DISubrange(count: 5)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !120, file: !121, line: 113, baseType: !312, size: 320, offset: 3648)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !309)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!134, !118, !117}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !120, file: !121, line: 114, baseType: !317, size: 320, offset: 3968)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 320, elements: !309)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !120, file: !121, line: 115, baseType: !291, size: 32, offset: 4288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !120, file: !121, line: 120, baseType: !306, size: 64, offset: 4352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !120, file: !121, line: 121, baseType: !291, size: 32, offset: 4416)
!321 = !{i32 7, !"Dwarf Version", i32 4}
!322 = !{i32 2, !"Debug Info Version", i32 3}
!323 = !{i32 1, !"wchar_size", i32 4}
!324 = !{i32 7, !"PIC Level", i32 2}
!325 = !{i32 7, !"uwtable", i32 1}
!326 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!327 = distinct !DISubprogram(name: "SNESApplyNPC", scope: !328, file: !328, line: 25, type: !329, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !520)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snespc.c", directory: "/home/users/ndemeye/xSDK")
!329 = !DISubroutineType(types: !330)
!330 = !{!134, !331, !346, !346, !346}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !334, line: 38, size: 11648, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !338, !404, !409, !410, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !427, !431, !432, !434, !435, !436, !437, !438, !443, !445, !446, !447, !448, !449, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !485, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !333, file: !334, line: 39, baseType: !337, size: 4480)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !121, line: 122, baseType: !120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !333, file: !334, line: 39, baseType: !339, size: 1088, offset: 4480)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 1088, elements: !172)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !334, line: 12, size: 1088, elements: !341)
!341 = !{!342, !349, !353, !357, !363, !364, !368, !369, !373, !377, !378, !379, !384, !388, !392, !396, !403}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !340, file: !334, line: 13, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!134, !331, !346, !117}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !106, line: 21, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !106, line: 21, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !340, file: !334, line: 14, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!134, !346, !346, !117}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !340, file: !334, line: 15, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!134, !331, !176}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !340, file: !334, line: 16, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!134, !331, !176, !230, !230, !230, !361, !117}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !340, file: !334, line: 17, baseType: !258, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !340, file: !334, line: 18, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!134, !331}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !340, file: !334, line: 19, baseType: !365, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !340, file: !334, line: 20, baseType: !370, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!134, !331, !140}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !340, file: !334, line: 21, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!134, !267, !331}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !340, file: !334, line: 22, baseType: !365, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !340, file: !334, line: 23, baseType: !365, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !340, file: !334, line: 24, baseType: !380, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!134, !331, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !340, file: !334, line: 25, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!134, !383}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !340, file: !334, line: 26, baseType: !389, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!134, !331, !346, !346}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !340, file: !334, line: 27, baseType: !393, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!134, !331, !346, !346, !117}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !340, file: !334, line: 28, baseType: !397, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!134, !331, !346, !400, !400, !117}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !340, file: !334, line: 29, baseType: !370, size: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !333, file: !334, line: 40, baseType: !405, size: 64, offset: 5568)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !406, line: 14, baseType: !407)
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !406, line: 14, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !333, file: !334, line: 41, baseType: !291, size: 32, offset: 5632)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !333, file: !334, line: 42, baseType: !331, size: 64, offset: 5696)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !333, file: !334, line: 43, baseType: !412, size: 32, offset: 5760)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !333, file: !334, line: 44, baseType: !291, size: 32, offset: 5792)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !333, file: !334, line: 47, baseType: !117, size: 64, offset: 5824)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !333, file: !334, line: 49, baseType: !346, size: 64, offset: 5888)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !333, file: !334, line: 50, baseType: !346, size: 64, offset: 5952)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !333, file: !334, line: 52, baseType: !346, size: 64, offset: 6016)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !333, file: !334, line: 54, baseType: !400, size: 64, offset: 6080)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !333, file: !334, line: 55, baseType: !400, size: 64, offset: 6144)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !333, file: !334, line: 56, baseType: !400, size: 64, offset: 6208)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !333, file: !334, line: 57, baseType: !117, size: 64, offset: 6272)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !333, file: !334, line: 58, baseType: !423, size: 64, offset: 6336)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !424, line: 22, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !424, line: 22, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !333, file: !334, line: 59, baseType: !428, size: 64, offset: 6400)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !333, file: !334, line: 60, baseType: !291, size: 32, offset: 6464)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !333, file: !334, line: 61, baseType: !433, size: 32, offset: 6496)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !333, file: !334, line: 63, baseType: !346, size: 64, offset: 6528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !333, file: !334, line: 65, baseType: !346, size: 64, offset: 6592)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !333, file: !334, line: 66, baseType: !117, size: 64, offset: 6656)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !333, file: !334, line: 68, baseType: !230, size: 64, offset: 6720)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !333, file: !334, line: 74, baseType: !439, size: 320, offset: 6784)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 320, elements: !309)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!134, !331, !176, !230, !117}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !333, file: !334, line: 75, baseType: !444, size: 320, offset: 7104)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 320, elements: !309)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !333, file: !334, line: 76, baseType: !317, size: 320, offset: 7424)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !333, file: !334, line: 77, baseType: !176, size: 32, offset: 7744)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !333, file: !334, line: 78, baseType: !117, size: 64, offset: 7808)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !333, file: !334, line: 79, baseType: !362, size: 32, offset: 7872)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !333, file: !334, line: 80, baseType: !450, size: 320, offset: 7936)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 320, elements: !309)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!134, !331, !117}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !333, file: !334, line: 81, baseType: !444, size: 320, offset: 8256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !333, file: !334, line: 82, baseType: !317, size: 320, offset: 8576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !333, file: !334, line: 83, baseType: !176, size: 32, offset: 8896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !333, file: !334, line: 84, baseType: !291, size: 32, offset: 8928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !333, file: !334, line: 88, baseType: !291, size: 32, offset: 8960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !334, line: 89, baseType: !117, size: 64, offset: 9024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !333, file: !334, line: 93, baseType: !176, size: 32, offset: 9088)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !333, file: !334, line: 94, baseType: !176, size: 32, offset: 9120)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !333, file: !334, line: 95, baseType: !176, size: 32, offset: 9152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !333, file: !334, line: 96, baseType: !176, size: 32, offset: 9184)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !333, file: !334, line: 97, baseType: !176, size: 32, offset: 9216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !333, file: !334, line: 98, baseType: !230, size: 64, offset: 9280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !333, file: !334, line: 99, baseType: !230, size: 64, offset: 9344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !333, file: !334, line: 100, baseType: !230, size: 64, offset: 9408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !333, file: !334, line: 101, baseType: !230, size: 64, offset: 9472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !333, file: !334, line: 102, baseType: !230, size: 64, offset: 9536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !333, file: !334, line: 103, baseType: !230, size: 64, offset: 9600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !333, file: !334, line: 104, baseType: !230, size: 64, offset: 9664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !333, file: !334, line: 105, baseType: !230, size: 64, offset: 9728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !333, file: !334, line: 106, baseType: !291, size: 32, offset: 9792)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !333, file: !334, line: 107, baseType: !176, size: 32, offset: 9824)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !333, file: !334, line: 108, baseType: !176, size: 32, offset: 9856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !333, file: !334, line: 109, baseType: !176, size: 32, offset: 9888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !333, file: !334, line: 110, baseType: !291, size: 32, offset: 9920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !333, file: !334, line: 111, baseType: !176, size: 32, offset: 9952)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !333, file: !334, line: 112, baseType: !291, size: 32, offset: 9984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !333, file: !334, line: 113, baseType: !176, size: 32, offset: 10016)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !333, file: !334, line: 115, baseType: !291, size: 32, offset: 10048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !333, file: !334, line: 117, baseType: !291, size: 32, offset: 10080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !333, file: !334, line: 119, baseType: !484, size: 32, offset: 10112)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !333, file: !334, line: 120, baseType: !486, size: 32, offset: 10144)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !333, file: !334, line: 124, baseType: !176, size: 32, offset: 10176)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !333, file: !334, line: 125, baseType: !489, size: 64, offset: 10240)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !333, file: !334, line: 129, baseType: !176, size: 32, offset: 10304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !333, file: !334, line: 130, baseType: !229, size: 64, offset: 10368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !333, file: !334, line: 132, baseType: !221, size: 64, offset: 10432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !333, file: !334, line: 133, baseType: !176, size: 32, offset: 10496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !333, file: !334, line: 134, baseType: !176, size: 32, offset: 10528)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !333, file: !334, line: 135, baseType: !291, size: 32, offset: 10560)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !333, file: !334, line: 136, baseType: !291, size: 32, offset: 10592)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !333, file: !334, line: 137, baseType: !291, size: 32, offset: 10624)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !333, file: !334, line: 140, baseType: !176, size: 32, offset: 10656)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !333, file: !334, line: 141, baseType: !176, size: 32, offset: 10688)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !333, file: !334, line: 143, baseType: !176, size: 32, offset: 10720)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !333, file: !334, line: 144, baseType: !176, size: 32, offset: 10752)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !333, file: !334, line: 146, baseType: !291, size: 32, offset: 10784)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !333, file: !334, line: 147, baseType: !291, size: 32, offset: 10816)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !333, file: !334, line: 148, baseType: !291, size: 32, offset: 10848)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !333, file: !334, line: 150, baseType: !291, size: 32, offset: 10880)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !333, file: !334, line: 151, baseType: !117, size: 64, offset: 10944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !333, file: !334, line: 154, baseType: !230, size: 64, offset: 11008)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !333, file: !334, line: 155, baseType: !230, size: 64, offset: 11072)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !333, file: !334, line: 157, baseType: !489, size: 64, offset: 11136)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !333, file: !334, line: 158, baseType: !176, size: 32, offset: 11200)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !333, file: !334, line: 160, baseType: !291, size: 32, offset: 11232)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !333, file: !334, line: 161, baseType: !291, size: 32, offset: 11264)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !333, file: !334, line: 162, baseType: !176, size: 32, offset: 11296)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !333, file: !334, line: 164, baseType: !230, size: 64, offset: 11328)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !333, file: !334, line: 165, baseType: !346, size: 64, offset: 11392)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !333, file: !334, line: 165, baseType: !346, size: 64, offset: 11456)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !333, file: !334, line: 166, baseType: !176, size: 32, offset: 11520)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !333, file: !334, line: 167, baseType: !291, size: 32, offset: 11552)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !333, file: !334, line: 169, baseType: !291, size: 32, offset: 11584)
!520 = !{!521, !522, !523, !524, !525, !526, !528, !529, !531, !537, !538, !540, !541, !543, !546, !547, !549, !555, !557, !559, !561, !563}
!521 = !DILocalVariable(name: "snes", arg: 1, scope: !327, file: !328, line: 25, type: !331)
!522 = !DILocalVariable(name: "x", arg: 2, scope: !327, file: !328, line: 25, type: !346)
!523 = !DILocalVariable(name: "f", arg: 3, scope: !327, file: !328, line: 25, type: !346)
!524 = !DILocalVariable(name: "y", arg: 4, scope: !327, file: !328, line: 25, type: !346)
!525 = !DILocalVariable(name: "ierr", scope: !327, file: !328, line: 27, type: !134)
!526 = !DILocalVariable(name: "_7_ierr", scope: !527, file: !328, line: 33, type: !134)
!527 = distinct !DILexicalBlock(scope: !327, file: !328, line: 33, column: 3)
!528 = !DILocalVariable(name: "_7_flag", scope: !527, file: !328, line: 33, type: !193)
!529 = !DILocalVariable(name: "_7_errorcode", scope: !530, file: !328, line: 33, type: !134)
!530 = distinct !DILexicalBlock(scope: !527, file: !328, line: 33, column: 3)
!531 = !DILocalVariable(name: "_7_errorstring", scope: !532, file: !328, line: 33, type: !534)
!532 = distinct !DILexicalBlock(scope: !533, file: !328, line: 33, column: 3)
!533 = distinct !DILexicalBlock(scope: !530, file: !328, line: 33, column: 3)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 2048, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 256)
!537 = !DILocalVariable(name: "_7_resultlen", scope: !532, file: !328, line: 33, type: !193)
!538 = !DILocalVariable(name: "_7_ierr", scope: !539, file: !328, line: 34, type: !134)
!539 = distinct !DILexicalBlock(scope: !327, file: !328, line: 34, column: 3)
!540 = !DILocalVariable(name: "_7_flag", scope: !539, file: !328, line: 34, type: !193)
!541 = !DILocalVariable(name: "_7_errorcode", scope: !542, file: !328, line: 34, type: !134)
!542 = distinct !DILexicalBlock(scope: !539, file: !328, line: 34, column: 3)
!543 = !DILocalVariable(name: "_7_errorstring", scope: !544, file: !328, line: 34, type: !534)
!544 = distinct !DILexicalBlock(scope: !545, file: !328, line: 34, column: 3)
!545 = distinct !DILexicalBlock(scope: !542, file: !328, line: 34, column: 3)
!546 = !DILocalVariable(name: "_7_resultlen", scope: !544, file: !328, line: 34, type: !193)
!547 = !DILocalVariable(name: "ierr__", scope: !548, file: !328, line: 35, type: !134)
!548 = distinct !DILexicalBlock(scope: !327, file: !328, line: 35, column: 41)
!549 = !DILocalVariable(name: "ierr__", scope: !550, file: !328, line: 38, type: !134)
!550 = distinct !DILexicalBlock(scope: !551, file: !328, line: 38, column: 50)
!551 = distinct !DILexicalBlock(scope: !552, file: !328, line: 37, column: 12)
!552 = distinct !DILexicalBlock(scope: !553, file: !328, line: 37, column: 9)
!553 = distinct !DILexicalBlock(scope: !554, file: !328, line: 36, column: 18)
!554 = distinct !DILexicalBlock(scope: !327, file: !328, line: 36, column: 7)
!555 = !DILocalVariable(name: "ierr__", scope: !556, file: !328, line: 40, type: !134)
!556 = distinct !DILexicalBlock(scope: !553, file: !328, line: 40, column: 25)
!557 = !DILocalVariable(name: "ierr__", scope: !558, file: !328, line: 41, type: !134)
!558 = distinct !DILexicalBlock(scope: !553, file: !328, line: 41, column: 62)
!559 = !DILocalVariable(name: "ierr__", scope: !560, file: !328, line: 42, type: !134)
!560 = distinct !DILexicalBlock(scope: !553, file: !328, line: 42, column: 49)
!561 = !DILocalVariable(name: "ierr__", scope: !562, file: !328, line: 43, type: !134)
!562 = distinct !DILexicalBlock(scope: !553, file: !328, line: 43, column: 60)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !328, line: 44, type: !134)
!564 = distinct !DILexicalBlock(scope: !553, file: !328, line: 44, column: 30)
!565 = !DILocation(line: 0, scope: !327)
!566 = !DILocation(line: 29, column: 3, scope: !567)
