; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiaijpc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiaijpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !{!295, !347}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !297, line: 70, baseType: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 34, size: 1344, elements: !299)
!299 = !{!300, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1303, !1304, !1305, !1306, !1312, !1313, !1314, !1315, !1316, !1317}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !298, file: !297, line: 35, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !304, line: 436, size: 23424, elements: !305)
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!305 = !{!306, !516, !1023, !1043, !1044, !1045, !1047, !1048, !1049, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1176, !1177, !1193, !1194, !1195, !1196, !1197, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1232, !1252, !1253, !1255, !1256, !1257, !1258, !1259, !1260, !1278, !1279}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !303, file: !304, line: 437, baseType: !307, size: 4480)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !308, line: 122, baseType: !309)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !308, line: 73, size: 4480, elements: !310)
!310 = !{!311, !313, !368, !369, !371, !374, !375, !376, !377, !385, !386, !388, !392, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !410, !411, !412, !414, !415, !417, !419, !420, !421, !422, !423, !426, !428, !429, !430, !431, !432, !435, !437, !438, !439, !449, !451, !452, !456, !457, !506, !511, !513, !514, !515}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !309, file: !308, line: 74, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !309, file: !308, line: 75, baseType: !314, size: 448, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 448, elements: !366)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !308, line: 53, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 45, size: 448, elements: !317)
!317 = !{!318, !330, !338, !343, !350, !354, !361}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !316, file: !308, line: 46, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !323, !325}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !327, line: 330, baseType: !328)
!327 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !327, line: 330, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !316, file: !308, line: 47, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!322, !323, !334}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !335, line: 16, baseType: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !335, line: 16, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !316, file: !308, line: 48, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!322, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !316, file: !308, line: 49, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!322, !323, !347, !323}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !316, file: !308, line: 50, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!322, !323, !347, !342}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !316, file: !308, line: 51, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!322, !323, !347, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !316, file: !308, line: 52, baseType: !362, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!322, !323, !347, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!366 = !{!367}
!367 = !DISubrange(count: 1)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !309, file: !308, line: 76, baseType: !326, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !308, line: 77, baseType: !370, size: 32, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !309, file: !308, line: 78, baseType: !372, size: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !373)
!373 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !309, file: !308, line: 78, baseType: !372, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !309, file: !308, line: 78, baseType: !372, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !309, file: !308, line: 78, baseType: !372, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !309, file: !308, line: 79, baseType: !378, size: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !381, line: 27, baseType: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !383, line: 43, baseType: !384)
!383 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!384 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !309, file: !308, line: 80, baseType: !370, size: 32, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !309, file: !308, line: 81, baseType: !387, size: 32, offset: 992)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !309, file: !308, line: 82, baseType: !389, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !309, file: !308, line: 83, baseType: !393, size: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !309, file: !308, line: 84, baseType: !397, size: 64, offset: 1152)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !309, file: !308, line: 85, baseType: !397, size: 64, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !309, file: !308, line: 86, baseType: !397, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !309, file: !308, line: 87, baseType: !397, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !309, file: !308, line: 88, baseType: !323, size: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !309, file: !308, line: 89, baseType: !378, size: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !308, line: 90, baseType: !397, size: 64, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !309, file: !308, line: 91, baseType: !397, size: 64, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !309, file: !308, line: 92, baseType: !370, size: 32, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !309, file: !308, line: 93, baseType: !407, size: 64, offset: 1728)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !308, line: 94, baseType: !409, size: 64, offset: 1792)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !379)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !309, file: !308, line: 95, baseType: !370, size: 32, offset: 1856)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !309, file: !308, line: 95, baseType: !370, size: 32, offset: 1888)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !309, file: !308, line: 96, baseType: !413, size: 64, offset: 1920)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !309, file: !308, line: 96, baseType: !413, size: 64, offset: 1984)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !309, file: !308, line: 97, baseType: !416, size: 64, offset: 2048)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !309, file: !308, line: 97, baseType: !418, size: 64, offset: 2112)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !309, file: !308, line: 98, baseType: !370, size: 32, offset: 2176)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !309, file: !308, line: 98, baseType: !370, size: 32, offset: 2208)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !309, file: !308, line: 99, baseType: !413, size: 64, offset: 2240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !309, file: !308, line: 99, baseType: !413, size: 64, offset: 2304)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !309, file: !308, line: 100, baseType: !424, size: 64, offset: 2368)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !373)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !309, file: !308, line: 100, baseType: !427, size: 64, offset: 2432)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !309, file: !308, line: 101, baseType: !370, size: 32, offset: 2496)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !309, file: !308, line: 101, baseType: !370, size: 32, offset: 2528)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !309, file: !308, line: 102, baseType: !413, size: 64, offset: 2560)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !309, file: !308, line: 102, baseType: !413, size: 64, offset: 2624)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !309, file: !308, line: 103, baseType: !433, size: 64, offset: 2688)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !425)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !309, file: !308, line: 103, baseType: !436, size: 64, offset: 2752)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !309, file: !308, line: 104, baseType: !365, size: 64, offset: 2816)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !309, file: !308, line: 105, baseType: !370, size: 32, offset: 2880)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !309, file: !308, line: 106, baseType: !440, size: 128, offset: 2944)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !447)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !308, line: 64, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 61, size: 128, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !443, file: !308, line: 62, baseType: !358, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !443, file: !308, line: 63, baseType: !407, size: 64, offset: 64)
!447 = !{!448}
!448 = !DISubrange(count: 2)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !309, file: !308, line: 107, baseType: !450, size: 64, offset: 3072)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 64, elements: !447)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !309, file: !308, line: 108, baseType: !407, size: 64, offset: 3136)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !309, file: !308, line: 109, baseType: !453, size: 64, offset: 3200)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!322, !407}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !309, file: !308, line: 111, baseType: !370, size: 32, offset: 3264)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !309, file: !308, line: 112, baseType: !458, size: 320, offset: 3328)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 320, elements: !504)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!322, !462, !323, !407}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !465)
!465 = !{!466, !467, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !464, file: !10, line: 100, baseType: !370, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !10, line: 101, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !479, !480, !481, !485, !487, !489, !490, !491}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !470, file: !10, line: 84, baseType: !397, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !470, file: !10, line: 85, baseType: !397, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !10, line: 86, baseType: !407, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !470, file: !10, line: 87, baseType: !389, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !470, file: !10, line: 88, baseType: !477, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !470, file: !10, line: 89, baseType: !349, size: 8, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !470, file: !10, line: 90, baseType: !397, size: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !470, file: !10, line: 91, baseType: !482, size: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !483, line: 46, baseType: !484)
!483 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!484 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !470, file: !10, line: 92, baseType: !486, size: 32, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !10, line: 93, baseType: !488, size: 32, offset: 544)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !10, line: 94, baseType: !468, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !470, file: !10, line: 95, baseType: !397, size: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !470, file: !10, line: 96, baseType: !407, size: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !464, file: !10, line: 102, baseType: !397, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !464, file: !10, line: 102, baseType: !397, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !464, file: !10, line: 103, baseType: !397, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !464, file: !10, line: 104, baseType: !326, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !464, file: !10, line: 105, baseType: !486, size: 32, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !464, file: !10, line: 105, baseType: !486, size: 32, offset: 416)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !464, file: !10, line: 105, baseType: !486, size: 32, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !464, file: !10, line: 106, baseType: !323, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !464, file: !10, line: 107, baseType: !501, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!504 = !{!505}
!505 = !DISubrange(count: 5)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !309, file: !308, line: 113, baseType: !507, size: 320, offset: 3648)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 320, elements: !504)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!322, !323, !407}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !309, file: !308, line: 114, baseType: !512, size: 320, offset: 3968)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 320, elements: !504)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !309, file: !308, line: 115, baseType: !486, size: 32, offset: 4288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !309, file: !308, line: 120, baseType: !501, size: 64, offset: 4352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !309, file: !308, line: 121, baseType: !486, size: 32, offset: 4416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !303, file: !304, line: 437, baseType: !517, size: 9472, offset: 4480)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 9472, elements: !366)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !304, line: 32, size: 9472, elements: !519)
!519 = !{!520, !529, !533, !534, !541, !545, !546, !547, !548, !549, !550, !551, !575, !579, !584, !590, !609, !614, !618, !619, !624, !629, !630, !635, !639, !643, !647, !651, !655, !656, !657, !658, !659, !663, !664, !669, !670, !671, !672, !673, !678, !685, !690, !694, !698, !702, !706, !707, !711, !712, !719, !724, !725, !726, !727, !789, !797, !798, !802, !803, !807, !808, !812, !817, !818, !822, !826, !833, !834, !835, !836, !837, !838, !843, !844, !848, !852, !856, !857, !858, !862, !872, !873, !877, !878, !882, !883, !887, !888, !893, !894, !898, !902, !903, !904, !905, !906, !907, !908, !912, !913, !914, !915, !916, !917, !921, !922, !923, !924, !925, !926, !927, !928, !932, !936, !937, !938, !942, !943, !944, !945, !946, !947, !948, !952, !953, !954, !959, !963, !964, !968, !969, !970, !971, !997, !1001, !1002, !1003, !1004, !1005, !1009, !1010, !1011, !1012, !1013, !1017, !1021, !1022}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !518, file: !304, line: 34, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!322, !301, !370, !524, !370, !524, !526, !528}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !518, file: !304, line: 35, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!322, !301, !370, !416, !418, !436}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !518, file: !304, line: 36, baseType: !530, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !518, file: !304, line: 37, baseType: !535, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!322, !301, !538, !538}
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !518, file: !304, line: 38, baseType: !542, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!322, !301, !538, !538, !538}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !518, file: !304, line: 40, baseType: !535, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !518, file: !304, line: 41, baseType: !542, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !518, file: !304, line: 42, baseType: !535, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !518, file: !304, line: 43, baseType: !542, size: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !518, file: !304, line: 44, baseType: !535, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !518, file: !304, line: 46, baseType: !542, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !518, file: !304, line: 47, baseType: !552, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!322, !301, !555, !555, !559}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !556, line: 11, baseType: !557)
!556 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !556, line: 11, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !562, file: !36, line: 1227, baseType: !425, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !562, file: !36, line: 1228, baseType: !425, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !562, file: !36, line: 1229, baseType: !425, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !562, file: !36, line: 1230, baseType: !425, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !562, file: !36, line: 1231, baseType: !425, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !562, file: !36, line: 1232, baseType: !425, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !562, file: !36, line: 1233, baseType: !425, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !562, file: !36, line: 1234, baseType: !425, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !562, file: !36, line: 1236, baseType: !425, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !562, file: !36, line: 1237, baseType: !425, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !562, file: !36, line: 1238, baseType: !425, size: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !518, file: !304, line: 48, baseType: !576, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!322, !301, !555, !559}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !518, file: !304, line: 49, baseType: !580, size: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!322, !301, !538, !425, !583, !425, !370, !370, !538}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !518, file: !304, line: 50, baseType: !585, size: 64, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!322, !301, !588, !589}
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !518, file: !304, line: 52, baseType: !591, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!322, !301, !594, !595}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !597, file: !36, line: 593, baseType: !372, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !597, file: !36, line: 594, baseType: !372, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !597, file: !36, line: 594, baseType: !372, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !597, file: !36, line: 594, baseType: !372, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !597, file: !36, line: 595, baseType: !372, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !597, file: !36, line: 596, baseType: !372, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !597, file: !36, line: 597, baseType: !372, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !597, file: !36, line: 598, baseType: !372, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !597, file: !36, line: 598, baseType: !372, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !597, file: !36, line: 599, baseType: !372, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !518, file: !304, line: 53, baseType: !610, size: 64, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!322, !301, !301, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !518, file: !304, line: 54, baseType: !615, size: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!322, !301, !538}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !518, file: !304, line: 55, baseType: !535, size: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !518, file: !304, line: 56, baseType: !620, size: 64, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!322, !301, !623, !424}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !518, file: !304, line: 58, baseType: !625, size: 64, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!322, !301, !628}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !518, file: !304, line: 59, baseType: !625, size: 64, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !518, file: !304, line: 60, baseType: !631, size: 64, offset: 1408)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!322, !301, !634, !486}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !518, file: !304, line: 61, baseType: !636, size: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!322, !301}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !518, file: !304, line: 63, baseType: !640, size: 64, offset: 1536)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!322, !301, !370, !524, !434, !538, !538}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !518, file: !304, line: 64, baseType: !644, size: 64, offset: 1600)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!322, !301, !301, !555, !555, !559}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !518, file: !304, line: 65, baseType: !648, size: 64, offset: 1664)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!322, !301, !301, !559}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !518, file: !304, line: 66, baseType: !652, size: 64, offset: 1728)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!322, !301, !301, !555, !559}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !518, file: !304, line: 67, baseType: !648, size: 64, offset: 1792)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !518, file: !304, line: 69, baseType: !636, size: 64, offset: 1856)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !518, file: !304, line: 70, baseType: !644, size: 64, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !518, file: !304, line: 71, baseType: !652, size: 64, offset: 1984)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !518, file: !304, line: 72, baseType: !660, size: 64, offset: 2048)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!322, !301, !589}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !518, file: !304, line: 73, baseType: !636, size: 64, offset: 2112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !518, file: !304, line: 75, baseType: !665, size: 64, offset: 2176)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!322, !301, !668, !589}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !518, file: !304, line: 76, baseType: !535, size: 64, offset: 2240)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !518, file: !304, line: 77, baseType: !535, size: 64, offset: 2304)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !518, file: !304, line: 78, baseType: !552, size: 64, offset: 2368)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !518, file: !304, line: 79, baseType: !576, size: 64, offset: 2432)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !518, file: !304, line: 81, baseType: !674, size: 64, offset: 2496)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!322, !301, !434, !301, !677}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !518, file: !304, line: 82, baseType: !679, size: 64, offset: 2560)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!322, !301, !370, !682, !682, !588, !684}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !518, file: !304, line: 83, baseType: !686, size: 64, offset: 2624)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!322, !301, !370, !689, !370}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !518, file: !304, line: 84, baseType: !691, size: 64, offset: 2688)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!322, !301, !370, !524, !370, !524, !433}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !518, file: !304, line: 85, baseType: !695, size: 64, offset: 2752)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!322, !301, !301, !677}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !518, file: !304, line: 87, baseType: !699, size: 64, offset: 2816)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!322, !301, !538, !416}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !518, file: !304, line: 88, baseType: !703, size: 64, offset: 2880)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!322, !301, !434}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !518, file: !304, line: 89, baseType: !703, size: 64, offset: 2944)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !518, file: !304, line: 90, baseType: !708, size: 64, offset: 3008)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!322, !301, !538, !528}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !518, file: !304, line: 91, baseType: !640, size: 64, offset: 3072)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !518, file: !304, line: 93, baseType: !713, size: 64, offset: 3136)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!322, !301, !716}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !518, file: !304, line: 94, baseType: !720, size: 64, offset: 3200)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!322, !301, !370, !486, !486, !416, !723, !723, !613}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !518, file: !304, line: 95, baseType: !720, size: 64, offset: 3264)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !518, file: !304, line: 96, baseType: !720, size: 64, offset: 3328)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !518, file: !304, line: 97, baseType: !720, size: 64, offset: 3392)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !518, file: !304, line: 99, baseType: !728, size: 64, offset: 3456)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!322, !301, !731, !734}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !556, line: 51, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !556, line: 51, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !304, line: 609, size: 6208, elements: !737)
!737 = !{!738, !739, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !758, !765, !766, !767, !768, !769, !770, !771, !772, !776, !777, !778, !779, !780, !782, !783, !784, !785, !786, !787, !788}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !736, file: !304, line: 610, baseType: !307, size: 4480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !736, file: !304, line: 610, baseType: !740, size: 32, offset: 4480)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !366)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !736, file: !304, line: 611, baseType: !370, size: 32, offset: 4512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !736, file: !304, line: 611, baseType: !370, size: 32, offset: 4544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !736, file: !304, line: 611, baseType: !370, size: 32, offset: 4576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !736, file: !304, line: 612, baseType: !370, size: 32, offset: 4608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !736, file: !304, line: 613, baseType: !370, size: 32, offset: 4640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !736, file: !304, line: 614, baseType: !416, size: 64, offset: 4672)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !736, file: !304, line: 615, baseType: !418, size: 64, offset: 4736)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !736, file: !304, line: 616, baseType: !689, size: 64, offset: 4800)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !736, file: !304, line: 617, baseType: !416, size: 64, offset: 4864)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !736, file: !304, line: 618, baseType: !751, size: 64, offset: 4928)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !304, line: 602, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 598, size: 128, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !753, file: !304, line: 599, baseType: !370, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !753, file: !304, line: 600, baseType: !370, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !753, file: !304, line: 601, baseType: !433, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !736, file: !304, line: 619, baseType: !759, size: 64, offset: 4992)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !304, line: 607, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 604, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !761, file: !304, line: 605, baseType: !370, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !761, file: !304, line: 606, baseType: !433, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !736, file: !304, line: 620, baseType: !433, size: 64, offset: 5056)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !736, file: !304, line: 621, baseType: !425, size: 64, offset: 5120)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !736, file: !304, line: 622, baseType: !425, size: 64, offset: 5184)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !736, file: !304, line: 623, baseType: !538, size: 64, offset: 5248)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !736, file: !304, line: 623, baseType: !538, size: 64, offset: 5312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !736, file: !304, line: 623, baseType: !538, size: 64, offset: 5376)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !736, file: !304, line: 624, baseType: !486, size: 32, offset: 5440)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !736, file: !304, line: 625, baseType: !773, size: 64, offset: 5504)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!322}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !736, file: !304, line: 626, baseType: !407, size: 64, offset: 5568)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !736, file: !304, line: 627, baseType: !538, size: 64, offset: 5632)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !736, file: !304, line: 628, baseType: !370, size: 32, offset: 5696)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !736, file: !304, line: 629, baseType: !347, size: 64, offset: 5760)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !736, file: !304, line: 630, baseType: !781, size: 32, offset: 5824)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !736, file: !304, line: 631, baseType: !370, size: 32, offset: 5856)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !736, file: !304, line: 631, baseType: !370, size: 32, offset: 5888)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !736, file: !304, line: 632, baseType: !486, size: 32, offset: 5920)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !736, file: !304, line: 633, baseType: !486, size: 32, offset: 5952)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !736, file: !304, line: 634, baseType: !358, size: 64, offset: 6016)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !736, file: !304, line: 634, baseType: !407, size: 64, offset: 6080)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !736, file: !304, line: 635, baseType: !378, size: 64, offset: 6144)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !518, file: !304, line: 100, baseType: !790, size: 64, offset: 3520)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!322, !301, !370, !370, !793, !796}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !795)
!795 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !518, file: !304, line: 101, baseType: !636, size: 64, offset: 3584)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !518, file: !304, line: 102, baseType: !799, size: 64, offset: 3648)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!322, !301, !555, !555, !589}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !518, file: !304, line: 103, baseType: !521, size: 64, offset: 3712)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !518, file: !304, line: 105, baseType: !804, size: 64, offset: 3776)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!322, !301, !555, !555, !588, !589}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !518, file: !304, line: 106, baseType: !636, size: 64, offset: 3840)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !518, file: !304, line: 107, baseType: !809, size: 64, offset: 3904)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!322, !301, !334}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !518, file: !304, line: 108, baseType: !813, size: 64, offset: 3968)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!322, !301, !816, !588, !589}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !347)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !518, file: !304, line: 109, baseType: !773, size: 64, offset: 4032)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !518, file: !304, line: 111, baseType: !819, size: 64, offset: 4096)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!322, !301, !301, !301, !425, !301}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !518, file: !304, line: 112, baseType: !823, size: 64, offset: 4160)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!322, !301, !301, !301, !301}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !518, file: !304, line: 113, baseType: !827, size: 64, offset: 4224)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!322, !301, !830, !830}
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !556, line: 30, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !556, line: 30, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !518, file: !304, line: 114, baseType: !521, size: 64, offset: 4288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !518, file: !304, line: 115, baseType: !640, size: 64, offset: 4352)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !518, file: !304, line: 117, baseType: !699, size: 64, offset: 4416)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !518, file: !304, line: 118, baseType: !699, size: 64, offset: 4480)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !518, file: !304, line: 119, baseType: !813, size: 64, offset: 4544)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !518, file: !304, line: 120, baseType: !839, size: 64, offset: 4608)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!322, !301, !842, !613}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !518, file: !304, line: 121, baseType: !773, size: 64, offset: 4672)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !518, file: !304, line: 123, baseType: !845, size: 64, offset: 4736)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!322, !301, !370, !407}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !518, file: !304, line: 124, baseType: !849, size: 64, offset: 4800)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!322, !301, !734, !538, !407}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !518, file: !304, line: 125, baseType: !853, size: 64, offset: 4864)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!322, !462, !301}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !518, file: !304, line: 126, baseType: !535, size: 64, offset: 4928)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !518, file: !304, line: 127, baseType: !535, size: 64, offset: 4992)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !518, file: !304, line: 129, baseType: !859, size: 64, offset: 5056)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!322, !301, !689}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !518, file: !304, line: 130, baseType: !863, size: 64, offset: 5120)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!322, !301, !866, !866}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !868, file: !60, line: 653, baseType: !370, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !868, file: !60, line: 653, baseType: !538, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !518, file: !304, line: 131, baseType: !863, size: 64, offset: 5184)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !518, file: !304, line: 132, baseType: !874, size: 64, offset: 5248)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!322, !301, !416, !416, !416}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !518, file: !304, line: 133, baseType: !809, size: 64, offset: 5312)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !518, file: !304, line: 135, baseType: !879, size: 64, offset: 5376)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!322, !301, !425, !613}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !518, file: !304, line: 136, baseType: !879, size: 64, offset: 5440)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !518, file: !304, line: 137, baseType: !884, size: 64, offset: 5504)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!322, !301, !613}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !518, file: !304, line: 138, baseType: !521, size: 64, offset: 5568)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !518, file: !304, line: 139, baseType: !889, size: 64, offset: 5632)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!322, !301, !892, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !518, file: !304, line: 141, baseType: !773, size: 64, offset: 5696)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !518, file: !304, line: 142, baseType: !895, size: 64, offset: 5760)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!322, !301, !301, !425, !301}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !518, file: !304, line: 143, baseType: !899, size: 64, offset: 5824)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!322, !301, !301, !301}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !518, file: !304, line: 144, baseType: !773, size: 64, offset: 5888)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !518, file: !304, line: 145, baseType: !895, size: 64, offset: 5952)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !518, file: !304, line: 147, baseType: !899, size: 64, offset: 6016)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !518, file: !304, line: 148, baseType: !773, size: 64, offset: 6080)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !518, file: !304, line: 149, baseType: !895, size: 64, offset: 6144)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !518, file: !304, line: 150, baseType: !899, size: 64, offset: 6208)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !518, file: !304, line: 151, baseType: !909, size: 64, offset: 6272)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!322, !301, !486}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !518, file: !304, line: 153, baseType: !636, size: 64, offset: 6336)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !518, file: !304, line: 154, baseType: !636, size: 64, offset: 6400)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !518, file: !304, line: 155, baseType: !636, size: 64, offset: 6464)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !518, file: !304, line: 156, baseType: !636, size: 64, offset: 6528)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !518, file: !304, line: 157, baseType: !809, size: 64, offset: 6592)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !518, file: !304, line: 159, baseType: !918, size: 64, offset: 6656)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!322, !301, !370, !526}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !518, file: !304, line: 160, baseType: !636, size: 64, offset: 6720)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !518, file: !304, line: 161, baseType: !636, size: 64, offset: 6784)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !518, file: !304, line: 162, baseType: !636, size: 64, offset: 6848)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !518, file: !304, line: 163, baseType: !636, size: 64, offset: 6912)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !518, file: !304, line: 165, baseType: !899, size: 64, offset: 6976)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !518, file: !304, line: 166, baseType: !899, size: 64, offset: 7040)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !518, file: !304, line: 167, baseType: !699, size: 64, offset: 7104)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !518, file: !304, line: 168, baseType: !929, size: 64, offset: 7168)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!322, !301, !538, !370}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !518, file: !304, line: 169, baseType: !933, size: 64, offset: 7232)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!322, !301, !613, !416}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !518, file: !304, line: 171, baseType: !660, size: 64, offset: 7296)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !518, file: !304, line: 172, baseType: !636, size: 64, offset: 7360)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !518, file: !304, line: 173, baseType: !939, size: 64, offset: 7424)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!322, !301, !416, !723}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !518, file: !304, line: 174, baseType: !799, size: 64, offset: 7488)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !518, file: !304, line: 175, baseType: !799, size: 64, offset: 7552)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !518, file: !304, line: 177, baseType: !535, size: 64, offset: 7616)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !518, file: !304, line: 178, baseType: !585, size: 64, offset: 7680)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !518, file: !304, line: 179, baseType: !535, size: 64, offset: 7744)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !518, file: !304, line: 180, baseType: !542, size: 64, offset: 7808)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !518, file: !304, line: 181, baseType: !949, size: 64, offset: 7872)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!322, !301, !326, !588, !589}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !518, file: !304, line: 183, baseType: !859, size: 64, offset: 7936)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !518, file: !304, line: 184, baseType: !620, size: 64, offset: 8000)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !518, file: !304, line: 185, baseType: !955, size: 64, offset: 8064)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!322, !301, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !518, file: !304, line: 186, baseType: !960, size: 64, offset: 8128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!322, !301, !370, !524, !433}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !518, file: !304, line: 187, baseType: !679, size: 64, offset: 8192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !518, file: !304, line: 189, baseType: !965, size: 64, offset: 8256)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!322, !301, !370, !370, !416, !526}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !518, file: !304, line: 190, baseType: !773, size: 64, offset: 8320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !518, file: !304, line: 191, baseType: !895, size: 64, offset: 8384)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !518, file: !304, line: 192, baseType: !899, size: 64, offset: 8448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !518, file: !304, line: 193, baseType: !972, size: 64, offset: 8512)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!322, !301, !731, !975}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !304, line: 660, size: 5312, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !977, file: !304, line: 661, baseType: !307, size: 4480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !977, file: !304, line: 661, baseType: !740, size: 32, offset: 4480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !977, file: !304, line: 662, baseType: !370, size: 32, offset: 4512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !977, file: !304, line: 662, baseType: !370, size: 32, offset: 4544)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !977, file: !304, line: 662, baseType: !370, size: 32, offset: 4576)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !977, file: !304, line: 663, baseType: !370, size: 32, offset: 4608)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !977, file: !304, line: 664, baseType: !370, size: 32, offset: 4640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !977, file: !304, line: 665, baseType: !416, size: 64, offset: 4672)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !977, file: !304, line: 666, baseType: !416, size: 64, offset: 4736)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !977, file: !304, line: 667, baseType: !370, size: 32, offset: 4800)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !977, file: !304, line: 668, baseType: !781, size: 32, offset: 4832)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !977, file: !304, line: 670, baseType: !416, size: 64, offset: 4864)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !977, file: !304, line: 670, baseType: !416, size: 64, offset: 4928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !977, file: !304, line: 671, baseType: !416, size: 64, offset: 4992)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !977, file: !304, line: 672, baseType: !416, size: 64, offset: 5056)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !977, file: !304, line: 673, baseType: !416, size: 64, offset: 5120)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !977, file: !304, line: 674, baseType: !370, size: 32, offset: 5184)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !977, file: !304, line: 675, baseType: !416, size: 64, offset: 5248)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !518, file: !304, line: 195, baseType: !998, size: 64, offset: 8576)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!322, !975, !301, !301}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !518, file: !304, line: 196, baseType: !998, size: 64, offset: 8640)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !518, file: !304, line: 197, baseType: !773, size: 64, offset: 8704)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !518, file: !304, line: 198, baseType: !895, size: 64, offset: 8768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !518, file: !304, line: 199, baseType: !899, size: 64, offset: 8832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !518, file: !304, line: 201, baseType: !1006, size: 64, offset: 8896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!322, !301, !370, !370}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !518, file: !304, line: 202, baseType: !674, size: 64, offset: 8960)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !518, file: !304, line: 203, baseType: !542, size: 64, offset: 9024)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !518, file: !304, line: 204, baseType: !728, size: 64, offset: 9088)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !518, file: !304, line: 205, baseType: !859, size: 64, offset: 9152)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !518, file: !304, line: 206, baseType: !1014, size: 64, offset: 9216)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!322, !326, !301, !370, !588, !589}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !518, file: !304, line: 208, baseType: !1018, size: 64, offset: 9280)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!322, !370, !684}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !518, file: !304, line: 209, baseType: !899, size: 64, offset: 9344)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !518, file: !304, line: 210, baseType: !691, size: 64, offset: 9408)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !303, file: !304, line: 438, baseType: !1024, size: 64, offset: 13952)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !556, line: 60, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1026, file: !114, line: 241, baseType: !326, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !114, line: 242, baseType: !387, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1026, file: !114, line: 243, baseType: !370, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1026, file: !114, line: 243, baseType: !370, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1026, file: !114, line: 244, baseType: !370, size: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1026, file: !114, line: 244, baseType: !370, size: 32, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1026, file: !114, line: 245, baseType: !416, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1026, file: !114, line: 246, baseType: !486, size: 32, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1026, file: !114, line: 247, baseType: !370, size: 32, offset: 352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1026, file: !114, line: 251, baseType: !370, size: 32, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1026, file: !114, line: 252, baseType: !830, size: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1026, file: !114, line: 253, baseType: !486, size: 32, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1026, file: !114, line: 254, baseType: !370, size: 32, offset: 544)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1026, file: !114, line: 254, baseType: !370, size: 32, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1026, file: !114, line: 255, baseType: !370, size: 32, offset: 608)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !303, file: !304, line: 438, baseType: !1024, size: 64, offset: 14016)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !304, line: 439, baseType: !407, size: 64, offset: 14080)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !303, file: !304, line: 440, baseType: !1046, size: 32, offset: 14144)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !303, file: !304, line: 441, baseType: !486, size: 32, offset: 14176)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !303, file: !304, line: 442, baseType: !486, size: 32, offset: 14208)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !303, file: !304, line: 443, baseType: !1050, size: 448, offset: 14272)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 448, elements: !1052)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !347)
!1052 = !{!1053}
!1053 = !DISubrange(count: 7)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !303, file: !304, line: 444, baseType: !486, size: 32, offset: 14720)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !303, file: !304, line: 445, baseType: !486, size: 32, offset: 14752)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !303, file: !304, line: 446, baseType: !370, size: 32, offset: 14784)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !303, file: !304, line: 447, baseType: !409, size: 64, offset: 14848)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !303, file: !304, line: 448, baseType: !409, size: 64, offset: 14912)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !303, file: !304, line: 449, baseType: !596, size: 640, offset: 14976)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !303, file: !304, line: 450, baseType: !528, size: 32, offset: 15616)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !303, file: !304, line: 451, baseType: !1062, size: 2880, offset: 15680)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !304, line: 318, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !304, line: 319, size: 2880, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1084, !1085, !1090, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1110, !1111, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1143, !1144, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1167, !1168, !1169, !1173, !1174}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1063, file: !304, line: 320, baseType: !370, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1063, file: !304, line: 321, baseType: !370, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1063, file: !304, line: 322, baseType: !370, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1063, file: !304, line: 323, baseType: !370, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1063, file: !304, line: 324, baseType: !370, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1063, file: !304, line: 325, baseType: !370, size: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1063, file: !304, line: 326, baseType: !1072, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !304, line: 293, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !304, line: 295, size: 448, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1074, file: !304, line: 296, baseType: !1072, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1074, file: !304, line: 297, baseType: !433, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1074, file: !304, line: 297, baseType: !433, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1074, file: !304, line: 298, baseType: !416, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1074, file: !304, line: 298, baseType: !416, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1074, file: !304, line: 299, baseType: !370, size: 32, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1074, file: !304, line: 300, baseType: !370, size: 32, offset: 352)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1074, file: !304, line: 301, baseType: !370, size: 32, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1063, file: !304, line: 326, baseType: !1072, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1063, file: !304, line: 328, baseType: !1086, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!322, !301, !1089, !416}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1063, file: !304, line: 329, baseType: !1091, size: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!322, !1089, !1094, !418, !418, !436, !416}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1063, file: !304, line: 330, baseType: !1096, size: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!322, !1089}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1063, file: !304, line: 331, baseType: !1096, size: 64, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1063, file: !304, line: 334, baseType: !326, size: 64, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !304, line: 335, baseType: !387, size: 32, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1063, file: !304, line: 335, baseType: !387, size: 32, offset: 672)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1063, file: !304, line: 336, baseType: !387, size: 32, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1063, file: !304, line: 336, baseType: !387, size: 32, offset: 736)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1063, file: !304, line: 337, baseType: !1106, size: 64, offset: 768)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !327, line: 339, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !327, line: 339, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1063, file: !304, line: 338, baseType: !1106, size: 64, offset: 832)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1063, file: !304, line: 339, baseType: !1112, size: 64, offset: 896)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !327, line: 341, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !327, line: 351, size: 192, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1114, file: !327, line: 354, baseType: !72, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1114, file: !327, line: 355, baseType: !72, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1114, file: !327, line: 356, baseType: !72, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1114, file: !327, line: 361, baseType: !72, size: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1114, file: !327, line: 362, baseType: !482, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1063, file: !304, line: 340, baseType: !370, size: 32, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1063, file: !304, line: 340, baseType: !370, size: 32, offset: 992)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1063, file: !304, line: 341, baseType: !433, size: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1063, file: !304, line: 342, baseType: !416, size: 64, offset: 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1063, file: !304, line: 343, baseType: !436, size: 64, offset: 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1063, file: !304, line: 344, baseType: !418, size: 64, offset: 1216)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1063, file: !304, line: 345, baseType: !370, size: 32, offset: 1280)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1063, file: !304, line: 346, baseType: !1094, size: 64, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1063, file: !304, line: 347, baseType: !486, size: 32, offset: 1408)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1063, file: !304, line: 348, baseType: !370, size: 32, offset: 1440)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1063, file: !304, line: 351, baseType: !486, size: 32, offset: 1472)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1063, file: !304, line: 352, baseType: !486, size: 32, offset: 1504)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1063, file: !304, line: 353, baseType: !387, size: 32, offset: 1536)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1063, file: !304, line: 354, baseType: !387, size: 32, offset: 1568)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1063, file: !304, line: 355, baseType: !1094, size: 64, offset: 1600)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1063, file: !304, line: 356, baseType: !1094, size: 64, offset: 1664)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1063, file: !304, line: 357, baseType: !1138, size: 64, offset: 1728)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !304, line: 310, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 308, size: 32, elements: !1141)
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1140, file: !304, line: 309, baseType: !370, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1063, file: !304, line: 357, baseType: !1138, size: 64, offset: 1792)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1063, file: !304, line: 358, baseType: !1145, size: 64, offset: 1856)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !304, line: 316, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 312, size: 128, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1147, file: !304, line: 313, baseType: !407, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1147, file: !304, line: 314, baseType: !370, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1147, file: !304, line: 315, baseType: !349, size: 8, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1063, file: !304, line: 359, baseType: !1145, size: 64, offset: 1920)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1063, file: !304, line: 360, baseType: !1145, size: 64, offset: 1984)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1063, file: !304, line: 361, baseType: !370, size: 32, offset: 2048)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1063, file: !304, line: 362, baseType: !387, size: 32, offset: 2080)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1063, file: !304, line: 363, baseType: !370, size: 32, offset: 2112)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1063, file: !304, line: 364, baseType: !1094, size: 64, offset: 2176)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1063, file: !304, line: 365, baseType: !1112, size: 64, offset: 2240)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1063, file: !304, line: 366, baseType: !387, size: 32, offset: 2304)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1063, file: !304, line: 367, baseType: !387, size: 32, offset: 2336)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1063, file: !304, line: 368, baseType: !1106, size: 64, offset: 2368)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1063, file: !304, line: 369, baseType: !1106, size: 64, offset: 2432)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1063, file: !304, line: 370, baseType: !1164, size: 64, offset: 2496)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1063, file: !304, line: 371, baseType: !1164, size: 64, offset: 2560)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1063, file: !304, line: 372, baseType: !1164, size: 64, offset: 2624)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1063, file: !304, line: 373, baseType: !1170, size: 64, offset: 2688)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !327, line: 331, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !327, line: 331, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1063, file: !304, line: 374, baseType: !482, size: 64, offset: 2752)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1063, file: !304, line: 375, baseType: !1175, size: 64, offset: 2816)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !303, file: !304, line: 451, baseType: !1062, size: 2880, offset: 18560)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !303, file: !304, line: 452, baseType: !1178, size: 64, offset: 21440)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !304, line: 681, size: 4864, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1192}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1180, file: !304, line: 682, baseType: !307, size: 4480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1180, file: !304, line: 682, baseType: !740, size: 32, offset: 4480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1180, file: !304, line: 683, baseType: !486, size: 32, offset: 4512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1180, file: !304, line: 684, baseType: !370, size: 32, offset: 4544)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1180, file: !304, line: 685, baseType: !892, size: 64, offset: 4608)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1180, file: !304, line: 686, baseType: !433, size: 64, offset: 4672)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1180, file: !304, line: 687, baseType: !1189, size: 64, offset: 4736)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!322, !1178, !538, !407}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1180, file: !304, line: 688, baseType: !407, size: 64, offset: 4800)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !303, file: !304, line: 453, baseType: !1178, size: 64, offset: 21504)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !303, file: !304, line: 454, baseType: !1178, size: 64, offset: 21568)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !303, file: !304, line: 455, baseType: !370, size: 32, offset: 21632)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !303, file: !304, line: 456, baseType: !486, size: 32, offset: 21664)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !303, file: !304, line: 457, baseType: !1198, size: 320, offset: 21696)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !304, line: 399, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 394, size: 320, elements: !1200)
!1200 = !{!1201, !1202, !1206, !1207}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1199, file: !304, line: 395, baseType: !370, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1199, file: !304, line: 396, baseType: !1203, size: 128, offset: 32)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 128, elements: !1204)
!1204 = !{!1205}
!1205 = !DISubrange(count: 4)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1199, file: !304, line: 397, baseType: !1203, size: 128, offset: 160)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1199, file: !304, line: 398, baseType: !486, size: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !303, file: !304, line: 458, baseType: !486, size: 32, offset: 22016)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !303, file: !304, line: 458, baseType: !486, size: 32, offset: 22048)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !303, file: !304, line: 458, baseType: !486, size: 32, offset: 22080)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !303, file: !304, line: 458, baseType: !486, size: 32, offset: 22112)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !303, file: !304, line: 459, baseType: !486, size: 32, offset: 22144)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !303, file: !304, line: 459, baseType: !486, size: 32, offset: 22176)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !303, file: !304, line: 459, baseType: !486, size: 32, offset: 22208)
