; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/ftn-auto/dtdsf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/ftn-auto/dtdsf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._p_PetscDS = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }
%struct.PetscOps = type { i32 (%struct._p_PetscObject*, %struct.ompi_communicator_t**)*, i32 (%struct._p_PetscObject*, %struct._p_PetscViewer*)*, i32 (%struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject*)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, void ()*)*, i32 (%struct._p_PetscObject*, i8*, void ()**)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/ftn-auto/dtdsf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !{!25, !29, !35, !243}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !26, line: 13, baseType: !27)
!26 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !26, line: 13, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !31, line: 135, baseType: !32)
!31 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 100, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !38, line: 73, size: 4480, elements: !39)
!38 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!39 = !{!40, !43, !96, !97, !99, !102, !103, !104, !105, !113, !114, !116, !120, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !136, !138, !139, !140, !142, !143, !145, !147, !148, !149, !150, !151, !154, !156, !157, !158, !159, !160, !163, !165, !166, !167, !177, !179, !180, !184, !185, !233, !238, !240, !241, !242}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !37, file: !38, line: 74, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !42)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !37, file: !38, line: 75, baseType: !44, size: 448, offset: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 448, elements: !94)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !38, line: 53, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 45, size: 448, elements: !47)
!47 = !{!48, !58, !66, !71, !78, !82, !89}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !46, file: !38, line: 46, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !35, !53}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !42)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !55, line: 330, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !55, line: 330, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !46, file: !38, line: 47, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!52, !35, !62}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !63, line: 16, baseType: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !63, line: 16, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !46, file: !38, line: 48, baseType: !67, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!52, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !46, file: !38, line: 49, baseType: !72, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!52, !35, !75, !35}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !46, file: !38, line: 50, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!52, !35, !75, !70}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !46, file: !38, line: 51, baseType: !83, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!52, !35, !75, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !46, file: !38, line: 52, baseType: !90, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!52, !35, !75, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !37, file: !38, line: 76, baseType: !54, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !37, file: !38, line: 77, baseType: !98, size: 32, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !37, file: !38, line: 78, baseType: !100, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !101)
!101 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !37, file: !38, line: 78, baseType: !100, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !37, file: !38, line: 78, baseType: !100, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !37, file: !38, line: 78, baseType: !100, size: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !38, line: 79, baseType: !106, size: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 27, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 43, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !37, file: !38, line: 80, baseType: !98, size: 32, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !37, file: !38, line: 81, baseType: !115, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !42)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !37, file: !38, line: 82, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !37, file: !38, line: 83, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !37, file: !38, line: 84, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !37, file: !38, line: 85, baseType: !125, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !37, file: !38, line: 86, baseType: !125, size: 64, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !37, file: !38, line: 87, baseType: !125, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !37, file: !38, line: 88, baseType: !35, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !37, file: !38, line: 89, baseType: !106, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !38, line: 90, baseType: !125, size: 64, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !37, file: !38, line: 91, baseType: !125, size: 64, offset: 1600)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !37, file: !38, line: 92, baseType: !98, size: 32, offset: 1664)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !37, file: !38, line: 93, baseType: !135, size: 64, offset: 1728)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !37, file: !38, line: 94, baseType: !137, size: 64, offset: 1792)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !107)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !37, file: !38, line: 95, baseType: !98, size: 32, offset: 1856)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !37, file: !38, line: 95, baseType: !98, size: 32, offset: 1888)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !37, file: !38, line: 96, baseType: !141, size: 64, offset: 1920)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !37, file: !38, line: 96, baseType: !141, size: 64, offset: 1984)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !37, file: !38, line: 97, baseType: !144, size: 64, offset: 2048)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !37, file: !38, line: 97, baseType: !146, size: 64, offset: 2112)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !37, file: !38, line: 98, baseType: !98, size: 32, offset: 2176)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !37, file: !38, line: 98, baseType: !98, size: 32, offset: 2208)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !37, file: !38, line: 99, baseType: !141, size: 64, offset: 2240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !37, file: !38, line: 99, baseType: !141, size: 64, offset: 2304)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !37, file: !38, line: 100, baseType: !152, size: 64, offset: 2368)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !101)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !37, file: !38, line: 100, baseType: !155, size: 64, offset: 2432)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !37, file: !38, line: 101, baseType: !98, size: 32, offset: 2496)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !37, file: !38, line: 101, baseType: !98, size: 32, offset: 2528)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !37, file: !38, line: 102, baseType: !141, size: 64, offset: 2560)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !37, file: !38, line: 102, baseType: !141, size: 64, offset: 2624)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !37, file: !38, line: 103, baseType: !161, size: 64, offset: 2688)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !153)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !37, file: !38, line: 103, baseType: !164, size: 64, offset: 2752)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !37, file: !38, line: 104, baseType: !93, size: 64, offset: 2816)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !37, file: !38, line: 105, baseType: !98, size: 32, offset: 2880)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !37, file: !38, line: 106, baseType: !168, size: 128, offset: 2944)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !175)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !38, line: 64, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 61, size: 128, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !171, file: !38, line: 62, baseType: !86, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !171, file: !38, line: 63, baseType: !135, size: 64, offset: 64)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !37, file: !38, line: 107, baseType: !178, size: 64, offset: 3072)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !175)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !37, file: !38, line: 108, baseType: !135, size: 64, offset: 3136)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !37, file: !38, line: 109, baseType: !181, size: 64, offset: 3200)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!52, !135}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !37, file: !38, line: 111, baseType: !98, size: 32, offset: 3264)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !37, file: !38, line: 112, baseType: !186, size: 320, offset: 3328)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 320, elements: !231)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!52, !190, !35, !135}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !193)
!193 = !{!194, !195, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !192, file: !10, line: 100, baseType: !98, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !10, line: 101, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !207, !208, !209, !212, !214, !216, !217, !218}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !198, file: !10, line: 84, baseType: !125, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !198, file: !10, line: 85, baseType: !125, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !10, line: 86, baseType: !135, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !198, file: !10, line: 87, baseType: !117, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !198, file: !10, line: 88, baseType: !205, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !198, file: !10, line: 89, baseType: !77, size: 8, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !198, file: !10, line: 90, baseType: !125, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !198, file: !10, line: 91, baseType: !210, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 46, baseType: !34)
!211 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !198, file: !10, line: 92, baseType: !213, size: 32, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !10, line: 93, baseType: !215, size: 32, offset: 544)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !10, line: 94, baseType: !196, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !198, file: !10, line: 95, baseType: !125, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !198, file: !10, line: 96, baseType: !135, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !192, file: !10, line: 102, baseType: !125, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !192, file: !10, line: 102, baseType: !125, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !192, file: !10, line: 103, baseType: !125, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !192, file: !10, line: 104, baseType: !54, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !192, file: !10, line: 105, baseType: !213, size: 32, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !192, file: !10, line: 105, baseType: !213, size: 32, offset: 416)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !192, file: !10, line: 105, baseType: !213, size: 32, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !192, file: !10, line: 106, baseType: !35, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !192, file: !10, line: 107, baseType: !228, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!231 = !{!232}
!232 = !DISubrange(count: 5)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !37, file: !38, line: 113, baseType: !234, size: 320, offset: 3648)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 320, elements: !231)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!52, !35, !135}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !37, file: !38, line: 114, baseType: !239, size: 320, offset: 3968)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 320, elements: !231)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !37, file: !38, line: 115, baseType: !213, size: 32, offset: 4288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !37, file: !38, line: 120, baseType: !228, size: 64, offset: 4352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !37, file: !38, line: 121, baseType: !213, size: 32, offset: 4416)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !26, line: 22, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !26, line: 22, flags: DIFlagFwdDecl)
!247 = !{i32 7, !"Dwarf Version", i32 4}
!248 = !{i32 2, !"Debug Info Version", i32 3}
!249 = !{i32 1, !"wchar_size", i32 4}
!250 = !{i32 7, !"PIC Level", i32 2}
!251 = !{i32 7, !"uwtable", i32 1}
!252 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!253 = distinct !DISubprogram(name: "petscdssetfromoptions_", scope: !254, file: !254, line: 232, type: !255, scopeLine: 233, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !258)
!254 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/ftn-auto/dtdsf.c", directory: "/home/users/ndemeye/xSDK")
!255 = !DISubroutineType(types: !256)
!256 = !{null, !25, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!258 = !{!259, !260}
!259 = !DILocalVariable(name: "prob", arg: 1, scope: !253, file: !254, line: 232, type: !25)
!260 = !DILocalVariable(name: "__ierr", arg: 2, scope: !253, file: !254, line: 232, type: !257)
!261 = !DILocation(line: 0, scope: !253)
!262 = !DILocation(line: 235, column: 11, scope: !253)
!263 = !{!264, !264, i64 0}
!264 = !{!"long", !265, i64 0}
!265 = !{!"omnipotent char", !266, i64 0}
!266 = !{!"Simple C/C++ TBAA"}
!267 = !DILocation(line: 235, column: 2, scope: !253)
!268 = !DILocation(line: 234, column: 11, scope: !253)
!269 = !DILocation(line: 234, column: 9, scope: !253)
!270 = !{!271, !271, i64 0}
!271 = !{!"int", !265, i64 0}
!272 = !DILocation(line: 236, column: 1, scope: !253)
!273 = !DISubprogram(name: "PetscDSSetFromOptions", scope: !274, file: !274, line: 588, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !277)
!274 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!275 = !DISubroutineType(types: !276)
!276 = !{!42, !27}
!277 = !{}
!278 = distinct !DISubprogram(name: "petscdsdestroy_", scope: !254, file: !254, line: 237, type: !279, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !282)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281, !257}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!282 = !{!283, !284}
!283 = !DILocalVariable(name: "ds", arg: 1, scope: !278, file: !254, line: 237, type: !281)
!284 = !DILocalVariable(name: "__ierr", arg: 2, scope: !278, file: !254, line: 237, type: !257)
!285 = !DILocation(line: 0, scope: !278)
!286 = !DILocation(line: 239, column: 11, scope: !278)
!287 = !DILocation(line: 239, column: 9, scope: !278)
!288 = !DILocation(line: 240, column: 1, scope: !278)
!289 = !DISubprogram(name: "PetscDSDestroy", scope: !274, file: !274, line: 584, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !277)
!290 = !DISubroutineType(types: !291)
!291 = !{!42, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!293 = distinct !DISubprogram(name: "petscdscreate_", scope: !254, file: !254, line: 241, type: !294, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !257, !281, !257}
!296 = !{!297, !298, !299}
!297 = !DILocalVariable(name: "comm", arg: 1, scope: !293, file: !254, line: 241, type: !257)
