; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/hmg/hmg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/hmg/hmg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 98, baseType: !72, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299, !300}
!297 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!298 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!299 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!300 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 85, baseType: !72, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!304 = !DIEnumerator(name: "PC_LEFT", value: 0)
!305 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!306 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 395, baseType: !72, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315}
!309 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!310 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!311 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!312 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!313 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!314 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!315 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 264, baseType: !5, size: 32, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIEnumerator(name: "PC_MG_MULTIPLICATIVE", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "PC_MG_ADDITIVE", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "PC_MG_FULL", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "PC_MG_KASKADE", value: 3, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 297, baseType: !5, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327, !328}
!324 = !DIEnumerator(name: "PC_MG_GALERKIN_BOTH", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "PC_MG_GALERKIN_PMAT", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "PC_MG_GALERKIN_MAT", value: 2, isUnsigned: true)
!327 = !DIEnumerator(name: "PC_MG_GALERKIN_NONE", value: 3, isUnsigned: true)
!328 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 330, baseType: !5, size: 32, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 663, baseType: !5, size: 32, elements: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!337 = !{!338, !339, !340}
!338 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!343 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!361 = !{!362, !1506, !422, !425, !505, !446, !1517, !1519, !580}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !364, line: 79, baseType: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 53, size: 2240, elements: !366)
!366 = !{!367, !369, !371, !372, !374, !376, !377, !379, !380, !381, !382, !383, !384, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1410, !1501, !1505}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !365, file: !364, line: 54, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !295, line: 264, baseType: !316)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !365, file: !364, line: 55, baseType: !370, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !365, file: !364, line: 56, baseType: !370, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !365, file: !364, line: 57, baseType: !373, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !295, line: 297, baseType: !322)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !365, file: !364, line: 58, baseType: !375, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !365, file: !364, line: 60, baseType: !375, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !365, file: !364, line: 61, baseType: !378, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !295, line: 330, baseType: !329)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !365, file: !364, line: 62, baseType: !370, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !365, file: !364, line: 63, baseType: !370, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !365, file: !364, line: 64, baseType: !375, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !365, file: !364, line: 66, baseType: !375, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !365, file: !364, line: 68, baseType: !370, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !365, file: !364, line: 69, baseType: !385, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !364, line: 48, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 14, size: 1600, elements: !389)
!389 = !{!390, !391, !392, !393, !397, !398, !399, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1398, !1399, !1400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !388, file: !364, line: 15, baseType: !370, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !388, file: !364, line: 16, baseType: !370, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !388, file: !364, line: 17, baseType: !370, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !388, file: !364, line: 18, baseType: !394, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !388, file: !364, line: 19, baseType: !394, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !388, file: !364, line: 20, baseType: !394, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !388, file: !364, line: 21, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !403, line: 436, size: 23424, elements: !404)
!403 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!404 = !{!405, !613, !1117, !1137, !1138, !1139, !1141, !1142, !1143, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1270, !1271, !1287, !1288, !1289, !1290, !1291, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1326, !1346, !1347, !1349, !1350, !1351, !1352, !1353, !1354, !1372, !1373}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !402, file: !403, line: 437, baseType: !406, size: 4480)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !407, line: 122, baseType: !408)
!407 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !407, line: 73, size: 4480, elements: !409)
!409 = !{!410, !412, !467, !468, !469, !472, !473, !474, !475, !483, !484, !486, !490, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !506, !508, !509, !510, !512, !513, !515, !517, !518, !519, !520, !521, !524, !526, !527, !528, !529, !530, !533, !535, !536, !537, !547, !549, !550, !554, !555, !603, !608, !610, !611, !612}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !408, file: !407, line: 74, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !408, file: !407, line: 75, baseType: !413, size: 448, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 448, elements: !465)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !407, line: 53, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 45, size: 448, elements: !416)
!416 = !{!417, !429, !437, !442, !449, !453, !460}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !415, file: !407, line: 46, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !422, !424}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !426, line: 330, baseType: !427)
!426 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !426, line: 330, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !415, file: !407, line: 47, baseType: !430, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!421, !422, !433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !434, line: 16, baseType: !435)
!434 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !434, line: 16, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !415, file: !407, line: 48, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!421, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !415, file: !407, line: 49, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!421, !422, !446, !422}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !415, file: !407, line: 50, baseType: !450, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!421, !422, !446, !441}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !415, file: !407, line: 51, baseType: !454, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!421, !422, !446, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !415, file: !407, line: 52, baseType: !461, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!421, !422, !446, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!465 = !{!466}
!466 = !DISubrange(count: 1)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !408, file: !407, line: 76, baseType: !425, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !407, line: 77, baseType: !370, size: 32, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !408, file: !407, line: 78, baseType: !470, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !471)
!471 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !408, file: !407, line: 78, baseType: !470, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !408, file: !407, line: 78, baseType: !470, size: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !408, file: !407, line: 78, baseType: !470, size: 64, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !408, file: !407, line: 79, baseType: !476, size: 64, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !479, line: 27, baseType: !480)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !481, line: 43, baseType: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!482 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !408, file: !407, line: 80, baseType: !370, size: 32, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !408, file: !407, line: 81, baseType: !485, size: 32, offset: 992)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !408, file: !407, line: 82, baseType: !487, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !408, file: !407, line: 83, baseType: !491, size: 64, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !408, file: !407, line: 84, baseType: !495, size: 64, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !408, file: !407, line: 85, baseType: !495, size: 64, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !408, file: !407, line: 86, baseType: !495, size: 64, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !408, file: !407, line: 87, baseType: !495, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !408, file: !407, line: 88, baseType: !422, size: 64, offset: 1408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !408, file: !407, line: 89, baseType: !476, size: 64, offset: 1472)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !407, line: 90, baseType: !495, size: 64, offset: 1536)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !408, file: !407, line: 91, baseType: !495, size: 64, offset: 1600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !408, file: !407, line: 92, baseType: !370, size: 32, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !408, file: !407, line: 93, baseType: !505, size: 64, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !408, file: !407, line: 94, baseType: !507, size: 64, offset: 1792)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !477)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !408, file: !407, line: 95, baseType: !370, size: 32, offset: 1856)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !408, file: !407, line: 95, baseType: !370, size: 32, offset: 1888)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !408, file: !407, line: 96, baseType: !511, size: 64, offset: 1920)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !408, file: !407, line: 96, baseType: !511, size: 64, offset: 1984)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !408, file: !407, line: 97, baseType: !514, size: 64, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !408, file: !407, line: 97, baseType: !516, size: 64, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !408, file: !407, line: 98, baseType: !370, size: 32, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !408, file: !407, line: 98, baseType: !370, size: 32, offset: 2208)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !408, file: !407, line: 99, baseType: !511, size: 64, offset: 2240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !408, file: !407, line: 99, baseType: !511, size: 64, offset: 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !408, file: !407, line: 100, baseType: !522, size: 64, offset: 2368)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !471)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !408, file: !407, line: 100, baseType: !525, size: 64, offset: 2432)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !408, file: !407, line: 101, baseType: !370, size: 32, offset: 2496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !408, file: !407, line: 101, baseType: !370, size: 32, offset: 2528)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !408, file: !407, line: 102, baseType: !511, size: 64, offset: 2560)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !408, file: !407, line: 102, baseType: !511, size: 64, offset: 2624)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !408, file: !407, line: 103, baseType: !531, size: 64, offset: 2688)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !523)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !408, file: !407, line: 103, baseType: !534, size: 64, offset: 2752)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !408, file: !407, line: 104, baseType: !464, size: 64, offset: 2816)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !408, file: !407, line: 105, baseType: !370, size: 32, offset: 2880)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !408, file: !407, line: 106, baseType: !538, size: 128, offset: 2944)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 128, elements: !545)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !407, line: 64, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 61, size: 128, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !541, file: !407, line: 62, baseType: !457, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !541, file: !407, line: 63, baseType: !505, size: 64, offset: 64)
!545 = !{!546}
!546 = !DISubrange(count: 2)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !408, file: !407, line: 107, baseType: !548, size: 64, offset: 3072)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 64, elements: !545)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !408, file: !407, line: 108, baseType: !505, size: 64, offset: 3136)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !408, file: !407, line: 109, baseType: !551, size: 64, offset: 3200)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!421, !505}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !408, file: !407, line: 111, baseType: !370, size: 32, offset: 3264)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !408, file: !407, line: 112, baseType: !556, size: 320, offset: 3328)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 320, elements: !601)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!421, !560, !422, !505}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !563)
!563 = !{!564, !565, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !562, file: !10, line: 100, baseType: !370, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !10, line: 101, baseType: !566, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !577, !578, !579, !583, !584, !586, !587, !588}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !568, file: !10, line: 84, baseType: !495, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !568, file: !10, line: 85, baseType: !495, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !568, file: !10, line: 86, baseType: !505, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !568, file: !10, line: 87, baseType: !487, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !568, file: !10, line: 88, baseType: !575, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !568, file: !10, line: 89, baseType: !448, size: 8, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !568, file: !10, line: 90, baseType: !495, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !568, file: !10, line: 91, baseType: !580, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !581, line: 46, baseType: !582)
!581 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!582 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !568, file: !10, line: 92, baseType: !375, size: 32, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !10, line: 93, baseType: !585, size: 32, offset: 544)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !568, file: !10, line: 94, baseType: !566, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !568, file: !10, line: 95, baseType: !495, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !568, file: !10, line: 96, baseType: !505, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !562, file: !10, line: 102, baseType: !495, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !562, file: !10, line: 102, baseType: !495, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !562, file: !10, line: 103, baseType: !495, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !562, file: !10, line: 104, baseType: !425, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !562, file: !10, line: 105, baseType: !375, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !562, file: !10, line: 105, baseType: !375, size: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !562, file: !10, line: 105, baseType: !375, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !562, file: !10, line: 106, baseType: !422, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !562, file: !10, line: 107, baseType: !598, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!601 = !{!602}
!602 = !DISubrange(count: 5)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !408, file: !407, line: 113, baseType: !604, size: 320, offset: 3648)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 320, elements: !601)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!421, !422, !505}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !408, file: !407, line: 114, baseType: !609, size: 320, offset: 3968)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 320, elements: !601)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !408, file: !407, line: 115, baseType: !375, size: 32, offset: 4288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !408, file: !407, line: 120, baseType: !598, size: 64, offset: 4352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !408, file: !407, line: 121, baseType: !375, size: 32, offset: 4416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !402, file: !403, line: 437, baseType: !614, size: 9472, offset: 4480)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 9472, elements: !465)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !403, line: 32, size: 9472, elements: !616)
!616 = !{!617, !626, !630, !631, !635, !639, !640, !641, !642, !643, !644, !645, !669, !673, !678, !684, !703, !708, !712, !713, !718, !723, !724, !729, !733, !737, !741, !745, !749, !750, !751, !752, !753, !757, !758, !763, !764, !765, !766, !767, !772, !779, !784, !788, !792, !796, !800, !801, !805, !806, !813, !818, !819, !820, !821, !883, !891, !892, !896, !897, !901, !902, !906, !911, !912, !916, !920, !927, !928, !929, !930, !931, !932, !937, !938, !942, !946, !950, !951, !952, !956, !966, !967, !971, !972, !976, !977, !981, !982, !987, !988, !992, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1026, !1030, !1031, !1032, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1046, !1047, !1048, !1053, !1057, !1058, !1062, !1063, !1064, !1065, !1091, !1095, !1096, !1097, !1098, !1099, !1103, !1104, !1105, !1106, !1107, !1111, !1115, !1116}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !615, file: !403, line: 34, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!421, !400, !370, !621, !370, !621, !623, !625}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !615, file: !403, line: 35, baseType: !627, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!421, !400, !370, !514, !516, !534}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !615, file: !403, line: 36, baseType: !627, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !615, file: !403, line: 37, baseType: !632, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!421, !400, !394, !394}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !615, file: !403, line: 38, baseType: !636, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!421, !400, !394, !394, !394}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !615, file: !403, line: 40, baseType: !632, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !615, file: !403, line: 41, baseType: !636, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !615, file: !403, line: 42, baseType: !632, size: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !615, file: !403, line: 43, baseType: !636, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !615, file: !403, line: 44, baseType: !632, size: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !615, file: !403, line: 46, baseType: !636, size: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !615, file: !403, line: 47, baseType: !646, size: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!421, !400, !649, !649, !653}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !650, line: 11, baseType: !651)
!650 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !650, line: 11, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !656, file: !36, line: 1227, baseType: !523, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !656, file: !36, line: 1228, baseType: !523, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !656, file: !36, line: 1229, baseType: !523, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !656, file: !36, line: 1230, baseType: !523, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !656, file: !36, line: 1231, baseType: !523, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !656, file: !36, line: 1232, baseType: !523, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !656, file: !36, line: 1233, baseType: !523, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !656, file: !36, line: 1234, baseType: !523, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !656, file: !36, line: 1236, baseType: !523, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !656, file: !36, line: 1237, baseType: !523, size: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !656, file: !36, line: 1238, baseType: !523, size: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !615, file: !403, line: 48, baseType: !670, size: 64, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!421, !400, !649, !653}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !615, file: !403, line: 49, baseType: !674, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!421, !400, !394, !523, !677, !523, !370, !370, !394}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !615, file: !403, line: 50, baseType: !679, size: 64, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!421, !400, !682, !683}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !615, file: !403, line: 52, baseType: !685, size: 64, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!421, !400, !688, !689}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !691, file: !36, line: 593, baseType: !470, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !691, file: !36, line: 594, baseType: !470, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !691, file: !36, line: 594, baseType: !470, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !691, file: !36, line: 594, baseType: !470, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !691, file: !36, line: 595, baseType: !470, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !691, file: !36, line: 596, baseType: !470, size: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !691, file: !36, line: 597, baseType: !470, size: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !691, file: !36, line: 598, baseType: !470, size: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !691, file: !36, line: 598, baseType: !470, size: 64, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !691, file: !36, line: 599, baseType: !470, size: 64, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !615, file: !403, line: 53, baseType: !704, size: 64, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!421, !400, !400, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !615, file: !403, line: 54, baseType: !709, size: 64, offset: 1088)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!421, !400, !394}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !615, file: !403, line: 55, baseType: !632, size: 64, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !615, file: !403, line: 56, baseType: !714, size: 64, offset: 1216)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!421, !400, !717, !522}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !615, file: !403, line: 58, baseType: !719, size: 64, offset: 1280)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!421, !400, !722}
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !615, file: !403, line: 59, baseType: !719, size: 64, offset: 1344)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !615, file: !403, line: 60, baseType: !725, size: 64, offset: 1408)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!421, !400, !728, !375}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !615, file: !403, line: 61, baseType: !730, size: 64, offset: 1472)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!421, !400}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !615, file: !403, line: 63, baseType: !734, size: 64, offset: 1536)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!421, !400, !370, !621, !532, !394, !394}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !615, file: !403, line: 64, baseType: !738, size: 64, offset: 1600)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!421, !400, !400, !649, !649, !653}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !615, file: !403, line: 65, baseType: !742, size: 64, offset: 1664)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!421, !400, !400, !653}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !615, file: !403, line: 66, baseType: !746, size: 64, offset: 1728)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!421, !400, !400, !649, !653}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !615, file: !403, line: 67, baseType: !742, size: 64, offset: 1792)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !615, file: !403, line: 69, baseType: !730, size: 64, offset: 1856)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !615, file: !403, line: 70, baseType: !738, size: 64, offset: 1920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !615, file: !403, line: 71, baseType: !746, size: 64, offset: 1984)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !615, file: !403, line: 72, baseType: !754, size: 64, offset: 2048)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!421, !400, !683}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !615, file: !403, line: 73, baseType: !730, size: 64, offset: 2112)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !615, file: !403, line: 75, baseType: !759, size: 64, offset: 2176)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!421, !400, !762, !683}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !615, file: !403, line: 76, baseType: !632, size: 64, offset: 2240)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !615, file: !403, line: 77, baseType: !632, size: 64, offset: 2304)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !615, file: !403, line: 78, baseType: !646, size: 64, offset: 2368)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !615, file: !403, line: 79, baseType: !670, size: 64, offset: 2432)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !615, file: !403, line: 81, baseType: !768, size: 64, offset: 2496)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!421, !400, !532, !400, !771}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !615, file: !403, line: 82, baseType: !773, size: 64, offset: 2560)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!421, !400, !370, !776, !776, !682, !778}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !615, file: !403, line: 83, baseType: !780, size: 64, offset: 2624)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!421, !400, !370, !783, !370}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !615, file: !403, line: 84, baseType: !785, size: 64, offset: 2688)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!421, !400, !370, !621, !370, !621, !531}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !615, file: !403, line: 85, baseType: !789, size: 64, offset: 2752)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!421, !400, !400, !771}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !615, file: !403, line: 87, baseType: !793, size: 64, offset: 2816)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!421, !400, !394, !514}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !615, file: !403, line: 88, baseType: !797, size: 64, offset: 2880)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!421, !400, !532}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !615, file: !403, line: 89, baseType: !797, size: 64, offset: 2944)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !615, file: !403, line: 90, baseType: !802, size: 64, offset: 3008)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!421, !400, !394, !625}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !615, file: !403, line: 91, baseType: !734, size: 64, offset: 3072)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !615, file: !403, line: 93, baseType: !807, size: 64, offset: 3136)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!421, !400, !810}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !615, file: !403, line: 94, baseType: !814, size: 64, offset: 3200)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!421, !400, !370, !375, !375, !514, !817, !817, !707}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !615, file: !403, line: 95, baseType: !814, size: 64, offset: 3264)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !615, file: !403, line: 96, baseType: !814, size: 64, offset: 3328)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !615, file: !403, line: 97, baseType: !814, size: 64, offset: 3392)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !615, file: !403, line: 99, baseType: !822, size: 64, offset: 3456)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!421, !400, !825, !828}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !650, line: 51, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !650, line: 51, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !403, line: 609, size: 6208, elements: !831)
!831 = !{!832, !833, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !852, !859, !860, !861, !862, !863, !864, !865, !866, !870, !871, !872, !873, !874, !876, !877, !878, !879, !880, !881, !882}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !830, file: !403, line: 610, baseType: !406, size: 4480)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !830, file: !403, line: 610, baseType: !834, size: 32, offset: 4480)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !465)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !830, file: !403, line: 611, baseType: !370, size: 32, offset: 4512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !830, file: !403, line: 611, baseType: !370, size: 32, offset: 4544)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !830, file: !403, line: 611, baseType: !370, size: 32, offset: 4576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !830, file: !403, line: 612, baseType: !370, size: 32, offset: 4608)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !830, file: !403, line: 613, baseType: !370, size: 32, offset: 4640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !830, file: !403, line: 614, baseType: !514, size: 64, offset: 4672)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !830, file: !403, line: 615, baseType: !516, size: 64, offset: 4736)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !830, file: !403, line: 616, baseType: !783, size: 64, offset: 4800)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !830, file: !403, line: 617, baseType: !514, size: 64, offset: 4864)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !830, file: !403, line: 618, baseType: !845, size: 64, offset: 4928)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !403, line: 602, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 598, size: 128, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !847, file: !403, line: 599, baseType: !370, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !847, file: !403, line: 600, baseType: !370, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !847, file: !403, line: 601, baseType: !531, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !830, file: !403, line: 619, baseType: !853, size: 64, offset: 4992)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !403, line: 607, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 604, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !855, file: !403, line: 605, baseType: !370, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !855, file: !403, line: 606, baseType: !531, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !830, file: !403, line: 620, baseType: !531, size: 64, offset: 5056)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !830, file: !403, line: 621, baseType: !523, size: 64, offset: 5120)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !830, file: !403, line: 622, baseType: !523, size: 64, offset: 5184)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !830, file: !403, line: 623, baseType: !394, size: 64, offset: 5248)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !830, file: !403, line: 623, baseType: !394, size: 64, offset: 5312)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !830, file: !403, line: 623, baseType: !394, size: 64, offset: 5376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !830, file: !403, line: 624, baseType: !375, size: 32, offset: 5440)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !830, file: !403, line: 625, baseType: !867, size: 64, offset: 5504)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!421}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !830, file: !403, line: 626, baseType: !505, size: 64, offset: 5568)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !830, file: !403, line: 627, baseType: !394, size: 64, offset: 5632)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !830, file: !403, line: 628, baseType: !370, size: 32, offset: 5696)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !830, file: !403, line: 629, baseType: !446, size: 64, offset: 5760)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !830, file: !403, line: 630, baseType: !875, size: 32, offset: 5824)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !830, file: !403, line: 631, baseType: !370, size: 32, offset: 5856)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !830, file: !403, line: 631, baseType: !370, size: 32, offset: 5888)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !830, file: !403, line: 632, baseType: !375, size: 32, offset: 5920)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !830, file: !403, line: 633, baseType: !375, size: 32, offset: 5952)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !830, file: !403, line: 634, baseType: !457, size: 64, offset: 6016)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !830, file: !403, line: 634, baseType: !505, size: 64, offset: 6080)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !830, file: !403, line: 635, baseType: !476, size: 64, offset: 6144)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !615, file: !403, line: 100, baseType: !884, size: 64, offset: 3520)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!421, !400, !370, !370, !887, !890}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !889)
!889 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !615, file: !403, line: 101, baseType: !730, size: 64, offset: 3584)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !615, file: !403, line: 102, baseType: !893, size: 64, offset: 3648)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!421, !400, !649, !649, !683}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !615, file: !403, line: 103, baseType: !618, size: 64, offset: 3712)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !615, file: !403, line: 105, baseType: !898, size: 64, offset: 3776)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!421, !400, !649, !649, !682, !683}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !615, file: !403, line: 106, baseType: !730, size: 64, offset: 3840)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !615, file: !403, line: 107, baseType: !903, size: 64, offset: 3904)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!421, !400, !433}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !615, file: !403, line: 108, baseType: !907, size: 64, offset: 3968)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!421, !400, !910, !682, !683}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !446)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !615, file: !403, line: 109, baseType: !867, size: 64, offset: 4032)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !615, file: !403, line: 111, baseType: !913, size: 64, offset: 4096)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!421, !400, !400, !400, !523, !400}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !615, file: !403, line: 112, baseType: !917, size: 64, offset: 4160)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!421, !400, !400, !400, !400}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !615, file: !403, line: 113, baseType: !921, size: 64, offset: 4224)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!421, !400, !924, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !650, line: 30, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !650, line: 30, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !615, file: !403, line: 114, baseType: !618, size: 64, offset: 4288)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !615, file: !403, line: 115, baseType: !734, size: 64, offset: 4352)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !615, file: !403, line: 117, baseType: !793, size: 64, offset: 4416)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !615, file: !403, line: 118, baseType: !793, size: 64, offset: 4480)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !615, file: !403, line: 119, baseType: !907, size: 64, offset: 4544)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !615, file: !403, line: 120, baseType: !933, size: 64, offset: 4608)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!421, !400, !936, !707}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !615, file: !403, line: 121, baseType: !867, size: 64, offset: 4672)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !615, file: !403, line: 123, baseType: !939, size: 64, offset: 4736)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!421, !400, !370, !505}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !615, file: !403, line: 124, baseType: !943, size: 64, offset: 4800)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!421, !400, !828, !394, !505}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !615, file: !403, line: 125, baseType: !947, size: 64, offset: 4864)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!421, !560, !400}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !615, file: !403, line: 126, baseType: !632, size: 64, offset: 4928)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !615, file: !403, line: 127, baseType: !632, size: 64, offset: 4992)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !615, file: !403, line: 129, baseType: !953, size: 64, offset: 5056)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!421, !400, !783}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !615, file: !403, line: 130, baseType: !957, size: 64, offset: 5120)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!421, !400, !960, !960}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !962, file: !60, line: 653, baseType: !370, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !962, file: !60, line: 653, baseType: !394, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !615, file: !403, line: 131, baseType: !957, size: 64, offset: 5184)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !615, file: !403, line: 132, baseType: !968, size: 64, offset: 5248)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!421, !400, !514, !514, !514}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !615, file: !403, line: 133, baseType: !903, size: 64, offset: 5312)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !615, file: !403, line: 135, baseType: !973, size: 64, offset: 5376)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!421, !400, !523, !707}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !615, file: !403, line: 136, baseType: !973, size: 64, offset: 5440)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !615, file: !403, line: 137, baseType: !978, size: 64, offset: 5504)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!421, !400, !707}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !615, file: !403, line: 138, baseType: !618, size: 64, offset: 5568)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !615, file: !403, line: 139, baseType: !983, size: 64, offset: 5632)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!421, !400, !986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !615, file: !403, line: 141, baseType: !867, size: 64, offset: 5696)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !615, file: !403, line: 142, baseType: !989, size: 64, offset: 5760)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!421, !400, !400, !523, !400}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !615, file: !403, line: 143, baseType: !993, size: 64, offset: 5824)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!421, !400, !400, !400}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !615, file: !403, line: 144, baseType: !867, size: 64, offset: 5888)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !615, file: !403, line: 145, baseType: !989, size: 64, offset: 5952)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !615, file: !403, line: 147, baseType: !993, size: 64, offset: 6016)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !615, file: !403, line: 148, baseType: !867, size: 64, offset: 6080)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !615, file: !403, line: 149, baseType: !989, size: 64, offset: 6144)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !615, file: !403, line: 150, baseType: !993, size: 64, offset: 6208)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !615, file: !403, line: 151, baseType: !1003, size: 64, offset: 6272)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!421, !400, !375}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !615, file: !403, line: 153, baseType: !730, size: 64, offset: 6336)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !615, file: !403, line: 154, baseType: !730, size: 64, offset: 6400)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !615, file: !403, line: 155, baseType: !730, size: 64, offset: 6464)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !615, file: !403, line: 156, baseType: !730, size: 64, offset: 6528)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !615, file: !403, line: 157, baseType: !903, size: 64, offset: 6592)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !615, file: !403, line: 159, baseType: !1012, size: 64, offset: 6656)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!421, !400, !370, !623}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !615, file: !403, line: 160, baseType: !730, size: 64, offset: 6720)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !615, file: !403, line: 161, baseType: !730, size: 64, offset: 6784)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !615, file: !403, line: 162, baseType: !730, size: 64, offset: 6848)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !615, file: !403, line: 163, baseType: !730, size: 64, offset: 6912)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !615, file: !403, line: 165, baseType: !993, size: 64, offset: 6976)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !615, file: !403, line: 166, baseType: !993, size: 64, offset: 7040)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !615, file: !403, line: 167, baseType: !793, size: 64, offset: 7104)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !615, file: !403, line: 168, baseType: !1023, size: 64, offset: 7168)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!421, !400, !394, !370}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !615, file: !403, line: 169, baseType: !1027, size: 64, offset: 7232)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!421, !400, !707, !514}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !615, file: !403, line: 171, baseType: !754, size: 64, offset: 7296)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !615, file: !403, line: 172, baseType: !730, size: 64, offset: 7360)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !615, file: !403, line: 173, baseType: !1033, size: 64, offset: 7424)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!421, !400, !514, !817}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !615, file: !403, line: 174, baseType: !893, size: 64, offset: 7488)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !615, file: !403, line: 175, baseType: !893, size: 64, offset: 7552)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !615, file: !403, line: 177, baseType: !632, size: 64, offset: 7616)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !615, file: !403, line: 178, baseType: !679, size: 64, offset: 7680)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !615, file: !403, line: 179, baseType: !632, size: 64, offset: 7744)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !615, file: !403, line: 180, baseType: !636, size: 64, offset: 7808)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !615, file: !403, line: 181, baseType: !1043, size: 64, offset: 7872)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!421, !400, !425, !682, !683}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !615, file: !403, line: 183, baseType: !953, size: 64, offset: 7936)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !615, file: !403, line: 184, baseType: !714, size: 64, offset: 8000)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !615, file: !403, line: 185, baseType: !1049, size: 64, offset: 8064)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!421, !400, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !615, file: !403, line: 186, baseType: !1054, size: 64, offset: 8128)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!421, !400, !370, !621, !531}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !615, file: !403, line: 187, baseType: !773, size: 64, offset: 8192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !615, file: !403, line: 189, baseType: !1059, size: 64, offset: 8256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!421, !400, !370, !370, !514, !623}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !615, file: !403, line: 190, baseType: !867, size: 64, offset: 8320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !615, file: !403, line: 191, baseType: !989, size: 64, offset: 8384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !615, file: !403, line: 192, baseType: !993, size: 64, offset: 8448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !615, file: !403, line: 193, baseType: !1066, size: 64, offset: 8512)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!421, !400, !825, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !403, line: 660, size: 5312, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1071, file: !403, line: 661, baseType: !406, size: 4480)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1071, file: !403, line: 661, baseType: !834, size: 32, offset: 4480)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1071, file: !403, line: 662, baseType: !370, size: 32, offset: 4512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1071, file: !403, line: 662, baseType: !370, size: 32, offset: 4544)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1071, file: !403, line: 662, baseType: !370, size: 32, offset: 4576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1071, file: !403, line: 663, baseType: !370, size: 32, offset: 4608)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1071, file: !403, line: 664, baseType: !370, size: 32, offset: 4640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1071, file: !403, line: 665, baseType: !514, size: 64, offset: 4672)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1071, file: !403, line: 666, baseType: !514, size: 64, offset: 4736)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1071, file: !403, line: 667, baseType: !370, size: 32, offset: 4800)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1071, file: !403, line: 668, baseType: !875, size: 32, offset: 4832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1071, file: !403, line: 670, baseType: !514, size: 64, offset: 4864)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1071, file: !403, line: 670, baseType: !514, size: 64, offset: 4928)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1071, file: !403, line: 671, baseType: !514, size: 64, offset: 4992)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1071, file: !403, line: 672, baseType: !514, size: 64, offset: 5056)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1071, file: !403, line: 673, baseType: !514, size: 64, offset: 5120)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1071, file: !403, line: 674, baseType: !370, size: 32, offset: 5184)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1071, file: !403, line: 675, baseType: !514, size: 64, offset: 5248)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !615, file: !403, line: 195, baseType: !1092, size: 64, offset: 8576)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!421, !1069, !400, !400}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !615, file: !403, line: 196, baseType: !1092, size: 64, offset: 8640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !615, file: !403, line: 197, baseType: !867, size: 64, offset: 8704)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !615, file: !403, line: 198, baseType: !989, size: 64, offset: 8768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !615, file: !403, line: 199, baseType: !993, size: 64, offset: 8832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !615, file: !403, line: 201, baseType: !1100, size: 64, offset: 8896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!421, !400, !370, !370}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !615, file: !403, line: 202, baseType: !768, size: 64, offset: 8960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !615, file: !403, line: 203, baseType: !636, size: 64, offset: 9024)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !615, file: !403, line: 204, baseType: !822, size: 64, offset: 9088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !615, file: !403, line: 205, baseType: !953, size: 64, offset: 9152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !615, file: !403, line: 206, baseType: !1108, size: 64, offset: 9216)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!421, !425, !400, !370, !682, !683}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !615, file: !403, line: 208, baseType: !1112, size: 64, offset: 9280)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!421, !370, !778}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !615, file: !403, line: 209, baseType: !993, size: 64, offset: 9344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !615, file: !403, line: 210, baseType: !785, size: 64, offset: 9408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !402, file: !403, line: 438, baseType: !1118, size: 64, offset: 13952)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !650, line: 60, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1120, file: !114, line: 241, baseType: !425, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !114, line: 242, baseType: !485, size: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1120, file: !114, line: 243, baseType: !370, size: 32, offset: 96)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1120, file: !114, line: 243, baseType: !370, size: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1120, file: !114, line: 244, baseType: !370, size: 32, offset: 160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1120, file: !114, line: 244, baseType: !370, size: 32, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1120, file: !114, line: 245, baseType: !514, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1120, file: !114, line: 246, baseType: !375, size: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1120, file: !114, line: 247, baseType: !370, size: 32, offset: 352)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1120, file: !114, line: 251, baseType: !370, size: 32, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1120, file: !114, line: 252, baseType: !924, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1120, file: !114, line: 253, baseType: !375, size: 32, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1120, file: !114, line: 254, baseType: !370, size: 32, offset: 544)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1120, file: !114, line: 254, baseType: !370, size: 32, offset: 576)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1120, file: !114, line: 255, baseType: !370, size: 32, offset: 608)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !402, file: !403, line: 438, baseType: !1118, size: 64, offset: 14016)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !403, line: 439, baseType: !505, size: 64, offset: 14080)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !402, file: !403, line: 440, baseType: !1140, size: 32, offset: 14144)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !402, file: !403, line: 441, baseType: !375, size: 32, offset: 14176)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !402, file: !403, line: 442, baseType: !375, size: 32, offset: 14208)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !402, file: !403, line: 443, baseType: !1144, size: 448, offset: 14272)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 448, elements: !1146)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !446)
!1146 = !{!1147}
!1147 = !DISubrange(count: 7)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !402, file: !403, line: 444, baseType: !375, size: 32, offset: 14720)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !402, file: !403, line: 445, baseType: !375, size: 32, offset: 14752)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !402, file: !403, line: 446, baseType: !370, size: 32, offset: 14784)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !402, file: !403, line: 447, baseType: !507, size: 64, offset: 14848)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !402, file: !403, line: 448, baseType: !507, size: 64, offset: 14912)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !402, file: !403, line: 449, baseType: !690, size: 640, offset: 14976)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !402, file: !403, line: 450, baseType: !625, size: 32, offset: 15616)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !402, file: !403, line: 451, baseType: !1156, size: 2880, offset: 15680)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !403, line: 318, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !403, line: 319, size: 2880, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1178, !1179, !1184, !1189, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1204, !1205, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1237, !1238, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1261, !1262, !1263, !1267, !1268}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1157, file: !403, line: 320, baseType: !370, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1157, file: !403, line: 321, baseType: !370, size: 32, offset: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1157, file: !403, line: 322, baseType: !370, size: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1157, file: !403, line: 323, baseType: !370, size: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1157, file: !403, line: 324, baseType: !370, size: 32, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1157, file: !403, line: 325, baseType: !370, size: 32, offset: 160)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1157, file: !403, line: 326, baseType: !1166, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !403, line: 293, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !403, line: 295, size: 448, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1168, file: !403, line: 296, baseType: !1166, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1168, file: !403, line: 297, baseType: !531, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1168, file: !403, line: 297, baseType: !531, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1168, file: !403, line: 298, baseType: !514, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1168, file: !403, line: 298, baseType: !514, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1168, file: !403, line: 299, baseType: !370, size: 32, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1168, file: !403, line: 300, baseType: !370, size: 32, offset: 352)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1168, file: !403, line: 301, baseType: !370, size: 32, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1157, file: !403, line: 326, baseType: !1166, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1157, file: !403, line: 328, baseType: !1180, size: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!421, !400, !1183, !514}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1157, file: !403, line: 329, baseType: !1185, size: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!421, !1183, !1188, !516, !516, !534, !514}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1157, file: !403, line: 330, baseType: !1190, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!421, !1183}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1157, file: !403, line: 331, baseType: !1190, size: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1157, file: !403, line: 334, baseType: !425, size: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !403, line: 335, baseType: !485, size: 32, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1157, file: !403, line: 335, baseType: !485, size: 32, offset: 672)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1157, file: !403, line: 336, baseType: !485, size: 32, offset: 704)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1157, file: !403, line: 336, baseType: !485, size: 32, offset: 736)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1157, file: !403, line: 337, baseType: !1200, size: 64, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !426, line: 339, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !426, line: 339, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1157, file: !403, line: 338, baseType: !1200, size: 64, offset: 832)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1157, file: !403, line: 339, baseType: !1206, size: 64, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !426, line: 341, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !426, line: 351, size: 192, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1208, file: !426, line: 354, baseType: !72, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1208, file: !426, line: 355, baseType: !72, size: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1208, file: !426, line: 356, baseType: !72, size: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1208, file: !426, line: 361, baseType: !72, size: 32, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1208, file: !426, line: 362, baseType: !580, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1157, file: !403, line: 340, baseType: !370, size: 32, offset: 960)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1157, file: !403, line: 340, baseType: !370, size: 32, offset: 992)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1157, file: !403, line: 341, baseType: !531, size: 64, offset: 1024)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1157, file: !403, line: 342, baseType: !514, size: 64, offset: 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1157, file: !403, line: 343, baseType: !534, size: 64, offset: 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1157, file: !403, line: 344, baseType: !516, size: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1157, file: !403, line: 345, baseType: !370, size: 32, offset: 1280)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1157, file: !403, line: 346, baseType: !1188, size: 64, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1157, file: !403, line: 347, baseType: !375, size: 32, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1157, file: !403, line: 348, baseType: !370, size: 32, offset: 1440)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1157, file: !403, line: 351, baseType: !375, size: 32, offset: 1472)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1157, file: !403, line: 352, baseType: !375, size: 32, offset: 1504)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1157, file: !403, line: 353, baseType: !485, size: 32, offset: 1536)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1157, file: !403, line: 354, baseType: !485, size: 32, offset: 1568)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1157, file: !403, line: 355, baseType: !1188, size: 64, offset: 1600)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1157, file: !403, line: 356, baseType: !1188, size: 64, offset: 1664)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1157, file: !403, line: 357, baseType: !1232, size: 64, offset: 1728)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !403, line: 310, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 308, size: 32, elements: !1235)
!1235 = !{!1236}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1234, file: !403, line: 309, baseType: !370, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1157, file: !403, line: 357, baseType: !1232, size: 64, offset: 1792)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1157, file: !403, line: 358, baseType: !1239, size: 64, offset: 1856)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !403, line: 316, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 312, size: 128, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1241, file: !403, line: 313, baseType: !505, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1241, file: !403, line: 314, baseType: !370, size: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1241, file: !403, line: 315, baseType: !448, size: 8, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1157, file: !403, line: 359, baseType: !1239, size: 64, offset: 1920)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1157, file: !403, line: 360, baseType: !1239, size: 64, offset: 1984)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1157, file: !403, line: 361, baseType: !370, size: 32, offset: 2048)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1157, file: !403, line: 362, baseType: !485, size: 32, offset: 2080)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1157, file: !403, line: 363, baseType: !370, size: 32, offset: 2112)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1157, file: !403, line: 364, baseType: !1188, size: 64, offset: 2176)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1157, file: !403, line: 365, baseType: !1206, size: 64, offset: 2240)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1157, file: !403, line: 366, baseType: !485, size: 32, offset: 2304)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1157, file: !403, line: 367, baseType: !485, size: 32, offset: 2336)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1157, file: !403, line: 368, baseType: !1200, size: 64, offset: 2368)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1157, file: !403, line: 369, baseType: !1200, size: 64, offset: 2432)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1157, file: !403, line: 370, baseType: !1258, size: 64, offset: 2496)
