; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/tagm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/tagm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 663, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!32 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 510, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!53 = !DIEnumerator(name: "MPI_TAG_UB", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "MPI_HOST", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "MPI_IO", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "MPI_WTIME_IS_GLOBAL", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "MPI_APPNUM", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "MPI_LASTUSEDCODE", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "MPI_UNIVERSE_SIZE", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "MPI_WIN_BASE", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "MPI_WIN_SIZE", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "MPI_WIN_DISP_UNIT", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "MPI_WIN_CREATE_FLAVOR", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "MPI_WIN_MODEL", value: 11, isUnsigned: true)
!65 = !DIEnumerator(name: "IMPI_CLIENT_SIZE", value: 12, isUnsigned: true)
!66 = !DIEnumerator(name: "IMPI_CLIENT_COLOR", value: 13, isUnsigned: true)
!67 = !DIEnumerator(name: "IMPI_HOST_SIZE", value: 14, isUnsigned: true)
!68 = !DIEnumerator(name: "IMPI_HOST_COLOR", value: 15, isUnsigned: true)
!69 = !{!70, !73, !74, !77, !78, !79, !244, !148, !151, !278, !281, !5}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !51, line: 330, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !51, line: 330, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !86, !132, !133, !135, !138, !139, !140, !141, !149, !150, !152, !156, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !173, !174, !176, !177, !179, !181, !182, !183, !184, !185, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !211, !213, !214, !218, !219, !268, !273, !275, !276, !277}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !78)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !87, size: 448, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !130)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !90)
!90 = !{!91, !97, !105, !110, !114, !118, !125}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !89, file: !82, line: 46, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !79, !96}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !78)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !89, file: !82, line: 47, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!95, !79, !101}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !102, line: 16, baseType: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !102, line: 16, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !89, file: !82, line: 48, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!95, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !89, file: !82, line: 49, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!95, !79, !74, !79}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !89, file: !82, line: 50, baseType: !115, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!95, !79, !74, !109}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !89, file: !82, line: 51, baseType: !119, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!95, !79, !74, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !89, file: !82, line: 52, baseType: !126, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!95, !79, !74, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!130 = !{!131}
!131 = !DISubrange(count: 1)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !70, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !134, size: 32, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !78)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !137)
!137 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !142, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !145, line: 27, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !147, line: 43, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!148 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !134, size: 32, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !151, size: 32, offset: 992)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !78)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !153, size: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !157, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !77, size: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !77, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !77, size: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !77, size: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !142, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !77, size: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !77, size: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !134, size: 32, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !73, size: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !171, size: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !143)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !134, size: 32, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !134, size: 32, offset: 1888)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !175, size: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !175, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !178, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !180, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !134, size: 32, offset: 2176)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !134, size: 32, offset: 2208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !175, size: 64, offset: 2240)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !175, size: 64, offset: 2304)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !186, size: 64, offset: 2368)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !137)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !189, size: 64, offset: 2432)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !134, size: 32, offset: 2496)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !134, size: 32, offset: 2528)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !175, size: 64, offset: 2560)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !175, size: 64, offset: 2624)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !195, size: 64, offset: 2688)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !187)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !198, size: 64, offset: 2752)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !129, size: 64, offset: 2816)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !134, size: 32, offset: 2880)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !202, size: 128, offset: 2944)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !209)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !205, file: !82, line: 62, baseType: !122, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !205, file: !82, line: 63, baseType: !73, size: 64, offset: 64)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !212, size: 64, offset: 3072)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !209)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !73, size: 64, offset: 3136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !215, size: 64, offset: 3200)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!95, !73}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !134, size: 32, offset: 3264)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !220, size: 320, offset: 3328)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 320, elements: !266)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!95, !224, !79, !73}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !227)
!227 = !{!228, !229, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !226, file: !10, line: 100, baseType: !134, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !10, line: 101, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !241, !242, !243, !247, !249, !251, !252, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !232, file: !10, line: 84, baseType: !77, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !232, file: !10, line: 85, baseType: !77, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !10, line: 86, baseType: !73, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !232, file: !10, line: 87, baseType: !153, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !232, file: !10, line: 88, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !232, file: !10, line: 89, baseType: !76, size: 8, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !232, file: !10, line: 90, baseType: !77, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !232, file: !10, line: 91, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !245, line: 46, baseType: !246)
!245 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!246 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !232, file: !10, line: 92, baseType: !248, size: 32, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !10, line: 93, baseType: !250, size: 32, offset: 544)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !10, line: 94, baseType: !230, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !232, file: !10, line: 95, baseType: !77, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !232, file: !10, line: 96, baseType: !73, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !226, file: !10, line: 102, baseType: !77, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !226, file: !10, line: 102, baseType: !77, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !226, file: !10, line: 103, baseType: !77, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !226, file: !10, line: 104, baseType: !70, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !226, file: !10, line: 106, baseType: !79, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !226, file: !10, line: 107, baseType: !263, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!266 = !{!267}
!267 = !DISubrange(count: 5)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !269, size: 320, offset: 3648)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 320, elements: !266)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!95, !79, !73}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !274, size: 320, offset: 3968)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 320, elements: !266)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !248, size: 32, offset: 4288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !263, size: 64, offset: 4352)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !248, size: 32, offset: 4416)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !51, line: 331, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !51, line: 331, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !51, line: 338, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !51, line: 338, flags: DIFlagFwdDecl)
!284 = !{i32 7, !"Dwarf Version", i32 4}
!285 = !{i32 2, !"Debug Info Version", i32 3}
!286 = !{i32 1, !"wchar_size", i32 4}
!287 = !{i32 7, !"PIC Level", i32 2}
!288 = !{i32 7, !"uwtable", i32 1}
!289 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!290 = distinct !DISubprogram(name: "PetscObjectGetNewTag", scope: !291, file: !291, line: 30, type: !292, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !295)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/objects/tagm.c", directory: "/home/users/ndemeye/xSDK")
!292 = !DISubroutineType(types: !293)
!293 = !{!95, !79, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!295 = !{!296, !297, !298, !299}
!296 = !DILocalVariable(name: "obj", arg: 1, scope: !290, file: !291, line: 30, type: !79)
!297 = !DILocalVariable(name: "tag", arg: 2, scope: !290, file: !291, line: 30, type: !294)
!298 = !DILocalVariable(name: "ierr", scope: !290, file: !291, line: 32, type: !95)
!299 = !DILocalVariable(name: "ierr__", scope: !300, file: !291, line: 35, type: !95)
!300 = distinct !DILexicalBlock(scope: !290, file: !291, line: 35, column: 44)
!301 = !DILocation(line: 0, scope: !290)
!302 = !DILocation(line: 34, column: 3, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !291, line: 34, column: 3)
!304 = distinct !DILexicalBlock(scope: !305, file: !291, line: 34, column: 3)
!305 = distinct !DILexicalBlock(scope: !290, file: !291, line: 34, column: 3)
!306 = !{!307, !307, i64 0}
!307 = !{!"any pointer", !308, i64 0}
!308 = !{!"omnipotent char", !309, i64 0}
!309 = !{!"Simple C/C++ TBAA"}
!310 = !DILocation(line: 34, column: 3, scope: !304)
!311 = !DILocation(line: 34, column: 3, scope: !312)
!312 = distinct !DILexicalBlock(scope: !313, file: !291, line: 34, column: 3)
!313 = distinct !DILexicalBlock(scope: !303, file: !291, line: 34, column: 3)
!314 = !{!315, !316, i64 1536}
!315 = !{!"", !308, i64 0, !308, i64 512, !308, i64 1024, !308, i64 1280, !316, i64 1536, !316, i64 1540, !308, i64 1544}
!316 = !{!"int", !308, i64 0}
!317 = !DILocation(line: 34, column: 3, scope: !313)
!318 = !DILocation(line: 34, column: 3, scope: !319)
!319 = distinct !DILexicalBlock(scope: !312, file: !291, line: 34, column: 3)
!320 = !{!316, !316, i64 0}
!321 = !{!315, !316, i64 1540}
!322 = !DILocation(line: 35, column: 34, scope: !290)
!323 = !{!324, !307, i64 64}
!324 = !{!"_p_PetscObject", !316, i64 0, !308, i64 8, !307, i64 64, !316, i64 72, !325, i64 80, !325, i64 88, !325, i64 96, !325, i64 104, !326, i64 112, !316, i64 120, !316, i64 124, !307, i64 128, !307, i64 136, !307, i64 144, !307, i64 152, !307, i64 160, !307, i64 168, !307, i64 176, !326, i64 184, !307, i64 192, !307, i64 200, !316, i64 208, !307, i64 216, !326, i64 224, !316, i64 232, !316, i64 236, !307, i64 240, !307, i64 248, !307, i64 256, !307, i64 264, !316, i64 272, !316, i64 276, !307, i64 280, !307, i64 288, !307, i64 296, !307, i64 304, !316, i64 312, !316, i64 316, !307, i64 320, !307, i64 328, !307, i64 336, !307, i64 344, !307, i64 352, !316, i64 360, !308, i64 368, !308, i64 384, !307, i64 392, !307, i64 400, !316, i64 408, !308, i64 416, !308, i64 456, !308, i64 496, !308, i64 536, !307, i64 544, !308, i64 552}
!325 = !{!"double", !308, i64 0}
!326 = !{!"long", !308, i64 0}
!327 = !DILocation(line: 35, column: 10, scope: !290)
!328 = !DILocation(line: 0, scope: !300)
!329 = !DILocation(line: 35, column: 44, scope: !330)
!330 = distinct !DILexicalBlock(scope: !300, file: !291, line: 35, column: 44)
!331 = !DILocation(line: 35, column: 44, scope: !300)
!332 = !{!"branch_weights", i32 2000, i32 1}
!333 = !DILocation(line: 36, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !291, line: 36, column: 3)
!335 = distinct !DILexicalBlock(scope: !336, file: !291, line: 36, column: 3)
!336 = distinct !DILexicalBlock(scope: !290, file: !291, line: 36, column: 3)
!337 = !DILocation(line: 36, column: 3, scope: !335)
!338 = !DILocation(line: 36, column: 3, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !291, line: 36, column: 3)
!340 = distinct !DILexicalBlock(scope: !334, file: !291, line: 36, column: 3)
!341 = !DILocation(line: 36, column: 3, scope: !340)
!342 = !DILocation(line: 36, column: 3, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !291, line: 36, column: 3)
!344 = distinct !DILexicalBlock(scope: !339, file: !291, line: 36, column: 3)
!345 = !{!315, !308, i64 1544}
!346 = !DILocation(line: 36, column: 3, scope: !344)
!347 = !DILocation(line: 36, column: 3, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !291, line: 36, column: 3)
!349 = !DILocation(line: 36, column: 3, scope: !350)
!350 = distinct !DILexicalBlock(scope: !339, file: !291, line: 36, column: 3)
!351 = !DILocation(line: 36, column: 3, scope: !352)
!352 = distinct !DILexicalBlock(scope: !350, file: !291, line: 36, column: 3)
!353 = !DILocation(line: 36, column: 3, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !291, line: 36, column: 3)
!355 = distinct !DILexicalBlock(scope: !352, file: !291, line: 36, column: 3)
!356 = !DILocation(line: 36, column: 3, scope: !355)
!357 = !DILocation(line: 36, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !291, line: 36, column: 3)
!359 = !DILocation(line: 37, column: 1, scope: !290)
!360 = distinct !DISubprogram(name: "PetscCommGetNewTag", scope: !291, file: !291, line: 57, type: !361, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!95, !70, !294}
!363 = !{!364, !365, !366, !367, !376, !377, !378, !380, !386, !387, !391, !393, !396, !397, !401, !404}
!364 = !DILocalVariable(name: "comm", arg: 1, scope: !360, file: !291, line: 57, type: !70)
!365 = !DILocalVariable(name: "tag", arg: 2, scope: !360, file: !291, line: 57, type: !294)
!366 = !DILocalVariable(name: "ierr", scope: !360, file: !291, line: 59, type: !95)
!367 = !DILocalVariable(name: "counter", scope: !360, file: !291, line: 60, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCommCounter", file: !82, line: 869, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 864, size: 192, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !370, file: !82, line: 865, baseType: !151, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !370, file: !82, line: 866, baseType: !134, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "namecount", scope: !370, file: !82, line: 867, baseType: !134, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "iflags", scope: !370, file: !82, line: 868, baseType: !294, size: 64, offset: 128)
!376 = !DILocalVariable(name: "maxval", scope: !360, file: !291, line: 61, type: !294)
!377 = !DILocalVariable(name: "flg", scope: !360, file: !291, line: 61, type: !151)
!378 = !DILocalVariable(name: "_7_errorcode", scope: !379, file: !291, line: 66, type: !95)
!379 = distinct !DILexicalBlock(scope: !360, file: !291, line: 66, column: 69)
!380 = !DILocalVariable(name: "_7_errorstring", scope: !381, file: !291, line: 66, type: !383)
!381 = distinct !DILexicalBlock(scope: !382, file: !291, line: 66, column: 69)
!382 = distinct !DILexicalBlock(scope: !379, file: !291, line: 66, column: 69)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 256)
!386 = !DILocalVariable(name: "_7_resultlen", scope: !381, file: !291, line: 66, type: !151)
!387 = !DILocalVariable(name: "ierr__", scope: !388, file: !291, line: 70, type: !95)
!388 = distinct !DILexicalBlock(scope: !389, file: !291, line: 70, column: 120)
!389 = distinct !DILexicalBlock(scope: !390, file: !291, line: 69, column: 25)
!390 = distinct !DILexicalBlock(scope: !360, file: !291, line: 69, column: 7)
!391 = !DILocalVariable(name: "_7_errorcode", scope: !392, file: !291, line: 71, type: !95)
!392 = distinct !DILexicalBlock(scope: !389, file: !291, line: 71, column: 70)
!393 = !DILocalVariable(name: "_7_errorstring", scope: !394, file: !291, line: 71, type: !383)
!394 = distinct !DILexicalBlock(scope: !395, file: !291, line: 71, column: 70)
!395 = distinct !DILexicalBlock(scope: !392, file: !291, line: 71, column: 70)
!396 = !DILocalVariable(name: "_7_resultlen", scope: !394, file: !291, line: 71, type: !151)
!397 = !DILocalVariable(name: "_7_errorcode", scope: !398, file: !291, line: 81, type: !95)
!398 = distinct !DILexicalBlock(scope: !399, file: !291, line: 81, column: 30)
!399 = distinct !DILexicalBlock(scope: !400, file: !291, line: 77, column: 32)
!400 = distinct !DILexicalBlock(scope: !360, file: !291, line: 77, column: 7)
!401 = !DILocalVariable(name: "_7_errorstring", scope: !402, file: !291, line: 81, type: !383)
!402 = distinct !DILexicalBlock(scope: !403, file: !291, line: 81, column: 30)
!403 = distinct !DILexicalBlock(scope: !398, file: !291, line: 81, column: 30)
!404 = !DILocalVariable(name: "_7_resultlen", scope: !402, file: !291, line: 81, type: !151)
!405 = !DILocation(line: 0, scope: !360)
!406 = !DILocation(line: 60, column: 3, scope: !360)
!407 = !DILocation(line: 61, column: 3, scope: !360)
!408 = !DILocation(line: 63, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !291, line: 63, column: 3)
!410 = distinct !DILexicalBlock(scope: !411, file: !291, line: 63, column: 3)
!411 = distinct !DILexicalBlock(scope: !360, file: !291, line: 63, column: 3)
!412 = !DILocation(line: 63, column: 3, scope: !410)
!413 = !DILocation(line: 63, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !291, line: 63, column: 3)
!415 = distinct !DILexicalBlock(scope: !409, file: !291, line: 63, column: 3)
!416 = !DILocation(line: 63, column: 3, scope: !415)
!417 = !DILocation(line: 63, column: 3, scope: !418)
!418 = distinct !DILexicalBlock(scope: !414, file: !291, line: 63, column: 3)
!419 = !DILocation(line: 64, column: 3, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !291, line: 64, column: 3)
!421 = distinct !DILexicalBlock(scope: !360, file: !291, line: 64, column: 3)
!422 = !DILocation(line: 64, column: 3, scope: !421)
!423 = !DILocation(line: 64, column: 3, scope: !424)
!424 = distinct !DILexicalBlock(scope: !421, file: !291, line: 64, column: 3)
!425 = !DILocation(line: 66, column: 33, scope: !360)
!426 = !DILocation(line: 66, column: 10, scope: !360)
!427 = !DILocation(line: 0, scope: !379)
!428 = !DILocation(line: 66, column: 69, scope: !382)
!429 = !DILocation(line: 66, column: 69, scope: !379)
