; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/projection.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/projection.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 624, baseType: !5, size: 32, elements: !90)
!89 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 30, baseType: !5, size: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !106}
!102 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!106 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!107 = !{!108, !111, !112, !198, !119, !282, !148, !188, !316, !319, !174, !322, !5}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !89, line: 330, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !89, line: 330, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !115, line: 73, size: 4480, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !120, !169, !170, !172, !175, !176, !177, !178, !186, !187, !189, !193, !197, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !211, !212, !214, !215, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !231, !232, !235, !237, !238, !239, !249, !251, !252, !256, !257, !306, !311, !313, !314, !315}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !114, file: !115, line: 74, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !119)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !114, file: !115, line: 75, baseType: !121, size: 448, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 448, elements: !167)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !115, line: 53, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 45, size: 448, elements: !124)
!124 = !{!125, !131, !139, !144, !151, !155, !162}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !123, file: !115, line: 46, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !112, !130}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !119)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !123, file: !115, line: 47, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!129, !112, !135}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !136, line: 16, baseType: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !136, line: 16, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !123, file: !115, line: 48, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!129, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !123, file: !115, line: 49, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!129, !112, !148, !112}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !123, file: !115, line: 50, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!129, !112, !148, !143}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !123, file: !115, line: 51, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!129, !112, !148, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !123, file: !115, line: 52, baseType: !163, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!129, !112, !148, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!167 = !{!168}
!168 = !DISubrange(count: 1)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !114, file: !115, line: 76, baseType: !108, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !115, line: 77, baseType: !171, size: 32, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !119)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !114, file: !115, line: 78, baseType: !173, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !174)
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !114, file: !115, line: 78, baseType: !173, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !114, file: !115, line: 78, baseType: !173, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !114, file: !115, line: 78, baseType: !173, size: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !115, line: 79, baseType: !179, size: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !182, line: 27, baseType: !183)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !184, line: 43, baseType: !185)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!185 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !114, file: !115, line: 80, baseType: !171, size: 32, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !114, file: !115, line: 81, baseType: !188, size: 32, offset: 992)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !119)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !114, file: !115, line: 82, baseType: !190, size: 64, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !114, file: !115, line: 83, baseType: !194, size: 64, offset: 1088)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !114, file: !115, line: 84, baseType: !198, size: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !114, file: !115, line: 85, baseType: !198, size: 64, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !114, file: !115, line: 86, baseType: !198, size: 64, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !114, file: !115, line: 87, baseType: !198, size: 64, offset: 1344)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !114, file: !115, line: 88, baseType: !112, size: 64, offset: 1408)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !114, file: !115, line: 89, baseType: !179, size: 64, offset: 1472)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !115, line: 90, baseType: !198, size: 64, offset: 1536)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !114, file: !115, line: 91, baseType: !198, size: 64, offset: 1600)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !114, file: !115, line: 92, baseType: !171, size: 32, offset: 1664)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !114, file: !115, line: 93, baseType: !111, size: 64, offset: 1728)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !115, line: 94, baseType: !209, size: 64, offset: 1792)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !180)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !114, file: !115, line: 95, baseType: !171, size: 32, offset: 1856)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !114, file: !115, line: 95, baseType: !171, size: 32, offset: 1888)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !114, file: !115, line: 96, baseType: !213, size: 64, offset: 1920)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !114, file: !115, line: 96, baseType: !213, size: 64, offset: 1984)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !114, file: !115, line: 97, baseType: !216, size: 64, offset: 2048)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !114, file: !115, line: 97, baseType: !218, size: 64, offset: 2112)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !114, file: !115, line: 98, baseType: !171, size: 32, offset: 2176)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !114, file: !115, line: 98, baseType: !171, size: 32, offset: 2208)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !114, file: !115, line: 99, baseType: !213, size: 64, offset: 2240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !114, file: !115, line: 99, baseType: !213, size: 64, offset: 2304)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !114, file: !115, line: 100, baseType: !224, size: 64, offset: 2368)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !174)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !114, file: !115, line: 100, baseType: !227, size: 64, offset: 2432)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !114, file: !115, line: 101, baseType: !171, size: 32, offset: 2496)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !114, file: !115, line: 101, baseType: !171, size: 32, offset: 2528)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !114, file: !115, line: 102, baseType: !213, size: 64, offset: 2560)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !114, file: !115, line: 102, baseType: !213, size: 64, offset: 2624)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !114, file: !115, line: 103, baseType: !233, size: 64, offset: 2688)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !225)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !114, file: !115, line: 103, baseType: !236, size: 64, offset: 2752)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !114, file: !115, line: 104, baseType: !166, size: 64, offset: 2816)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !114, file: !115, line: 105, baseType: !171, size: 32, offset: 2880)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !114, file: !115, line: 106, baseType: !240, size: 128, offset: 2944)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !247)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !115, line: 64, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 61, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !243, file: !115, line: 62, baseType: !159, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !243, file: !115, line: 63, baseType: !111, size: 64, offset: 64)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !114, file: !115, line: 107, baseType: !250, size: 64, offset: 3072)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 64, elements: !247)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !114, file: !115, line: 108, baseType: !111, size: 64, offset: 3136)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !114, file: !115, line: 109, baseType: !253, size: 64, offset: 3200)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!129, !111}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !114, file: !115, line: 111, baseType: !171, size: 32, offset: 3264)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !114, file: !115, line: 112, baseType: !258, size: 320, offset: 3328)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 320, elements: !304)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!129, !262, !112, !111}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !265)
!265 = !{!266, !267, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !264, file: !10, line: 100, baseType: !171, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 101, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !285, !287, !289, !290, !291}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !270, file: !10, line: 84, baseType: !198, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !270, file: !10, line: 85, baseType: !198, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !10, line: 86, baseType: !111, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !270, file: !10, line: 87, baseType: !190, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !270, file: !10, line: 88, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !270, file: !10, line: 89, baseType: !150, size: 8, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !270, file: !10, line: 90, baseType: !198, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !270, file: !10, line: 91, baseType: !282, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !283, line: 46, baseType: !284)
!283 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!284 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !270, file: !10, line: 92, baseType: !286, size: 32, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !10, line: 93, baseType: !288, size: 32, offset: 544)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !10, line: 94, baseType: !268, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !270, file: !10, line: 95, baseType: !198, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !270, file: !10, line: 96, baseType: !111, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !264, file: !10, line: 102, baseType: !198, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !264, file: !10, line: 102, baseType: !198, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !264, file: !10, line: 103, baseType: !198, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !264, file: !10, line: 104, baseType: !108, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !264, file: !10, line: 105, baseType: !286, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !264, file: !10, line: 105, baseType: !286, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !264, file: !10, line: 105, baseType: !286, size: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !264, file: !10, line: 106, baseType: !112, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !264, file: !10, line: 107, baseType: !301, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!304 = !{!305}
!305 = !DISubrange(count: 5)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !114, file: !115, line: 113, baseType: !307, size: 320, offset: 3648)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !304)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!129, !112, !111}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !114, file: !115, line: 114, baseType: !312, size: 320, offset: 3968)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 320, elements: !304)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !114, file: !115, line: 115, baseType: !286, size: 32, offset: 4288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !115, line: 120, baseType: !301, size: 64, offset: 4352)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !114, file: !115, line: 121, baseType: !286, size: 32, offset: 4416)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !89, line: 331, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !89, line: 331, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !89, line: 338, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !89, line: 338, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!325 = !{i32 7, !"Dwarf Version", i32 4}
!326 = !{i32 2, !"Debug Info Version", i32 3}
!327 = !{i32 1, !"wchar_size", i32 4}
!328 = !{i32 7, !"PIC Level", i32 2}
!329 = !{i32 7, !"uwtable", i32 1}
!330 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!331 = distinct !DISubprogram(name: "VecWhichEqual", scope: !332, file: !332, line: 20, type: !333, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !634)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/projection.c", directory: "/home/users/ndemeye/xSDK")
!333 = !DISubroutineType(types: !334)
!334 = !{!129, !335, !335, !558}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !338, line: 142, size: 12800, elements: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!339 = !{!340, !342, !559, !580, !581, !582, !628, !629, !630, !631, !633}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !337, file: !338, line: 143, baseType: !341, size: 4480)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !115, line: 122, baseType: !114)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !337, file: !338, line: 143, baseType: !343, size: 5248, offset: 4480)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 5248, elements: !167)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !338, line: 23, size: 5248, elements: !345)
!345 = !{!346, !351, !356, !360, !364, !370, !375, !376, !377, !381, !385, !386, !387, !391, !395, !399, !400, !404, !408, !412, !413, !420, !424, !425, !429, !433, !434, !435, !439, !440, !447, !452, !453, !454, !458, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !479, !480, !481, !485, !489, !490, !491, !492, !496, !497, !498, !499, !500, !501, !502, !506, !507, !511, !518, !519, !523, !524, !528, !529, !530, !531, !532, !533, !534, !535, !539, !540, !541, !547, !551, !552, !553}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !344, file: !338, line: 24, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!129, !335, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !344, file: !338, line: 25, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!129, !335, !171, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !344, file: !338, line: 26, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!129, !171, !350}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !344, file: !338, line: 27, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!129, !335, !335, !233}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !344, file: !338, line: 28, baseType: !365, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!129, !335, !171, !368, !233}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !344, file: !338, line: 29, baseType: !371, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!129, !335, !374, !224}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !344, file: !338, line: 30, baseType: !361, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !344, file: !338, line: 31, baseType: !365, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !344, file: !338, line: 32, baseType: !378, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!129, !335, !234}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !344, file: !338, line: 33, baseType: !382, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!129, !335, !335}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !344, file: !338, line: 34, baseType: !378, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !344, file: !338, line: 35, baseType: !382, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !344, file: !338, line: 36, baseType: !388, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!129, !335, !234, !335}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !344, file: !338, line: 37, baseType: !392, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!129, !335, !234, !234, !335}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !344, file: !338, line: 38, baseType: !396, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!129, !335, !171, !323, !350}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !344, file: !338, line: 39, baseType: !388, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !344, file: !338, line: 40, baseType: !401, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!129, !335, !234, !335, !335}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !344, file: !338, line: 41, baseType: !405, size: 64, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!129, !335, !234, !234, !234, !335, !335}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !344, file: !338, line: 42, baseType: !409, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!129, !335, !335, !335}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !344, file: !338, line: 43, baseType: !409, size: 64, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !344, file: !338, line: 44, baseType: !414, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!129, !335, !171, !417, !323, !419}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !344, file: !338, line: 45, baseType: !421, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!129, !335}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !344, file: !338, line: 46, baseType: !421, size: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !344, file: !338, line: 47, baseType: !426, size: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!129, !335, !236}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !344, file: !338, line: 48, baseType: !430, size: 64, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!129, !335, !216}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !344, file: !338, line: 49, baseType: !430, size: 64, offset: 1600)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !344, file: !338, line: 50, baseType: !426, size: 64, offset: 1664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !344, file: !338, line: 51, baseType: !436, size: 64, offset: 1728)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!129, !335, !216, !224}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !344, file: !338, line: 52, baseType: !436, size: 64, offset: 1792)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !344, file: !338, line: 53, baseType: !441, size: 64, offset: 1856)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!129, !335, !444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !344, file: !338, line: 54, baseType: !448, size: 64, offset: 1920)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!129, !335, !451, !286}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !344, file: !338, line: 55, baseType: !414, size: 64, offset: 1984)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !344, file: !338, line: 56, baseType: !421, size: 64, offset: 2048)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !344, file: !338, line: 57, baseType: !455, size: 64, offset: 2112)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!129, !335, !135}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !344, file: !338, line: 58, baseType: !459, size: 64, offset: 2176)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!129, !335, !323}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !344, file: !338, line: 59, baseType: !459, size: 64, offset: 2240)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !344, file: !338, line: 60, baseType: !361, size: 64, offset: 2304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !344, file: !338, line: 61, baseType: !361, size: 64, offset: 2368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !344, file: !338, line: 62, baseType: !371, size: 64, offset: 2432)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !344, file: !338, line: 63, baseType: !365, size: 64, offset: 2496)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !344, file: !338, line: 64, baseType: !365, size: 64, offset: 2560)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !344, file: !338, line: 65, baseType: !455, size: 64, offset: 2624)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !344, file: !338, line: 66, baseType: !421, size: 64, offset: 2688)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !344, file: !338, line: 67, baseType: !421, size: 64, offset: 2752)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !344, file: !338, line: 68, baseType: !472, size: 64, offset: 2816)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!129, !335, !475}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !476, line: 30, baseType: !477)
!476 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !476, line: 30, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !344, file: !338, line: 69, baseType: !414, size: 64, offset: 2880)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !344, file: !338, line: 70, baseType: !421, size: 64, offset: 2944)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !344, file: !338, line: 71, baseType: !482, size: 64, offset: 3008)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!129, !262, !335}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !344, file: !338, line: 72, baseType: !486, size: 64, offset: 3072)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!129, !335, !335, !224}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !344, file: !338, line: 73, baseType: !409, size: 64, offset: 3136)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !344, file: !338, line: 74, baseType: !409, size: 64, offset: 3200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !344, file: !338, line: 75, baseType: !409, size: 64, offset: 3264)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !344, file: !338, line: 76, baseType: !493, size: 64, offset: 3328)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!129, !335, !171, !417, !233}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !344, file: !338, line: 77, baseType: !421, size: 64, offset: 3392)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !344, file: !338, line: 78, baseType: !421, size: 64, offset: 3456)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !344, file: !338, line: 79, baseType: !421, size: 64, offset: 3520)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !344, file: !338, line: 80, baseType: !421, size: 64, offset: 3584)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !344, file: !338, line: 81, baseType: !378, size: 64, offset: 3648)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !344, file: !338, line: 82, baseType: !421, size: 64, offset: 3712)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !344, file: !338, line: 83, baseType: !503, size: 64, offset: 3776)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!129, !335, !171, !335, !419}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !344, file: !338, line: 84, baseType: !503, size: 64, offset: 3840)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !344, file: !338, line: 85, baseType: !508, size: 64, offset: 3904)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!129, !335, !335, !233, !233}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !344, file: !338, line: 86, baseType: !512, size: 64, offset: 3968)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!129, !335, !515, !350}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !476, line: 11, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !476, line: 11, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !344, file: !338, line: 87, baseType: !512, size: 64, offset: 4032)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !344, file: !338, line: 88, baseType: !520, size: 64, offset: 4096)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!129, !335, !322}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !344, file: !338, line: 89, baseType: !520, size: 64, offset: 4160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !344, file: !338, line: 90, baseType: !525, size: 64, offset: 4224)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!129, !335, !171, !417, !417, !335, !419}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !344, file: !338, line: 91, baseType: !525, size: 64, offset: 4288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !344, file: !338, line: 92, baseType: !455, size: 64, offset: 4352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !344, file: !338, line: 93, baseType: !455, size: 64, offset: 4416)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !344, file: !338, line: 94, baseType: !382, size: 64, offset: 4480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !344, file: !338, line: 95, baseType: !382, size: 64, offset: 4544)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !344, file: !338, line: 96, baseType: !382, size: 64, offset: 4608)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !344, file: !338, line: 97, baseType: !382, size: 64, offset: 4672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !344, file: !338, line: 98, baseType: !536, size: 64, offset: 4736)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!129, !335, !286}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !344, file: !338, line: 99, baseType: !426, size: 64, offset: 4800)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !344, file: !338, line: 100, baseType: !426, size: 64, offset: 4864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !344, file: !338, line: 101, baseType: !542, size: 64, offset: 4928)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!129, !335, !236, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !344, file: !338, line: 102, baseType: !548, size: 64, offset: 4992)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!129, !335, !322, !545}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !344, file: !338, line: 103, baseType: !426, size: 64, offset: 5056)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !344, file: !338, line: 104, baseType: !520, size: 64, offset: 5120)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !344, file: !338, line: 105, baseType: !554, size: 64, offset: 5184)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!129, !171, !368, !350, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !337, file: !338, line: 144, baseType: !560, size: 64, offset: 9728)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !476, line: 60, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !563, line: 240, size: 640, elements: !564)
!563 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !562, file: !563, line: 241, baseType: !108, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !563, line: 242, baseType: !188, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !562, file: !563, line: 243, baseType: !171, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !562, file: !563, line: 243, baseType: !171, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !562, file: !563, line: 244, baseType: !171, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !562, file: !563, line: 244, baseType: !171, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !562, file: !563, line: 245, baseType: !216, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !562, file: !563, line: 246, baseType: !286, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !562, file: !563, line: 247, baseType: !171, size: 32, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !562, file: !563, line: 251, baseType: !171, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !562, file: !563, line: 252, baseType: !475, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !562, file: !563, line: 253, baseType: !286, size: 32, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !562, file: !563, line: 254, baseType: !171, size: 32, offset: 544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !562, file: !563, line: 254, baseType: !171, size: 32, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !562, file: !563, line: 255, baseType: !171, size: 32, offset: 608)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !338, line: 145, baseType: !111, size: 64, offset: 9792)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !337, file: !338, line: 146, baseType: !286, size: 32, offset: 9856)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !337, file: !338, line: 147, baseType: !583, size: 1344, offset: 9920)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !338, line: 140, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 114, size: 1344, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !604, !605, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !584, file: !338, line: 115, baseType: !171, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !584, file: !338, line: 116, baseType: !171, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !584, file: !338, line: 117, baseType: !171, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !584, file: !338, line: 118, baseType: !171, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !584, file: !338, line: 119, baseType: !171, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !584, file: !338, line: 120, baseType: !171, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !584, file: !338, line: 121, baseType: !216, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !584, file: !338, line: 122, baseType: !233, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !584, file: !338, line: 124, baseType: !108, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !584, file: !338, line: 125, baseType: !188, size: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !584, file: !338, line: 125, baseType: !188, size: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !584, file: !338, line: 126, baseType: !188, size: 32, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !584, file: !338, line: 126, baseType: !188, size: 32, offset: 480)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !584, file: !338, line: 127, baseType: !600, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !89, line: 339, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !89, line: 339, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !584, file: !338, line: 128, baseType: !600, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !584, file: !338, line: 129, baseType: !606, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !89, line: 341, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !89, line: 351, size: 192, elements: !609)
!609 = !{!610, !611, !612, !613, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !608, file: !89, line: 354, baseType: !119, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !608, file: !89, line: 355, baseType: !119, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !608, file: !89, line: 356, baseType: !119, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !608, file: !89, line: 361, baseType: !119, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !608, file: !89, line: 362, baseType: !282, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !584, file: !338, line: 130, baseType: !171, size: 32, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !584, file: !338, line: 130, baseType: !171, size: 32, offset: 736)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !584, file: !338, line: 131, baseType: !233, size: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !584, file: !338, line: 131, baseType: !233, size: 64, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !584, file: !338, line: 132, baseType: !216, size: 64, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !584, file: !338, line: 132, baseType: !216, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !584, file: !338, line: 133, baseType: !171, size: 32, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !584, file: !338, line: 134, baseType: !216, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !584, file: !338, line: 135, baseType: !171, size: 32, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !584, file: !338, line: 136, baseType: !286, size: 32, offset: 1184)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !584, file: !338, line: 137, baseType: !286, size: 32, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !584, file: !338, line: 138, baseType: !419, size: 32, offset: 1248)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !584, file: !338, line: 139, baseType: !216, size: 64, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !337, file: !338, line: 147, baseType: !583, size: 1344, offset: 11264)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !337, file: !338, line: 148, baseType: !286, size: 32, offset: 12608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !337, file: !338, line: 149, baseType: !171, size: 32, offset: 12640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !337, file: !338, line: 150, baseType: !632, size: 32, offset: 12672)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !337, file: !338, line: 157, baseType: !198, size: 64, offset: 12736)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !649, !650, !652, !658, !659, !661, !663, !669, !672, !674, !676, !680, !683, !685}
!635 = !DILocalVariable(name: "Vec1", arg: 1, scope: !331, file: !332, line: 20, type: !335)
!636 = !DILocalVariable(name: "Vec2", arg: 2, scope: !331, file: !332, line: 20, type: !335)
!637 = !DILocalVariable(name: "S", arg: 3, scope: !331, file: !332, line: 20, type: !558)
!638 = !DILocalVariable(name: "ierr", scope: !331, file: !332, line: 22, type: !129)
!639 = !DILocalVariable(name: "i", scope: !331, file: !332, line: 23, type: !171)
!640 = !DILocalVariable(name: "n_same", scope: !331, file: !332, line: 23, type: !171)
!641 = !DILocalVariable(name: "n", scope: !331, file: !332, line: 24, type: !171)
!642 = !DILocalVariable(name: "low", scope: !331, file: !332, line: 24, type: !171)
!643 = !DILocalVariable(name: "high", scope: !331, file: !332, line: 24, type: !171)
!644 = !DILocalVariable(name: "same", scope: !331, file: !332, line: 25, type: !216)
!645 = !DILocalVariable(name: "v1", scope: !331, file: !332, line: 26, type: !323)
!646 = !DILocalVariable(name: "v2", scope: !331, file: !332, line: 26, type: !323)
!647 = !DILocalVariable(name: "_7_ierr", scope: !648, file: !332, line: 31, type: !129)
!648 = distinct !DILexicalBlock(scope: !331, file: !332, line: 31, column: 3)
!649 = !DILocalVariable(name: "_7_flag", scope: !648, file: !332, line: 31, type: !188)
!650 = !DILocalVariable(name: "_7_errorcode", scope: !651, file: !332, line: 31, type: !129)
!651 = distinct !DILexicalBlock(scope: !648, file: !332, line: 31, column: 3)
!652 = !DILocalVariable(name: "_7_errorstring", scope: !653, file: !332, line: 31, type: !655)
!653 = distinct !DILexicalBlock(scope: !654, file: !332, line: 31, column: 3)
!654 = distinct !DILexicalBlock(scope: !651, file: !332, line: 31, column: 3)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2048, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 256)
!658 = !DILocalVariable(name: "_7_resultlen", scope: !653, file: !332, line: 31, type: !188)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !332, line: 34, type: !129)
!660 = distinct !DILexicalBlock(scope: !331, file: !332, line: 34, column: 48)
!661 = !DILocalVariable(name: "ierr__", scope: !662, file: !332, line: 35, type: !129)
!662 = distinct !DILexicalBlock(scope: !331, file: !332, line: 35, column: 35)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !332, line: 38, type: !129)
!664 = distinct !DILexicalBlock(scope: !665, file: !332, line: 38, column: 40)
!665 = distinct !DILexicalBlock(scope: !666, file: !332, line: 37, column: 23)
!666 = distinct !DILexicalBlock(scope: !667, file: !332, line: 37, column: 9)
!667 = distinct !DILexicalBlock(scope: !668, file: !332, line: 36, column: 12)
!668 = distinct !DILexicalBlock(scope: !331, file: !332, line: 36, column: 7)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !332, line: 41, type: !129)
!670 = distinct !DILexicalBlock(scope: !671, file: !332, line: 41, column: 40)
!671 = distinct !DILexicalBlock(scope: !666, file: !332, line: 40, column: 12)
!672 = !DILocalVariable(name: "ierr__", scope: !673, file: !332, line: 42, type: !129)
!673 = distinct !DILexicalBlock(scope: !671, file: !332, line: 42, column: 40)
!674 = !DILocalVariable(name: "ierr__", scope: !675, file: !332, line: 45, type: !129)
!675 = distinct !DILexicalBlock(scope: !667, file: !332, line: 45, column: 34)
!676 = !DILocalVariable(name: "ierr__", scope: !677, file: !332, line: 52, type: !129)
!677 = distinct !DILexicalBlock(scope: !678, file: !332, line: 52, column: 44)
!678 = distinct !DILexicalBlock(scope: !679, file: !332, line: 51, column: 23)
!679 = distinct !DILexicalBlock(scope: !667, file: !332, line: 51, column: 9)
