; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vector.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vector.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!100 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 595, baseType: !7, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148}
!144 = !DIEnumerator(name: "VECOP_DUPLICATE", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "VECOP_VIEW", value: 33, isUnsigned: true)
!146 = !DIEnumerator(name: "VECOP_LOAD", value: 41, isUnsigned: true)
!147 = !DIEnumerator(name: "VECOP_VIEWNATIVE", value: 68, isUnsigned: true)
!148 = !DIEnumerator(name: "VECOP_LOADNATIVE", value: 69, isUnsigned: true)
!149 = !{!150, !153, !154, !157, !240, !164, !324, !208, !230, !358, !361, !7}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !91, line: 330, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !91, line: 330, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !160, line: 73, size: 4480, elements: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!161 = !{!162, !165, !211, !212, !214, !217, !218, !219, !220, !228, !229, !231, !235, !239, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !252, !253, !254, !256, !257, !259, !261, !262, !263, !264, !265, !268, !270, !271, !272, !273, !274, !277, !279, !280, !281, !291, !293, !294, !298, !299, !348, !353, !355, !356, !357}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !159, file: !160, line: 74, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !164)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !159, file: !160, line: 75, baseType: !166, size: 448, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 448, elements: !209)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !160, line: 53, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 45, size: 448, elements: !169)
!169 = !{!170, !176, !184, !189, !193, !197, !204}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !168, file: !160, line: 46, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !157, !175}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !164)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !168, file: !160, line: 47, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!174, !157, !180}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !181, line: 16, baseType: !182)
!181 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !181, line: 16, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !168, file: !160, line: 48, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!174, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !168, file: !160, line: 49, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!174, !157, !154, !157}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !168, file: !160, line: 50, baseType: !194, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!174, !157, !154, !188}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !168, file: !160, line: 51, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!174, !157, !154, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !168, file: !160, line: 52, baseType: !205, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!174, !157, !154, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!209 = !{!210}
!210 = !DISubrange(count: 1)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !159, file: !160, line: 76, baseType: !150, size: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !160, line: 77, baseType: !213, size: 32, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !164)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !159, file: !160, line: 78, baseType: !215, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !216)
!216 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !159, file: !160, line: 78, baseType: !215, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !159, file: !160, line: 78, baseType: !215, size: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !159, file: !160, line: 78, baseType: !215, size: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !160, line: 79, baseType: !221, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !224, line: 27, baseType: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !226, line: 43, baseType: !227)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!227 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !159, file: !160, line: 80, baseType: !213, size: 32, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !159, file: !160, line: 81, baseType: !230, size: 32, offset: 992)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !164)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !159, file: !160, line: 82, baseType: !232, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !159, file: !160, line: 83, baseType: !236, size: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !159, file: !160, line: 84, baseType: !240, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !159, file: !160, line: 85, baseType: !240, size: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !159, file: !160, line: 86, baseType: !240, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !159, file: !160, line: 87, baseType: !240, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !159, file: !160, line: 88, baseType: !157, size: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !159, file: !160, line: 89, baseType: !221, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 90, baseType: !240, size: 64, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !159, file: !160, line: 91, baseType: !240, size: 64, offset: 1600)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !159, file: !160, line: 92, baseType: !213, size: 32, offset: 1664)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !159, file: !160, line: 93, baseType: !153, size: 64, offset: 1728)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !159, file: !160, line: 94, baseType: !251, size: 64, offset: 1792)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !159, file: !160, line: 95, baseType: !213, size: 32, offset: 1856)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !159, file: !160, line: 95, baseType: !213, size: 32, offset: 1888)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !159, file: !160, line: 96, baseType: !255, size: 64, offset: 1920)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !159, file: !160, line: 96, baseType: !255, size: 64, offset: 1984)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !159, file: !160, line: 97, baseType: !258, size: 64, offset: 2048)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !159, file: !160, line: 97, baseType: !260, size: 64, offset: 2112)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !159, file: !160, line: 98, baseType: !213, size: 32, offset: 2176)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !159, file: !160, line: 98, baseType: !213, size: 32, offset: 2208)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !159, file: !160, line: 99, baseType: !255, size: 64, offset: 2240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !159, file: !160, line: 99, baseType: !255, size: 64, offset: 2304)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !159, file: !160, line: 100, baseType: !266, size: 64, offset: 2368)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !159, file: !160, line: 100, baseType: !269, size: 64, offset: 2432)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !159, file: !160, line: 101, baseType: !213, size: 32, offset: 2496)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !159, file: !160, line: 101, baseType: !213, size: 32, offset: 2528)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !159, file: !160, line: 102, baseType: !255, size: 64, offset: 2560)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !159, file: !160, line: 102, baseType: !255, size: 64, offset: 2624)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !159, file: !160, line: 103, baseType: !275, size: 64, offset: 2688)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !267)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !159, file: !160, line: 103, baseType: !278, size: 64, offset: 2752)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !159, file: !160, line: 104, baseType: !208, size: 64, offset: 2816)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !159, file: !160, line: 105, baseType: !213, size: 32, offset: 2880)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !159, file: !160, line: 106, baseType: !282, size: 128, offset: 2944)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 128, elements: !289)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !160, line: 64, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 61, size: 128, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !285, file: !160, line: 62, baseType: !201, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !285, file: !160, line: 63, baseType: !153, size: 64, offset: 64)
!289 = !{!290}
!290 = !DISubrange(count: 2)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !159, file: !160, line: 107, baseType: !292, size: 64, offset: 3072)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 64, elements: !289)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !159, file: !160, line: 108, baseType: !153, size: 64, offset: 3136)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !159, file: !160, line: 109, baseType: !295, size: 64, offset: 3200)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!174, !153}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !159, file: !160, line: 111, baseType: !213, size: 32, offset: 3264)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !159, file: !160, line: 112, baseType: !300, size: 320, offset: 3328)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 320, elements: !346)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!174, !304, !157, !153}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !307)
!307 = !{!308, !309, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !306, file: !12, line: 100, baseType: !213, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !12, line: 101, baseType: !310, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !321, !322, !323, !327, !329, !331, !332, !333}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !312, file: !12, line: 84, baseType: !240, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !312, file: !12, line: 85, baseType: !240, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !12, line: 86, baseType: !153, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !312, file: !12, line: 87, baseType: !232, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !312, file: !12, line: 88, baseType: !319, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !312, file: !12, line: 89, baseType: !156, size: 8, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !312, file: !12, line: 90, baseType: !240, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !312, file: !12, line: 91, baseType: !324, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !325, line: 46, baseType: !326)
!325 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!326 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !312, file: !12, line: 92, baseType: !328, size: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !12, line: 93, baseType: !330, size: 32, offset: 544)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !12, line: 94, baseType: !310, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !312, file: !12, line: 95, baseType: !240, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !312, file: !12, line: 96, baseType: !153, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !306, file: !12, line: 102, baseType: !240, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !306, file: !12, line: 102, baseType: !240, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !306, file: !12, line: 103, baseType: !240, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !306, file: !12, line: 104, baseType: !150, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !306, file: !12, line: 105, baseType: !328, size: 32, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !306, file: !12, line: 105, baseType: !328, size: 32, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !306, file: !12, line: 105, baseType: !328, size: 32, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !306, file: !12, line: 106, baseType: !157, size: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !306, file: !12, line: 107, baseType: !343, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!346 = !{!347}
!347 = !DISubrange(count: 5)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !159, file: !160, line: 113, baseType: !349, size: 320, offset: 3648)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 320, elements: !346)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!174, !157, !153}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !159, file: !160, line: 114, baseType: !354, size: 320, offset: 3968)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, elements: !346)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !159, file: !160, line: 115, baseType: !328, size: 32, offset: 4288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !159, file: !160, line: 120, baseType: !343, size: 64, offset: 4352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !159, file: !160, line: 121, baseType: !328, size: 32, offset: 4416)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !91, line: 331, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !91, line: 331, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !91, line: 338, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !91, line: 338, flags: DIFlagFwdDecl)
!364 = !{!0, !365, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "VEC_View", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!367 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/vector.c", directory: "/home/users/ndemeye/xSDK")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !369, line: 80, baseType: !164)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "VEC_Max", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "VEC_Min", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "VEC_Dot", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "VEC_MDot", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "VEC_TDot", scope: !2, file: !367, line: 9, type: !368, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "VEC_Norm", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "VEC_Normalize", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "VEC_Scale", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "VEC_Copy", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "VEC_Set", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "VEC_AXPY", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "VEC_AYPX", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "VEC_WAXPY", scope: !2, file: !367, line: 10, type: !368, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "VEC_MTDot", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "VEC_MAXPY", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "VEC_Swap", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "VEC_AssemblyBegin", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "VEC_ScatterBegin", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "VEC_ScatterEnd", scope: !2, file: !367, line: 11, type: !368, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "VEC_AssemblyEnd", scope: !2, file: !367, line: 12, type: !368, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "VEC_PointwiseMult", scope: !2, file: !367, line: 12, type: !368, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "VEC_SetValues", scope: !2, file: !367, line: 12, type: !368, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "VEC_Load", scope: !2, file: !367, line: 12, type: !368, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "VEC_SetRandom", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "VEC_ReduceArithmetic", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "VEC_ReduceCommunication", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "VEC_ReduceBegin", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "VEC_ReduceEnd", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "VEC_Ops", scope: !2, file: !367, line: 13, type: !368, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "VEC_DotNorm2", scope: !2, file: !367, line: 14, type: !368, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "VEC_AXPBYPCZ", scope: !2, file: !367, line: 14, type: !368, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "VEC_ViennaCLCopyFromGPU", scope: !2, file: !367, line: 15, type: !368, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "VEC_ViennaCLCopyToGPU", scope: !2, file: !367, line: 15, type: !368, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "VEC_CUDACopyFromGPU", scope: !2, file: !367, line: 16, type: !368, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "VEC_CUDACopyToGPU", scope: !2, file: !367, line: 16, type: !368, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "VEC_CUDACopyFromGPUSome", scope: !2, file: !367, line: 17, type: !368, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "VEC_CUDACopyToGPUSome", scope: !2, file: !367, line: 17, type: !368, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "VEC_HIPCopyFromGPU", scope: !2, file: !367, line: 18, type: !368, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "VEC_HIPCopyToGPU", scope: !2, file: !367, line: 18, type: !368, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "VEC_HIPCopyFromGPUSome", scope: !2, file: !367, line: 19, type: !368, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "VEC_HIPCopyToGPUSome", scope: !2, file: !367, line: 19, type: !368, isLocal: false, isDefinition: true)
!452 = !{i32 7, !"Dwarf Version", i32 4}
!453 = !{i32 2, !"Debug Info Version", i32 3}
!454 = !{i32 1, !"wchar_size", i32 4}
!455 = !{i32 7, !"PIC Level", i32 2}
!456 = !{i32 7, !"uwtable", i32 1}
!457 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!458 = distinct !DISubprogram(name: "VecStashGetInfo", scope: !367, file: !367, line: 41, type: !459, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !763)
!459 = !DISubroutineType(types: !460)
!460 = !{!174, !461, !258, !258, !258, !258}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !464, line: 142, size: 12800, elements: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!465 = !{!466, !468, !688, !709, !710, !711, !757, !758, !759, !760, !762}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !463, file: !464, line: 143, baseType: !467, size: 4480)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !160, line: 122, baseType: !159)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !463, file: !464, line: 143, baseType: !469, size: 5248, offset: 4480)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 5248, elements: !209)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !464, line: 23, size: 5248, elements: !471)
!471 = !{!472, !477, !482, !486, !490, !496, !501, !502, !503, !507, !511, !512, !513, !517, !521, !527, !528, !532, !536, !540, !541, !548, !552, !553, !557, !561, !562, !563, !567, !568, !575, !580, !581, !582, !586, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !607, !608, !609, !613, !617, !618, !619, !620, !624, !625, !626, !627, !628, !629, !630, !634, !635, !639, !646, !647, !652, !653, !657, !658, !659, !660, !661, !662, !663, !664, !668, !669, !670, !676, !680, !681, !682}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !470, file: !464, line: 24, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!174, !461, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !470, file: !464, line: 25, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!174, !461, !213, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !470, file: !464, line: 26, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!174, !213, !476}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !470, file: !464, line: 27, baseType: !487, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!174, !461, !461, !275}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !470, file: !464, line: 28, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!174, !461, !213, !494, !275}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !470, file: !464, line: 29, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!174, !461, !500, !266}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !470, file: !464, line: 30, baseType: !487, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !470, file: !464, line: 31, baseType: !491, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !470, file: !464, line: 32, baseType: !504, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!174, !461, !276}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !470, file: !464, line: 33, baseType: !508, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!174, !461, !461}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !470, file: !464, line: 34, baseType: !504, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !470, file: !464, line: 35, baseType: !508, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !470, file: !464, line: 36, baseType: !514, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!174, !461, !276, !461}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !470, file: !464, line: 37, baseType: !518, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!174, !461, !276, !276, !461}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !470, file: !464, line: 38, baseType: !522, size: 64, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!174, !461, !213, !525, !476}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !470, file: !464, line: 39, baseType: !514, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !470, file: !464, line: 40, baseType: !529, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!174, !461, !276, !461, !461}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !470, file: !464, line: 41, baseType: !533, size: 64, offset: 1088)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!174, !461, !276, !276, !276, !461, !461}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !470, file: !464, line: 42, baseType: !537, size: 64, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!174, !461, !461, !461}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !470, file: !464, line: 43, baseType: !537, size: 64, offset: 1216)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !470, file: !464, line: 44, baseType: !542, size: 64, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!174, !461, !213, !545, !525, !547}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !470, file: !464, line: 45, baseType: !549, size: 64, offset: 1344)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!174, !461}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !470, file: !464, line: 46, baseType: !549, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !470, file: !464, line: 47, baseType: !554, size: 64, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!174, !461, !278}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !470, file: !464, line: 48, baseType: !558, size: 64, offset: 1536)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!174, !461, !258}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !470, file: !464, line: 49, baseType: !558, size: 64, offset: 1600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !470, file: !464, line: 50, baseType: !554, size: 64, offset: 1664)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !470, file: !464, line: 51, baseType: !564, size: 64, offset: 1728)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!174, !461, !258, !266}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !470, file: !464, line: 52, baseType: !564, size: 64, offset: 1792)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !470, file: !464, line: 53, baseType: !569, size: 64, offset: 1856)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!174, !461, !572}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !470, file: !464, line: 54, baseType: !576, size: 64, offset: 1920)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!174, !461, !579, !328}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !470, file: !464, line: 55, baseType: !542, size: 64, offset: 1984)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !470, file: !464, line: 56, baseType: !549, size: 64, offset: 2048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !470, file: !464, line: 57, baseType: !583, size: 64, offset: 2112)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!174, !461, !180}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !470, file: !464, line: 58, baseType: !587, size: 64, offset: 2176)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!174, !461, !525}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !470, file: !464, line: 59, baseType: !587, size: 64, offset: 2240)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !470, file: !464, line: 60, baseType: !487, size: 64, offset: 2304)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !470, file: !464, line: 61, baseType: !487, size: 64, offset: 2368)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !470, file: !464, line: 62, baseType: !497, size: 64, offset: 2432)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !470, file: !464, line: 63, baseType: !491, size: 64, offset: 2496)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !470, file: !464, line: 64, baseType: !491, size: 64, offset: 2560)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !470, file: !464, line: 65, baseType: !583, size: 64, offset: 2624)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !470, file: !464, line: 66, baseType: !549, size: 64, offset: 2688)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !470, file: !464, line: 67, baseType: !549, size: 64, offset: 2752)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !470, file: !464, line: 68, baseType: !600, size: 64, offset: 2816)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!174, !461, !603}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !604, line: 30, baseType: !605)
!604 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !604, line: 30, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !470, file: !464, line: 69, baseType: !542, size: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !470, file: !464, line: 70, baseType: !549, size: 64, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !470, file: !464, line: 71, baseType: !610, size: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!174, !304, !461}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !470, file: !464, line: 72, baseType: !614, size: 64, offset: 3072)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!174, !461, !461, !266}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !470, file: !464, line: 73, baseType: !537, size: 64, offset: 3136)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !470, file: !464, line: 74, baseType: !537, size: 64, offset: 3200)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !470, file: !464, line: 75, baseType: !537, size: 64, offset: 3264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !470, file: !464, line: 76, baseType: !621, size: 64, offset: 3328)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!174, !461, !213, !545, !275}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !470, file: !464, line: 77, baseType: !549, size: 64, offset: 3392)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !470, file: !464, line: 78, baseType: !549, size: 64, offset: 3456)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !470, file: !464, line: 79, baseType: !549, size: 64, offset: 3520)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !470, file: !464, line: 80, baseType: !549, size: 64, offset: 3584)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !470, file: !464, line: 81, baseType: !504, size: 64, offset: 3648)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !470, file: !464, line: 82, baseType: !549, size: 64, offset: 3712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !470, file: !464, line: 83, baseType: !631, size: 64, offset: 3776)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!174, !461, !213, !461, !547}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !470, file: !464, line: 84, baseType: !631, size: 64, offset: 3840)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !470, file: !464, line: 85, baseType: !636, size: 64, offset: 3904)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!174, !461, !461, !275, !275}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !470, file: !464, line: 86, baseType: !640, size: 64, offset: 3968)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!174, !461, !643, !476}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !604, line: 11, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !604, line: 11, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !470, file: !464, line: 87, baseType: !640, size: 64, offset: 4032)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !470, file: !464, line: 88, baseType: !648, size: 64, offset: 4096)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!174, !461, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !470, file: !464, line: 89, baseType: !648, size: 64, offset: 4160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !470, file: !464, line: 90, baseType: !654, size: 64, offset: 4224)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!174, !461, !213, !545, !545, !461, !547}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !470, file: !464, line: 91, baseType: !654, size: 64, offset: 4288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !470, file: !464, line: 92, baseType: !583, size: 64, offset: 4352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !470, file: !464, line: 93, baseType: !583, size: 64, offset: 4416)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !470, file: !464, line: 94, baseType: !508, size: 64, offset: 4480)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !470, file: !464, line: 95, baseType: !508, size: 64, offset: 4544)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !470, file: !464, line: 96, baseType: !508, size: 64, offset: 4608)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !470, file: !464, line: 97, baseType: !508, size: 64, offset: 4672)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !470, file: !464, line: 98, baseType: !665, size: 64, offset: 4736)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!174, !461, !328}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !470, file: !464, line: 99, baseType: !554, size: 64, offset: 4800)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !470, file: !464, line: 100, baseType: !554, size: 64, offset: 4864)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !470, file: !464, line: 101, baseType: !671, size: 64, offset: 4928)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!174, !461, !278, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !470, file: !464, line: 102, baseType: !677, size: 64, offset: 4992)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!174, !461, !651, !674}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !470, file: !464, line: 103, baseType: !554, size: 64, offset: 5056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !470, file: !464, line: 104, baseType: !648, size: 64, offset: 5120)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !470, file: !464, line: 105, baseType: !683, size: 64, offset: 5184)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!174, !213, !494, !476, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !463, file: !464, line: 144, baseType: !689, size: 64, offset: 9728)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !604, line: 60, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !692, line: 240, size: 640, elements: !693)
!692 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !691, file: !692, line: 241, baseType: !150, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !691, file: !692, line: 242, baseType: !230, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !691, file: !692, line: 243, baseType: !213, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !691, file: !692, line: 243, baseType: !213, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !691, file: !692, line: 244, baseType: !213, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !691, file: !692, line: 244, baseType: !213, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !691, file: !692, line: 245, baseType: !258, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !691, file: !692, line: 246, baseType: !328, size: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !691, file: !692, line: 247, baseType: !213, size: 32, offset: 352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !691, file: !692, line: 251, baseType: !213, size: 32, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !691, file: !692, line: 252, baseType: !603, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !691, file: !692, line: 253, baseType: !328, size: 32, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !691, file: !692, line: 254, baseType: !213, size: 32, offset: 544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !691, file: !692, line: 254, baseType: !213, size: 32, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !691, file: !692, line: 255, baseType: !213, size: 32, offset: 608)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !464, line: 145, baseType: !153, size: 64, offset: 9792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !463, file: !464, line: 146, baseType: !328, size: 32, offset: 9856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !463, file: !464, line: 147, baseType: !712, size: 1344, offset: 9920)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !464, line: 140, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 114, size: 1344, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !733, !734, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !713, file: !464, line: 115, baseType: !213, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !713, file: !464, line: 116, baseType: !213, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !713, file: !464, line: 117, baseType: !213, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !713, file: !464, line: 118, baseType: !213, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !713, file: !464, line: 119, baseType: !213, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !713, file: !464, line: 120, baseType: !213, size: 32, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !713, file: !464, line: 121, baseType: !258, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !713, file: !464, line: 122, baseType: !275, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !713, file: !464, line: 124, baseType: !150, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !464, line: 125, baseType: !230, size: 32, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !713, file: !464, line: 125, baseType: !230, size: 32, offset: 416)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !713, file: !464, line: 126, baseType: !230, size: 32, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !713, file: !464, line: 126, baseType: !230, size: 32, offset: 480)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !713, file: !464, line: 127, baseType: !729, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !91, line: 339, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !91, line: 339, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !713, file: !464, line: 128, baseType: !729, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !713, file: !464, line: 129, baseType: !735, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !91, line: 341, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !91, line: 351, size: 192, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !737, file: !91, line: 354, baseType: !164, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !737, file: !91, line: 355, baseType: !164, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !737, file: !91, line: 356, baseType: !164, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !737, file: !91, line: 361, baseType: !164, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !737, file: !91, line: 362, baseType: !324, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !713, file: !464, line: 130, baseType: !213, size: 32, offset: 704)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !713, file: !464, line: 130, baseType: !213, size: 32, offset: 736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !713, file: !464, line: 131, baseType: !275, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !713, file: !464, line: 131, baseType: !275, size: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !713, file: !464, line: 132, baseType: !258, size: 64, offset: 896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !713, file: !464, line: 132, baseType: !258, size: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !713, file: !464, line: 133, baseType: !213, size: 32, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !713, file: !464, line: 134, baseType: !258, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !713, file: !464, line: 135, baseType: !213, size: 32, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !713, file: !464, line: 136, baseType: !328, size: 32, offset: 1184)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !713, file: !464, line: 137, baseType: !328, size: 32, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !713, file: !464, line: 138, baseType: !547, size: 32, offset: 1248)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !713, file: !464, line: 139, baseType: !258, size: 64, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !463, file: !464, line: 147, baseType: !712, size: 1344, offset: 11264)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !463, file: !464, line: 148, baseType: !328, size: 32, offset: 12608)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !463, file: !464, line: 149, baseType: !213, size: 32, offset: 12640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !463, file: !464, line: 150, baseType: !761, size: 32, offset: 12672)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !463, file: !464, line: 157, baseType: !240, size: 64, offset: 12736)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !772}
!764 = !DILocalVariable(name: "vec", arg: 1, scope: !458, file: !367, line: 41, type: !461)
!765 = !DILocalVariable(name: "nstash", arg: 2, scope: !458, file: !367, line: 41, type: !258)
!766 = !DILocalVariable(name: "reallocs", arg: 3, scope: !458, file: !367, line: 41, type: !258)
!767 = !DILocalVariable(name: "bnstash", arg: 4, scope: !458, file: !367, line: 41, type: !258)
!768 = !DILocalVariable(name: "breallocs", arg: 5, scope: !458, file: !367, line: 41, type: !258)
!769 = !DILocalVariable(name: "ierr", scope: !458, file: !367, line: 43, type: !174)
!770 = !DILocalVariable(name: "ierr__", scope: !771, file: !367, line: 46, type: !174)
!771 = distinct !DILexicalBlock(scope: !458, file: !367, line: 46, column: 63)
!772 = !DILocalVariable(name: "ierr__", scope: !773, file: !367, line: 47, type: !174)
!773 = distinct !DILexicalBlock(scope: !458, file: !367, line: 47, column: 66)
!774 = !DILocation(line: 0, scope: !458)
!775 = !DILocation(line: 45, column: 3, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !367, line: 45, column: 3)
!777 = distinct !DILexicalBlock(scope: !778, file: !367, line: 45, column: 3)
!778 = distinct !DILexicalBlock(scope: !458, file: !367, line: 45, column: 3)
!779 = !{!780, !780, i64 0}
!780 = !{!"any pointer", !781, i64 0}
!781 = !{!"omnipotent char", !782, i64 0}
!782 = !{!"Simple C/C++ TBAA"}
!783 = !DILocation(line: 45, column: 3, scope: !777)
!784 = !DILocation(line: 45, column: 3, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !367, line: 45, column: 3)
!786 = distinct !DILexicalBlock(scope: !776, file: !367, line: 45, column: 3)
!787 = !{!788, !789, i64 1536}
!788 = !{!"", !781, i64 0, !781, i64 512, !781, i64 1024, !781, i64 1280, !789, i64 1536, !789, i64 1540, !781, i64 1544}
!789 = !{!"int", !781, i64 0}
!790 = !DILocation(line: 45, column: 3, scope: !786)
!791 = !DILocation(line: 45, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !785, file: !367, line: 45, column: 3)
!793 = !{!789, !789, i64 0}
!794 = !{!788, !789, i64 1540}
!795 = !DILocation(line: 46, column: 40, scope: !458)
!796 = !DILocation(line: 46, column: 10, scope: !458)
!797 = !DILocation(line: 0, scope: !771)
!798 = !DILocation(line: 46, column: 63, scope: !799)
!799 = distinct !DILexicalBlock(scope: !771, file: !367, line: 46, column: 63)
!800 = !DILocation(line: 46, column: 63, scope: !771)
!801 = !{!"branch_weights", i32 2000, i32 1}
!802 = !DILocation(line: 47, column: 40, scope: !458)
!803 = !DILocation(line: 47, column: 10, scope: !458)
!804 = !DILocation(line: 0, scope: !773)
!805 = !DILocation(line: 47, column: 66, scope: !806)
!806 = distinct !DILexicalBlock(scope: !773, file: !367, line: 47, column: 66)
!807 = !DILocation(line: 47, column: 66, scope: !773)
!808 = !DILocation(line: 48, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !367, line: 48, column: 3)
!810 = distinct !DILexicalBlock(scope: !811, file: !367, line: 48, column: 3)
!811 = distinct !DILexicalBlock(scope: !458, file: !367, line: 48, column: 3)
!812 = !DILocation(line: 48, column: 3, scope: !810)
!813 = !DILocation(line: 48, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !367, line: 48, column: 3)
!815 = distinct !DILexicalBlock(scope: !809, file: !367, line: 48, column: 3)
!816 = !DILocation(line: 48, column: 3, scope: !815)
!817 = !DILocation(line: 48, column: 3, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !367, line: 48, column: 3)
!819 = distinct !DILexicalBlock(scope: !814, file: !367, line: 48, column: 3)
!820 = !{!788, !781, i64 1544}
!821 = !DILocation(line: 48, column: 3, scope: !819)
!822 = !DILocation(line: 48, column: 3, scope: !823)
!823 = distinct !DILexicalBlock(scope: !818, file: !367, line: 48, column: 3)
