; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope_dmda.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope_dmda.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!324 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 60, baseType: !7, size: 32, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334}
!329 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!330 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!331 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!332 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!333 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!334 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 395, baseType: !74, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343}
!337 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!338 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!339 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!340 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!341 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!342 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!343 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 657, baseType: !7, size: 32, elements: !345)
!345 = !{!346, !347, !348}
!346 = !DIEnumerator(name: "PETSC_SUBCOMM_GENERAL", value: 0, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_SUBCOMM_CONTIGUOUS", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_SUBCOMM_INTERLACED", value: 2, isUnsigned: true)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !350, line: 6, baseType: !7, size: 32, elements: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/telescope/telescope.h", directory: "/home/users/ndemeye/xSDK")
!351 = !{!352, !353, !354, !355}
!352 = !DIEnumerator(name: "TELESCOPE_DEFAULT", value: 0, isUnsigned: true)
!353 = !DIEnumerator(name: "TELESCOPE_DMDA", value: 1, isUnsigned: true)
!354 = !DIEnumerator(name: "TELESCOPE_DMPLEX", value: 2, isUnsigned: true)
!355 = !DIEnumerator(name: "TELESCOPE_COARSEDM", value: 3, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 14, baseType: !7, size: 32, elements: !358)
!357 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!358 = !{!359, !360}
!359 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 24, baseType: !7, size: 32, elements: !362)
!362 = !{!363, !364}
!363 = !DIEnumerator(name: "DMDA_Q0", value: 0, isUnsigned: true)
!364 = !DIEnumerator(name: "DMDA_Q1", value: 1, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 663, baseType: !7, size: 32, elements: !367)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!367 = !{!368, !369, !370}
!368 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!377 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!383 = !{!384, !388, !389, !592, !474, !74, !558, !424, !595, !2067, !2137}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !385, line: 330, baseType: !386)
!385 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !385, line: 330, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !392, line: 73, size: 4480, elements: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!393 = !{!394, !396, !445, !446, !448, !451, !452, !453, !454, !462, !463, !465, !469, !473, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !487, !488, !490, !491, !493, !495, !496, !497, !498, !499, !502, !504, !505, !506, !507, !508, !511, !513, !514, !515, !525, !527, !528, !532, !533, !582, !587, !589, !590, !591}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !391, file: !392, line: 74, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !391, file: !392, line: 75, baseType: !397, size: 448, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 448, elements: !443)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !392, line: 53, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 45, size: 448, elements: !400)
!400 = !{!401, !407, !415, !420, !427, !431, !438}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !399, file: !392, line: 46, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!405, !389, !406}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !399, file: !392, line: 47, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!405, !389, !411}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !412, line: 16, baseType: !413)
!412 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !412, line: 16, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !399, file: !392, line: 48, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!405, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !399, file: !392, line: 49, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!405, !389, !424, !389}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !399, file: !392, line: 50, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!405, !389, !424, !419}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !399, file: !392, line: 51, baseType: !432, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!405, !389, !424, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !399, file: !392, line: 52, baseType: !439, size: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!405, !389, !424, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!443 = !{!444}
!444 = !DISubrange(count: 1)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !391, file: !392, line: 76, baseType: !384, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !392, line: 77, baseType: !447, size: 32, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !391, file: !392, line: 78, baseType: !449, size: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !450)
!450 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !391, file: !392, line: 78, baseType: !449, size: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !391, file: !392, line: 78, baseType: !449, size: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !391, file: !392, line: 78, baseType: !449, size: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !392, line: 79, baseType: !455, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !458, line: 27, baseType: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !460, line: 43, baseType: !461)
!460 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!461 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !391, file: !392, line: 80, baseType: !447, size: 32, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !391, file: !392, line: 81, baseType: !464, size: 32, offset: 992)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !391, file: !392, line: 82, baseType: !466, size: 64, offset: 1024)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !391, file: !392, line: 83, baseType: !470, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !391, file: !392, line: 84, baseType: !474, size: 64, offset: 1152)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !391, file: !392, line: 85, baseType: !474, size: 64, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !391, file: !392, line: 86, baseType: !474, size: 64, offset: 1280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !391, file: !392, line: 87, baseType: !474, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !391, file: !392, line: 88, baseType: !389, size: 64, offset: 1408)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !391, file: !392, line: 89, baseType: !455, size: 64, offset: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 90, baseType: !474, size: 64, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !391, file: !392, line: 91, baseType: !474, size: 64, offset: 1600)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !391, file: !392, line: 92, baseType: !447, size: 32, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !391, file: !392, line: 93, baseType: !388, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !391, file: !392, line: 94, baseType: !485, size: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !456)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !391, file: !392, line: 95, baseType: !447, size: 32, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !391, file: !392, line: 95, baseType: !447, size: 32, offset: 1888)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !391, file: !392, line: 96, baseType: !489, size: 64, offset: 1920)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !391, file: !392, line: 96, baseType: !489, size: 64, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !391, file: !392, line: 97, baseType: !492, size: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !391, file: !392, line: 97, baseType: !494, size: 64, offset: 2112)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !391, file: !392, line: 98, baseType: !447, size: 32, offset: 2176)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !391, file: !392, line: 98, baseType: !447, size: 32, offset: 2208)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !391, file: !392, line: 99, baseType: !489, size: 64, offset: 2240)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !391, file: !392, line: 99, baseType: !489, size: 64, offset: 2304)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !391, file: !392, line: 100, baseType: !500, size: 64, offset: 2368)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !450)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !391, file: !392, line: 100, baseType: !503, size: 64, offset: 2432)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !391, file: !392, line: 101, baseType: !447, size: 32, offset: 2496)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !391, file: !392, line: 101, baseType: !447, size: 32, offset: 2528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !391, file: !392, line: 102, baseType: !489, size: 64, offset: 2560)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !391, file: !392, line: 102, baseType: !489, size: 64, offset: 2624)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !391, file: !392, line: 103, baseType: !509, size: 64, offset: 2688)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !501)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !391, file: !392, line: 103, baseType: !512, size: 64, offset: 2752)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !391, file: !392, line: 104, baseType: !442, size: 64, offset: 2816)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !391, file: !392, line: 105, baseType: !447, size: 32, offset: 2880)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !391, file: !392, line: 106, baseType: !516, size: 128, offset: 2944)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 128, elements: !523)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !392, line: 64, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 61, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !519, file: !392, line: 62, baseType: !435, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !519, file: !392, line: 63, baseType: !388, size: 64, offset: 64)
!523 = !{!524}
!524 = !DISubrange(count: 2)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !391, file: !392, line: 107, baseType: !526, size: 64, offset: 3072)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 64, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !391, file: !392, line: 108, baseType: !388, size: 64, offset: 3136)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !391, file: !392, line: 109, baseType: !529, size: 64, offset: 3200)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!405, !388}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !391, file: !392, line: 111, baseType: !447, size: 32, offset: 3264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !391, file: !392, line: 112, baseType: !534, size: 320, offset: 3328)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 320, elements: !580)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!405, !538, !389, !388}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !541)
!541 = !{!542, !543, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !540, file: !12, line: 100, baseType: !447, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !12, line: 101, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !555, !556, !557, !561, !563, !565, !566, !567}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !546, file: !12, line: 84, baseType: !474, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !546, file: !12, line: 85, baseType: !474, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !12, line: 86, baseType: !388, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !546, file: !12, line: 87, baseType: !466, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !546, file: !12, line: 88, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !546, file: !12, line: 89, baseType: !426, size: 8, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !546, file: !12, line: 90, baseType: !474, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !546, file: !12, line: 91, baseType: !558, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !559, line: 46, baseType: !560)
!559 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!560 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !546, file: !12, line: 92, baseType: !562, size: 32, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !12, line: 93, baseType: !564, size: 32, offset: 544)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !12, line: 94, baseType: !544, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !546, file: !12, line: 95, baseType: !474, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !546, file: !12, line: 96, baseType: !388, size: 64, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !540, file: !12, line: 102, baseType: !474, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !540, file: !12, line: 102, baseType: !474, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !540, file: !12, line: 103, baseType: !474, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !540, file: !12, line: 104, baseType: !384, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !540, file: !12, line: 105, baseType: !562, size: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !540, file: !12, line: 105, baseType: !562, size: 32, offset: 416)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !540, file: !12, line: 105, baseType: !562, size: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !540, file: !12, line: 106, baseType: !389, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !540, file: !12, line: 107, baseType: !577, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!580 = !{!581}
!581 = !DISubrange(count: 5)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !391, file: !392, line: 113, baseType: !583, size: 320, offset: 3648)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 320, elements: !580)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!405, !389, !388}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !391, file: !392, line: 114, baseType: !588, size: 320, offset: 3968)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 320, elements: !580)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !391, file: !392, line: 115, baseType: !562, size: 32, offset: 4288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !391, file: !392, line: 120, baseType: !577, size: 64, offset: 4352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !391, file: !392, line: 121, baseType: !562, size: 32, offset: 4416)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !385, line: 331, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !385, line: 331, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Telescope_DMDACtx", file: !350, line: 36, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 29, size: 704, elements: !598)
!598 = !{!599, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dmrepart", scope: !597, file: !350, line: 30, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !310, line: 14, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !316, line: 202, size: 40000, elements: !603)
!603 = !{!604, !606, !1583, !1587, !1588, !1589, !1590, !1600, !1601, !1609, !1610, !1618, !1619, !1620, !1621, !1625, !1626, !1627, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1656, !1668, !1680, !1692, !1701, !1702, !1725, !1726, !1727, !1728, !1729, !1730, !1732, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1831, !1832, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1847, !1856, !1857, !1858, !1867, !1955, !1956, !2044, !2045, !2046, !2047, !2049, !2051, !2052, !2053, !2054, !2055}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !602, file: !316, line: 203, baseType: !605, size: 4480)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !392, line: 122, baseType: !391)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !602, file: !316, line: 203, baseType: !607, size: 3456, offset: 4480)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 3456, elements: !443)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !316, line: 30, size: 3456, elements: !609)
!609 = !{!610, !614, !615, !620, !624, !628, !629, !630, !638, !639, !640, !652, !653, !661, !670, !1427, !1431, !1435, !1436, !1440, !1441, !1445, !1446, !1450, !1451, !1459, !1463, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1477, !1481, !1485, !1490, !1494, !1505, !1509, !1514, !1521, !1525, !1526, !1531, !1542, !1546, !1554, !1558, !1566, !1570, !1578, !1579}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !608, file: !316, line: 31, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!405, !600, !411}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !608, file: !316, line: 32, baseType: !611, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !608, file: !316, line: 33, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!405, !600, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !608, file: !316, line: 34, baseType: !621, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!405, !538, !600}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !608, file: !316, line: 35, baseType: !625, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!405, !600}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !608, file: !316, line: 36, baseType: !625, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !608, file: !316, line: 37, baseType: !625, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !608, file: !316, line: 38, baseType: !631, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!405, !600, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !608, file: !316, line: 39, baseType: !631, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !608, file: !316, line: 40, baseType: !625, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !608, file: !316, line: 41, baseType: !641, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!405, !600, !492, !644, !646}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !649, line: 11, baseType: !650)
!649 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !649, line: 11, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !608, file: !316, line: 42, baseType: !616, size: 64, offset: 704)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !608, file: !316, line: 43, baseType: !654, size: 64, offset: 768)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!405, !600, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !310, line: 165, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !310, line: 165, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !608, file: !316, line: 45, baseType: !662, size: 64, offset: 832)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!405, !600, !665, !666}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !649, line: 51, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !649, line: 51, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !608, file: !316, line: 46, baseType: !671, size: 64, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!405, !600, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !678, line: 436, size: 23424, elements: !679)
!678 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!679 = !{!680, !681, !1173, !1193, !1194, !1195, !1197, !1198, !1199, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1323, !1324, !1340, !1341, !1342, !1343, !1344, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1379, !1399, !1400, !1402, !1403, !1404, !1405, !1406, !1407, !1425, !1426}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !677, file: !678, line: 437, baseType: !605, size: 4480)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !677, file: !678, line: 437, baseType: !682, size: 9472, offset: 4480)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 9472, elements: !443)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !678, line: 32, size: 9472, elements: !684)
!684 = !{!685, !694, !698, !699, !703, !707, !708, !709, !710, !711, !712, !713, !733, !737, !742, !747, !766, !771, !775, !776, !781, !786, !787, !792, !796, !800, !804, !808, !812, !813, !814, !815, !816, !820, !821, !826, !827, !828, !829, !830, !835, !842, !846, !850, !854, !858, !862, !863, !867, !868, !875, !880, !881, !882, !883, !941, !948, !949, !953, !954, !958, !959, !963, !968, !969, !973, !977, !984, !985, !986, !987, !988, !989, !994, !995, !999, !1003, !1007, !1008, !1009, !1013, !1023, !1024, !1028, !1029, !1033, !1034, !1038, !1039, !1043, !1044, !1048, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1062, !1063, !1064, !1065, !1066, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1082, !1086, !1087, !1088, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1104, !1109, !1113, !1114, !1118, !1119, !1120, !1121, !1147, !1151, !1152, !1153, !1154, !1155, !1159, !1160, !1161, !1162, !1163, !1167, !1171, !1172}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !683, file: !678, line: 34, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!405, !675, !447, !689, !447, !689, !691, !693}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !683, file: !678, line: 35, baseType: !695, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!405, !675, !447, !492, !494, !512}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !683, file: !678, line: 36, baseType: !695, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !683, file: !678, line: 37, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!405, !675, !635, !635}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !683, file: !678, line: 38, baseType: !704, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!405, !675, !635, !635, !635}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !683, file: !678, line: 40, baseType: !700, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !683, file: !678, line: 41, baseType: !704, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !683, file: !678, line: 42, baseType: !700, size: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !683, file: !678, line: 43, baseType: !704, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !683, file: !678, line: 44, baseType: !700, size: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !683, file: !678, line: 46, baseType: !704, size: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !683, file: !678, line: 47, baseType: !714, size: 64, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!405, !675, !648, !648, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !720, file: !38, line: 1227, baseType: !501, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !720, file: !38, line: 1228, baseType: !501, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !720, file: !38, line: 1229, baseType: !501, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !720, file: !38, line: 1230, baseType: !501, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !720, file: !38, line: 1231, baseType: !501, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !720, file: !38, line: 1232, baseType: !501, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !720, file: !38, line: 1233, baseType: !501, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !720, file: !38, line: 1234, baseType: !501, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !720, file: !38, line: 1236, baseType: !501, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !720, file: !38, line: 1237, baseType: !501, size: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !720, file: !38, line: 1238, baseType: !501, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !683, file: !678, line: 48, baseType: !734, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!405, !675, !648, !717}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !683, file: !678, line: 49, baseType: !738, size: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!405, !675, !635, !501, !741, !501, !447, !447, !635}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !683, file: !678, line: 50, baseType: !743, size: 64, offset: 896)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!405, !675, !746, !674}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !683, file: !678, line: 52, baseType: !748, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!405, !675, !751, !752}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !754, file: !38, line: 593, baseType: !449, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !754, file: !38, line: 594, baseType: !449, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !754, file: !38, line: 594, baseType: !449, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !754, file: !38, line: 594, baseType: !449, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !754, file: !38, line: 595, baseType: !449, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !754, file: !38, line: 596, baseType: !449, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !754, file: !38, line: 597, baseType: !449, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !754, file: !38, line: 598, baseType: !449, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !754, file: !38, line: 598, baseType: !449, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !754, file: !38, line: 599, baseType: !449, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !683, file: !678, line: 53, baseType: !767, size: 64, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!405, !675, !675, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !683, file: !678, line: 54, baseType: !772, size: 64, offset: 1088)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!405, !675, !635}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !683, file: !678, line: 55, baseType: !700, size: 64, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !683, file: !678, line: 56, baseType: !777, size: 64, offset: 1216)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!405, !675, !780, !500}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !683, file: !678, line: 58, baseType: !782, size: 64, offset: 1280)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!405, !675, !785}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !683, file: !678, line: 59, baseType: !782, size: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !683, file: !678, line: 60, baseType: !788, size: 64, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!405, !675, !791, !562}
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !683, file: !678, line: 61, baseType: !793, size: 64, offset: 1472)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!405, !675}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !683, file: !678, line: 63, baseType: !797, size: 64, offset: 1536)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!405, !675, !447, !689, !510, !635, !635}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !683, file: !678, line: 64, baseType: !801, size: 64, offset: 1600)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!405, !675, !675, !648, !648, !717}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !683, file: !678, line: 65, baseType: !805, size: 64, offset: 1664)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!405, !675, !675, !717}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !683, file: !678, line: 66, baseType: !809, size: 64, offset: 1728)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!405, !675, !675, !648, !717}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !683, file: !678, line: 67, baseType: !805, size: 64, offset: 1792)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !683, file: !678, line: 69, baseType: !793, size: 64, offset: 1856)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !683, file: !678, line: 70, baseType: !801, size: 64, offset: 1920)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !683, file: !678, line: 71, baseType: !809, size: 64, offset: 1984)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !683, file: !678, line: 72, baseType: !817, size: 64, offset: 2048)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!405, !675, !674}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !683, file: !678, line: 73, baseType: !793, size: 64, offset: 2112)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !683, file: !678, line: 75, baseType: !822, size: 64, offset: 2176)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!405, !675, !825, !674}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !683, file: !678, line: 76, baseType: !700, size: 64, offset: 2240)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !683, file: !678, line: 77, baseType: !700, size: 64, offset: 2304)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !683, file: !678, line: 78, baseType: !714, size: 64, offset: 2368)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !683, file: !678, line: 79, baseType: !734, size: 64, offset: 2432)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !683, file: !678, line: 81, baseType: !831, size: 64, offset: 2496)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!405, !675, !510, !675, !834}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !683, file: !678, line: 82, baseType: !836, size: 64, offset: 2560)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!405, !675, !447, !839, !839, !746, !841}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !683, file: !678, line: 83, baseType: !843, size: 64, offset: 2624)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!405, !675, !447, !647, !447}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !683, file: !678, line: 84, baseType: !847, size: 64, offset: 2688)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!405, !675, !447, !689, !447, !689, !509}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !683, file: !678, line: 85, baseType: !851, size: 64, offset: 2752)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!405, !675, !675, !834}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !683, file: !678, line: 87, baseType: !855, size: 64, offset: 2816)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!405, !675, !635, !492}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !683, file: !678, line: 88, baseType: !859, size: 64, offset: 2880)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!405, !675, !510}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !683, file: !678, line: 89, baseType: !859, size: 64, offset: 2944)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !683, file: !678, line: 90, baseType: !864, size: 64, offset: 3008)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!405, !675, !635, !693}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !683, file: !678, line: 91, baseType: !797, size: 64, offset: 3072)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !683, file: !678, line: 93, baseType: !869, size: 64, offset: 3136)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!405, !675, !872}
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !683, file: !678, line: 94, baseType: !876, size: 64, offset: 3200)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!405, !675, !447, !562, !562, !492, !879, !879, !770}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !683, file: !678, line: 95, baseType: !876, size: 64, offset: 3264)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !683, file: !678, line: 96, baseType: !876, size: 64, offset: 3328)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !683, file: !678, line: 97, baseType: !876, size: 64, offset: 3392)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !683, file: !678, line: 99, baseType: !884, size: 64, offset: 3456)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!405, !675, !667, !887}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !678, line: 609, size: 6208, elements: !890)
!890 = !{!891, !892, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !911, !918, !919, !920, !921, !922, !923, !924, !925, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !889, file: !678, line: 610, baseType: !605, size: 4480)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !889, file: !678, line: 610, baseType: !893, size: 32, offset: 4480)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !443)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !889, file: !678, line: 611, baseType: !447, size: 32, offset: 4512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !889, file: !678, line: 611, baseType: !447, size: 32, offset: 4544)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !889, file: !678, line: 611, baseType: !447, size: 32, offset: 4576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !889, file: !678, line: 612, baseType: !447, size: 32, offset: 4608)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !889, file: !678, line: 613, baseType: !447, size: 32, offset: 4640)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !889, file: !678, line: 614, baseType: !492, size: 64, offset: 4672)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !889, file: !678, line: 615, baseType: !494, size: 64, offset: 4736)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !889, file: !678, line: 616, baseType: !647, size: 64, offset: 4800)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !889, file: !678, line: 617, baseType: !492, size: 64, offset: 4864)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !889, file: !678, line: 618, baseType: !904, size: 64, offset: 4928)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !678, line: 602, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 598, size: 128, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !906, file: !678, line: 599, baseType: !447, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !906, file: !678, line: 600, baseType: !447, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !906, file: !678, line: 601, baseType: !509, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !889, file: !678, line: 619, baseType: !912, size: 64, offset: 4992)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !678, line: 607, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 604, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !914, file: !678, line: 605, baseType: !447, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !914, file: !678, line: 606, baseType: !509, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !889, file: !678, line: 620, baseType: !509, size: 64, offset: 5056)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !889, file: !678, line: 621, baseType: !501, size: 64, offset: 5120)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !889, file: !678, line: 622, baseType: !501, size: 64, offset: 5184)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !889, file: !678, line: 623, baseType: !635, size: 64, offset: 5248)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !889, file: !678, line: 623, baseType: !635, size: 64, offset: 5312)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !889, file: !678, line: 623, baseType: !635, size: 64, offset: 5376)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !889, file: !678, line: 624, baseType: !562, size: 32, offset: 5440)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !889, file: !678, line: 625, baseType: !926, size: 64, offset: 5504)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!405}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !889, file: !678, line: 626, baseType: !388, size: 64, offset: 5568)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !889, file: !678, line: 627, baseType: !635, size: 64, offset: 5632)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !889, file: !678, line: 628, baseType: !447, size: 32, offset: 5696)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !889, file: !678, line: 629, baseType: !424, size: 64, offset: 5760)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !889, file: !678, line: 630, baseType: !665, size: 32, offset: 5824)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !889, file: !678, line: 631, baseType: !447, size: 32, offset: 5856)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !889, file: !678, line: 631, baseType: !447, size: 32, offset: 5888)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !889, file: !678, line: 632, baseType: !562, size: 32, offset: 5920)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !889, file: !678, line: 633, baseType: !562, size: 32, offset: 5952)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !889, file: !678, line: 634, baseType: !435, size: 64, offset: 6016)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !889, file: !678, line: 634, baseType: !388, size: 64, offset: 6080)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !889, file: !678, line: 635, baseType: !455, size: 64, offset: 6144)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !683, file: !678, line: 100, baseType: !942, size: 64, offset: 3520)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!405, !675, !447, !447, !945, !666}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !947)
!947 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !683, file: !678, line: 101, baseType: !793, size: 64, offset: 3584)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !683, file: !678, line: 102, baseType: !950, size: 64, offset: 3648)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!405, !675, !648, !648, !674}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !683, file: !678, line: 103, baseType: !686, size: 64, offset: 3712)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !683, file: !678, line: 105, baseType: !955, size: 64, offset: 3776)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!405, !675, !648, !648, !746, !674}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !683, file: !678, line: 106, baseType: !793, size: 64, offset: 3840)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !683, file: !678, line: 107, baseType: !960, size: 64, offset: 3904)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!405, !675, !411}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !683, file: !678, line: 108, baseType: !964, size: 64, offset: 3968)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!405, !675, !967, !746, !674}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !424)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !683, file: !678, line: 109, baseType: !926, size: 64, offset: 4032)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !683, file: !678, line: 111, baseType: !970, size: 64, offset: 4096)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!405, !675, !675, !675, !501, !675}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !683, file: !678, line: 112, baseType: !974, size: 64, offset: 4160)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!405, !675, !675, !675, !675}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !683, file: !678, line: 113, baseType: !978, size: 64, offset: 4224)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!405, !675, !981, !981}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !649, line: 30, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !649, line: 30, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !683, file: !678, line: 114, baseType: !686, size: 64, offset: 4288)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !683, file: !678, line: 115, baseType: !797, size: 64, offset: 4352)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !683, file: !678, line: 117, baseType: !855, size: 64, offset: 4416)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !683, file: !678, line: 118, baseType: !855, size: 64, offset: 4480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !683, file: !678, line: 119, baseType: !964, size: 64, offset: 4544)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !683, file: !678, line: 120, baseType: !990, size: 64, offset: 4608)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!405, !675, !993, !770}
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !683, file: !678, line: 121, baseType: !926, size: 64, offset: 4672)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !683, file: !678, line: 123, baseType: !996, size: 64, offset: 4736)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!405, !675, !447, !388}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !683, file: !678, line: 124, baseType: !1000, size: 64, offset: 4800)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!405, !675, !887, !635, !388}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !683, file: !678, line: 125, baseType: !1004, size: 64, offset: 4864)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!405, !538, !675}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !683, file: !678, line: 126, baseType: !700, size: 64, offset: 4928)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !683, file: !678, line: 127, baseType: !700, size: 64, offset: 4992)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !683, file: !678, line: 129, baseType: !1010, size: 64, offset: 5056)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!405, !675, !647}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !683, file: !678, line: 130, baseType: !1014, size: 64, offset: 5120)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!405, !675, !1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1019, file: !62, line: 653, baseType: !447, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1019, file: !62, line: 653, baseType: !635, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !683, file: !678, line: 131, baseType: !1014, size: 64, offset: 5184)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !683, file: !678, line: 132, baseType: !1025, size: 64, offset: 5248)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!405, !675, !492, !492, !492}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !683, file: !678, line: 133, baseType: !960, size: 64, offset: 5312)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !683, file: !678, line: 135, baseType: !1030, size: 64, offset: 5376)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!405, !675, !501, !770}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !683, file: !678, line: 136, baseType: !1030, size: 64, offset: 5440)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !683, file: !678, line: 137, baseType: !1035, size: 64, offset: 5504)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!405, !675, !770}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !683, file: !678, line: 138, baseType: !686, size: 64, offset: 5568)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !683, file: !678, line: 139, baseType: !1040, size: 64, offset: 5632)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!405, !675, !634, !634}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !683, file: !678, line: 141, baseType: !926, size: 64, offset: 5696)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !683, file: !678, line: 142, baseType: !1045, size: 64, offset: 5760)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!405, !675, !675, !501, !675}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !683, file: !678, line: 143, baseType: !1049, size: 64, offset: 5824)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!405, !675, !675, !675}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !683, file: !678, line: 144, baseType: !926, size: 64, offset: 5888)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !683, file: !678, line: 145, baseType: !1045, size: 64, offset: 5952)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !683, file: !678, line: 147, baseType: !1049, size: 64, offset: 6016)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !683, file: !678, line: 148, baseType: !926, size: 64, offset: 6080)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !683, file: !678, line: 149, baseType: !1045, size: 64, offset: 6144)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !683, file: !678, line: 150, baseType: !1049, size: 64, offset: 6208)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !683, file: !678, line: 151, baseType: !1059, size: 64, offset: 6272)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!405, !675, !562}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !683, file: !678, line: 153, baseType: !793, size: 64, offset: 6336)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !683, file: !678, line: 154, baseType: !793, size: 64, offset: 6400)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !683, file: !678, line: 155, baseType: !793, size: 64, offset: 6464)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !683, file: !678, line: 156, baseType: !793, size: 64, offset: 6528)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !683, file: !678, line: 157, baseType: !960, size: 64, offset: 6592)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !683, file: !678, line: 159, baseType: !1068, size: 64, offset: 6656)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!405, !675, !447, !691}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !683, file: !678, line: 160, baseType: !793, size: 64, offset: 6720)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !683, file: !678, line: 161, baseType: !793, size: 64, offset: 6784)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !683, file: !678, line: 162, baseType: !793, size: 64, offset: 6848)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !683, file: !678, line: 163, baseType: !793, size: 64, offset: 6912)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !683, file: !678, line: 165, baseType: !1049, size: 64, offset: 6976)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !683, file: !678, line: 166, baseType: !1049, size: 64, offset: 7040)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !683, file: !678, line: 167, baseType: !855, size: 64, offset: 7104)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !683, file: !678, line: 168, baseType: !1079, size: 64, offset: 7168)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!405, !675, !635, !447}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !683, file: !678, line: 169, baseType: !1083, size: 64, offset: 7232)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!405, !675, !770, !492}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !683, file: !678, line: 171, baseType: !817, size: 64, offset: 7296)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !683, file: !678, line: 172, baseType: !793, size: 64, offset: 7360)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !683, file: !678, line: 173, baseType: !1089, size: 64, offset: 7424)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!405, !675, !492, !879}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !683, file: !678, line: 174, baseType: !950, size: 64, offset: 7488)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !683, file: !678, line: 175, baseType: !950, size: 64, offset: 7552)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !683, file: !678, line: 177, baseType: !700, size: 64, offset: 7616)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !683, file: !678, line: 178, baseType: !743, size: 64, offset: 7680)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !683, file: !678, line: 179, baseType: !700, size: 64, offset: 7744)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !683, file: !678, line: 180, baseType: !704, size: 64, offset: 7808)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !683, file: !678, line: 181, baseType: !1099, size: 64, offset: 7872)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!405, !675, !384, !746, !674}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !683, file: !678, line: 183, baseType: !1010, size: 64, offset: 7936)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !683, file: !678, line: 184, baseType: !777, size: 64, offset: 8000)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !683, file: !678, line: 185, baseType: !1105, size: 64, offset: 8064)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!405, !675, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !683, file: !678, line: 186, baseType: !1110, size: 64, offset: 8128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!405, !675, !447, !689, !509}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !683, file: !678, line: 187, baseType: !836, size: 64, offset: 8192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !683, file: !678, line: 189, baseType: !1115, size: 64, offset: 8256)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!405, !675, !447, !447, !492, !691}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !683, file: !678, line: 190, baseType: !926, size: 64, offset: 8320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !683, file: !678, line: 191, baseType: !1045, size: 64, offset: 8384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !683, file: !678, line: 192, baseType: !1049, size: 64, offset: 8448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !683, file: !678, line: 193, baseType: !1122, size: 64, offset: 8512)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!405, !675, !667, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !678, line: 660, size: 5312, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1127, file: !678, line: 661, baseType: !605, size: 4480)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1127, file: !678, line: 661, baseType: !893, size: 32, offset: 4480)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1127, file: !678, line: 662, baseType: !447, size: 32, offset: 4512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1127, file: !678, line: 662, baseType: !447, size: 32, offset: 4544)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1127, file: !678, line: 662, baseType: !447, size: 32, offset: 4576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1127, file: !678, line: 663, baseType: !447, size: 32, offset: 4608)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1127, file: !678, line: 664, baseType: !447, size: 32, offset: 4640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1127, file: !678, line: 665, baseType: !492, size: 64, offset: 4672)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1127, file: !678, line: 666, baseType: !492, size: 64, offset: 4736)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1127, file: !678, line: 667, baseType: !447, size: 32, offset: 4800)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1127, file: !678, line: 668, baseType: !665, size: 32, offset: 4832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1127, file: !678, line: 670, baseType: !492, size: 64, offset: 4864)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1127, file: !678, line: 670, baseType: !492, size: 64, offset: 4928)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1127, file: !678, line: 671, baseType: !492, size: 64, offset: 4992)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1127, file: !678, line: 672, baseType: !492, size: 64, offset: 5056)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1127, file: !678, line: 673, baseType: !492, size: 64, offset: 5120)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1127, file: !678, line: 674, baseType: !447, size: 32, offset: 5184)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1127, file: !678, line: 675, baseType: !492, size: 64, offset: 5248)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !683, file: !678, line: 195, baseType: !1148, size: 64, offset: 8576)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!405, !1125, !675, !675}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !683, file: !678, line: 196, baseType: !1148, size: 64, offset: 8640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !683, file: !678, line: 197, baseType: !926, size: 64, offset: 8704)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !683, file: !678, line: 198, baseType: !1045, size: 64, offset: 8768)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !683, file: !678, line: 199, baseType: !1049, size: 64, offset: 8832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !683, file: !678, line: 201, baseType: !1156, size: 64, offset: 8896)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!405, !675, !447, !447}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !683, file: !678, line: 202, baseType: !831, size: 64, offset: 8960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !683, file: !678, line: 203, baseType: !704, size: 64, offset: 9024)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !683, file: !678, line: 204, baseType: !884, size: 64, offset: 9088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !683, file: !678, line: 205, baseType: !1010, size: 64, offset: 9152)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !683, file: !678, line: 206, baseType: !1164, size: 64, offset: 9216)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!405, !384, !675, !447, !746, !674}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !683, file: !678, line: 208, baseType: !1168, size: 64, offset: 9280)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!405, !447, !841}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !683, file: !678, line: 209, baseType: !1049, size: 64, offset: 9344)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !683, file: !678, line: 210, baseType: !847, size: 64, offset: 9408)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !677, file: !678, line: 438, baseType: !1174, size: 64, offset: 13952)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !649, line: 60, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1176, file: !116, line: 241, baseType: !384, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1176, file: !116, line: 242, baseType: !464, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1176, file: !116, line: 243, baseType: !447, size: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1176, file: !116, line: 243, baseType: !447, size: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1176, file: !116, line: 244, baseType: !447, size: 32, offset: 160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1176, file: !116, line: 244, baseType: !447, size: 32, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1176, file: !116, line: 245, baseType: !492, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1176, file: !116, line: 246, baseType: !562, size: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1176, file: !116, line: 247, baseType: !447, size: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1176, file: !116, line: 251, baseType: !447, size: 32, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1176, file: !116, line: 252, baseType: !981, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1176, file: !116, line: 253, baseType: !562, size: 32, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1176, file: !116, line: 254, baseType: !447, size: 32, offset: 544)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1176, file: !116, line: 254, baseType: !447, size: 32, offset: 576)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1176, file: !116, line: 255, baseType: !447, size: 32, offset: 608)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !677, file: !678, line: 438, baseType: !1174, size: 64, offset: 14016)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !678, line: 439, baseType: !388, size: 64, offset: 14080)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !677, file: !678, line: 440, baseType: !1196, size: 32, offset: 14144)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !677, file: !678, line: 441, baseType: !562, size: 32, offset: 14176)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !677, file: !678, line: 442, baseType: !562, size: 32, offset: 14208)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !677, file: !678, line: 443, baseType: !1200, size: 448, offset: 14272)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 448, elements: !1202)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !424)
!1202 = !{!1203}
!1203 = !DISubrange(count: 7)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !677, file: !678, line: 444, baseType: !562, size: 32, offset: 14720)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !677, file: !678, line: 445, baseType: !562, size: 32, offset: 14752)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !677, file: !678, line: 446, baseType: !447, size: 32, offset: 14784)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !677, file: !678, line: 447, baseType: !485, size: 64, offset: 14848)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !677, file: !678, line: 448, baseType: !485, size: 64, offset: 14912)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !677, file: !678, line: 449, baseType: !753, size: 640, offset: 14976)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !677, file: !678, line: 450, baseType: !693, size: 32, offset: 15616)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !677, file: !678, line: 451, baseType: !1212, size: 2880, offset: 15680)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !678, line: 318, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !678, line: 319, size: 2880, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1234, !1235, !1240, !1245, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1260, !1261, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1293, !1294, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1317, !1318, !1319, !1320, !1321}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1213, file: !678, line: 320, baseType: !447, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1213, file: !678, line: 321, baseType: !447, size: 32, offset: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1213, file: !678, line: 322, baseType: !447, size: 32, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1213, file: !678, line: 323, baseType: !447, size: 32, offset: 96)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1213, file: !678, line: 324, baseType: !447, size: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1213, file: !678, line: 325, baseType: !447, size: 32, offset: 160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1213, file: !678, line: 326, baseType: !1222, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !678, line: 293, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !678, line: 295, size: 448, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1224, file: !678, line: 296, baseType: !1222, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1224, file: !678, line: 297, baseType: !509, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1224, file: !678, line: 297, baseType: !509, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1224, file: !678, line: 298, baseType: !492, size: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1224, file: !678, line: 298, baseType: !492, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1224, file: !678, line: 299, baseType: !447, size: 32, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1224, file: !678, line: 300, baseType: !447, size: 32, offset: 352)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1224, file: !678, line: 301, baseType: !447, size: 32, offset: 384)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1213, file: !678, line: 326, baseType: !1222, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1213, file: !678, line: 328, baseType: !1236, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!405, !675, !1239, !492}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1213, file: !678, line: 329, baseType: !1241, size: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!405, !1239, !1244, !494, !494, !512, !492}
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1213, file: !678, line: 330, baseType: !1246, size: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!405, !1239}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1213, file: !678, line: 331, baseType: !1246, size: 64, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1213, file: !678, line: 334, baseType: !384, size: 64, offset: 576)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !678, line: 335, baseType: !464, size: 32, offset: 640)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1213, file: !678, line: 335, baseType: !464, size: 32, offset: 672)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1213, file: !678, line: 336, baseType: !464, size: 32, offset: 704)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1213, file: !678, line: 336, baseType: !464, size: 32, offset: 736)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1213, file: !678, line: 337, baseType: !1256, size: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !385, line: 339, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !385, line: 339, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1213, file: !678, line: 338, baseType: !1256, size: 64, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1213, file: !678, line: 339, baseType: !1262, size: 64, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !385, line: 341, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !385, line: 351, size: 192, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1264, file: !385, line: 354, baseType: !74, size: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1264, file: !385, line: 355, baseType: !74, size: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1264, file: !385, line: 356, baseType: !74, size: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1264, file: !385, line: 361, baseType: !74, size: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1264, file: !385, line: 362, baseType: !558, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1213, file: !678, line: 340, baseType: !447, size: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1213, file: !678, line: 340, baseType: !447, size: 32, offset: 992)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1213, file: !678, line: 341, baseType: !509, size: 64, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1213, file: !678, line: 342, baseType: !492, size: 64, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1213, file: !678, line: 343, baseType: !512, size: 64, offset: 1152)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1213, file: !678, line: 344, baseType: !494, size: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1213, file: !678, line: 345, baseType: !447, size: 32, offset: 1280)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1213, file: !678, line: 346, baseType: !1244, size: 64, offset: 1344)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1213, file: !678, line: 347, baseType: !562, size: 32, offset: 1408)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1213, file: !678, line: 348, baseType: !447, size: 32, offset: 1440)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1213, file: !678, line: 351, baseType: !562, size: 32, offset: 1472)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1213, file: !678, line: 352, baseType: !562, size: 32, offset: 1504)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1213, file: !678, line: 353, baseType: !464, size: 32, offset: 1536)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1213, file: !678, line: 354, baseType: !464, size: 32, offset: 1568)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1213, file: !678, line: 355, baseType: !1244, size: 64, offset: 1600)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1213, file: !678, line: 356, baseType: !1244, size: 64, offset: 1664)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1213, file: !678, line: 357, baseType: !1288, size: 64, offset: 1728)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !678, line: 310, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 308, size: 32, elements: !1291)
!1291 = !{!1292}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1290, file: !678, line: 309, baseType: !447, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1213, file: !678, line: 357, baseType: !1288, size: 64, offset: 1792)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1213, file: !678, line: 358, baseType: !1295, size: 64, offset: 1856)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !678, line: 316, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 312, size: 128, elements: !1298)
!1298 = !{!1299, !1300, !1301}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1297, file: !678, line: 313, baseType: !388, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1297, file: !678, line: 314, baseType: !447, size: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1297, file: !678, line: 315, baseType: !426, size: 8, offset: 96)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1213, file: !678, line: 359, baseType: !1295, size: 64, offset: 1920)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1213, file: !678, line: 360, baseType: !1295, size: 64, offset: 1984)
