; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itregis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itregis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

!467 = !DILocation(line: 0, scope: !217)
!468 = !DILocation(line: 105, column: 53, scope: !469)
!469 = distinct !DILexicalBlock(scope: !217, file: !136, line: 105, column: 53)
!470 = !DILocation(line: 105, column: 53, scope: !217)
!471 = !DILocation(line: 106, column: 10, scope: !135)
!472 = !DILocation(line: 0, scope: !219)
!473 = !DILocation(line: 106, column: 57, scope: !474)
!474 = distinct !DILexicalBlock(scope: !219, file: !136, line: 106, column: 57)
!475 = !DILocation(line: 106, column: 57, scope: !219)
!476 = !DILocation(line: 107, column: 10, scope: !135)
!477 = !DILocation(line: 0, scope: !221)
!478 = !DILocation(line: 107, column: 56, scope: !479)
!479 = distinct !DILexicalBlock(scope: !221, file: !136, line: 107, column: 56)
!480 = !DILocation(line: 107, column: 56, scope: !221)
!481 = !DILocation(line: 109, column: 10, scope: !135)
!482 = !DILocation(line: 0, scope: !223)
!483 = !DILocation(line: 109, column: 56, scope: !484)
!484 = distinct !DILexicalBlock(scope: !223, file: !136, line: 109, column: 56)
!485 = !DILocation(line: 109, column: 56, scope: !223)
!486 = !DILocation(line: 111, column: 10, scope: !135)
!487 = !DILocation(line: 0, scope: !225)
!488 = !DILocation(line: 111, column: 55, scope: !489)
!489 = distinct !DILexicalBlock(scope: !225, file: !136, line: 111, column: 55)
!490 = !DILocation(line: 111, column: 55, scope: !225)
!491 = !DILocation(line: 112, column: 10, scope: !135)
!492 = !DILocation(line: 0, scope: !227)
!493 = !DILocation(line: 112, column: 54, scope: !494)
!494 = distinct !DILexicalBlock(scope: !227, file: !136, line: 112, column: 54)
!495 = !DILocation(line: 112, column: 54, scope: !227)
!496 = !DILocation(line: 113, column: 10, scope: !135)
!497 = !DILocation(line: 0, scope: !229)
!498 = !DILocation(line: 113, column: 56, scope: !499)
!499 = distinct !DILexicalBlock(scope: !229, file: !136, line: 113, column: 56)
!500 = !DILocation(line: 113, column: 56, scope: !229)
!501 = !DILocation(line: 117, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !136, line: 117, column: 3)
!503 = distinct !DILexicalBlock(scope: !504, file: !136, line: 117, column: 3)
!504 = distinct !DILexicalBlock(scope: !135, file: !136, line: 117, column: 3)
!505 = !DILocation(line: 117, column: 3, scope: !503)
!506 = !DILocation(line: 117, column: 3, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !136, line: 117, column: 3)
!508 = distinct !DILexicalBlock(scope: !502, file: !136, line: 117, column: 3)
!509 = !DILocation(line: 117, column: 3, scope: !508)
!510 = !DILocation(line: 117, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !136, line: 117, column: 3)
!512 = distinct !DILexicalBlock(scope: !507, file: !136, line: 117, column: 3)
!513 = !DILocation(line: 117, column: 3, scope: !512)
!514 = !DILocation(line: 117, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !511, file: !136, line: 117, column: 3)
!516 = !DILocation(line: 117, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !507, file: !136, line: 117, column: 3)
!518 = !DILocation(line: 117, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !517, file: !136, line: 117, column: 3)
!520 = !DILocation(line: 117, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !136, line: 117, column: 3)
!522 = distinct !DILexicalBlock(scope: !519, file: !136, line: 117, column: 3)
!523 = !DILocation(line: 117, column: 3, scope: !522)
!524 = !DILocation(line: 117, column: 3, scope: !525)
!525 = distinct !DILexicalBlock(scope: !521, file: !136, line: 117, column: 3)
!526 = !DILocation(line: 118, column: 1, scope: !135)
!527 = !DISubprogram(name: "KSPRegister", scope: !33, file: !33, line: 113, type: !528, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !977)
!528 = !DISubroutineType(types: !529)
!529 = !{!26, !121, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!26, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !535)
!535 = !{!536, !737, !792, !797, !798, !799, !800, !830, !831, !832, !833, !834, !836, !841, !842, !843, !844, !845, !846, !847, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !870, !876, !877, !878, !879, !884, !885, !886, !887, !892, !893, !894, !895, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !947, !948, !949, !950, !951, !958, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !974, !975, !976}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !534, file: !102, line: 76, baseType: !537, size: 4480)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !538, line: 122, baseType: !539)
!538 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !538, line: 73, size: 4480, elements: !540)
!540 = !{!541, !543, !590, !591, !593, !596, !597, !598, !599, !607, !608, !610, !614, !618, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !631, !632, !633, !635, !636, !638, !640, !641, !642, !643, !644, !647, !649, !650, !651, !652, !653, !656, !658, !659, !660, !670, !672, !673, !677, !678, !727, !732, !734, !735, !736}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !539, file: !538, line: 74, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !539, file: !538, line: 75, baseType: !544, size: 448, offset: 64)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 448, elements: !588)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !538, line: 53, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 45, size: 448, elements: !547)
!547 = !{!548, !555, !563, !568, !572, !576, !583}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !546, file: !538, line: 46, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!139, !552, !554}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !546, file: !538, line: 47, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!139, !552, !559}
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !560, line: 16, baseType: !561)
!560 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !560, line: 16, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !546, file: !538, line: 48, baseType: !564, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!139, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !546, file: !538, line: 49, baseType: !569, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!139, !552, !121, !552}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !546, file: !538, line: 50, baseType: !573, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!139, !552, !121, !567}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !546, file: !538, line: 51, baseType: !577, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!139, !552, !121, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !546, file: !538, line: 52, baseType: !584, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!139, !552, !121, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!588 = !{!589}
!589 = !DISubrange(count: 1)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !539, file: !538, line: 76, baseType: !124, size: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !538, line: 77, baseType: !592, size: 32, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !539, file: !538, line: 78, baseType: !594, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !595)
!595 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !539, file: !538, line: 78, baseType: !594, size: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !539, file: !538, line: 78, baseType: !594, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !539, file: !538, line: 78, baseType: !594, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !539, file: !538, line: 79, baseType: !600, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !603, line: 27, baseType: !604)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !605, line: 43, baseType: !606)
!605 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!606 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !539, file: !538, line: 80, baseType: !592, size: 32, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !539, file: !538, line: 81, baseType: !609, size: 32, offset: 992)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !539, file: !538, line: 82, baseType: !611, size: 64, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !539, file: !538, line: 83, baseType: !615, size: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !539, file: !538, line: 84, baseType: !619, size: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !539, file: !538, line: 85, baseType: !619, size: 64, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !539, file: !538, line: 86, baseType: !619, size: 64, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !539, file: !538, line: 87, baseType: !619, size: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !539, file: !538, line: 88, baseType: !552, size: 64, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !539, file: !538, line: 89, baseType: !600, size: 64, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !539, file: !538, line: 90, baseType: !619, size: 64, offset: 1536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !539, file: !538, line: 91, baseType: !619, size: 64, offset: 1600)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !539, file: !538, line: 92, baseType: !592, size: 32, offset: 1664)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !539, file: !538, line: 93, baseType: !128, size: 64, offset: 1728)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !539, file: !538, line: 94, baseType: !630, size: 64, offset: 1792)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !601)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !539, file: !538, line: 95, baseType: !592, size: 32, offset: 1856)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !539, file: !538, line: 95, baseType: !592, size: 32, offset: 1888)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !539, file: !538, line: 96, baseType: !634, size: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !539, file: !538, line: 96, baseType: !634, size: 64, offset: 1984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !539, file: !538, line: 97, baseType: !637, size: 64, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !539, file: !538, line: 97, baseType: !639, size: 64, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !539, file: !538, line: 98, baseType: !592, size: 32, offset: 2176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !539, file: !538, line: 98, baseType: !592, size: 32, offset: 2208)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !539, file: !538, line: 99, baseType: !634, size: 64, offset: 2240)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !539, file: !538, line: 99, baseType: !634, size: 64, offset: 2304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !539, file: !538, line: 100, baseType: !645, size: 64, offset: 2368)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !595)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !539, file: !538, line: 100, baseType: !648, size: 64, offset: 2432)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !539, file: !538, line: 101, baseType: !592, size: 32, offset: 2496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !539, file: !538, line: 101, baseType: !592, size: 32, offset: 2528)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !539, file: !538, line: 102, baseType: !634, size: 64, offset: 2560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !539, file: !538, line: 102, baseType: !634, size: 64, offset: 2624)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !539, file: !538, line: 103, baseType: !654, size: 64, offset: 2688)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !646)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !539, file: !538, line: 103, baseType: !657, size: 64, offset: 2752)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !539, file: !538, line: 104, baseType: !587, size: 64, offset: 2816)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !539, file: !538, line: 105, baseType: !592, size: 32, offset: 2880)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !539, file: !538, line: 106, baseType: !661, size: 128, offset: 2944)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 128, elements: !668)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !538, line: 64, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 61, size: 128, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !664, file: !538, line: 62, baseType: !580, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !664, file: !538, line: 63, baseType: !128, size: 64, offset: 64)
!668 = !{!669}
!669 = !DISubrange(count: 2)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !539, file: !538, line: 107, baseType: !671, size: 64, offset: 3072)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 64, elements: !668)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !539, file: !538, line: 108, baseType: !128, size: 64, offset: 3136)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !539, file: !538, line: 109, baseType: !674, size: 64, offset: 3200)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!139, !128}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !539, file: !538, line: 111, baseType: !592, size: 32, offset: 3264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !539, file: !538, line: 112, baseType: !679, size: 320, offset: 3328)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 320, elements: !725)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!139, !683, !552, !128}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !686)
!686 = !{!687, !688, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !685, file: !10, line: 100, baseType: !592, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !685, file: !10, line: 101, baseType: !689, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !700, !701, !702, !706, !708, !710, !711, !712}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !691, file: !10, line: 84, baseType: !619, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !691, file: !10, line: 85, baseType: !619, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !691, file: !10, line: 86, baseType: !128, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !691, file: !10, line: 87, baseType: !611, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !691, file: !10, line: 88, baseType: !698, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !691, file: !10, line: 89, baseType: !123, size: 8, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !691, file: !10, line: 90, baseType: !619, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !691, file: !10, line: 91, baseType: !703, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !704, line: 46, baseType: !705)
!704 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!705 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !691, file: !10, line: 92, baseType: !707, size: 32, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !10, line: 93, baseType: !709, size: 32, offset: 544)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !10, line: 94, baseType: !689, size: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !691, file: !10, line: 95, baseType: !619, size: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !691, file: !10, line: 96, baseType: !128, size: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !685, file: !10, line: 102, baseType: !619, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !685, file: !10, line: 102, baseType: !619, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !685, file: !10, line: 103, baseType: !619, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !685, file: !10, line: 104, baseType: !124, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !685, file: !10, line: 105, baseType: !707, size: 32, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !685, file: !10, line: 105, baseType: !707, size: 32, offset: 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !685, file: !10, line: 105, baseType: !707, size: 32, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !685, file: !10, line: 106, baseType: !552, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !685, file: !10, line: 107, baseType: !722, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!725 = !{!726}
!726 = !DISubrange(count: 5)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !539, file: !538, line: 113, baseType: !728, size: 320, offset: 3648)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 320, elements: !725)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!139, !552, !128}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !539, file: !538, line: 114, baseType: !733, size: 320, offset: 3968)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 320, elements: !725)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !539, file: !538, line: 115, baseType: !707, size: 32, offset: 4288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !539, file: !538, line: 120, baseType: !722, size: 64, offset: 4352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !539, file: !538, line: 121, baseType: !707, size: 32, offset: 4416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !534, file: !102, line: 76, baseType: !738, size: 896, offset: 4480)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 896, elements: !588)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !740)
!740 = !{!741, !751, !755, !759, !767, !768, !772, !773, !777, !781, !785, !786, !790, !791}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !739, file: !102, line: 19, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!139, !745, !746, !750}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !533)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !747, line: 21, baseType: !748)
!747 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !747, line: 21, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !739, file: !102, line: 22, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!139, !745, !746, !746, !750}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !739, file: !102, line: 25, baseType: !756, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!139, !745}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !739, file: !102, line: 26, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!139, !745, !763, !763}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !764, line: 16, baseType: !765)
!764 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !764, line: 16, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !739, file: !102, line: 27, baseType: !756, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !739, file: !102, line: 28, baseType: !769, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!139, !683, !745}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !739, file: !102, line: 29, baseType: !756, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !739, file: !102, line: 30, baseType: !774, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!139, !745, !645, !645}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !739, file: !102, line: 31, baseType: !778, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!139, !745, !592, !645, !645, !637}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !739, file: !102, line: 32, baseType: !782, size: 64, offset: 576)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!139, !745, !707, !707, !637, !750, !645, !645}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !739, file: !102, line: 33, baseType: !756, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !739, file: !102, line: 34, baseType: !787, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!139, !745, !559}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !739, file: !102, line: 35, baseType: !756, size: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !739, file: !102, line: 36, baseType: !787, size: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !534, file: !102, line: 77, baseType: !793, size: 64, offset: 5376)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !794, line: 14, baseType: !795)
!794 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !794, line: 14, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !534, file: !102, line: 78, baseType: !707, size: 32, offset: 5440)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !534, file: !102, line: 79, baseType: !707, size: 32, offset: 5472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !534, file: !102, line: 81, baseType: !592, size: 32, offset: 5504)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !534, file: !102, line: 82, baseType: !801, size: 64, offset: 5568)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !804)
!804 = !{!805, !806, !826, !827, !828, !829}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !803, file: !102, line: 55, baseType: !537, size: 4480)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !803, file: !102, line: 55, baseType: !807, size: 448, offset: 4480)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 448, elements: !588)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !809)
!809 = !{!810, !814, !815, !819, !820, !821, !825}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !808, file: !102, line: 42, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!139, !801, !746, !746}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !808, file: !102, line: 43, baseType: !811, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !808, file: !102, line: 44, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!139, !801}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !808, file: !102, line: 45, baseType: !816, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !808, file: !102, line: 46, baseType: !816, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !808, file: !102, line: 47, baseType: !822, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!139, !801, !559}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !808, file: !102, line: 48, baseType: !816, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !803, file: !102, line: 56, baseType: !745, size: 64, offset: 4928)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !803, file: !102, line: 57, baseType: !763, size: 64, offset: 4992)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !803, file: !102, line: 58, baseType: !630, size: 64, offset: 5056)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !102, line: 59, baseType: !128, size: 64, offset: 5120)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !534, file: !102, line: 83, baseType: !707, size: 32, offset: 5632)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !534, file: !102, line: 84, baseType: !707, size: 32, offset: 5664)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !534, file: !102, line: 85, baseType: !707, size: 32, offset: 5696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !534, file: !102, line: 86, baseType: !707, size: 32, offset: 5728)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !534, file: !102, line: 87, baseType: !835, size: 32, offset: 5760)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !534, file: !102, line: 88, baseType: !837, size: 384, offset: 5792)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 384, elements: !838)
!838 = !{!839, !840}
!839 = !DISubrange(count: 4)
!840 = !DISubrange(count: 3)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !534, file: !102, line: 89, baseType: !646, size: 64, offset: 6208)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !534, file: !102, line: 90, baseType: !646, size: 64, offset: 6272)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !534, file: !102, line: 91, baseType: !646, size: 64, offset: 6336)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !534, file: !102, line: 92, baseType: !646, size: 64, offset: 6400)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !534, file: !102, line: 93, baseType: !646, size: 64, offset: 6464)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !534, file: !102, line: 94, baseType: !646, size: 64, offset: 6528)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !534, file: !102, line: 95, baseType: !848, size: 32, offset: 6592)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !534, file: !102, line: 96, baseType: !707, size: 32, offset: 6624)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !534, file: !102, line: 98, baseType: !746, size: 64, offset: 6656)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !534, file: !102, line: 98, baseType: !746, size: 64, offset: 6720)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !534, file: !102, line: 102, baseType: !645, size: 64, offset: 6784)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !534, file: !102, line: 103, baseType: !645, size: 64, offset: 6848)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !534, file: !102, line: 104, baseType: !592, size: 32, offset: 6912)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !534, file: !102, line: 105, baseType: !592, size: 32, offset: 6944)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !534, file: !102, line: 106, baseType: !707, size: 32, offset: 6976)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !534, file: !102, line: 107, baseType: !645, size: 64, offset: 7040)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !534, file: !102, line: 108, baseType: !645, size: 64, offset: 7104)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !534, file: !102, line: 109, baseType: !592, size: 32, offset: 7168)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !534, file: !102, line: 110, baseType: !592, size: 32, offset: 7200)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !534, file: !102, line: 111, baseType: !707, size: 32, offset: 7232)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !534, file: !102, line: 113, baseType: !592, size: 32, offset: 7264)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !534, file: !102, line: 114, baseType: !707, size: 32, offset: 7296)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !534, file: !102, line: 117, baseType: !592, size: 32, offset: 7328)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !534, file: !102, line: 120, baseType: !866, size: 320, offset: 7360)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 320, elements: !725)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!139, !745, !592, !646, !128}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !534, file: !102, line: 121, baseType: !871, size: 320, offset: 7680)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 320, elements: !725)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!139, !875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !534, file: !102, line: 122, baseType: !733, size: 320, offset: 8000)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !534, file: !102, line: 123, baseType: !592, size: 32, offset: 8320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !534, file: !102, line: 124, baseType: !707, size: 32, offset: 8352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !534, file: !102, line: 126, baseType: !880, size: 320, offset: 8384)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 320, elements: !725)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!139, !745, !128}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !534, file: !102, line: 127, baseType: !871, size: 320, offset: 8704)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !534, file: !102, line: 128, baseType: !733, size: 320, offset: 9024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !534, file: !102, line: 129, baseType: !592, size: 32, offset: 9344)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !534, file: !102, line: 131, baseType: !888, size: 64, offset: 9408)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!139, !745, !592, !646, !891, !128}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !534, file: !102, line: 132, baseType: !674, size: 64, offset: 9472)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !534, file: !102, line: 133, baseType: !128, size: 64, offset: 9536)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !534, file: !102, line: 135, baseType: !128, size: 64, offset: 9600)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !534, file: !102, line: 137, baseType: !896, size: 64, offset: 9664)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !102, line: 139, baseType: !128, size: 64, offset: 9728)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9792)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9824)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9888)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9920)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9952)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 9984)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10016)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10048)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10080)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10112)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10144)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10176)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !534, file: !102, line: 142, baseType: !707, size: 32, offset: 10208)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10240)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10304)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10368)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10432)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10496)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10560)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10624)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10688)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10752)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10816)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10880)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 10944)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 11008)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !534, file: !102, line: 143, baseType: !559, size: 64, offset: 11072)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11136)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11168)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11200)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11232)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11264)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11296)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11328)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11360)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11392)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11424)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11456)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11488)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11520)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !534, file: !102, line: 144, baseType: !929, size: 32, offset: 11552)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !534, file: !102, line: 147, baseType: !592, size: 32, offset: 11584)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !534, file: !102, line: 148, baseType: !750, size: 64, offset: 11648)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !534, file: !102, line: 150, baseType: !946, size: 32, offset: 11712)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !534, file: !102, line: 151, baseType: !707, size: 32, offset: 11744)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !534, file: !102, line: 153, baseType: !592, size: 32, offset: 11776)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !534, file: !102, line: 154, baseType: !592, size: 32, offset: 11808)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !534, file: !102, line: 156, baseType: !707, size: 32, offset: 11840)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !534, file: !102, line: 161, baseType: !952, size: 192, offset: 11904)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !534, file: !102, line: 157, size: 192, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !952, file: !102, line: 158, baseType: !763, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !952, file: !102, line: 158, baseType: !763, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !952, file: !102, line: 159, baseType: !707, size: 32, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !952, file: !102, line: 160, baseType: !707, size: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !534, file: !102, line: 163, baseType: !959, size: 32, offset: 12096)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !534, file: !102, line: 165, baseType: !835, size: 32, offset: 12128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !534, file: !102, line: 166, baseType: !959, size: 32, offset: 12160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !534, file: !102, line: 171, baseType: !707, size: 32, offset: 12192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !534, file: !102, line: 172, baseType: !707, size: 32, offset: 12224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !534, file: !102, line: 173, baseType: !707, size: 32, offset: 12256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !534, file: !102, line: 174, baseType: !746, size: 64, offset: 12288)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !534, file: !102, line: 175, baseType: !746, size: 64, offset: 12352)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !534, file: !102, line: 177, baseType: !592, size: 32, offset: 12416)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !534, file: !102, line: 178, baseType: !707, size: 32, offset: 12448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !534, file: !102, line: 180, baseType: !559, size: 64, offset: 12480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !534, file: !102, line: 182, baseType: !971, size: 64, offset: 12544)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!139, !745, !746, !746, !128}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !534, file: !102, line: 183, baseType: !971, size: 64, offset: 12608)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !534, file: !102, line: 184, baseType: !128, size: 64, offset: 12672)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !534, file: !102, line: 184, baseType: !128, size: 64, offset: 12736)
!977 = !{}
!978 = !DISubprogram(name: "PetscError", scope: !115, file: !115, line: 668, type: !979, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !977)
!979 = !DISubroutineType(types: !980)
!980 = !{!139, !126, !26, !121, !121, !26, !114, !121, null}
!981 = distinct !DISubprogram(name: "KSPMonitorRegisterAll", scope: !136, file: !136, line: 127, type: !137, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !982)
!982 = !{!983, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018}
!983 = !DILocalVariable(name: "ierr", scope: !981, file: !136, line: 129, type: !139)
!984 = !DILocalVariable(name: "ierr__", scope: !985, file: !136, line: 135, type: !139)
!985 = distinct !DILexicalBlock(scope: !981, file: !136, line: 135, column: 144)
!986 = !DILocalVariable(name: "ierr__", scope: !987, file: !136, line: 136, type: !139)
!987 = distinct !DILexicalBlock(scope: !981, file: !136, line: 136, column: 144)
!988 = !DILocalVariable(name: "ierr__", scope: !989, file: !136, line: 137, type: !139)
!989 = distinct !DILexicalBlock(scope: !981, file: !136, line: 137, column: 170)
!990 = !DILocalVariable(name: "ierr__", scope: !991, file: !136, line: 138, type: !139)
!991 = distinct !DILexicalBlock(scope: !981, file: !136, line: 138, column: 144)
!992 = !DILocalVariable(name: "ierr__", scope: !993, file: !136, line: 139, type: !139)
!993 = distinct !DILexicalBlock(scope: !981, file: !136, line: 139, column: 144)
!994 = !DILocalVariable(name: "ierr__", scope: !995, file: !136, line: 140, type: !139)
!995 = distinct !DILexicalBlock(scope: !981, file: !136, line: 140, column: 144)
!996 = !DILocalVariable(name: "ierr__", scope: !997, file: !136, line: 141, type: !139)
!997 = distinct !DILexicalBlock(scope: !981, file: !136, line: 141, column: 144)
!998 = !DILocalVariable(name: "ierr__", scope: !999, file: !136, line: 142, type: !139)
!999 = distinct !DILexicalBlock(scope: !981, file: !136, line: 142, column: 174)
!1000 = !DILocalVariable(name: "ierr__", scope: !1001, file: !136, line: 143, type: !139)
!1001 = distinct !DILexicalBlock(scope: !981, file: !136, line: 143, column: 144)
!1002 = !DILocalVariable(name: "ierr__", scope: !1003, file: !136, line: 144, type: !139)
!1003 = distinct !DILexicalBlock(scope: !981, file: !136, line: 144, column: 144)
!1004 = !DILocalVariable(name: "ierr__", scope: !1005, file: !136, line: 145, type: !139)
!1005 = distinct !DILexicalBlock(scope: !981, file: !136, line: 145, column: 144)
!1006 = !DILocalVariable(name: "ierr__", scope: !1007, file: !136, line: 146, type: !139)
!1007 = distinct !DILexicalBlock(scope: !981, file: !136, line: 146, column: 167)
!1008 = !DILocalVariable(name: "ierr__", scope: !1009, file: !136, line: 147, type: !139)
!1009 = distinct !DILexicalBlock(scope: !981, file: !136, line: 147, column: 144)
!1010 = !DILocalVariable(name: "ierr__", scope: !1011, file: !136, line: 148, type: !139)
!1011 = distinct !DILexicalBlock(scope: !981, file: !136, line: 148, column: 144)
!1012 = !DILocalVariable(name: "ierr__", scope: !1013, file: !136, line: 149, type: !139)
!1013 = distinct !DILexicalBlock(scope: !981, file: !136, line: 149, column: 170)
!1014 = !DILocalVariable(name: "ierr__", scope: !1015, file: !136, line: 150, type: !139)
!1015 = distinct !DILexicalBlock(scope: !981, file: !136, line: 150, column: 169)
!1016 = !DILocalVariable(name: "ierr__", scope: !1017, file: !136, line: 151, type: !139)
!1017 = distinct !DILexicalBlock(scope: !981, file: !136, line: 151, column: 144)
!1018 = !DILocalVariable(name: "ierr__", scope: !1019, file: !136, line: 152, type: !139)
!1019 = distinct !DILexicalBlock(scope: !981, file: !136, line: 152, column: 174)
!1020 = !DILocation(line: 131, column: 3, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !136, line: 131, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !136, line: 131, column: 3)
!1023 = distinct !DILexicalBlock(scope: !981, file: !136, line: 131, column: 3)
!1024 = !DILocation(line: 131, column: 3, scope: !1022)
!1025 = !DILocation(line: 131, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !136, line: 131, column: 3)
!1027 = distinct !DILexicalBlock(scope: !1021, file: !136, line: 131, column: 3)
!1028 = !DILocation(line: 131, column: 3, scope: !1027)
!1029 = !DILocation(line: 131, column: 3, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !136, line: 131, column: 3)
!1031 = !DILocation(line: 132, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !981, file: !136, line: 132, column: 7)
!1033 = !DILocation(line: 132, column: 7, scope: !981)
!1034 = !DILocation(line: 132, column: 36, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !136, line: 132, column: 36)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !136, line: 132, column: 36)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !136, line: 132, column: 36)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !136, line: 132, column: 36)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !136, line: 132, column: 36)
!1040 = !DILocation(line: 132, column: 36, scope: !1036)
!1041 = !DILocation(line: 132, column: 36, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !136, line: 132, column: 36)
!1043 = distinct !DILexicalBlock(scope: !1035, file: !136, line: 132, column: 36)
!1044 = !DILocation(line: 132, column: 36, scope: !1043)
!1045 = !DILocation(line: 132, column: 36, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !136, line: 132, column: 36)
!1047 = !DILocation(line: 132, column: 36, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1035, file: !136, line: 132, column: 36)
!1049 = !DILocation(line: 132, column: 36, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1048, file: !136, line: 132, column: 36)
!1051 = !DILocation(line: 132, column: 36, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !136, line: 132, column: 36)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !136, line: 132, column: 36)
!1054 = !DILocation(line: 132, column: 36, scope: !1053)
!1055 = !DILocation(line: 132, column: 36, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !136, line: 132, column: 36)
!1057 = !DILocation(line: 133, column: 31, scope: !981)
!1058 = !DILocation(line: 135, column: 10, scope: !981)
!1059 = !DILocation(line: 0, scope: !981)
!1060 = !DILocation(line: 0, scope: !985)
!1061 = !DILocation(line: 135, column: 144, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !985, file: !136, line: 135, column: 144)
!1063 = !DILocation(line: 135, column: 144, scope: !985)
!1064 = !DILocation(line: 136, column: 10, scope: !981)
!1065 = !DILocation(line: 0, scope: !987)
!1066 = !DILocation(line: 136, column: 144, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !987, file: !136, line: 136, column: 144)
!1068 = !DILocation(line: 136, column: 144, scope: !987)
!1069 = !DILocation(line: 137, column: 10, scope: !981)
!1070 = !DILocation(line: 0, scope: !989)
!1071 = !DILocation(line: 137, column: 170, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !989, file: !136, line: 137, column: 170)
!1073 = !DILocation(line: 137, column: 170, scope: !989)
!1074 = !DILocation(line: 138, column: 10, scope: !981)
!1075 = !DILocation(line: 0, scope: !991)
!1076 = !DILocation(line: 138, column: 144, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !991, file: !136, line: 138, column: 144)
!1078 = !DILocation(line: 138, column: 144, scope: !991)
!1079 = !DILocation(line: 139, column: 10, scope: !981)
!1080 = !DILocation(line: 0, scope: !993)
!1081 = !DILocation(line: 139, column: 144, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !993, file: !136, line: 139, column: 144)
!1083 = !DILocation(line: 139, column: 144, scope: !993)
!1084 = !DILocation(line: 140, column: 10, scope: !981)
!1085 = !DILocation(line: 0, scope: !995)
!1086 = !DILocation(line: 140, column: 144, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !995, file: !136, line: 140, column: 144)
!1088 = !DILocation(line: 140, column: 144, scope: !995)
!1089 = !DILocation(line: 141, column: 10, scope: !981)
!1090 = !DILocation(line: 0, scope: !997)
!1091 = !DILocation(line: 141, column: 144, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !997, file: !136, line: 141, column: 144)
!1093 = !DILocation(line: 141, column: 144, scope: !997)
!1094 = !DILocation(line: 142, column: 10, scope: !981)
!1095 = !DILocation(line: 0, scope: !999)
!1096 = !DILocation(line: 142, column: 174, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !999, file: !136, line: 142, column: 174)
!1098 = !DILocation(line: 142, column: 174, scope: !999)
!1099 = !DILocation(line: 143, column: 10, scope: !981)
!1100 = !DILocation(line: 0, scope: !1001)
!1101 = !DILocation(line: 143, column: 144, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1001, file: !136, line: 143, column: 144)
!1103 = !DILocation(line: 143, column: 144, scope: !1001)
!1104 = !DILocation(line: 144, column: 10, scope: !981)
!1105 = !DILocation(line: 0, scope: !1003)
!1106 = !DILocation(line: 144, column: 144, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1003, file: !136, line: 144, column: 144)
!1108 = !DILocation(line: 144, column: 144, scope: !1003)
!1109 = !DILocation(line: 145, column: 10, scope: !981)
!1110 = !DILocation(line: 0, scope: !1005)
!1111 = !DILocation(line: 145, column: 144, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1005, file: !136, line: 145, column: 144)
!1113 = !DILocation(line: 145, column: 144, scope: !1005)
!1114 = !DILocation(line: 146, column: 10, scope: !981)
!1115 = !DILocation(line: 0, scope: !1007)
!1116 = !DILocation(line: 146, column: 167, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1007, file: !136, line: 146, column: 167)
!1118 = !DILocation(line: 146, column: 167, scope: !1007)
!1119 = !DILocation(line: 147, column: 10, scope: !981)
!1120 = !DILocation(line: 0, scope: !1009)
!1121 = !DILocation(line: 147, column: 144, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1009, file: !136, line: 147, column: 144)
!1123 = !DILocation(line: 147, column: 144, scope: !1009)
!1124 = !DILocation(line: 148, column: 10, scope: !981)
!1125 = !DILocation(line: 0, scope: !1011)
!1126 = !DILocation(line: 148, column: 144, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1011, file: !136, line: 148, column: 144)
!1128 = !DILocation(line: 148, column: 144, scope: !1011)
!1129 = !DILocation(line: 149, column: 10, scope: !981)
!1130 = !DILocation(line: 0, scope: !1013)
!1131 = !DILocation(line: 149, column: 170, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1013, file: !136, line: 149, column: 170)
!1133 = !DILocation(line: 149, column: 170, scope: !1013)
!1134 = !DILocation(line: 150, column: 10, scope: !981)
!1135 = !DILocation(line: 0, scope: !1015)
!1136 = !DILocation(line: 150, column: 169, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1015, file: !136, line: 150, column: 169)
!1138 = !DILocation(line: 150, column: 169, scope: !1015)
!1139 = !DILocation(line: 151, column: 10, scope: !981)
!1140 = !DILocation(line: 0, scope: !1017)
!1141 = !DILocation(line: 151, column: 144, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1017, file: !136, line: 151, column: 144)
!1143 = !DILocation(line: 151, column: 144, scope: !1017)
!1144 = !DILocation(line: 152, column: 10, scope: !981)
!1145 = !DILocation(line: 0, scope: !1019)
!1146 = !DILocation(line: 152, column: 174, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1019, file: !136, line: 152, column: 174)
!1148 = !DILocation(line: 152, column: 174, scope: !1019)
!1149 = !DILocation(line: 153, column: 3, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !136, line: 153, column: 3)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !136, line: 153, column: 3)
!1152 = distinct !DILexicalBlock(scope: !981, file: !136, line: 153, column: 3)
!1153 = !DILocation(line: 153, column: 3, scope: !1151)
!1154 = !DILocation(line: 153, column: 3, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !136, line: 153, column: 3)
!1156 = distinct !DILexicalBlock(scope: !1150, file: !136, line: 153, column: 3)
!1157 = !DILocation(line: 153, column: 3, scope: !1156)
!1158 = !DILocation(line: 153, column: 3, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !136, line: 153, column: 3)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !136, line: 153, column: 3)
!1161 = !DILocation(line: 153, column: 3, scope: !1160)
!1162 = !DILocation(line: 153, column: 3, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1159, file: !136, line: 153, column: 3)
!1164 = !DILocation(line: 153, column: 3, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1155, file: !136, line: 153, column: 3)
!1166 = !DILocation(line: 153, column: 3, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1165, file: !136, line: 153, column: 3)
!1168 = !DILocation(line: 153, column: 3, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !136, line: 153, column: 3)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !136, line: 153, column: 3)
!1171 = !DILocation(line: 153, column: 3, scope: !1170)
!1172 = !DILocation(line: 153, column: 3, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !136, line: 153, column: 3)
!1174 = !DILocation(line: 154, column: 1, scope: !981)
!1175 = !DISubprogram(name: "KSPMonitorRegister", scope: !33, file: !33, line: 114, type: !1176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !977)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!26, !121, !121, !56, !1178, !1192, !1196}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!26, !533, !26, !595, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 178, size: 256, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1191}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !1182, file: !57, line: 178, baseType: !559, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1182, file: !57, line: 178, baseType: !929, size: 32, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !1182, file: !57, line: 178, baseType: !1187, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !1188, line: 43, baseType: !1189)
!1188 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !1188, line: 43, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !57, line: 178, baseType: !128, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!26, !561, !56, !128, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!26, !1195}
