; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/fcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/fcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 719, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117}
!116 = !DIEnumerator(name: "KSP_CG_SYMMETRIC", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_CG_HERMITIAN", value: 1, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 203, baseType: !5, size: 32, elements: !119)
!119 = !{!120, !121}
!120 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_STANDARD", value: 0, isUnsigned: true)
!121 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_NOTAY", value: 1, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 663, baseType: !5, size: 32, elements: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!130 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 155, baseType: !5, size: 32, elements: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!152 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!153 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!155 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164}
!158 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!159 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!160 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!161 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!162 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!163 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!164 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !166)
!166 = !{!167}
!167 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!168 = !{!169, !207, !211, !212, !285, !408, !411, !295, !26, !247, !374, !5, !182, !414, !415, !416}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_FCG", file: !171, line: 21, baseType: !172)
!171 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/fcg/fcgimpl.h", directory: "/home/users/ndemeye/xSDK")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !171, line: 6, size: 1024, elements: !173)
!173 = !{!174, !176, !180, !181, !183, !185, !186, !188, !189, !190, !191, !192, !193, !198, !199, !201, !202, !204, !205}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !172, file: !171, line: 7, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCGType", file: !33, line: 719, baseType: !114)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !172, file: !171, line: 8, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !179)
!179 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !172, file: !171, line: 8, baseType: !177, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ned", scope: !172, file: !171, line: 9, baseType: !182, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !172, file: !171, line: 10, baseType: !184, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !172, file: !171, line: 10, baseType: !184, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !172, file: !171, line: 11, baseType: !187, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !172, file: !171, line: 11, baseType: !187, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mmax", scope: !172, file: !171, line: 13, baseType: !182, size: 32, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nprealloc", scope: !172, file: !171, line: 14, baseType: !182, size: 32, offset: 544)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nvecs", scope: !172, file: !171, line: 15, baseType: !182, size: 32, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !172, file: !171, line: 16, baseType: !182, size: 32, offset: 608)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Pvecs", scope: !172, file: !171, line: 17, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !149, line: 21, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !149, line: 21, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Cvecs", scope: !172, file: !171, line: 17, baseType: !194, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pPvecs", scope: !172, file: !171, line: 17, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pCvecs", scope: !172, file: !171, line: 17, baseType: !200, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "chunksizes", scope: !172, file: !171, line: 18, baseType: !203, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nchunks", scope: !172, file: !171, line: 19, baseType: !182, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "truncstrat", scope: !172, file: !171, line: 20, baseType: !206, size: 32, offset: 992)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPFCDTruncationType", file: !33, line: 203, baseType: !118)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !208, line: 330, baseType: !209)
!208 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !208, line: 330, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !215, line: 73, size: 4480, elements: !216)
!215 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!216 = !{!217, !219, !268, !269, !270, !272, !273, !274, !275, !283, !284, !286, !290, !294, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !307, !308, !309, !311, !312, !313, !315, !316, !317, !318, !319, !320, !322, !323, !324, !325, !326, !327, !329, !330, !331, !341, !343, !344, !348, !349, !398, !403, !405, !406, !407}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !214, file: !215, line: 74, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !214, file: !215, line: 75, baseType: !220, size: 448, offset: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 448, elements: !266)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !215, line: 53, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 45, size: 448, elements: !223)
!223 = !{!224, !230, !238, !243, !250, !254, !261}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !222, file: !215, line: 46, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !212, !229}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !222, file: !215, line: 47, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!228, !212, !234}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !235, line: 16, baseType: !236)
!235 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !235, line: 16, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !222, file: !215, line: 48, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!228, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !222, file: !215, line: 49, baseType: !244, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!228, !212, !247, !212}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !222, file: !215, line: 50, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!228, !212, !247, !242}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !222, file: !215, line: 51, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!228, !212, !247, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !222, file: !215, line: 52, baseType: !262, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!228, !212, !247, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!266 = !{!267}
!267 = !DISubrange(count: 1)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !214, file: !215, line: 76, baseType: !207, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !215, line: 77, baseType: !182, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !214, file: !215, line: 78, baseType: !271, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !179)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !214, file: !215, line: 78, baseType: !271, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !214, file: !215, line: 78, baseType: !271, size: 64, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !214, file: !215, line: 78, baseType: !271, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !215, line: 79, baseType: !276, size: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !279, line: 27, baseType: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !281, line: 43, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!282 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !214, file: !215, line: 80, baseType: !182, size: 32, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !214, file: !215, line: 81, baseType: !285, size: 32, offset: 992)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !214, file: !215, line: 82, baseType: !287, size: 64, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !214, file: !215, line: 83, baseType: !291, size: 64, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !214, file: !215, line: 84, baseType: !295, size: 64, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !214, file: !215, line: 85, baseType: !295, size: 64, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !214, file: !215, line: 86, baseType: !295, size: 64, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !214, file: !215, line: 87, baseType: !295, size: 64, offset: 1344)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !215, line: 88, baseType: !212, size: 64, offset: 1408)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !214, file: !215, line: 89, baseType: !276, size: 64, offset: 1472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 90, baseType: !295, size: 64, offset: 1536)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !214, file: !215, line: 91, baseType: !295, size: 64, offset: 1600)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !214, file: !215, line: 92, baseType: !182, size: 32, offset: 1664)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !214, file: !215, line: 93, baseType: !211, size: 64, offset: 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !215, line: 94, baseType: !306, size: 64, offset: 1792)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !277)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !214, file: !215, line: 95, baseType: !182, size: 32, offset: 1856)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !214, file: !215, line: 95, baseType: !182, size: 32, offset: 1888)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !214, file: !215, line: 96, baseType: !310, size: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !214, file: !215, line: 96, baseType: !310, size: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !214, file: !215, line: 97, baseType: !203, size: 64, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !214, file: !215, line: 97, baseType: !314, size: 64, offset: 2112)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !214, file: !215, line: 98, baseType: !182, size: 32, offset: 2176)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !214, file: !215, line: 98, baseType: !182, size: 32, offset: 2208)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !214, file: !215, line: 99, baseType: !310, size: 64, offset: 2240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !214, file: !215, line: 99, baseType: !310, size: 64, offset: 2304)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !214, file: !215, line: 100, baseType: !187, size: 64, offset: 2368)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !214, file: !215, line: 100, baseType: !321, size: 64, offset: 2432)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !214, file: !215, line: 101, baseType: !182, size: 32, offset: 2496)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !214, file: !215, line: 101, baseType: !182, size: 32, offset: 2528)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !214, file: !215, line: 102, baseType: !310, size: 64, offset: 2560)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !214, file: !215, line: 102, baseType: !310, size: 64, offset: 2624)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !214, file: !215, line: 103, baseType: !184, size: 64, offset: 2688)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !214, file: !215, line: 103, baseType: !328, size: 64, offset: 2752)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !214, file: !215, line: 104, baseType: !265, size: 64, offset: 2816)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !214, file: !215, line: 105, baseType: !182, size: 32, offset: 2880)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !214, file: !215, line: 106, baseType: !332, size: 128, offset: 2944)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 128, elements: !339)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !215, line: 64, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 61, size: 128, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !335, file: !215, line: 62, baseType: !258, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !335, file: !215, line: 63, baseType: !211, size: 64, offset: 64)
!339 = !{!340}
!340 = !DISubrange(count: 2)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !214, file: !215, line: 107, baseType: !342, size: 64, offset: 3072)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !339)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !214, file: !215, line: 108, baseType: !211, size: 64, offset: 3136)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !214, file: !215, line: 109, baseType: !345, size: 64, offset: 3200)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!228, !211}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !214, file: !215, line: 111, baseType: !182, size: 32, offset: 3264)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !214, file: !215, line: 112, baseType: !350, size: 320, offset: 3328)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !396)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!228, !354, !212, !211}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !357)
!357 = !{!358, !359, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !356, file: !10, line: 100, baseType: !182, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !10, line: 101, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !371, !372, !373, !377, !379, !381, !382, !383}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !362, file: !10, line: 84, baseType: !295, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !362, file: !10, line: 85, baseType: !295, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !10, line: 86, baseType: !211, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !362, file: !10, line: 87, baseType: !287, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !362, file: !10, line: 88, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !362, file: !10, line: 89, baseType: !249, size: 8, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !362, file: !10, line: 90, baseType: !295, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !362, file: !10, line: 91, baseType: !374, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !375, line: 46, baseType: !376)
!375 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!376 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !362, file: !10, line: 92, baseType: !378, size: 32, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !10, line: 93, baseType: !380, size: 32, offset: 544)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !10, line: 94, baseType: !360, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !362, file: !10, line: 95, baseType: !295, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !362, file: !10, line: 96, baseType: !211, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !356, file: !10, line: 102, baseType: !295, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !356, file: !10, line: 102, baseType: !295, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !356, file: !10, line: 103, baseType: !295, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !356, file: !10, line: 104, baseType: !207, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !356, file: !10, line: 105, baseType: !378, size: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !356, file: !10, line: 105, baseType: !378, size: 32, offset: 416)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !356, file: !10, line: 105, baseType: !378, size: 32, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !356, file: !10, line: 106, baseType: !212, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !356, file: !10, line: 107, baseType: !393, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!396 = !{!397}
!397 = !DISubrange(count: 5)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !214, file: !215, line: 113, baseType: !399, size: 320, offset: 3648)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 320, elements: !396)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!228, !212, !211}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !214, file: !215, line: 114, baseType: !404, size: 320, offset: 3968)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 320, elements: !396)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !214, file: !215, line: 115, baseType: !378, size: 32, offset: 4288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !214, file: !215, line: 120, baseType: !393, size: 64, offset: 4352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !214, file: !215, line: 121, baseType: !378, size: 32, offset: 4416)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !208, line: 331, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !208, line: 331, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !208, line: 338, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !208, line: 338, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !156)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !165)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!417 = !{i32 7, !"Dwarf Version", i32 4}
!418 = !{i32 2, !"Debug Info Version", i32 3}
!419 = !{i32 1, !"wchar_size", i32 4}
!420 = !{i32 7, !"PIC Level", i32 2}
!421 = !{i32 7, !"uwtable", i32 1}
!422 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!423 = distinct !DISubprogram(name: "KSPFCGSetMmax", scope: !424, file: !424, line: 342, type: !425, scopeLine: 343, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !667)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/fcg.c", directory: "/home/users/ndemeye/xSDK")
!425 = !DISubroutineType(types: !426)
!426 = !{!228, !427, !182}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !430)
!430 = !{!431, !433, !482, !487, !488, !489, !490, !520, !521, !522, !523, !524, !526, !531, !532, !533, !534, !535, !536, !537, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !560, !566, !567, !568, !569, !574, !575, !576, !577, !582, !583, !584, !585, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !637, !638, !639, !640, !641, !648, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !664, !665, !666}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !429, file: !102, line: 76, baseType: !432, size: 4480)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !215, line: 122, baseType: !214)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !429, file: !102, line: 76, baseType: !434, size: 896, offset: 4480)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 896, elements: !266)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !436)
!436 = !{!437, !441, !445, !449, !457, !458, !462, !463, !467, !471, !475, !476, !480, !481}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !435, file: !102, line: 19, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!228, !427, !195, !194}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !435, file: !102, line: 22, baseType: !442, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!228, !427, !195, !195, !194}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !435, file: !102, line: 25, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!228, !427}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !435, file: !102, line: 26, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!228, !427, !453, !453}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !454, line: 16, baseType: !455)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !454, line: 16, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !435, file: !102, line: 27, baseType: !446, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !435, file: !102, line: 28, baseType: !459, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!228, !354, !427}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !435, file: !102, line: 29, baseType: !446, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !435, file: !102, line: 30, baseType: !464, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!228, !427, !187, !187}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !435, file: !102, line: 31, baseType: !468, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!228, !427, !182, !187, !187, !203}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !435, file: !102, line: 32, baseType: !472, size: 64, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!228, !427, !378, !378, !203, !194, !187, !187}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !435, file: !102, line: 33, baseType: !446, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !435, file: !102, line: 34, baseType: !477, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!228, !427, !234}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !435, file: !102, line: 35, baseType: !446, size: 64, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !435, file: !102, line: 36, baseType: !477, size: 64, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !429, file: !102, line: 77, baseType: !483, size: 64, offset: 5376)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !484, line: 14, baseType: !485)
!484 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !484, line: 14, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !429, file: !102, line: 78, baseType: !378, size: 32, offset: 5440)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !429, file: !102, line: 79, baseType: !378, size: 32, offset: 5472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !429, file: !102, line: 81, baseType: !182, size: 32, offset: 5504)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !429, file: !102, line: 82, baseType: !491, size: 64, offset: 5568)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !494)
!494 = !{!495, !496, !516, !517, !518, !519}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !493, file: !102, line: 55, baseType: !432, size: 4480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !493, file: !102, line: 55, baseType: !497, size: 448, offset: 4480)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 448, elements: !266)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !499)
!499 = !{!500, !504, !505, !509, !510, !511, !515}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !498, file: !102, line: 42, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!228, !491, !195, !195}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !498, file: !102, line: 43, baseType: !501, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !498, file: !102, line: 44, baseType: !506, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!228, !491}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !498, file: !102, line: 45, baseType: !506, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !498, file: !102, line: 46, baseType: !506, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !498, file: !102, line: 47, baseType: !512, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!228, !491, !234}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !498, file: !102, line: 48, baseType: !506, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !493, file: !102, line: 56, baseType: !427, size: 64, offset: 4928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !493, file: !102, line: 57, baseType: !453, size: 64, offset: 4992)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !493, file: !102, line: 58, baseType: !306, size: 64, offset: 5056)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !102, line: 59, baseType: !211, size: 64, offset: 5120)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !429, file: !102, line: 83, baseType: !378, size: 32, offset: 5632)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !429, file: !102, line: 84, baseType: !378, size: 32, offset: 5664)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !429, file: !102, line: 85, baseType: !378, size: 32, offset: 5696)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !429, file: !102, line: 86, baseType: !378, size: 32, offset: 5728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !429, file: !102, line: 87, baseType: !525, size: 32, offset: 5760)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !429, file: !102, line: 88, baseType: !527, size: 384, offset: 5792)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 384, elements: !528)
!528 = !{!529, !530}
!529 = !DISubrange(count: 4)
!530 = !DISubrange(count: 3)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !429, file: !102, line: 89, baseType: !178, size: 64, offset: 6208)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !429, file: !102, line: 90, baseType: !178, size: 64, offset: 6272)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !429, file: !102, line: 91, baseType: !178, size: 64, offset: 6336)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !429, file: !102, line: 92, baseType: !178, size: 64, offset: 6400)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !429, file: !102, line: 93, baseType: !178, size: 64, offset: 6464)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !429, file: !102, line: 94, baseType: !178, size: 64, offset: 6528)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !429, file: !102, line: 95, baseType: !538, size: 32, offset: 6592)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !429, file: !102, line: 96, baseType: !378, size: 32, offset: 6624)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !429, file: !102, line: 98, baseType: !195, size: 64, offset: 6656)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !429, file: !102, line: 98, baseType: !195, size: 64, offset: 6720)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !429, file: !102, line: 102, baseType: !187, size: 64, offset: 6784)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !429, file: !102, line: 103, baseType: !187, size: 64, offset: 6848)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !429, file: !102, line: 104, baseType: !182, size: 32, offset: 6912)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !429, file: !102, line: 105, baseType: !182, size: 32, offset: 6944)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !429, file: !102, line: 106, baseType: !378, size: 32, offset: 6976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !429, file: !102, line: 107, baseType: !187, size: 64, offset: 7040)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !429, file: !102, line: 108, baseType: !187, size: 64, offset: 7104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !429, file: !102, line: 109, baseType: !182, size: 32, offset: 7168)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !429, file: !102, line: 110, baseType: !182, size: 32, offset: 7200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !429, file: !102, line: 111, baseType: !378, size: 32, offset: 7232)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !429, file: !102, line: 113, baseType: !182, size: 32, offset: 7264)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !429, file: !102, line: 114, baseType: !378, size: 32, offset: 7296)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !429, file: !102, line: 117, baseType: !182, size: 32, offset: 7328)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !429, file: !102, line: 120, baseType: !556, size: 320, offset: 7360)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 320, elements: !396)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!228, !427, !182, !178, !211}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !429, file: !102, line: 121, baseType: !561, size: 320, offset: 7680)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 320, elements: !396)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!228, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !429, file: !102, line: 122, baseType: !404, size: 320, offset: 8000)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !429, file: !102, line: 123, baseType: !182, size: 32, offset: 8320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !429, file: !102, line: 124, baseType: !378, size: 32, offset: 8352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !429, file: !102, line: 126, baseType: !570, size: 320, offset: 8384)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 320, elements: !396)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!228, !427, !211}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !429, file: !102, line: 127, baseType: !561, size: 320, offset: 8704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !429, file: !102, line: 128, baseType: !404, size: 320, offset: 9024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !429, file: !102, line: 129, baseType: !182, size: 32, offset: 9344)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !429, file: !102, line: 131, baseType: !578, size: 64, offset: 9408)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!228, !427, !182, !178, !581, !211}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !429, file: !102, line: 132, baseType: !345, size: 64, offset: 9472)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !429, file: !102, line: 133, baseType: !211, size: 64, offset: 9536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !429, file: !102, line: 135, baseType: !211, size: 64, offset: 9600)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !429, file: !102, line: 137, baseType: !586, size: 64, offset: 9664)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !102, line: 139, baseType: !211, size: 64, offset: 9728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9792)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9824)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9888)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9952)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 9984)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10016)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10080)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10144)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10176)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !429, file: !102, line: 142, baseType: !378, size: 32, offset: 10208)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10240)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10304)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10432)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10496)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10560)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10624)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10688)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10752)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10816)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10880)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 10944)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 11008)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !429, file: !102, line: 143, baseType: !234, size: 64, offset: 11072)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11136)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11168)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11200)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11232)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11296)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11328)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11360)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11392)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11424)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11456)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11488)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11520)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !429, file: !102, line: 144, baseType: !619, size: 32, offset: 11552)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !429, file: !102, line: 147, baseType: !182, size: 32, offset: 11584)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !429, file: !102, line: 148, baseType: !194, size: 64, offset: 11648)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !429, file: !102, line: 150, baseType: !636, size: 32, offset: 11712)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !429, file: !102, line: 151, baseType: !378, size: 32, offset: 11744)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !429, file: !102, line: 153, baseType: !182, size: 32, offset: 11776)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !429, file: !102, line: 154, baseType: !182, size: 32, offset: 11808)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !429, file: !102, line: 156, baseType: !378, size: 32, offset: 11840)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !429, file: !102, line: 161, baseType: !642, size: 192, offset: 11904)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !429, file: !102, line: 157, size: 192, elements: !643)
!643 = !{!644, !645, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !642, file: !102, line: 158, baseType: !453, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !642, file: !102, line: 158, baseType: !453, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !642, file: !102, line: 159, baseType: !378, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !642, file: !102, line: 160, baseType: !378, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !429, file: !102, line: 163, baseType: !649, size: 32, offset: 12096)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !429, file: !102, line: 165, baseType: !525, size: 32, offset: 12128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !429, file: !102, line: 166, baseType: !649, size: 32, offset: 12160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !429, file: !102, line: 171, baseType: !378, size: 32, offset: 12192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !429, file: !102, line: 172, baseType: !378, size: 32, offset: 12224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !429, file: !102, line: 173, baseType: !378, size: 32, offset: 12256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !429, file: !102, line: 174, baseType: !195, size: 64, offset: 12288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !429, file: !102, line: 175, baseType: !195, size: 64, offset: 12352)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !429, file: !102, line: 177, baseType: !182, size: 32, offset: 12416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !429, file: !102, line: 178, baseType: !378, size: 32, offset: 12448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !429, file: !102, line: 180, baseType: !234, size: 64, offset: 12480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !429, file: !102, line: 182, baseType: !661, size: 64, offset: 12544)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!228, !427, !195, !195, !211}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !429, file: !102, line: 183, baseType: !661, size: 64, offset: 12608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !429, file: !102, line: 184, baseType: !211, size: 64, offset: 12672)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !429, file: !102, line: 184, baseType: !211, size: 64, offset: 12736)
!667 = !{!668, !669, !670, !671, !673, !674, !675, !676, !678, !682, !683, !685, !691, !692, !694, !697, !698, !700, !703}
!668 = !DILocalVariable(name: "ksp", arg: 1, scope: !423, file: !424, line: 342, type: !427)
!669 = !DILocalVariable(name: "mmax", arg: 2, scope: !423, file: !424, line: 342, type: !182)
!670 = !DILocalVariable(name: "fcg", scope: !423, file: !424, line: 344, type: !169)
!671 = !DILocalVariable(name: "_7_ierr", scope: !672, file: !424, line: 348, type: !228)
!672 = distinct !DILexicalBlock(scope: !423, file: !424, line: 348, column: 3)
!673 = !DILocalVariable(name: "b0", scope: !672, file: !424, line: 348, type: !182)
!674 = !DILocalVariable(name: "b1", scope: !672, file: !424, line: 348, type: !342)
!675 = !DILocalVariable(name: "b2", scope: !672, file: !424, line: 348, type: !342)
!676 = !DILocalVariable(name: "_4_ierr", scope: !677, file: !424, line: 348, type: !228)
!677 = distinct !DILexicalBlock(scope: !672, file: !424, line: 348, column: 3)
!678 = !DILocalVariable(name: "a_b1", scope: !677, file: !424, line: 348, type: !679)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 192, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 6)
!682 = !DILocalVariable(name: "a_b2", scope: !677, file: !424, line: 348, type: !679)
!683 = !DILocalVariable(name: "_7_errorcode", scope: !684, file: !424, line: 348, type: !228)
!684 = distinct !DILexicalBlock(scope: !677, file: !424, line: 348, column: 3)
!685 = !DILocalVariable(name: "_7_errorstring", scope: !686, file: !424, line: 348, type: !688)
!686 = distinct !DILexicalBlock(scope: !687, file: !424, line: 348, column: 3)
!687 = distinct !DILexicalBlock(scope: !684, file: !424, line: 348, column: 3)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2048, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 256)
!691 = !DILocalVariable(name: "_7_resultlen", scope: !686, file: !424, line: 348, type: !285)
!692 = !DILocalVariable(name: "_7_errorcode", scope: !693, file: !424, line: 348, type: !228)
!693 = distinct !DILexicalBlock(scope: !677, file: !424, line: 348, column: 3)
!694 = !DILocalVariable(name: "_7_errorstring", scope: !695, file: !424, line: 348, type: !688)
!695 = distinct !DILexicalBlock(scope: !696, file: !424, line: 348, column: 3)
!696 = distinct !DILexicalBlock(scope: !693, file: !424, line: 348, column: 3)
!697 = !DILocalVariable(name: "_7_resultlen", scope: !695, file: !424, line: 348, type: !285)
!698 = !DILocalVariable(name: "_7_errorcode", scope: !699, file: !424, line: 348, type: !228)
!699 = distinct !DILexicalBlock(scope: !672, file: !424, line: 348, column: 3)
!700 = !DILocalVariable(name: "_7_errorstring", scope: !701, file: !424, line: 348, type: !688)
!701 = distinct !DILexicalBlock(scope: !702, file: !424, line: 348, column: 3)
!702 = distinct !DILexicalBlock(scope: !699, file: !424, line: 348, column: 3)
!703 = !DILocalVariable(name: "_7_resultlen", scope: !701, file: !424, line: 348, type: !285)
!704 = !DILocation(line: 0, scope: !423)
!705 = !DILocation(line: 344, column: 33, scope: !423)
!706 = !{!707, !712, i64 1216}
