; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/valid.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/valid.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_datatype_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1345, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 663, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!311 = !{!312, !316, !317, !320, !323, !523, !358, !408, !72, !360}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !313, line: 331, baseType: !314)
!313 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !313, line: 331, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !313, line: 330, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !313, line: 330, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !321, line: 46, baseType: !322)
!321 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!322 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !326, line: 73, size: 4480, elements: !327)
!326 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!327 = !{!328, !330, !379, !380, !382, !385, !386, !387, !388, !396, !397, !399, !403, !407, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !420, !421, !422, !424, !425, !427, !429, !430, !431, !432, !433, !436, !438, !439, !440, !441, !442, !445, !447, !448, !449, !459, !461, !462, !466, !467, !513, !518, !520, !521, !522}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !325, file: !326, line: 74, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !325, file: !326, line: 75, baseType: !331, size: 448, offset: 64)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 448, elements: !377)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !326, line: 53, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 45, size: 448, elements: !334)
!334 = !{!335, !341, !349, !354, !361, !365, !372}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !333, file: !326, line: 46, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !323, !340}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !333, file: !326, line: 47, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!339, !323, !345}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !346, line: 16, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !346, line: 16, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !333, file: !326, line: 48, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!339, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !333, file: !326, line: 49, baseType: !355, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!339, !323, !358, !323}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !333, file: !326, line: 50, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!339, !323, !358, !353}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !333, file: !326, line: 51, baseType: !366, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!339, !323, !358, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !333, file: !326, line: 52, baseType: !373, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!339, !323, !358, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!377 = !{!378}
!378 = !DISubrange(count: 1)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !325, file: !326, line: 76, baseType: !317, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !326, line: 77, baseType: !381, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !325, file: !326, line: 78, baseType: !383, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !384)
!384 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !325, file: !326, line: 78, baseType: !383, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !325, file: !326, line: 78, baseType: !383, size: 64, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !325, file: !326, line: 78, baseType: !383, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !326, line: 79, baseType: !389, size: 64, offset: 896)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !392, line: 27, baseType: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !394, line: 43, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!395 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !325, file: !326, line: 80, baseType: !381, size: 32, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !325, file: !326, line: 81, baseType: !398, size: 32, offset: 992)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !325, file: !326, line: 82, baseType: !400, size: 64, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !325, file: !326, line: 83, baseType: !404, size: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !325, file: !326, line: 84, baseType: !408, size: 64, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !325, file: !326, line: 85, baseType: !408, size: 64, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !325, file: !326, line: 86, baseType: !408, size: 64, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !325, file: !326, line: 87, baseType: !408, size: 64, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !325, file: !326, line: 88, baseType: !323, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !325, file: !326, line: 89, baseType: !389, size: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !326, line: 90, baseType: !408, size: 64, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !325, file: !326, line: 91, baseType: !408, size: 64, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !325, file: !326, line: 92, baseType: !381, size: 32, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !325, file: !326, line: 93, baseType: !316, size: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !325, file: !326, line: 94, baseType: !419, size: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !390)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !325, file: !326, line: 95, baseType: !381, size: 32, offset: 1856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !325, file: !326, line: 95, baseType: !381, size: 32, offset: 1888)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !325, file: !326, line: 96, baseType: !423, size: 64, offset: 1920)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !325, file: !326, line: 96, baseType: !423, size: 64, offset: 1984)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !325, file: !326, line: 97, baseType: !426, size: 64, offset: 2048)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !325, file: !326, line: 97, baseType: !428, size: 64, offset: 2112)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !325, file: !326, line: 98, baseType: !381, size: 32, offset: 2176)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !325, file: !326, line: 98, baseType: !381, size: 32, offset: 2208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !325, file: !326, line: 99, baseType: !423, size: 64, offset: 2240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !325, file: !326, line: 99, baseType: !423, size: 64, offset: 2304)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !325, file: !326, line: 100, baseType: !434, size: 64, offset: 2368)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !325, file: !326, line: 100, baseType: !437, size: 64, offset: 2432)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !325, file: !326, line: 101, baseType: !381, size: 32, offset: 2496)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !325, file: !326, line: 101, baseType: !381, size: 32, offset: 2528)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !325, file: !326, line: 102, baseType: !423, size: 64, offset: 2560)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !325, file: !326, line: 102, baseType: !423, size: 64, offset: 2624)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !325, file: !326, line: 103, baseType: !443, size: 64, offset: 2688)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !435)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !325, file: !326, line: 103, baseType: !446, size: 64, offset: 2752)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !325, file: !326, line: 104, baseType: !376, size: 64, offset: 2816)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !325, file: !326, line: 105, baseType: !381, size: 32, offset: 2880)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !325, file: !326, line: 106, baseType: !450, size: 128, offset: 2944)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 128, elements: !457)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !326, line: 64, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 61, size: 128, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !453, file: !326, line: 62, baseType: !369, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !453, file: !326, line: 63, baseType: !316, size: 64, offset: 64)
!457 = !{!458}
!458 = !DISubrange(count: 2)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !325, file: !326, line: 107, baseType: !460, size: 64, offset: 3072)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 64, elements: !457)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !325, file: !326, line: 108, baseType: !316, size: 64, offset: 3136)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !325, file: !326, line: 109, baseType: !463, size: 64, offset: 3200)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!339, !316}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !325, file: !326, line: 111, baseType: !381, size: 32, offset: 3264)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !325, file: !326, line: 112, baseType: !468, size: 320, offset: 3328)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 320, elements: !511)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!339, !472, !323, !316}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !475)
!475 = !{!476, !477, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !474, file: !10, line: 100, baseType: !381, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !10, line: 101, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !489, !490, !491, !492, !494, !496, !497, !498}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !480, file: !10, line: 84, baseType: !408, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !480, file: !10, line: 85, baseType: !408, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !480, file: !10, line: 86, baseType: !316, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !480, file: !10, line: 87, baseType: !400, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !480, file: !10, line: 88, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !480, file: !10, line: 89, baseType: !360, size: 8, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !480, file: !10, line: 90, baseType: !408, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !480, file: !10, line: 91, baseType: !320, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !480, file: !10, line: 92, baseType: !493, size: 32, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !10, line: 93, baseType: !495, size: 32, offset: 544)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !10, line: 94, baseType: !478, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !480, file: !10, line: 95, baseType: !408, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !480, file: !10, line: 96, baseType: !316, size: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !474, file: !10, line: 102, baseType: !408, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !474, file: !10, line: 102, baseType: !408, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !474, file: !10, line: 103, baseType: !408, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !474, file: !10, line: 104, baseType: !317, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !474, file: !10, line: 105, baseType: !493, size: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !474, file: !10, line: 105, baseType: !493, size: 32, offset: 416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !474, file: !10, line: 105, baseType: !493, size: 32, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !474, file: !10, line: 106, baseType: !323, size: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !474, file: !10, line: 107, baseType: !508, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!511 = !{!512}
!512 = !DISubrange(count: 5)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !325, file: !326, line: 113, baseType: !514, size: 320, offset: 3648)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 320, elements: !511)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!339, !323, !316}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !325, file: !326, line: 114, baseType: !519, size: 320, offset: 3968)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 320, elements: !511)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !325, file: !326, line: 115, baseType: !493, size: 32, offset: 4288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !325, file: !326, line: 120, baseType: !508, size: 64, offset: 4352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !325, file: !326, line: 121, baseType: !493, size: 32, offset: 4416)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !313, line: 338, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !313, line: 338, flags: DIFlagFwdDecl)
!526 = !{i32 7, !"Dwarf Version", i32 4}
!527 = !{i32 2, !"Debug Info Version", i32 3}
!528 = !{i32 1, !"wchar_size", i32 4}
!529 = !{i32 7, !"PIC Level", i32 2}
!530 = !{i32 7, !"uwtable", i32 1}
!531 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!532 = distinct !DISubprogram(name: "MatColoringTest", scope: !533, file: !533, line: 6, type: !534, scopeLine: 7, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1343)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/valid.c", directory: "/home/users/ndemeye/xSDK")
!534 = !DISubroutineType(types: !535)
!535 = !{!339, !536, !564}
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !36, line: 1312, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !539, line: 647, size: 5248, elements: !540)
!539 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!540 = !{!541, !543, !572, !1334, !1335, !1336, !1337, !1338, !1340, !1341, !1342}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !538, file: !539, line: 648, baseType: !542, size: 4480)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !326, line: 122, baseType: !325)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !538, file: !539, line: 648, baseType: !544, size: 320, offset: 4480)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 320, elements: !377)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !539, line: 639, size: 320, elements: !546)
!546 = !{!547, !551, !555, !559, !568}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !545, file: !539, line: 640, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!339, !536}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !545, file: !539, line: 641, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!339, !472, !536}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !545, file: !539, line: 642, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!339, !536, !345}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !545, file: !539, line: 643, baseType: !560, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!339, !536, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !565, line: 51, baseType: !566)
!565 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !565, line: 51, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !545, file: !539, line: 644, baseType: !569, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!339, !536, !437, !428}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !538, file: !539, line: 649, baseType: !573, size: 64, offset: 4800)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !539, line: 436, size: 23424, elements: !576)
!576 = !{!577, !578, !1080, !1100, !1101, !1102, !1104, !1105, !1106, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1230, !1231, !1247, !1248, !1249, !1250, !1251, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1286, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1332, !1333}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !575, file: !539, line: 437, baseType: !542, size: 4480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !575, file: !539, line: 437, baseType: !579, size: 9472, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 9472, elements: !377)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !539, line: 32, size: 9472, elements: !581)
!581 = !{!582, !591, !595, !596, !603, !607, !608, !609, !610, !611, !612, !613, !636, !640, !645, !651, !670, !675, !679, !680, !685, !690, !691, !696, !700, !704, !708, !712, !716, !717, !718, !719, !720, !724, !725, !730, !731, !732, !733, !734, !739, !746, !751, !755, !759, !763, !767, !768, !772, !773, !780, !785, !786, !787, !788, !847, !854, !855, !859, !860, !864, !865, !869, !874, !875, !879, !883, !890, !891, !892, !893, !894, !895, !900, !901, !905, !909, !913, !914, !915, !919, !929, !930, !934, !935, !939, !940, !944, !945, !950, !951, !955, !959, !960, !961, !962, !963, !964, !965, !969, !970, !971, !972, !973, !974, !978, !979, !980, !981, !982, !983, !984, !985, !989, !993, !994, !995, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1009, !1010, !1011, !1016, !1020, !1021, !1025, !1026, !1027, !1028, !1054, !1058, !1059, !1060, !1061, !1062, !1066, !1067, !1068, !1069, !1070, !1074, !1078, !1079}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !580, file: !539, line: 34, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!339, !573, !381, !586, !381, !586, !588, !590}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !580, file: !539, line: 35, baseType: !592, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!339, !573, !381, !426, !428, !446}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !580, file: !539, line: 36, baseType: !592, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !580, file: !539, line: 37, baseType: !597, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!339, !573, !600, !600}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !580, file: !539, line: 38, baseType: !604, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!339, !573, !600, !600, !600}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !580, file: !539, line: 40, baseType: !597, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !580, file: !539, line: 41, baseType: !604, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !580, file: !539, line: 42, baseType: !597, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !580, file: !539, line: 43, baseType: !604, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !580, file: !539, line: 44, baseType: !597, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !580, file: !539, line: 46, baseType: !604, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !580, file: !539, line: 47, baseType: !614, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!339, !573, !617, !617, !620}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !565, line: 11, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !565, line: 11, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !623, file: !36, line: 1227, baseType: !435, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !623, file: !36, line: 1228, baseType: !435, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !623, file: !36, line: 1229, baseType: !435, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !623, file: !36, line: 1230, baseType: !435, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !623, file: !36, line: 1231, baseType: !435, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !623, file: !36, line: 1232, baseType: !435, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !623, file: !36, line: 1233, baseType: !435, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !623, file: !36, line: 1234, baseType: !435, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !623, file: !36, line: 1236, baseType: !435, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !623, file: !36, line: 1237, baseType: !435, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !623, file: !36, line: 1238, baseType: !435, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !580, file: !539, line: 48, baseType: !637, size: 64, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!339, !573, !617, !620}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !580, file: !539, line: 49, baseType: !641, size: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!339, !573, !600, !435, !644, !435, !381, !381, !600}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !580, file: !539, line: 50, baseType: !646, size: 64, offset: 896)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!339, !573, !649, !650}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !580, file: !539, line: 52, baseType: !652, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!339, !573, !655, !656}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !658, file: !36, line: 593, baseType: !383, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !658, file: !36, line: 594, baseType: !383, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !658, file: !36, line: 594, baseType: !383, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !658, file: !36, line: 594, baseType: !383, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !658, file: !36, line: 595, baseType: !383, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !658, file: !36, line: 596, baseType: !383, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !658, file: !36, line: 597, baseType: !383, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !658, file: !36, line: 598, baseType: !383, size: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !658, file: !36, line: 598, baseType: !383, size: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !658, file: !36, line: 599, baseType: !383, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !580, file: !539, line: 53, baseType: !671, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!339, !573, !573, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !580, file: !539, line: 54, baseType: !676, size: 64, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!339, !573, !600}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !580, file: !539, line: 55, baseType: !597, size: 64, offset: 1152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !580, file: !539, line: 56, baseType: !681, size: 64, offset: 1216)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!339, !573, !684, !434}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !580, file: !539, line: 58, baseType: !686, size: 64, offset: 1280)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!339, !573, !689}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !580, file: !539, line: 59, baseType: !686, size: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !580, file: !539, line: 60, baseType: !692, size: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!339, !573, !695, !493}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !580, file: !539, line: 61, baseType: !697, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!339, !573}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !580, file: !539, line: 63, baseType: !701, size: 64, offset: 1536)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!339, !573, !381, !586, !444, !600, !600}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !580, file: !539, line: 64, baseType: !705, size: 64, offset: 1600)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!339, !573, !573, !617, !617, !620}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !580, file: !539, line: 65, baseType: !709, size: 64, offset: 1664)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!339, !573, !573, !620}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !580, file: !539, line: 66, baseType: !713, size: 64, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!339, !573, !573, !617, !620}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !580, file: !539, line: 67, baseType: !709, size: 64, offset: 1792)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !580, file: !539, line: 69, baseType: !697, size: 64, offset: 1856)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !580, file: !539, line: 70, baseType: !705, size: 64, offset: 1920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !580, file: !539, line: 71, baseType: !713, size: 64, offset: 1984)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !580, file: !539, line: 72, baseType: !721, size: 64, offset: 2048)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!339, !573, !650}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !580, file: !539, line: 73, baseType: !697, size: 64, offset: 2112)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !580, file: !539, line: 75, baseType: !726, size: 64, offset: 2176)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!339, !573, !729, !650}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !580, file: !539, line: 76, baseType: !597, size: 64, offset: 2240)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !580, file: !539, line: 77, baseType: !597, size: 64, offset: 2304)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !580, file: !539, line: 78, baseType: !614, size: 64, offset: 2368)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !580, file: !539, line: 79, baseType: !637, size: 64, offset: 2432)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !580, file: !539, line: 81, baseType: !735, size: 64, offset: 2496)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!339, !573, !444, !573, !738}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !580, file: !539, line: 82, baseType: !740, size: 64, offset: 2560)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!339, !573, !381, !743, !743, !649, !745}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !580, file: !539, line: 83, baseType: !747, size: 64, offset: 2624)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!339, !573, !381, !750, !381}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !580, file: !539, line: 84, baseType: !752, size: 64, offset: 2688)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!339, !573, !381, !586, !381, !586, !443}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !580, file: !539, line: 85, baseType: !756, size: 64, offset: 2752)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!339, !573, !573, !738}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !580, file: !539, line: 87, baseType: !760, size: 64, offset: 2816)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!339, !573, !600, !426}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !580, file: !539, line: 88, baseType: !764, size: 64, offset: 2880)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!339, !573, !444}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !580, file: !539, line: 89, baseType: !764, size: 64, offset: 2944)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !580, file: !539, line: 90, baseType: !769, size: 64, offset: 3008)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!339, !573, !600, !590}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !580, file: !539, line: 91, baseType: !701, size: 64, offset: 3072)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !580, file: !539, line: 93, baseType: !774, size: 64, offset: 3136)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!339, !573, !777}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !580, file: !539, line: 94, baseType: !781, size: 64, offset: 3200)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!339, !573, !381, !493, !493, !426, !784, !784, !674}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !580, file: !539, line: 95, baseType: !781, size: 64, offset: 3264)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !580, file: !539, line: 96, baseType: !781, size: 64, offset: 3328)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !580, file: !539, line: 97, baseType: !781, size: 64, offset: 3392)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !580, file: !539, line: 99, baseType: !789, size: 64, offset: 3456)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!339, !573, !564, !792}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !539, line: 609, size: 6208, elements: !795)
!795 = !{!796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !816, !823, !824, !825, !826, !827, !828, !829, !830, !834, !835, !836, !837, !838, !840, !841, !842, !843, !844, !845, !846}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !794, file: !539, line: 610, baseType: !542, size: 4480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !794, file: !539, line: 610, baseType: !798, size: 32, offset: 4480)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !377)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !794, file: !539, line: 611, baseType: !381, size: 32, offset: 4512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !794, file: !539, line: 611, baseType: !381, size: 32, offset: 4544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !794, file: !539, line: 611, baseType: !381, size: 32, offset: 4576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !794, file: !539, line: 612, baseType: !381, size: 32, offset: 4608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !794, file: !539, line: 613, baseType: !381, size: 32, offset: 4640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !794, file: !539, line: 614, baseType: !426, size: 64, offset: 4672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !794, file: !539, line: 615, baseType: !428, size: 64, offset: 4736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !794, file: !539, line: 616, baseType: !750, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !794, file: !539, line: 617, baseType: !426, size: 64, offset: 4864)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !794, file: !539, line: 618, baseType: !809, size: 64, offset: 4928)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !539, line: 602, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 598, size: 128, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !811, file: !539, line: 599, baseType: !381, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !811, file: !539, line: 600, baseType: !381, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !811, file: !539, line: 601, baseType: !443, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !794, file: !539, line: 619, baseType: !817, size: 64, offset: 4992)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !539, line: 607, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 604, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !819, file: !539, line: 605, baseType: !381, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !819, file: !539, line: 606, baseType: !443, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !794, file: !539, line: 620, baseType: !443, size: 64, offset: 5056)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !794, file: !539, line: 621, baseType: !435, size: 64, offset: 5120)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !794, file: !539, line: 622, baseType: !435, size: 64, offset: 5184)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !794, file: !539, line: 623, baseType: !600, size: 64, offset: 5248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !794, file: !539, line: 623, baseType: !600, size: 64, offset: 5312)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !794, file: !539, line: 623, baseType: !600, size: 64, offset: 5376)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !794, file: !539, line: 624, baseType: !493, size: 32, offset: 5440)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !794, file: !539, line: 625, baseType: !831, size: 64, offset: 5504)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!339}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !794, file: !539, line: 626, baseType: !316, size: 64, offset: 5568)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !794, file: !539, line: 627, baseType: !600, size: 64, offset: 5632)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !794, file: !539, line: 628, baseType: !381, size: 32, offset: 5696)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !794, file: !539, line: 629, baseType: !358, size: 64, offset: 5760)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !794, file: !539, line: 630, baseType: !839, size: 32, offset: 5824)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !794, file: !539, line: 631, baseType: !381, size: 32, offset: 5856)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !794, file: !539, line: 631, baseType: !381, size: 32, offset: 5888)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !794, file: !539, line: 632, baseType: !493, size: 32, offset: 5920)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !794, file: !539, line: 633, baseType: !493, size: 32, offset: 5952)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !794, file: !539, line: 634, baseType: !369, size: 64, offset: 6016)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !794, file: !539, line: 634, baseType: !316, size: 64, offset: 6080)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !794, file: !539, line: 635, baseType: !389, size: 64, offset: 6144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !580, file: !539, line: 100, baseType: !848, size: 64, offset: 3520)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!339, !573, !381, !381, !851, !563}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !853)
!853 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !580, file: !539, line: 101, baseType: !697, size: 64, offset: 3584)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !580, file: !539, line: 102, baseType: !856, size: 64, offset: 3648)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!339, !573, !617, !617, !650}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !580, file: !539, line: 103, baseType: !583, size: 64, offset: 3712)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !580, file: !539, line: 105, baseType: !861, size: 64, offset: 3776)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!339, !573, !617, !617, !649, !650}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !580, file: !539, line: 106, baseType: !697, size: 64, offset: 3840)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !580, file: !539, line: 107, baseType: !866, size: 64, offset: 3904)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!339, !573, !345}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !580, file: !539, line: 108, baseType: !870, size: 64, offset: 3968)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!339, !573, !873, !649, !650}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !358)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !580, file: !539, line: 109, baseType: !831, size: 64, offset: 4032)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !580, file: !539, line: 111, baseType: !876, size: 64, offset: 4096)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!339, !573, !573, !573, !435, !573}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !580, file: !539, line: 112, baseType: !880, size: 64, offset: 4160)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!339, !573, !573, !573, !573}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !580, file: !539, line: 113, baseType: !884, size: 64, offset: 4224)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!339, !573, !887, !887}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !565, line: 30, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !565, line: 30, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !580, file: !539, line: 114, baseType: !583, size: 64, offset: 4288)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !580, file: !539, line: 115, baseType: !701, size: 64, offset: 4352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !580, file: !539, line: 117, baseType: !760, size: 64, offset: 4416)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !580, file: !539, line: 118, baseType: !760, size: 64, offset: 4480)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !580, file: !539, line: 119, baseType: !870, size: 64, offset: 4544)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !580, file: !539, line: 120, baseType: !896, size: 64, offset: 4608)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!339, !573, !899, !674}
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !580, file: !539, line: 121, baseType: !831, size: 64, offset: 4672)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !580, file: !539, line: 123, baseType: !902, size: 64, offset: 4736)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!339, !573, !381, !316}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !580, file: !539, line: 124, baseType: !906, size: 64, offset: 4800)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!339, !573, !792, !600, !316}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !580, file: !539, line: 125, baseType: !910, size: 64, offset: 4864)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!339, !472, !573}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !580, file: !539, line: 126, baseType: !597, size: 64, offset: 4928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !580, file: !539, line: 127, baseType: !597, size: 64, offset: 4992)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !580, file: !539, line: 129, baseType: !916, size: 64, offset: 5056)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!339, !573, !750}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !580, file: !539, line: 130, baseType: !920, size: 64, offset: 5120)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!339, !573, !923, !923}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !925, file: !60, line: 653, baseType: !381, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !925, file: !60, line: 653, baseType: !600, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !580, file: !539, line: 131, baseType: !920, size: 64, offset: 5184)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !580, file: !539, line: 132, baseType: !931, size: 64, offset: 5248)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!339, !573, !426, !426, !426}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !580, file: !539, line: 133, baseType: !866, size: 64, offset: 5312)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !580, file: !539, line: 135, baseType: !936, size: 64, offset: 5376)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!339, !573, !435, !674}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !580, file: !539, line: 136, baseType: !936, size: 64, offset: 5440)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !580, file: !539, line: 137, baseType: !941, size: 64, offset: 5504)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!339, !573, !674}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !580, file: !539, line: 138, baseType: !583, size: 64, offset: 5568)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !580, file: !539, line: 139, baseType: !946, size: 64, offset: 5632)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!339, !573, !949, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !580, file: !539, line: 141, baseType: !831, size: 64, offset: 5696)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !580, file: !539, line: 142, baseType: !952, size: 64, offset: 5760)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!339, !573, !573, !435, !573}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !580, file: !539, line: 143, baseType: !956, size: 64, offset: 5824)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!339, !573, !573, !573}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !580, file: !539, line: 144, baseType: !831, size: 64, offset: 5888)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !580, file: !539, line: 145, baseType: !952, size: 64, offset: 5952)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !580, file: !539, line: 147, baseType: !956, size: 64, offset: 6016)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !580, file: !539, line: 148, baseType: !831, size: 64, offset: 6080)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !580, file: !539, line: 149, baseType: !952, size: 64, offset: 6144)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !580, file: !539, line: 150, baseType: !956, size: 64, offset: 6208)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !580, file: !539, line: 151, baseType: !966, size: 64, offset: 6272)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!339, !573, !493}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !580, file: !539, line: 153, baseType: !697, size: 64, offset: 6336)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !580, file: !539, line: 154, baseType: !697, size: 64, offset: 6400)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !580, file: !539, line: 155, baseType: !697, size: 64, offset: 6464)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !580, file: !539, line: 156, baseType: !697, size: 64, offset: 6528)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !580, file: !539, line: 157, baseType: !866, size: 64, offset: 6592)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !580, file: !539, line: 159, baseType: !975, size: 64, offset: 6656)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!339, !573, !381, !588}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !580, file: !539, line: 160, baseType: !697, size: 64, offset: 6720)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !580, file: !539, line: 161, baseType: !697, size: 64, offset: 6784)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !580, file: !539, line: 162, baseType: !697, size: 64, offset: 6848)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !580, file: !539, line: 163, baseType: !697, size: 64, offset: 6912)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !580, file: !539, line: 165, baseType: !956, size: 64, offset: 6976)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !580, file: !539, line: 166, baseType: !956, size: 64, offset: 7040)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !580, file: !539, line: 167, baseType: !760, size: 64, offset: 7104)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !580, file: !539, line: 168, baseType: !986, size: 64, offset: 7168)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!339, !573, !600, !381}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !580, file: !539, line: 169, baseType: !990, size: 64, offset: 7232)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!339, !573, !674, !426}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !580, file: !539, line: 171, baseType: !721, size: 64, offset: 7296)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !580, file: !539, line: 172, baseType: !697, size: 64, offset: 7360)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !580, file: !539, line: 173, baseType: !996, size: 64, offset: 7424)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!339, !573, !426, !784}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !580, file: !539, line: 174, baseType: !856, size: 64, offset: 7488)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !580, file: !539, line: 175, baseType: !856, size: 64, offset: 7552)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !580, file: !539, line: 177, baseType: !597, size: 64, offset: 7616)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !580, file: !539, line: 178, baseType: !646, size: 64, offset: 7680)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !580, file: !539, line: 179, baseType: !597, size: 64, offset: 7744)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !580, file: !539, line: 180, baseType: !604, size: 64, offset: 7808)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !580, file: !539, line: 181, baseType: !1006, size: 64, offset: 7872)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!339, !573, !317, !649, !650}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !580, file: !539, line: 183, baseType: !916, size: 64, offset: 7936)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !580, file: !539, line: 184, baseType: !681, size: 64, offset: 8000)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !580, file: !539, line: 185, baseType: !1012, size: 64, offset: 8064)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!339, !573, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !580, file: !539, line: 186, baseType: !1017, size: 64, offset: 8128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!339, !573, !381, !586, !443}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !580, file: !539, line: 187, baseType: !740, size: 64, offset: 8192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !580, file: !539, line: 189, baseType: !1022, size: 64, offset: 8256)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!339, !573, !381, !381, !426, !588}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !580, file: !539, line: 190, baseType: !831, size: 64, offset: 8320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !580, file: !539, line: 191, baseType: !952, size: 64, offset: 8384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !580, file: !539, line: 192, baseType: !956, size: 64, offset: 8448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !580, file: !539, line: 193, baseType: !1029, size: 64, offset: 8512)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!339, !573, !564, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !539, line: 660, size: 5312, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1034, file: !539, line: 661, baseType: !542, size: 4480)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1034, file: !539, line: 661, baseType: !798, size: 32, offset: 4480)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1034, file: !539, line: 662, baseType: !381, size: 32, offset: 4512)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1034, file: !539, line: 662, baseType: !381, size: 32, offset: 4544)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1034, file: !539, line: 662, baseType: !381, size: 32, offset: 4576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1034, file: !539, line: 663, baseType: !381, size: 32, offset: 4608)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1034, file: !539, line: 664, baseType: !381, size: 32, offset: 4640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1034, file: !539, line: 665, baseType: !426, size: 64, offset: 4672)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1034, file: !539, line: 666, baseType: !426, size: 64, offset: 4736)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1034, file: !539, line: 667, baseType: !381, size: 32, offset: 4800)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1034, file: !539, line: 668, baseType: !839, size: 32, offset: 4832)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1034, file: !539, line: 670, baseType: !426, size: 64, offset: 4864)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1034, file: !539, line: 670, baseType: !426, size: 64, offset: 4928)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1034, file: !539, line: 671, baseType: !426, size: 64, offset: 4992)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1034, file: !539, line: 672, baseType: !426, size: 64, offset: 5056)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1034, file: !539, line: 673, baseType: !426, size: 64, offset: 5120)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1034, file: !539, line: 674, baseType: !381, size: 32, offset: 5184)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1034, file: !539, line: 675, baseType: !426, size: 64, offset: 5248)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !580, file: !539, line: 195, baseType: !1055, size: 64, offset: 8576)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!339, !1032, !573, !573}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !580, file: !539, line: 196, baseType: !1055, size: 64, offset: 8640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !580, file: !539, line: 197, baseType: !831, size: 64, offset: 8704)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !580, file: !539, line: 198, baseType: !952, size: 64, offset: 8768)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !580, file: !539, line: 199, baseType: !956, size: 64, offset: 8832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !580, file: !539, line: 201, baseType: !1063, size: 64, offset: 8896)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!339, !573, !381, !381}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !580, file: !539, line: 202, baseType: !735, size: 64, offset: 8960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !580, file: !539, line: 203, baseType: !604, size: 64, offset: 9024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !580, file: !539, line: 204, baseType: !789, size: 64, offset: 9088)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !580, file: !539, line: 205, baseType: !916, size: 64, offset: 9152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !580, file: !539, line: 206, baseType: !1071, size: 64, offset: 9216)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!339, !317, !573, !381, !649, !650}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !580, file: !539, line: 208, baseType: !1075, size: 64, offset: 9280)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!339, !381, !745}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !580, file: !539, line: 209, baseType: !956, size: 64, offset: 9344)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !580, file: !539, line: 210, baseType: !752, size: 64, offset: 9408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !575, file: !539, line: 438, baseType: !1081, size: 64, offset: 13952)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !565, line: 60, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1083, file: !114, line: 241, baseType: !317, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !114, line: 242, baseType: !398, size: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1083, file: !114, line: 243, baseType: !381, size: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1083, file: !114, line: 243, baseType: !381, size: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1083, file: !114, line: 244, baseType: !381, size: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1083, file: !114, line: 244, baseType: !381, size: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1083, file: !114, line: 245, baseType: !426, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1083, file: !114, line: 246, baseType: !493, size: 32, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1083, file: !114, line: 247, baseType: !381, size: 32, offset: 352)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1083, file: !114, line: 251, baseType: !381, size: 32, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1083, file: !114, line: 252, baseType: !887, size: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1083, file: !114, line: 253, baseType: !493, size: 32, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1083, file: !114, line: 254, baseType: !381, size: 32, offset: 544)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1083, file: !114, line: 254, baseType: !381, size: 32, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1083, file: !114, line: 255, baseType: !381, size: 32, offset: 608)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !575, file: !539, line: 438, baseType: !1081, size: 64, offset: 14016)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !575, file: !539, line: 439, baseType: !316, size: 64, offset: 14080)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !575, file: !539, line: 440, baseType: !1103, size: 32, offset: 14144)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !575, file: !539, line: 441, baseType: !493, size: 32, offset: 14176)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !575, file: !539, line: 442, baseType: !493, size: 32, offset: 14208)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !575, file: !539, line: 443, baseType: !1107, size: 448, offset: 14272)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 448, elements: !1109)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !358)
!1109 = !{!1110}
!1110 = !DISubrange(count: 7)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !575, file: !539, line: 444, baseType: !493, size: 32, offset: 14720)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !575, file: !539, line: 445, baseType: !493, size: 32, offset: 14752)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !575, file: !539, line: 446, baseType: !381, size: 32, offset: 14784)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !575, file: !539, line: 447, baseType: !419, size: 64, offset: 14848)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !575, file: !539, line: 448, baseType: !419, size: 64, offset: 14912)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !575, file: !539, line: 449, baseType: !657, size: 640, offset: 14976)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !575, file: !539, line: 450, baseType: !590, size: 32, offset: 15616)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !575, file: !539, line: 451, baseType: !1119, size: 2880, offset: 15680)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !539, line: 318, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !539, line: 319, size: 2880, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1141, !1142, !1147, !1152, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1167, !1168, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1200, !1201, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1224, !1225, !1226, !1227, !1228}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1120, file: !539, line: 320, baseType: !381, size: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1120, file: !539, line: 321, baseType: !381, size: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1120, file: !539, line: 322, baseType: !381, size: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1120, file: !539, line: 323, baseType: !381, size: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1120, file: !539, line: 324, baseType: !381, size: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1120, file: !539, line: 325, baseType: !381, size: 32, offset: 160)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1120, file: !539, line: 326, baseType: !1129, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !539, line: 293, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !539, line: 295, size: 448, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !539, line: 296, baseType: !1129, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1131, file: !539, line: 297, baseType: !443, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1131, file: !539, line: 297, baseType: !443, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1131, file: !539, line: 298, baseType: !426, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1131, file: !539, line: 298, baseType: !426, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1131, file: !539, line: 299, baseType: !381, size: 32, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1131, file: !539, line: 300, baseType: !381, size: 32, offset: 352)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1131, file: !539, line: 301, baseType: !381, size: 32, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1120, file: !539, line: 326, baseType: !1129, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1120, file: !539, line: 328, baseType: !1143, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!339, !573, !1146, !426}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1120, file: !539, line: 329, baseType: !1148, size: 64, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!339, !1146, !1151, !428, !428, !446, !426}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1120, file: !539, line: 330, baseType: !1153, size: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!339, !1146}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1120, file: !539, line: 331, baseType: !1153, size: 64, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1120, file: !539, line: 334, baseType: !317, size: 64, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !539, line: 335, baseType: !398, size: 32, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1120, file: !539, line: 335, baseType: !398, size: 32, offset: 672)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1120, file: !539, line: 336, baseType: !398, size: 32, offset: 704)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1120, file: !539, line: 336, baseType: !398, size: 32, offset: 736)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1120, file: !539, line: 337, baseType: !1163, size: 64, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !313, line: 339, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !313, line: 339, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1120, file: !539, line: 338, baseType: !1163, size: 64, offset: 832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1120, file: !539, line: 339, baseType: !1169, size: 64, offset: 896)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !313, line: 341, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !313, line: 351, size: 192, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1171, file: !313, line: 354, baseType: !72, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1171, file: !313, line: 355, baseType: !72, size: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1171, file: !313, line: 356, baseType: !72, size: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1171, file: !313, line: 361, baseType: !72, size: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1171, file: !313, line: 362, baseType: !320, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1120, file: !539, line: 340, baseType: !381, size: 32, offset: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1120, file: !539, line: 340, baseType: !381, size: 32, offset: 992)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1120, file: !539, line: 341, baseType: !443, size: 64, offset: 1024)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1120, file: !539, line: 342, baseType: !426, size: 64, offset: 1088)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1120, file: !539, line: 343, baseType: !446, size: 64, offset: 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1120, file: !539, line: 344, baseType: !428, size: 64, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1120, file: !539, line: 345, baseType: !381, size: 32, offset: 1280)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1120, file: !539, line: 346, baseType: !1151, size: 64, offset: 1344)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1120, file: !539, line: 347, baseType: !493, size: 32, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1120, file: !539, line: 348, baseType: !381, size: 32, offset: 1440)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1120, file: !539, line: 351, baseType: !493, size: 32, offset: 1472)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1120, file: !539, line: 352, baseType: !493, size: 32, offset: 1504)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1120, file: !539, line: 353, baseType: !398, size: 32, offset: 1536)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1120, file: !539, line: 354, baseType: !398, size: 32, offset: 1568)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1120, file: !539, line: 355, baseType: !1151, size: 64, offset: 1600)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1120, file: !539, line: 356, baseType: !1151, size: 64, offset: 1664)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1120, file: !539, line: 357, baseType: !1195, size: 64, offset: 1728)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !539, line: 310, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 308, size: 32, elements: !1198)
!1198 = !{!1199}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1197, file: !539, line: 309, baseType: !381, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1120, file: !539, line: 357, baseType: !1195, size: 64, offset: 1792)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1120, file: !539, line: 358, baseType: !1202, size: 64, offset: 1856)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !539, line: 316, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 312, size: 128, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1204, file: !539, line: 313, baseType: !316, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1204, file: !539, line: 314, baseType: !381, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1204, file: !539, line: 315, baseType: !360, size: 8, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1120, file: !539, line: 359, baseType: !1202, size: 64, offset: 1920)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1120, file: !539, line: 360, baseType: !1202, size: 64, offset: 1984)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1120, file: !539, line: 361, baseType: !381, size: 32, offset: 2048)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1120, file: !539, line: 362, baseType: !398, size: 32, offset: 2080)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1120, file: !539, line: 363, baseType: !381, size: 32, offset: 2112)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1120, file: !539, line: 364, baseType: !1151, size: 64, offset: 2176)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1120, file: !539, line: 365, baseType: !1169, size: 64, offset: 2240)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1120, file: !539, line: 366, baseType: !398, size: 32, offset: 2304)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1120, file: !539, line: 367, baseType: !398, size: 32, offset: 2336)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1120, file: !539, line: 368, baseType: !1163, size: 64, offset: 2368)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1120, file: !539, line: 369, baseType: !1163, size: 64, offset: 2432)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1120, file: !539, line: 370, baseType: !1221, size: 64, offset: 2496)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1120, file: !539, line: 371, baseType: !1221, size: 64, offset: 2560)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1120, file: !539, line: 372, baseType: !1221, size: 64, offset: 2624)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1120, file: !539, line: 373, baseType: !312, size: 64, offset: 2688)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1120, file: !539, line: 374, baseType: !320, size: 64, offset: 2752)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1120, file: !539, line: 375, baseType: !1229, size: 64, offset: 2816)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !575, file: !539, line: 451, baseType: !1119, size: 2880, offset: 18560)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !575, file: !539, line: 452, baseType: !1232, size: 64, offset: 21440)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !539, line: 681, size: 4864, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1234, file: !539, line: 682, baseType: !542, size: 4480)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1234, file: !539, line: 682, baseType: !798, size: 32, offset: 4480)
