; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/lu/lu.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/lu/lu.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 161, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63}
!56 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1189, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 612, baseType: !5, size: 32, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "MAT_LOCAL", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MAT_GLOBAL_MAX", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "MAT_GLOBAL_SUM", value: 3, isUnsigned: true)
!88 = !{!89, !122, !142, !145, !163, !239, !343, !108, !344, !346}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_LU", file: !91, line: 14, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/lu/lu.h", directory: "/home/users/ndemeye/xSDK")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 9, size: 1408, elements: !93)
!93 = !{!94, !134, !139, !140, !141}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !92, file: !91, line: 10, baseType: !95, size: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Factor", file: !96, line: 19, baseType: !97)
!96 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/factor.h", directory: "/home/users/ndemeye/xSDK")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 9, size: 1152, elements: !98)
!98 = !{!99, !103, !120, !125, !127, !129, !130, !132, !133}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fact", scope: !97, file: !96, line: 10, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !97, file: !96, line: 11, baseType: !104, size: 704, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !39, line: 1239, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 1226, size: 704, elements: !106)
!106 = !{!107, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !105, file: !39, line: 1227, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !109)
!109 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !105, file: !39, line: 1228, baseType: !108, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !105, file: !39, line: 1229, baseType: !108, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !105, file: !39, line: 1230, baseType: !108, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !105, file: !39, line: 1231, baseType: !108, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !105, file: !39, line: 1232, baseType: !108, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !105, file: !39, line: 1233, baseType: !108, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !105, file: !39, line: 1234, baseType: !108, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !105, file: !39, line: 1236, baseType: !108, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !105, file: !39, line: 1237, baseType: !108, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !105, file: !39, line: 1238, baseType: !108, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !97, file: !96, line: 12, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !39, line: 1159, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !97, file: !96, line: 13, baseType: !126, size: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !97, file: !96, line: 14, baseType: !128, size: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !39, line: 161, baseType: !54)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "actualfill", scope: !97, file: !96, line: 15, baseType: !108, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "inplace", scope: !97, file: !96, line: 16, baseType: !131, size: 32, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reuseordering", scope: !97, file: !96, line: 17, baseType: !131, size: 32, offset: 1056)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reusefill", scope: !97, file: !96, line: 18, baseType: !131, size: 32, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !92, file: !91, line: 11, baseType: !135, size: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !136, line: 11, baseType: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !136, line: 11, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !92, file: !91, line: 11, baseType: !135, size: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerosalongdiagonal", scope: !92, file: !91, line: 12, baseType: !131, size: 32, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerosalongdiagonaltol", scope: !92, file: !91, line: 13, baseType: !108, size: 64, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 46, baseType: !144)
!143 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!144 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !148, line: 73, size: 4480, elements: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!149 = !{!150, !152, !202, !203, !205, !207, !208, !209, !210, !218, !219, !221, !225, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !242, !243, !244, !246, !247, !249, !251, !252, !253, !254, !255, !257, !259, !260, !261, !262, !263, !266, !268, !269, !270, !280, !282, !283, !287, !288, !333, !338, !340, !341, !342}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !147, file: !148, line: 74, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !147, file: !148, line: 75, baseType: !153, size: 448, offset: 64)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 448, elements: !200)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !148, line: 53, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 45, size: 448, elements: !156)
!156 = !{!157, !167, !175, !180, !184, !188, !195}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !155, file: !148, line: 46, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !145, !162}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !164, line: 330, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !164, line: 330, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !155, file: !148, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!161, !145, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !155, file: !148, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!161, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !155, file: !148, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!161, !145, !122, !145}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !155, file: !148, line: 50, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!161, !145, !122, !179}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !155, file: !148, line: 51, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!161, !145, !122, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !155, file: !148, line: 52, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!161, !145, !122, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !147, file: !148, line: 76, baseType: !163, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 77, baseType: !204, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !147, file: !148, line: 78, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !109)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !147, file: !148, line: 78, baseType: !206, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !147, file: !148, line: 78, baseType: !206, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !147, file: !148, line: 78, baseType: !206, size: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !148, line: 79, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !214, line: 27, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !216, line: 43, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !147, file: !148, line: 80, baseType: !204, size: 32, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !148, line: 81, baseType: !220, size: 32, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !147, file: !148, line: 82, baseType: !222, size: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !147, file: !148, line: 83, baseType: !226, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !148, line: 84, baseType: !126, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !147, file: !148, line: 85, baseType: !126, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !147, file: !148, line: 86, baseType: !126, size: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !147, file: !148, line: 87, baseType: !126, size: 64, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 88, baseType: !145, size: 64, offset: 1408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !147, file: !148, line: 89, baseType: !211, size: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 90, baseType: !126, size: 64, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !147, file: !148, line: 91, baseType: !126, size: 64, offset: 1600)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !147, file: !148, line: 92, baseType: !204, size: 32, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !147, file: !148, line: 93, baseType: !239, size: 64, offset: 1728)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 94, baseType: !241, size: 64, offset: 1792)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !212)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !147, file: !148, line: 95, baseType: !204, size: 32, offset: 1856)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !147, file: !148, line: 95, baseType: !204, size: 32, offset: 1888)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !147, file: !148, line: 96, baseType: !245, size: 64, offset: 1920)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !147, file: !148, line: 96, baseType: !245, size: 64, offset: 1984)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !147, file: !148, line: 97, baseType: !248, size: 64, offset: 2048)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !147, file: !148, line: 97, baseType: !250, size: 64, offset: 2112)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !147, file: !148, line: 98, baseType: !204, size: 32, offset: 2176)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !147, file: !148, line: 98, baseType: !204, size: 32, offset: 2208)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !147, file: !148, line: 99, baseType: !245, size: 64, offset: 2240)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !147, file: !148, line: 99, baseType: !245, size: 64, offset: 2304)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !147, file: !148, line: 100, baseType: !256, size: 64, offset: 2368)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !147, file: !148, line: 100, baseType: !258, size: 64, offset: 2432)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !147, file: !148, line: 101, baseType: !204, size: 32, offset: 2496)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !147, file: !148, line: 101, baseType: !204, size: 32, offset: 2528)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !147, file: !148, line: 102, baseType: !245, size: 64, offset: 2560)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !147, file: !148, line: 102, baseType: !245, size: 64, offset: 2624)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !147, file: !148, line: 103, baseType: !264, size: 64, offset: 2688)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !108)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !147, file: !148, line: 103, baseType: !267, size: 64, offset: 2752)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !147, file: !148, line: 104, baseType: !199, size: 64, offset: 2816)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !147, file: !148, line: 105, baseType: !204, size: 32, offset: 2880)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !147, file: !148, line: 106, baseType: !271, size: 128, offset: 2944)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !278)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !148, line: 64, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 61, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !274, file: !148, line: 62, baseType: !192, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !274, file: !148, line: 63, baseType: !239, size: 64, offset: 64)
!278 = !{!279}
!279 = !DISubrange(count: 2)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !147, file: !148, line: 107, baseType: !281, size: 64, offset: 3072)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !147, file: !148, line: 108, baseType: !239, size: 64, offset: 3136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !147, file: !148, line: 109, baseType: !284, size: 64, offset: 3200)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!161, !239}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !147, file: !148, line: 111, baseType: !204, size: 32, offset: 3264)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !147, file: !148, line: 112, baseType: !289, size: 320, offset: 3328)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 320, elements: !331)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!161, !293, !145, !239}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !296)
!296 = !{!297, !298, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !295, file: !10, line: 100, baseType: !204, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !10, line: 101, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !310, !311, !312, !313, !314, !316, !317, !318}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !301, file: !10, line: 84, baseType: !126, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !301, file: !10, line: 85, baseType: !126, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !10, line: 86, baseType: !239, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !301, file: !10, line: 87, baseType: !222, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !301, file: !10, line: 88, baseType: !308, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !301, file: !10, line: 89, baseType: !124, size: 8, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !301, file: !10, line: 90, baseType: !126, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !301, file: !10, line: 91, baseType: !142, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !301, file: !10, line: 92, baseType: !131, size: 32, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !10, line: 93, baseType: !315, size: 32, offset: 544)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !10, line: 94, baseType: !299, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !301, file: !10, line: 95, baseType: !126, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !301, file: !10, line: 96, baseType: !239, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !295, file: !10, line: 102, baseType: !126, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !295, file: !10, line: 102, baseType: !126, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !295, file: !10, line: 103, baseType: !126, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !295, file: !10, line: 104, baseType: !163, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !295, file: !10, line: 105, baseType: !131, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !295, file: !10, line: 105, baseType: !131, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !295, file: !10, line: 105, baseType: !131, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !295, file: !10, line: 106, baseType: !145, size: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !295, file: !10, line: 107, baseType: !328, size: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!331 = !{!332}
!332 = !DISubrange(count: 5)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !147, file: !148, line: 113, baseType: !334, size: 320, offset: 3648)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !331)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!161, !145, !239}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !147, file: !148, line: 114, baseType: !339, size: 320, offset: 3968)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 320, elements: !331)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !147, file: !148, line: 115, baseType: !131, size: 32, offset: 4288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !147, file: !148, line: 120, baseType: !328, size: 64, offset: 4352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !147, file: !148, line: 121, baseType: !131, size: 32, offset: 4416)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !345, line: 1451, baseType: !192)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!347 = !{i32 7, !"Dwarf Version", i32 4}
!348 = !{i32 2, !"Debug Info Version", i32 3}
!349 = !{i32 1, !"wchar_size", i32 4}
!350 = !{i32 7, !"PIC Level", i32 2}
!351 = !{i32 7, !"uwtable", i32 1}
!352 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!353 = distinct !DISubprogram(name: "PCFactorReorderForNonzeroDiagonal_LU", scope: !354, file: !354, line: 10, type: !355, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !459)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/lu/lu.c", directory: "/home/users/ndemeye/xSDK")
!355 = !DISubroutineType(types: !356)
!356 = !{!161, !357, !108}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !360, line: 37, size: 6720, elements: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!361 = !{!362, !364, !428, !433, !434, !435, !436, !437, !439, !440, !441, !442, !443, !444, !445, !446, !447, !453, !454, !455, !456, !457, !458}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !359, file: !360, line: 38, baseType: !363, size: 4480)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !148, line: 122, baseType: !147)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !359, file: !360, line: 38, baseType: !365, size: 1152, offset: 4480)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1152, elements: !200)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !360, line: 13, size: 1152, elements: !367)
!367 = !{!368, !372, !380, !384, !390, !395, !396, !400, !404, !412, !413, !418, !419, !420, !421, !422, !426, !427}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !366, file: !360, line: 14, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!161, !357}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !366, file: !360, line: 15, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!161, !357, !376, !376}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !377, line: 21, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !377, line: 21, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !366, file: !360, line: 16, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!161, !357, !100, !100}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !366, file: !360, line: 17, baseType: !385, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!161, !357, !376, !376, !376, !108, !108, !108, !204, !131, !248, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !366, file: !360, line: 18, baseType: !391, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!161, !357, !394, !376, !376, !376}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !366, file: !360, line: 19, baseType: !373, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !366, file: !360, line: 20, baseType: !397, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!161, !357, !204, !376, !376, !376}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !366, file: !360, line: 21, baseType: !401, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!161, !293, !357}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !366, file: !360, line: 22, baseType: !405, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!161, !357, !408, !376, !376}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !409, line: 22, baseType: !410)
!409 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !409, line: 22, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !366, file: !360, line: 23, baseType: !405, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !366, file: !360, line: 24, baseType: !414, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!161, !357, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !366, file: !360, line: 25, baseType: !373, size: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !366, file: !360, line: 26, baseType: !373, size: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !366, file: !360, line: 27, baseType: !369, size: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !366, file: !360, line: 28, baseType: !369, size: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !366, file: !360, line: 29, baseType: !423, size: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!161, !357, !171}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !366, file: !360, line: 30, baseType: !369, size: 64, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !366, file: !360, line: 31, baseType: !423, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !359, file: !360, line: 39, baseType: !429, size: 64, offset: 5632)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !430, line: 14, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !430, line: 14, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !359, file: !360, line: 40, baseType: !204, size: 32, offset: 5696)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !359, file: !360, line: 41, baseType: !241, size: 64, offset: 5760)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !359, file: !360, line: 41, baseType: !241, size: 64, offset: 5824)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !359, file: !360, line: 42, baseType: !131, size: 32, offset: 5888)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !359, file: !360, line: 43, baseType: !438, size: 32, offset: 5920)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !359, file: !360, line: 45, baseType: !204, size: 32, offset: 5952)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !359, file: !360, line: 46, baseType: !131, size: 32, offset: 5984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !359, file: !360, line: 47, baseType: !100, size: 64, offset: 6016)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !359, file: !360, line: 47, baseType: !100, size: 64, offset: 6080)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !359, file: !360, line: 48, baseType: !376, size: 64, offset: 6144)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !359, file: !360, line: 48, baseType: !376, size: 64, offset: 6208)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !359, file: !360, line: 49, baseType: !131, size: 32, offset: 6272)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !359, file: !360, line: 50, baseType: !131, size: 32, offset: 6304)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !359, file: !360, line: 51, baseType: !448, size: 64, offset: 6336)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!161, !357, !204, !451, !451, !417, !239}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !359, file: !360, line: 52, baseType: !239, size: 64, offset: 6400)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !360, line: 53, baseType: !239, size: 64, offset: 6464)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !359, file: !360, line: 54, baseType: !204, size: 32, offset: 6528)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !359, file: !360, line: 55, baseType: !239, size: 64, offset: 6592)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !359, file: !360, line: 56, baseType: !346, size: 32, offset: 6656)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !359, file: !360, line: 57, baseType: !346, size: 32, offset: 6688)
!459 = !{!460, !461, !462}
!460 = !DILocalVariable(name: "pc", arg: 1, scope: !353, file: !354, line: 10, type: !357)
!461 = !DILocalVariable(name: "z", arg: 2, scope: !353, file: !354, line: 10, type: !108)
!462 = !DILocalVariable(name: "lu", scope: !353, file: !354, line: 12, type: !89)
!463 = !DILocation(line: 0, scope: !353)
!464 = !DILocation(line: 12, column: 27, scope: !353)
!465 = !{!466, !471, i64 808}
!466 = !{!"_p_PC", !467, i64 0, !469, i64 560, !471, i64 704, !468, i64 712, !473, i64 720, !473, i64 728, !469, i64 736, !469, i64 740, !468, i64 744, !469, i64 748, !471, i64 752, !471, i64 760, !471, i64 768, !471, i64 776, !469, i64 784, !469, i64 788, !471, i64 792, !471, i64 800, !471, i64 808, !468, i64 816, !471, i64 824, !469, i64 832, !469, i64 836}
!467 = !{!"_p_PetscObject", !468, i64 0, !469, i64 8, !471, i64 64, !468, i64 72, !472, i64 80, !472, i64 88, !472, i64 96, !472, i64 104, !473, i64 112, !468, i64 120, !468, i64 124, !471, i64 128, !471, i64 136, !471, i64 144, !471, i64 152, !471, i64 160, !471, i64 168, !471, i64 176, !473, i64 184, !471, i64 192, !471, i64 200, !468, i64 208, !471, i64 216, !473, i64 224, !468, i64 232, !468, i64 236, !471, i64 240, !471, i64 248, !471, i64 256, !471, i64 264, !468, i64 272, !468, i64 276, !471, i64 280, !471, i64 288, !471, i64 296, !471, i64 304, !468, i64 312, !468, i64 316, !471, i64 320, !471, i64 328, !471, i64 336, !471, i64 344, !471, i64 352, !468, i64 360, !469, i64 368, !469, i64 384, !471, i64 392, !471, i64 400, !468, i64 408, !469, i64 416, !469, i64 456, !469, i64 496, !469, i64 536, !471, i64 544, !469, i64 552}
!468 = !{!"int", !469, i64 0}
!469 = !{!"omnipotent char", !470, i64 0}
!470 = !{!"Simple C/C++ TBAA"}
!471 = !{!"any pointer", !469, i64 0}
!472 = !{!"double", !469, i64 0}
!473 = !{!"long", !469, i64 0}
!474 = !DILocation(line: 14, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !354, line: 14, column: 3)
!476 = distinct !DILexicalBlock(scope: !477, file: !354, line: 14, column: 3)
!477 = distinct !DILexicalBlock(scope: !353, file: !354, line: 14, column: 3)
!478 = !{!471, !471, i64 0}
!479 = !DILocation(line: 14, column: 3, scope: !476)
!480 = !DILocation(line: 14, column: 3, scope: !481)
!481 = distinct !DILexicalBlock(scope: !482, file: !354, line: 14, column: 3)
!482 = distinct !DILexicalBlock(scope: !475, file: !354, line: 14, column: 3)
!483 = !{!484, !468, i64 1536}
!484 = !{!"", !469, i64 0, !469, i64 512, !469, i64 1024, !469, i64 1280, !468, i64 1536, !468, i64 1540, !469, i64 1544}
!485 = !DILocation(line: 14, column: 3, scope: !482)
!486 = !DILocation(line: 14, column: 3, scope: !487)
!487 = distinct !DILexicalBlock(scope: !481, file: !354, line: 14, column: 3)
!488 = !{!468, !468, i64 0}
!489 = !{!484, !468, i64 1540}
!490 = !DILocation(line: 15, column: 7, scope: !353)
!491 = !DILocation(line: 15, column: 29, scope: !353)
!492 = !{!493, !469, i64 160}
!493 = !{!"", !494, i64 0, !471, i64 144, !471, i64 152, !469, i64 160, !472, i64 168}
!494 = !{!"", !471, i64 0, !495, i64 8, !471, i64 96, !471, i64 104, !469, i64 112, !472, i64 120, !469, i64 128, !469, i64 132, !469, i64 136}
!495 = !{!"", !472, i64 0, !472, i64 8, !472, i64 16, !472, i64 24, !472, i64 32, !472, i64 40, !472, i64 48, !472, i64 56, !472, i64 64, !472, i64 72, !472, i64 80}
!496 = !DILocation(line: 16, column: 9, scope: !497)
!497 = distinct !DILexicalBlock(scope: !353, file: !354, line: 16, column: 7)
!498 = !DILocation(line: 16, column: 7, scope: !353)
!499 = !DILocation(line: 16, column: 30, scope: !497)
!500 = !DILocation(line: 16, column: 55, scope: !497)
!501 = !DILocation(line: 18, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !354, line: 18, column: 3)
!503 = distinct !DILexicalBlock(scope: !504, file: !354, line: 18, column: 3)
!504 = distinct !DILexicalBlock(scope: !353, file: !354, line: 18, column: 3)
!505 = !DILocation(line: 18, column: 3, scope: !503)
!506 = !DILocation(line: 18, column: 3, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !354, line: 18, column: 3)
!508 = distinct !DILexicalBlock(scope: !502, file: !354, line: 18, column: 3)
!509 = !DILocation(line: 18, column: 3, scope: !508)
!510 = !DILocation(line: 18, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !354, line: 18, column: 3)
!512 = distinct !DILexicalBlock(scope: !507, file: !354, line: 18, column: 3)
!513 = !{!484, !469, i64 1544}
!514 = !DILocation(line: 18, column: 3, scope: !512)
!515 = !DILocation(line: 18, column: 3, scope: !516)
!516 = distinct !DILexicalBlock(scope: !511, file: !354, line: 18, column: 3)
!517 = !DILocation(line: 18, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !507, file: !354, line: 18, column: 3)
!519 = !DILocation(line: 18, column: 3, scope: !520)
!520 = distinct !DILexicalBlock(scope: !518, file: !354, line: 18, column: 3)
!521 = !DILocation(line: 18, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !354, line: 18, column: 3)
!523 = distinct !DILexicalBlock(scope: !520, file: !354, line: 18, column: 3)
!524 = !DILocation(line: 18, column: 3, scope: !523)
!525 = !DILocation(line: 18, column: 3, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !354, line: 18, column: 3)
!527 = !DILocation(line: 19, column: 1, scope: !353)
!528 = distinct !DISubprogram(name: "PCCreate_LU", scope: !354, file: !354, line: 255, type: !370, scopeLine: 256, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !529)
!529 = !{!530, !531, !532, !533, !535, !537}
!530 = !DILocalVariable(name: "pc", arg: 1, scope: !528, file: !354, line: 255, type: !357)
!531 = !DILocalVariable(name: "ierr", scope: !528, file: !354, line: 257, type: !161)
!532 = !DILocalVariable(name: "dir", scope: !528, file: !354, line: 258, type: !89)
!533 = !DILocalVariable(name: "ierr__", scope: !534, file: !354, line: 261, type: !161)
!534 = distinct !DILexicalBlock(scope: !528, file: !354, line: 261, column: 35)
!535 = !DILocalVariable(name: "ierr__", scope: !536, file: !354, line: 263, type: !161)
!536 = distinct !DILexicalBlock(scope: !528, file: !354, line: 263, column: 51)
!537 = !DILocalVariable(name: "ierr__", scope: !538, file: !354, line: 281, type: !161)
!538 = distinct !DILexicalBlock(scope: !528, file: !354, line: 281, column: 129)
!539 = !DILocation(line: 0, scope: !528)
!540 = !DILocation(line: 258, column: 3, scope: !528)
!541 = !DILocation(line: 260, column: 3, scope: !542)
!542 = distinct !DILexicalBlock(scope: !543, file: !354, line: 260, column: 3)
!543 = distinct !DILexicalBlock(scope: !544, file: !354, line: 260, column: 3)
!544 = distinct !DILexicalBlock(scope: !528, file: !354, line: 260, column: 3)
!545 = !DILocation(line: 260, column: 3, scope: !543)
!546 = !DILocation(line: 260, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !354, line: 260, column: 3)
!548 = distinct !DILexicalBlock(scope: !542, file: !354, line: 260, column: 3)
!549 = !DILocation(line: 260, column: 3, scope: !548)
!550 = !DILocation(line: 260, column: 3, scope: !551)
!551 = distinct !DILexicalBlock(scope: !547, file: !354, line: 260, column: 3)
!552 = !DILocation(line: 261, column: 14, scope: !528)
!553 = !{!"branch_weights", i32 2146410443, i32 1073205}
!554 = !DILocation(line: 0, scope: !534)
!555 = !DILocation(line: 261, column: 35, scope: !534)
!556 = !{!"branch_weights", i32 2000, i32 1}
!557 = !DILocation(line: 261, column: 35, scope: !558)
!558 = distinct !DILexicalBlock(scope: !534, file: !354, line: 261, column: 35)
!559 = !DILocation(line: 262, column: 21, scope: !528)
!560 = !DILocation(line: 262, column: 7, scope: !528)
!561 = !DILocation(line: 262, column: 12, scope: !528)
!562 = !DILocation(line: 263, column: 14, scope: !528)
!563 = !DILocation(line: 0, scope: !536)
!564 = !DILocation(line: 263, column: 51, scope: !565)
!565 = distinct !DILexicalBlock(scope: !536, file: !354, line: 263, column: 51)
!566 = !DILocation(line: 263, column: 51, scope: !536)
!567 = !DILocation(line: 264, column: 3, scope: !528)
!568 = !DILocation(line: 264, column: 8, scope: !528)
!569 = !DILocation(line: 264, column: 33, scope: !528)
!570 = !DILocation(line: 266, column: 27, scope: !528)
!571 = !DILocation(line: 266, column: 41, scope: !528)
!572 = !{!494, !472, i64 48}
!573 = !DILocation(line: 267, column: 27, scope: !528)
!574 = !DILocation(line: 267, column: 41, scope: !528)
!575 = !{!494, !472, i64 32}
!576 = !DILocation(line: 268, column: 16, scope: !528)
!577 = !DILocation(line: 268, column: 27, scope: !528)
!578 = !DILocation(line: 268, column: 41, scope: !528)
!579 = !{!494, !472, i64 80}
!580 = !DILocation(line: 270, column: 8, scope: !528)
!581 = !DILocation(line: 272, column: 12, scope: !528)
!582 = !DILocation(line: 272, column: 30, scope: !528)
!583 = !DILocation(line: 270, column: 41, scope: !528)
!584 = !{!585, !471, i64 128}
!585 = !{!"_PCOps", !471, i64 0, !471, i64 8, !471, i64 16, !471, i64 24, !471, i64 32, !471, i64 40, !471, i64 48, !471, i64 56, !471, i64 64, !471, i64 72, !471, i64 80, !471, i64 88, !471, i64 96, !471, i64 104, !471, i64 112, !471, i64 120, !471, i64 128, !471, i64 136}
!586 = !DILocation(line: 273, column: 12, scope: !528)
!587 = !DILocation(line: 273, column: 30, scope: !528)
!588 = !{!585, !471, i64 112}
!589 = !DILocation(line: 274, column: 12, scope: !528)
!590 = !DILocation(line: 274, column: 30, scope: !528)
!591 = !{!585, !471, i64 8}
!592 = !DILocation(line: 275, column: 12, scope: !528)
!593 = !DILocation(line: 275, column: 30, scope: !528)
!594 = !{!585, !471, i64 16}
!595 = !DILocation(line: 276, column: 12, scope: !528)
!596 = !DILocation(line: 276, column: 30, scope: !528)
!597 = !{!585, !471, i64 40}
!598 = !DILocation(line: 277, column: 12, scope: !528)
!599 = !DILocation(line: 277, column: 30, scope: !528)
!600 = !{!585, !471, i64 0}
!601 = !DILocation(line: 278, column: 12, scope: !528)
!602 = !DILocation(line: 278, column: 30, scope: !528)
!603 = !{!585, !471, i64 56}
!604 = !DILocation(line: 279, column: 12, scope: !528)
!605 = !DILocation(line: 279, column: 30, scope: !528)
!606 = !{!585, !471, i64 120}
!607 = !DILocation(line: 280, column: 12, scope: !528)
!608 = !DILocation(line: 280, column: 30, scope: !528)
!609 = !{!585, !471, i64 24}
!610 = !DILocation(line: 281, column: 10, scope: !528)
!611 = !DILocation(line: 0, scope: !538)
!612 = !DILocation(line: 281, column: 129, scope: !613)
!613 = distinct !DILexicalBlock(scope: !538, file: !354, line: 281, column: 129)
!614 = !DILocation(line: 281, column: 129, scope: !538)
!615 = !DILocation(line: 282, column: 3, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !354, line: 282, column: 3)
!617 = distinct !DILexicalBlock(scope: !618, file: !354, line: 282, column: 3)
!618 = distinct !DILexicalBlock(scope: !528, file: !354, line: 282, column: 3)
!619 = !DILocation(line: 282, column: 3, scope: !617)
!620 = !DILocation(line: 282, column: 3, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !354, line: 282, column: 3)
!622 = distinct !DILexicalBlock(scope: !616, file: !354, line: 282, column: 3)
!623 = !DILocation(line: 282, column: 3, scope: !622)
!624 = !DILocation(line: 282, column: 3, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !354, line: 282, column: 3)
!626 = distinct !DILexicalBlock(scope: !621, file: !354, line: 282, column: 3)
!627 = !DILocation(line: 282, column: 3, scope: !626)
!628 = !DILocation(line: 282, column: 3, scope: !629)
!629 = distinct !DILexicalBlock(scope: !625, file: !354, line: 282, column: 3)
!630 = !DILocation(line: 282, column: 3, scope: !631)
!631 = distinct !DILexicalBlock(scope: !621, file: !354, line: 282, column: 3)
!632 = !DILocation(line: 282, column: 3, scope: !633)
!633 = distinct !DILexicalBlock(scope: !631, file: !354, line: 282, column: 3)
!634 = !DILocation(line: 282, column: 3, scope: !635)
!635 = distinct !DILexicalBlock(scope: !636, file: !354, line: 282, column: 3)
!636 = distinct !DILexicalBlock(scope: !633, file: !354, line: 282, column: 3)
!637 = !DILocation(line: 282, column: 3, scope: !636)
!638 = !DILocation(line: 282, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !635, file: !354, line: 282, column: 3)
!640 = !DILocation(line: 283, column: 1, scope: !528)
!641 = !DISubprogram(name: "PetscMallocA", scope: !345, file: !345, line: 1288, type: !642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{!161, !26, !3, !26, !122, !122, !144, !239, null}
!644 = !{}
!645 = !DISubprogram(name: "PetscLogObjectMemory", scope: !646, file: !646, line: 228, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !644)
!646 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!647 = !DISubroutineType(types: !648)
!648 = !{!26, !146, !109}
!649 = !DISubprogram(name: "PetscError", scope: !65, file: !65, line: 668, type: !650, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !644)
!650 = !DISubroutineType(types: !651)
!651 = !{!161, !165, !26, !122, !122, !26, !64, !122, null}
!652 = !DISubprogram(name: "PCFactorInitialize", scope: !96, file: !96, line: 21, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !644)
!653 = !DISubroutineType(types: !654)
!654 = !{!26, !358, !54}
!655 = distinct !DISubprogram(name: "PCReset_LU", scope: !354, file: !354, line: 150, type: !370, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !656)
!656 = !{!657, !658, !659, !660, !664, !668}
!657 = !DILocalVariable(name: "pc", arg: 1, scope: !655, file: !354, line: 150, type: !357)
!658 = !DILocalVariable(name: "dir", scope: !655, file: !354, line: 152, type: !89)
!659 = !DILocalVariable(name: "ierr", scope: !655, file: !354, line: 153, type: !161)
!660 = !DILocalVariable(name: "ierr__", scope: !661, file: !354, line: 156, type: !161)
!661 = distinct !DILexicalBlock(scope: !662, file: !354, line: 156, column: 98)
!662 = distinct !DILexicalBlock(scope: !663, file: !354, line: 156, column: 53)
!663 = distinct !DILexicalBlock(scope: !655, file: !354, line: 156, column: 7)
!664 = !DILocalVariable(name: "ierr__", scope: !665, file: !354, line: 157, type: !161)
!665 = distinct !DILexicalBlock(scope: !666, file: !354, line: 157, column: 82)
!666 = distinct !DILexicalBlock(scope: !667, file: !354, line: 157, column: 53)
!667 = distinct !DILexicalBlock(scope: !655, file: !354, line: 157, column: 7)
!668 = !DILocalVariable(name: "ierr__", scope: !669, file: !354, line: 158, type: !161)
!669 = distinct !DILexicalBlock(scope: !655, file: !354, line: 158, column: 31)
!670 = !DILocation(line: 0, scope: !655)
!671 = !DILocation(line: 152, column: 37, scope: !655)
!672 = !DILocation(line: 155, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !354, line: 155, column: 3)
!674 = distinct !DILexicalBlock(scope: !675, file: !354, line: 155, column: 3)
!675 = distinct !DILexicalBlock(scope: !655, file: !354, line: 155, column: 3)
!676 = !DILocation(line: 155, column: 3, scope: !674)
!677 = !DILocation(line: 155, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !354, line: 155, column: 3)
!679 = distinct !DILexicalBlock(scope: !673, file: !354, line: 155, column: 3)
!680 = !DILocation(line: 155, column: 3, scope: !679)
!681 = !DILocation(line: 155, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !678, file: !354, line: 155, column: 3)
!683 = !DILocation(line: 156, column: 17, scope: !663)
!684 = !{!493, !469, i64 128}
!685 = !DILocation(line: 156, column: 8, scope: !663)
!686 = !DILocation(line: 156, column: 25, scope: !663)
!687 = !DILocation(line: 156, column: 47, scope: !663)
!688 = !{!494, !471, i64 0}
!689 = !DILocation(line: 156, column: 28, scope: !663)
!690 = !DILocation(line: 156, column: 7, scope: !655)
!691 = !DILocation(line: 156, column: 61, scope: !662)
!692 = !DILocation(line: 0, scope: !661)
!693 = !DILocation(line: 156, column: 98, scope: !694)
!694 = distinct !DILexicalBlock(scope: !661, file: !354, line: 156, column: 98)
!695 = !DILocation(line: 156, column: 98, scope: !661)
!696 = !DILocation(line: 157, column: 12, scope: !667)
!697 = !{!493, !471, i64 144}
!698 = !DILocation(line: 157, column: 7, scope: !667)
!699 = !DILocation(line: 157, column: 16, scope: !667)
!700 = !DILocation(line: 157, column: 24, scope: !667)
!701 = !{!493, !471, i64 152}
!702 = !DILocation(line: 157, column: 19, scope: !667)
!703 = !DILocation(line: 157, column: 28, scope: !667)
!704 = !DILocation(line: 157, column: 61, scope: !666)
!705 = !DILocation(line: 0, scope: !665)
!706 = !DILocation(line: 157, column: 82, scope: !707)
!707 = distinct !DILexicalBlock(scope: !665, file: !354, line: 157, column: 82)
!708 = !DILocation(line: 157, column: 82, scope: !665)
!709 = !DILocation(line: 158, column: 26, scope: !655)
!710 = !DILocation(line: 158, column: 10, scope: !655)
!711 = !DILocation(line: 0, scope: !669)
!712 = !DILocation(line: 158, column: 31, scope: !713)
!713 = distinct !DILexicalBlock(scope: !669, file: !354, line: 158, column: 31)
!714 = !DILocation(line: 158, column: 31, scope: !669)
!715 = !DILocation(line: 159, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !354, line: 159, column: 3)
!717 = distinct !DILexicalBlock(scope: !718, file: !354, line: 159, column: 3)
!718 = distinct !DILexicalBlock(scope: !655, file: !354, line: 159, column: 3)
!719 = !DILocation(line: 159, column: 3, scope: !717)
!720 = !DILocation(line: 159, column: 3, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !354, line: 159, column: 3)
!722 = distinct !DILexicalBlock(scope: !716, file: !354, line: 159, column: 3)
!723 = !DILocation(line: 159, column: 3, scope: !722)
!724 = !DILocation(line: 159, column: 3, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !354, line: 159, column: 3)
!726 = distinct !DILexicalBlock(scope: !721, file: !354, line: 159, column: 3)
!727 = !DILocation(line: 159, column: 3, scope: !726)
!728 = !DILocation(line: 159, column: 3, scope: !729)
!729 = distinct !DILexicalBlock(scope: !725, file: !354, line: 159, column: 3)
!730 = !DILocation(line: 159, column: 3, scope: !731)
!731 = distinct !DILexicalBlock(scope: !721, file: !354, line: 159, column: 3)
!732 = !DILocation(line: 159, column: 3, scope: !733)
!733 = distinct !DILexicalBlock(scope: !731, file: !354, line: 159, column: 3)
!734 = !DILocation(line: 159, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !354, line: 159, column: 3)
!736 = distinct !DILexicalBlock(scope: !733, file: !354, line: 159, column: 3)
!737 = !DILocation(line: 159, column: 3, scope: !736)
!738 = !DILocation(line: 159, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !354, line: 159, column: 3)
!740 = !DILocation(line: 160, column: 1, scope: !655)
!741 = distinct !DISubprogram(name: "PCDestroy_LU", scope: !354, file: !354, line: 162, type: !370, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !742)
!742 = !{!743, !744, !745, !746, !748, !750, !752}
!743 = !DILocalVariable(name: "pc", arg: 1, scope: !741, file: !354, line: 162, type: !357)
!744 = !DILocalVariable(name: "dir", scope: !741, file: !354, line: 164, type: !89)
!745 = !DILocalVariable(name: "ierr", scope: !741, file: !354, line: 165, type: !161)
!746 = !DILocalVariable(name: "ierr__", scope: !747, file: !354, line: 168, type: !161)
!747 = distinct !DILexicalBlock(scope: !741, file: !354, line: 168, column: 25)
!748 = !DILocalVariable(name: "ierr__", scope: !749, file: !354, line: 169, type: !161)
!749 = distinct !DILexicalBlock(scope: !741, file: !354, line: 169, column: 49)
!750 = !DILocalVariable(name: "ierr__", scope: !751, file: !354, line: 170, type: !161)
!751 = distinct !DILexicalBlock(scope: !741, file: !354, line: 170, column: 51)
!752 = !DILocalVariable(name: "ierr__", scope: !753, file: !354, line: 171, type: !161)
!753 = distinct !DILexicalBlock(scope: !741, file: !354, line: 171, column: 30)
!754 = !DILocation(line: 0, scope: !741)
!755 = !DILocation(line: 164, column: 37, scope: !741)
!756 = !DILocation(line: 167, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !354, line: 167, column: 3)
!758 = distinct !DILexicalBlock(scope: !759, file: !354, line: 167, column: 3)
!759 = distinct !DILexicalBlock(scope: !741, file: !354, line: 167, column: 3)
!760 = !DILocation(line: 167, column: 3, scope: !758)
!761 = !DILocation(line: 167, column: 3, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !354, line: 167, column: 3)
!763 = distinct !DILexicalBlock(scope: !757, file: !354, line: 167, column: 3)
!764 = !DILocation(line: 167, column: 3, scope: !763)
!765 = !DILocation(line: 167, column: 3, scope: !766)
!766 = distinct !DILexicalBlock(scope: !762, file: !354, line: 167, column: 3)
!767 = !DILocation(line: 168, column: 10, scope: !741)
!768 = !DILocation(line: 0, scope: !747)
!769 = !DILocation(line: 168, column: 25, scope: !770)
!770 = distinct !DILexicalBlock(scope: !747, file: !354, line: 168, column: 25)
!771 = !DILocation(line: 168, column: 25, scope: !747)
!772 = !DILocation(line: 169, column: 10, scope: !741)
!773 = !{!494, !471, i64 96}
!774 = !DILocation(line: 0, scope: !749)
!775 = !DILocation(line: 169, column: 49, scope: !776)
!776 = distinct !DILexicalBlock(scope: !749, file: !354, line: 169, column: 49)
!777 = !DILocation(line: 170, column: 10, scope: !741)
!778 = !{!494, !471, i64 104}
!779 = !DILocation(line: 0, scope: !751)
!780 = !DILocation(line: 170, column: 51, scope: !781)
!781 = distinct !DILexicalBlock(scope: !751, file: !354, line: 170, column: 51)
!782 = !DILocation(line: 171, column: 10, scope: !741)
!783 = !DILocation(line: 0, scope: !753)
!784 = !DILocation(line: 171, column: 30, scope: !785)
!785 = distinct !DILexicalBlock(scope: !753, file: !354, line: 171, column: 30)
!786 = !DILocation(line: 172, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !354, line: 172, column: 3)
!788 = distinct !DILexicalBlock(scope: !789, file: !354, line: 172, column: 3)
!789 = distinct !DILexicalBlock(scope: !741, file: !354, line: 172, column: 3)
!790 = !DILocation(line: 172, column: 3, scope: !788)
!791 = !DILocation(line: 172, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !354, line: 172, column: 3)
!793 = distinct !DILexicalBlock(scope: !787, file: !354, line: 172, column: 3)
!794 = !DILocation(line: 172, column: 3, scope: !793)
!795 = !DILocation(line: 172, column: 3, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !354, line: 172, column: 3)
!797 = distinct !DILexicalBlock(scope: !792, file: !354, line: 172, column: 3)
!798 = !DILocation(line: 172, column: 3, scope: !797)
!799 = !DILocation(line: 172, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !796, file: !354, line: 172, column: 3)
!801 = !DILocation(line: 172, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !792, file: !354, line: 172, column: 3)
!803 = !DILocation(line: 172, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !802, file: !354, line: 172, column: 3)
!805 = !DILocation(line: 172, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !354, line: 172, column: 3)
!807 = distinct !DILexicalBlock(scope: !804, file: !354, line: 172, column: 3)
!808 = !DILocation(line: 172, column: 3, scope: !807)
!809 = !DILocation(line: 172, column: 3, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !354, line: 172, column: 3)
!811 = !DILocation(line: 173, column: 1, scope: !741)
!812 = distinct !DISubprogram(name: "PCApply_LU", scope: !354, file: !354, line: 175, type: !374, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !823}
!814 = !DILocalVariable(name: "pc", arg: 1, scope: !812, file: !354, line: 175, type: !357)
!815 = !DILocalVariable(name: "x", arg: 2, scope: !812, file: !354, line: 175, type: !376)
!816 = !DILocalVariable(name: "y", arg: 3, scope: !812, file: !354, line: 175, type: !376)
!817 = !DILocalVariable(name: "dir", scope: !812, file: !354, line: 177, type: !89)
!818 = !DILocalVariable(name: "ierr", scope: !812, file: !354, line: 178, type: !161)
!819 = !DILocalVariable(name: "ierr__", scope: !820, file: !354, line: 182, type: !161)
!820 = distinct !DILexicalBlock(scope: !821, file: !354, line: 182, column: 35)
!821 = distinct !DILexicalBlock(scope: !822, file: !354, line: 181, column: 25)
!822 = distinct !DILexicalBlock(scope: !812, file: !354, line: 181, column: 7)
!823 = !DILocalVariable(name: "ierr__", scope: !824, file: !354, line: 184, type: !161)
!824 = distinct !DILexicalBlock(scope: !825, file: !354, line: 184, column: 50)
!825 = distinct !DILexicalBlock(scope: !822, file: !354, line: 183, column: 10)
!826 = !DILocation(line: 0, scope: !812)
!827 = !DILocation(line: 177, column: 37, scope: !812)
!828 = !DILocation(line: 180, column: 3, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !354, line: 180, column: 3)
!830 = distinct !DILexicalBlock(scope: !831, file: !354, line: 180, column: 3)
!831 = distinct !DILexicalBlock(scope: !812, file: !354, line: 180, column: 3)
!832 = !DILocation(line: 180, column: 3, scope: !830)
!833 = !DILocation(line: 180, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !354, line: 180, column: 3)
!835 = distinct !DILexicalBlock(scope: !829, file: !354, line: 180, column: 3)
!836 = !DILocation(line: 180, column: 3, scope: !835)
!837 = !DILocation(line: 180, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !834, file: !354, line: 180, column: 3)
!839 = !DILocation(line: 181, column: 16, scope: !822)
!840 = !DILocation(line: 181, column: 7, scope: !822)
!841 = !DILocation(line: 181, column: 7, scope: !812)
!842 = !DILocation(line: 182, column: 25, scope: !821)
!843 = !{!466, !471, i64 760}
!844 = !DILocation(line: 182, column: 12, scope: !821)
!845 = !DILocation(line: 0, scope: !820)
!846 = !DILocation(line: 182, column: 35, scope: !847)
!847 = distinct !DILexicalBlock(scope: !820, file: !354, line: 182, column: 35)
!848 = !DILocation(line: 182, column: 35, scope: !820)
!849 = !DILocation(line: 184, column: 40, scope: !825)
!850 = !DILocation(line: 184, column: 12, scope: !825)
!851 = !DILocation(line: 0, scope: !824)
!852 = !DILocation(line: 184, column: 50, scope: !853)
!853 = distinct !DILexicalBlock(scope: !824, file: !354, line: 184, column: 50)
!854 = !DILocation(line: 184, column: 50, scope: !824)
!855 = !DILocation(line: 186, column: 3, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !354, line: 186, column: 3)
!857 = distinct !DILexicalBlock(scope: !858, file: !354, line: 186, column: 3)
!858 = distinct !DILexicalBlock(scope: !812, file: !354, line: 186, column: 3)
!859 = !DILocation(line: 186, column: 3, scope: !857)
!860 = !DILocation(line: 186, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !354, line: 186, column: 3)
!862 = distinct !DILexicalBlock(scope: !856, file: !354, line: 186, column: 3)
!863 = !DILocation(line: 186, column: 3, scope: !862)
!864 = !DILocation(line: 186, column: 3, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !354, line: 186, column: 3)
!866 = distinct !DILexicalBlock(scope: !861, file: !354, line: 186, column: 3)
!867 = !DILocation(line: 186, column: 3, scope: !866)
!868 = !DILocation(line: 186, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !354, line: 186, column: 3)
!870 = !DILocation(line: 186, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !861, file: !354, line: 186, column: 3)
!872 = !DILocation(line: 186, column: 3, scope: !873)
!873 = distinct !DILexicalBlock(scope: !871, file: !354, line: 186, column: 3)
!874 = !DILocation(line: 186, column: 3, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !354, line: 186, column: 3)
!876 = distinct !DILexicalBlock(scope: !873, file: !354, line: 186, column: 3)
!877 = !DILocation(line: 186, column: 3, scope: !876)
!878 = !DILocation(line: 186, column: 3, scope: !879)
!879 = distinct !DILexicalBlock(scope: !875, file: !354, line: 186, column: 3)
!880 = !DILocation(line: 187, column: 1, scope: !812)
!881 = distinct !DISubprogram(name: "PCMatApply_LU", scope: !354, file: !354, line: 189, type: !382, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !892}
!883 = !DILocalVariable(name: "pc", arg: 1, scope: !881, file: !354, line: 189, type: !357)
!884 = !DILocalVariable(name: "X", arg: 2, scope: !881, file: !354, line: 189, type: !100)
!885 = !DILocalVariable(name: "Y", arg: 3, scope: !881, file: !354, line: 189, type: !100)
!886 = !DILocalVariable(name: "dir", scope: !881, file: !354, line: 191, type: !89)
!887 = !DILocalVariable(name: "ierr", scope: !881, file: !354, line: 192, type: !161)
!888 = !DILocalVariable(name: "ierr__", scope: !889, file: !354, line: 196, type: !161)
!889 = distinct !DILexicalBlock(scope: !890, file: !354, line: 196, column: 38)
!890 = distinct !DILexicalBlock(scope: !891, file: !354, line: 195, column: 25)
!891 = distinct !DILexicalBlock(scope: !881, file: !354, line: 195, column: 7)
!892 = !DILocalVariable(name: "ierr__", scope: !893, file: !354, line: 198, type: !161)
!893 = distinct !DILexicalBlock(scope: !894, file: !354, line: 198, column: 53)
!894 = distinct !DILexicalBlock(scope: !891, file: !354, line: 197, column: 10)
!895 = !DILocation(line: 0, scope: !881)
!896 = !DILocation(line: 191, column: 37, scope: !881)
!897 = !DILocation(line: 194, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !354, line: 194, column: 3)
!899 = distinct !DILexicalBlock(scope: !900, file: !354, line: 194, column: 3)
!900 = distinct !DILexicalBlock(scope: !881, file: !354, line: 194, column: 3)
!901 = !DILocation(line: 194, column: 3, scope: !899)
!902 = !DILocation(line: 194, column: 3, scope: !903)
!903 = distinct !DILexicalBlock(scope: !904, file: !354, line: 194, column: 3)
!904 = distinct !DILexicalBlock(scope: !898, file: !354, line: 194, column: 3)
!905 = !DILocation(line: 194, column: 3, scope: !904)
!906 = !DILocation(line: 194, column: 3, scope: !907)
!907 = distinct !DILexicalBlock(scope: !903, file: !354, line: 194, column: 3)
!908 = !DILocation(line: 195, column: 16, scope: !891)
!909 = !DILocation(line: 195, column: 7, scope: !891)
!910 = !DILocation(line: 195, column: 7, scope: !881)
!911 = !DILocation(line: 196, column: 28, scope: !890)
!912 = !DILocation(line: 196, column: 12, scope: !890)
!913 = !DILocation(line: 0, scope: !889)
!914 = !DILocation(line: 196, column: 38, scope: !915)
!915 = distinct !DILexicalBlock(scope: !889, file: !354, line: 196, column: 38)
!916 = !DILocation(line: 196, column: 38, scope: !889)
!917 = !DILocation(line: 198, column: 43, scope: !894)
!918 = !DILocation(line: 198, column: 12, scope: !894)
!919 = !DILocation(line: 0, scope: !893)
!920 = !DILocation(line: 198, column: 53, scope: !921)
!921 = distinct !DILexicalBlock(scope: !893, file: !354, line: 198, column: 53)
!922 = !DILocation(line: 198, column: 53, scope: !893)
!923 = !DILocation(line: 200, column: 3, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !354, line: 200, column: 3)
!925 = distinct !DILexicalBlock(scope: !926, file: !354, line: 200, column: 3)
!926 = distinct !DILexicalBlock(scope: !881, file: !354, line: 200, column: 3)
!927 = !DILocation(line: 200, column: 3, scope: !925)
!928 = !DILocation(line: 200, column: 3, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !354, line: 200, column: 3)
!930 = distinct !DILexicalBlock(scope: !924, file: !354, line: 200, column: 3)
!931 = !DILocation(line: 200, column: 3, scope: !930)
!932 = !DILocation(line: 200, column: 3, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !354, line: 200, column: 3)
!934 = distinct !DILexicalBlock(scope: !929, file: !354, line: 200, column: 3)
!935 = !DILocation(line: 200, column: 3, scope: !934)
!936 = !DILocation(line: 200, column: 3, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !354, line: 200, column: 3)
!938 = !DILocation(line: 200, column: 3, scope: !939)
!939 = distinct !DILexicalBlock(scope: !929, file: !354, line: 200, column: 3)
!940 = !DILocation(line: 200, column: 3, scope: !941)
!941 = distinct !DILexicalBlock(scope: !939, file: !354, line: 200, column: 3)
!942 = !DILocation(line: 200, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !354, line: 200, column: 3)
!944 = distinct !DILexicalBlock(scope: !941, file: !354, line: 200, column: 3)
!945 = !DILocation(line: 200, column: 3, scope: !944)
!946 = !DILocation(line: 200, column: 3, scope: !947)
!947 = distinct !DILexicalBlock(scope: !943, file: !354, line: 200, column: 3)
!948 = !DILocation(line: 201, column: 1, scope: !881)
!949 = distinct !DISubprogram(name: "PCApplyTranspose_LU", scope: !354, file: !354, line: 203, type: !374, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !960}
!951 = !DILocalVariable(name: "pc", arg: 1, scope: !949, file: !354, line: 203, type: !357)
!952 = !DILocalVariable(name: "x", arg: 2, scope: !949, file: !354, line: 203, type: !376)
!953 = !DILocalVariable(name: "y", arg: 3, scope: !949, file: !354, line: 203, type: !376)
!954 = !DILocalVariable(name: "dir", scope: !949, file: !354, line: 205, type: !89)
!955 = !DILocalVariable(name: "ierr", scope: !949, file: !354, line: 206, type: !161)
!956 = !DILocalVariable(name: "ierr__", scope: !957, file: !354, line: 210, type: !161)
!957 = distinct !DILexicalBlock(scope: !958, file: !354, line: 210, column: 44)
!958 = distinct !DILexicalBlock(scope: !959, file: !354, line: 209, column: 25)
!959 = distinct !DILexicalBlock(scope: !949, file: !354, line: 209, column: 7)
!960 = !DILocalVariable(name: "ierr__", scope: !961, file: !354, line: 212, type: !161)
!961 = distinct !DILexicalBlock(scope: !962, file: !354, line: 212, column: 59)
!962 = distinct !DILexicalBlock(scope: !959, file: !354, line: 211, column: 10)
!963 = !DILocation(line: 0, scope: !949)
!964 = !DILocation(line: 205, column: 37, scope: !949)
!965 = !DILocation(line: 208, column: 3, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !354, line: 208, column: 3)
!967 = distinct !DILexicalBlock(scope: !968, file: !354, line: 208, column: 3)
!968 = distinct !DILexicalBlock(scope: !949, file: !354, line: 208, column: 3)
!969 = !DILocation(line: 208, column: 3, scope: !967)
!970 = !DILocation(line: 208, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !354, line: 208, column: 3)
!972 = distinct !DILexicalBlock(scope: !966, file: !354, line: 208, column: 3)
!973 = !DILocation(line: 208, column: 3, scope: !972)
!974 = !DILocation(line: 208, column: 3, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !354, line: 208, column: 3)
!976 = !DILocation(line: 209, column: 16, scope: !959)
!977 = !DILocation(line: 209, column: 7, scope: !959)
!978 = !DILocation(line: 209, column: 7, scope: !949)
!979 = !DILocation(line: 210, column: 34, scope: !958)
!980 = !DILocation(line: 210, column: 12, scope: !958)
!981 = !DILocation(line: 0, scope: !957)
!982 = !DILocation(line: 210, column: 44, scope: !983)
!983 = distinct !DILexicalBlock(scope: !957, file: !354, line: 210, column: 44)
!984 = !DILocation(line: 210, column: 44, scope: !957)
!985 = !DILocation(line: 212, column: 49, scope: !962)
!986 = !DILocation(line: 212, column: 12, scope: !962)
!987 = !DILocation(line: 0, scope: !961)
!988 = !DILocation(line: 212, column: 59, scope: !989)
!989 = distinct !DILexicalBlock(scope: !961, file: !354, line: 212, column: 59)
!990 = !DILocation(line: 212, column: 59, scope: !961)
!991 = !DILocation(line: 214, column: 3, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !354, line: 214, column: 3)
!993 = distinct !DILexicalBlock(scope: !994, file: !354, line: 214, column: 3)
!994 = distinct !DILexicalBlock(scope: !949, file: !354, line: 214, column: 3)
!995 = !DILocation(line: 214, column: 3, scope: !993)
!996 = !DILocation(line: 214, column: 3, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !354, line: 214, column: 3)
!998 = distinct !DILexicalBlock(scope: !992, file: !354, line: 214, column: 3)
!999 = !DILocation(line: 214, column: 3, scope: !998)
!1000 = !DILocation(line: 214, column: 3, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !354, line: 214, column: 3)
!1002 = distinct !DILexicalBlock(scope: !997, file: !354, line: 214, column: 3)
!1003 = !DILocation(line: 214, column: 3, scope: !1002)
!1004 = !DILocation(line: 214, column: 3, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1001, file: !354, line: 214, column: 3)
!1006 = !DILocation(line: 214, column: 3, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !997, file: !354, line: 214, column: 3)
!1008 = !DILocation(line: 214, column: 3, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1007, file: !354, line: 214, column: 3)
!1010 = !DILocation(line: 214, column: 3, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !354, line: 214, column: 3)
!1012 = distinct !DILexicalBlock(scope: !1009, file: !354, line: 214, column: 3)
!1013 = !DILocation(line: 214, column: 3, scope: !1012)
!1014 = !DILocation(line: 214, column: 3, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !354, line: 214, column: 3)
!1016 = !DILocation(line: 215, column: 1, scope: !949)
!1017 = distinct !DISubprogram(name: "PCSetUp_LU", scope: !354, file: !354, line: 42, type: !370, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1024, !1026, !1028, !1031, !1033, !1039, !1041, !1043, !1045, !1049, !1051, !1053, !1055, !1070, !1073, !1077, !1079, !1081, !1085, !1087, !1091, !1093, !1095, !1097, !1099, !1102, !1106, !1108, !1110, !1112, !1118, !1120, !1122, !1124, !1128, !1130, !1132, !1134, !1136, !1139, !1143, !1145, !1147, !1149, !1151, !1154, !1156}
!1019 = !DILocalVariable(name: "pc", arg: 1, scope: !1017, file: !354, line: 42, type: !357)
!1020 = !DILocalVariable(name: "ierr", scope: !1017, file: !354, line: 44, type: !161)
!1021 = !DILocalVariable(name: "dir", scope: !1017, file: !354, line: 45, type: !89)
!1022 = !DILocalVariable(name: "stype", scope: !1017, file: !354, line: 46, type: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSolverType", file: !39, line: 126, baseType: !122)
!1024 = !DILocalVariable(name: "err", scope: !1017, file: !354, line: 47, type: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !39, line: 1203, baseType: !76)
!1026 = !DILocalVariable(name: "ierr__", scope: !1027, file: !354, line: 53, type: !161)
!1027 = distinct !DILexicalBlock(scope: !1017, file: !354, line: 53, column: 60)
!1028 = !DILocalVariable(name: "ftype", scope: !1029, file: !354, line: 55, type: !128)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !354, line: 54, column: 25)
!1030 = distinct !DILexicalBlock(scope: !1017, file: !354, line: 54, column: 7)
!1031 = !DILocalVariable(name: "ierr__", scope: !1032, file: !354, line: 57, type: !161)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !354, line: 57, column: 47)
!1033 = !DILocalVariable(name: "ierr__", scope: !1034, file: !354, line: 59, type: !161)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !354, line: 59, column: 86)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !354, line: 59, column: 57)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 59, column: 11)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !354, line: 58, column: 35)
!1038 = distinct !DILexicalBlock(scope: !1029, file: !354, line: 58, column: 9)
!1039 = !DILocalVariable(name: "ierr__", scope: !1040, file: !354, line: 60, type: !161)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 60, column: 35)
!1041 = !DILocalVariable(name: "ierr__", scope: !1042, file: !354, line: 62, type: !161)
!1042 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 62, column: 52)
!1043 = !DILocalVariable(name: "ierr__", scope: !1044, file: !354, line: 63, type: !161)
!1044 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 63, column: 87)
!1045 = !DILocalVariable(name: "ierr__", scope: !1046, file: !354, line: 65, type: !161)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !354, line: 65, column: 76)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !354, line: 64, column: 21)
!1048 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 64, column: 11)
!1049 = !DILocalVariable(name: "ierr__", scope: !1050, file: !354, line: 66, type: !161)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !354, line: 66, column: 76)
!1051 = !DILocalVariable(name: "ierr__", scope: !1052, file: !354, line: 68, type: !161)
!1052 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 68, column: 79)
!1053 = !DILocalVariable(name: "ierr__", scope: !1054, file: !354, line: 69, type: !161)
!1054 = distinct !DILexicalBlock(scope: !1037, file: !354, line: 69, column: 47)
!1055 = !DILocalVariable(name: "info", scope: !1056, file: !354, line: 77, type: !1057)
!1056 = distinct !DILexicalBlock(scope: !1030, file: !354, line: 76, column: 10)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !39, line: 600, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 592, size: 640, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1058, file: !39, line: 593, baseType: !206, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !1058, file: !39, line: 594, baseType: !206, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !1058, file: !39, line: 594, baseType: !206, size: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !1058, file: !39, line: 594, baseType: !206, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1058, file: !39, line: 595, baseType: !206, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !1058, file: !39, line: 596, baseType: !206, size: 64, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !1058, file: !39, line: 597, baseType: !206, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !1058, file: !39, line: 598, baseType: !206, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !1058, file: !39, line: 598, baseType: !206, size: 64, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !1058, file: !39, line: 599, baseType: !206, size: 64, offset: 576)
!1070 = !DILocalVariable(name: "canuseordering", scope: !1071, file: !354, line: 80, type: !131)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !354, line: 79, column: 27)
!1072 = distinct !DILexicalBlock(scope: !1056, file: !354, line: 79, column: 9)
!1073 = !DILocalVariable(name: "ierr__", scope: !1074, file: !354, line: 82, type: !161)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !354, line: 82, column: 108)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !354, line: 81, column: 37)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !354, line: 81, column: 11)
!1077 = !DILocalVariable(name: "ierr__", scope: !1078, file: !354, line: 83, type: !161)
!1078 = distinct !DILexicalBlock(scope: !1075, file: !354, line: 83, column: 91)
!1079 = !DILocalVariable(name: "ierr__", scope: !1080, file: !354, line: 85, type: !161)
!1080 = distinct !DILexicalBlock(scope: !1071, file: !354, line: 85, column: 82)
!1081 = !DILocalVariable(name: "ierr__", scope: !1082, file: !354, line: 87, type: !161)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !354, line: 87, column: 54)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !354, line: 86, column: 27)
!1084 = distinct !DILexicalBlock(scope: !1071, file: !354, line: 86, column: 11)
!1085 = !DILocalVariable(name: "ierr__", scope: !1086, file: !354, line: 88, type: !161)
!1086 = distinct !DILexicalBlock(scope: !1083, file: !354, line: 88, column: 89)
!1087 = !DILocalVariable(name: "ierr__", scope: !1088, file: !354, line: 90, type: !161)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !354, line: 90, column: 105)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !354, line: 89, column: 41)
!1090 = distinct !DILexicalBlock(scope: !1083, file: !354, line: 89, column: 13)
!1091 = !DILocalVariable(name: "ierr__", scope: !1092, file: !354, line: 92, type: !161)
!1092 = distinct !DILexicalBlock(scope: !1083, file: !354, line: 92, column: 76)
!1093 = !DILocalVariable(name: "ierr__", scope: !1094, file: !354, line: 93, type: !161)
!1094 = distinct !DILexicalBlock(scope: !1083, file: !354, line: 93, column: 76)
!1095 = !DILocalVariable(name: "ierr__", scope: !1096, file: !354, line: 95, type: !161)
!1096 = distinct !DILexicalBlock(scope: !1071, file: !354, line: 95, column: 126)
!1097 = !DILocalVariable(name: "ierr__", scope: !1098, file: !354, line: 96, type: !161)
!1098 = distinct !DILexicalBlock(scope: !1071, file: !354, line: 96, column: 81)
!1099 = !DILocalVariable(name: "canuseordering", scope: !1100, file: !354, line: 99, type: !131)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !354, line: 98, column: 50)
!1101 = distinct !DILexicalBlock(scope: !1072, file: !354, line: 98, column: 16)
!1102 = !DILocalVariable(name: "ierr__", scope: !1103, file: !354, line: 101, type: !161)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !354, line: 101, column: 53)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !354, line: 100, column: 36)
!1105 = distinct !DILexicalBlock(scope: !1100, file: !354, line: 100, column: 11)
!1106 = !DILocalVariable(name: "ierr__", scope: !1107, file: !354, line: 102, type: !161)
!1107 = distinct !DILexicalBlock(scope: !1104, file: !354, line: 102, column: 108)
!1108 = !DILocalVariable(name: "ierr__", scope: !1109, file: !354, line: 103, type: !161)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !354, line: 103, column: 91)
!1110 = !DILocalVariable(name: "ierr__", scope: !1111, file: !354, line: 104, type: !161)
!1111 = distinct !DILexicalBlock(scope: !1104, file: !354, line: 104, column: 84)
!1112 = !DILocalVariable(name: "ierr__", scope: !1113, file: !354, line: 106, type: !161)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !354, line: 106, column: 90)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !354, line: 106, column: 61)
