; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/comb.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/comb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_op_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 385, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!83 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!101 = !{!102, !125, !110, !148, !108, !151, !154, !232, !111, !314, !258, !113, !348, !351, !354, !363, !220, !368, !379, !7}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscScalarInt", scope: !105, file: !104, line: 78, size: 128, elements: !142)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/comb.c", directory: "/home/users/ndemeye/xSDK")
!105 = distinct !DISubprogram(name: "PetscSplitReduction_Local", scope: !104, file: !104, line: 76, type: !106, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !117)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108, !108, !109, !112}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !111)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !114, line: 331, baseType: !115)
!114 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !114, line: 331, flags: DIFlagFwdDecl)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !126, !127, !131, !132, !141}
!118 = !DILocalVariable(name: "in", arg: 1, scope: !105, file: !104, line: 76, type: !108)
!119 = !DILocalVariable(name: "out", arg: 2, scope: !105, file: !104, line: 76, type: !108)
!120 = !DILocalVariable(name: "cnt", arg: 3, scope: !105, file: !104, line: 76, type: !109)
!121 = !DILocalVariable(name: "datatype", arg: 4, scope: !105, file: !104, line: 76, type: !112)
!122 = !DILocalVariable(name: "xin", scope: !105, file: !104, line: 79, type: !102)
!123 = !DILocalVariable(name: "xout", scope: !105, file: !104, line: 80, type: !102)
!124 = !DILocalVariable(name: "i", scope: !105, file: !104, line: 81, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !111)
!126 = !DILocalVariable(name: "count", scope: !105, file: !104, line: 81, type: !125)
!127 = !DILocalVariable(name: "idx", scope: !128, file: !104, line: 86, type: !125)
!128 = distinct !DILexicalBlock(scope: !129, file: !104, line: 86, column: 5)
!129 = distinct !DILexicalBlock(scope: !130, file: !104, line: 84, column: 37)
!130 = distinct !DILexicalBlock(scope: !105, file: !104, line: 84, column: 7)
!131 = !DILocalVariable(name: "errcode", scope: !128, file: !104, line: 86, type: !110)
!132 = !DILocalVariable(name: "idx", scope: !133, file: !104, line: 94, type: !125)
!133 = distinct !DILexicalBlock(scope: !134, file: !104, line: 94, column: 7)
!134 = distinct !DILexicalBlock(scope: !135, file: !104, line: 92, column: 10)
!135 = distinct !DILexicalBlock(scope: !136, file: !104, line: 91, column: 14)
!136 = distinct !DILexicalBlock(scope: !137, file: !104, line: 90, column: 14)
!137 = distinct !DILexicalBlock(scope: !138, file: !104, line: 89, column: 14)
!138 = distinct !DILexicalBlock(scope: !139, file: !104, line: 88, column: 27)
!139 = distinct !DILexicalBlock(scope: !140, file: !104, line: 88, column: 3)
!140 = distinct !DILexicalBlock(scope: !105, file: !104, line: 88, column: 3)
!141 = !DILocalVariable(name: "errcode", scope: !133, file: !104, line: 94, type: !110)
!142 = !{!143, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !103, file: !104, line: 78, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !146)
!146 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !103, file: !104, line: 78, baseType: !125, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !114, line: 330, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !114, line: 330, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !6, line: 73, size: 4480, elements: !157)
!157 = !{!158, !160, !206, !207, !208, !210, !211, !212, !213, !221, !222, !223, !227, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !244, !245, !246, !248, !249, !251, !253, !254, !255, !256, !257, !259, !261, !262, !263, !264, !265, !267, !269, !270, !271, !281, !283, !284, !288, !289, !338, !343, !345, !346, !347}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !156, file: !6, line: 74, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !111)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !156, file: !6, line: 75, baseType: !161, size: 448, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 448, elements: !204)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !6, line: 53, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 45, size: 448, elements: !164)
!164 = !{!165, !171, !179, !184, !188, !192, !199}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !163, file: !6, line: 46, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !154, !170}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !111)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !163, file: !6, line: 47, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!169, !154, !175}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !176, line: 16, baseType: !177)
!176 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !176, line: 16, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !163, file: !6, line: 48, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!169, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !163, file: !6, line: 49, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!169, !154, !151, !154}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !163, file: !6, line: 50, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!169, !154, !151, !183}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !163, file: !6, line: 51, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!169, !154, !151, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !163, file: !6, line: 52, baseType: !200, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!169, !154, !151, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !156, file: !6, line: 76, baseType: !148, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !6, line: 77, baseType: !125, size: 32, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !156, file: !6, line: 78, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !146)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !156, file: !6, line: 78, baseType: !209, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !156, file: !6, line: 78, baseType: !209, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !156, file: !6, line: 78, baseType: !209, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !6, line: 79, baseType: !214, size: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !217, line: 27, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !219, line: 43, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!220 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !156, file: !6, line: 80, baseType: !125, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !6, line: 81, baseType: !110, size: 32, offset: 992)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !156, file: !6, line: 82, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !156, file: !6, line: 83, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !156, file: !6, line: 84, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !156, file: !6, line: 85, baseType: !232, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !156, file: !6, line: 86, baseType: !232, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !156, file: !6, line: 87, baseType: !232, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !6, line: 88, baseType: !154, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !156, file: !6, line: 89, baseType: !214, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !6, line: 90, baseType: !232, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !156, file: !6, line: 91, baseType: !232, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !156, file: !6, line: 92, baseType: !125, size: 32, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !156, file: !6, line: 93, baseType: !108, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !6, line: 94, baseType: !243, size: 64, offset: 1792)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !215)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !156, file: !6, line: 95, baseType: !125, size: 32, offset: 1856)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !156, file: !6, line: 95, baseType: !125, size: 32, offset: 1888)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !156, file: !6, line: 96, baseType: !247, size: 64, offset: 1920)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !156, file: !6, line: 96, baseType: !247, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !156, file: !6, line: 97, baseType: !250, size: 64, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !156, file: !6, line: 97, baseType: !252, size: 64, offset: 2112)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !156, file: !6, line: 98, baseType: !125, size: 32, offset: 2176)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !156, file: !6, line: 98, baseType: !125, size: 32, offset: 2208)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !156, file: !6, line: 99, baseType: !247, size: 64, offset: 2240)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !156, file: !6, line: 99, baseType: !247, size: 64, offset: 2304)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !156, file: !6, line: 100, baseType: !258, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !156, file: !6, line: 100, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !156, file: !6, line: 101, baseType: !125, size: 32, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !156, file: !6, line: 101, baseType: !125, size: 32, offset: 2528)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !156, file: !6, line: 102, baseType: !247, size: 64, offset: 2560)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !156, file: !6, line: 102, baseType: !247, size: 64, offset: 2624)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !156, file: !6, line: 103, baseType: !266, size: 64, offset: 2688)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !156, file: !6, line: 103, baseType: !268, size: 64, offset: 2752)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !156, file: !6, line: 104, baseType: !203, size: 64, offset: 2816)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !156, file: !6, line: 105, baseType: !125, size: 32, offset: 2880)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !156, file: !6, line: 106, baseType: !272, size: 128, offset: 2944)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 128, elements: !279)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !6, line: 64, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 61, size: 128, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !275, file: !6, line: 62, baseType: !196, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !275, file: !6, line: 63, baseType: !108, size: 64, offset: 64)
!279 = !{!280}
!280 = !DISubrange(count: 2)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !156, file: !6, line: 107, baseType: !282, size: 64, offset: 3072)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !156, file: !6, line: 108, baseType: !108, size: 64, offset: 3136)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !156, file: !6, line: 109, baseType: !285, size: 64, offset: 3200)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!169, !108}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !156, file: !6, line: 111, baseType: !125, size: 32, offset: 3264)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !156, file: !6, line: 112, baseType: !290, size: 320, offset: 3328)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 320, elements: !336)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!169, !294, !154, !108}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !29, line: 108, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !29, line: 99, size: 640, elements: !297)
!297 = !{!298, !299, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !296, file: !29, line: 100, baseType: !125, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !29, line: 101, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !29, line: 82, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !29, line: 83, size: 768, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !311, !312, !313, !317, !319, !321, !322, !323}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !302, file: !29, line: 84, baseType: !232, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !302, file: !29, line: 85, baseType: !232, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !29, line: 86, baseType: !108, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !302, file: !29, line: 87, baseType: !224, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !302, file: !29, line: 88, baseType: !309, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !302, file: !29, line: 89, baseType: !153, size: 8, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !302, file: !29, line: 90, baseType: !232, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !302, file: !29, line: 91, baseType: !314, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !315, line: 46, baseType: !316)
!315 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!316 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !302, file: !29, line: 92, baseType: !318, size: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !29, line: 93, baseType: !320, size: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !29, line: 81, baseType: !28)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !29, line: 94, baseType: !300, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !302, file: !29, line: 95, baseType: !232, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !302, file: !29, line: 96, baseType: !108, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !296, file: !29, line: 102, baseType: !232, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !296, file: !29, line: 102, baseType: !232, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !296, file: !29, line: 103, baseType: !232, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !296, file: !29, line: 104, baseType: !148, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !296, file: !29, line: 105, baseType: !318, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !296, file: !29, line: 105, baseType: !318, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !296, file: !29, line: 105, baseType: !318, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !296, file: !29, line: 106, baseType: !154, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !296, file: !29, line: 107, baseType: !333, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !29, line: 10, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !29, line: 10, flags: DIFlagFwdDecl)
!336 = !{!337}
!337 = !DISubrange(count: 5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !156, file: !6, line: 113, baseType: !339, size: 320, offset: 3648)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 320, elements: !336)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!169, !154, !108}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !156, file: !6, line: 114, baseType: !344, size: 320, offset: 3968)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, elements: !336)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !156, file: !6, line: 115, baseType: !318, size: 32, offset: 4288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !156, file: !6, line: 120, baseType: !333, size: 64, offset: 4352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !156, file: !6, line: 121, baseType: !318, size: 32, offset: 4416)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !114, line: 338, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !114, line: 338, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !114, line: 339, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !114, line: 339, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !114, line: 341, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !114, line: 351, size: 192, elements: !357)
!357 = !{!358, !359, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !356, file: !114, line: 354, baseType: !111, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !356, file: !114, line: 355, baseType: !111, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !356, file: !114, line: 356, baseType: !111, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !356, file: !114, line: 361, baseType: !111, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !356, file: !114, line: 362, baseType: !314, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscScalarInt", scope: !365, file: !104, line: 243, size: 128, elements: !419)
!365 = distinct !DISubprogram(name: "PetscSplitReductionExtend", scope: !104, file: !104, line: 241, type: !366, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !393)
!366 = !DISubroutineType(types: !367)
!367 = !{!169, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSplitReduction", file: !6, line: 889, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 875, size: 704, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !380, !381, !387, !388, !390, !391, !392}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !370, file: !6, line: 876, baseType: !148, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !370, file: !6, line: 877, baseType: !351, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mix", scope: !370, file: !6, line: 878, baseType: !318, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "async", scope: !370, file: !6, line: 879, baseType: !318, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lvalues", scope: !370, file: !6, line: 880, baseType: !266, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gvalues", scope: !370, file: !6, line: 881, baseType: !266, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "invecs", scope: !370, file: !6, line: 882, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reducetype", scope: !370, file: !6, line: 883, baseType: !250, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lvalues_mix", scope: !370, file: !6, line: 884, baseType: !382, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !6, line: 884, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !383, file: !6, line: 884, baseType: !144, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !383, file: !6, line: 884, baseType: !125, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gvalues_mix", scope: !370, file: !6, line: 884, baseType: !382, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !370, file: !6, line: 885, baseType: !389, size: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SRState", file: !6, line: 871, baseType: !17)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "maxops", scope: !370, file: !6, line: 886, baseType: !125, size: 32, offset: 608)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "numopsbegin", scope: !370, file: !6, line: 887, baseType: !125, size: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "numopsend", scope: !370, file: !6, line: 888, baseType: !125, size: 32, offset: 672)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !405, !407, !409, !411, !413, !415, !417}
!394 = !DILocalVariable(name: "sr", arg: 1, scope: !365, file: !104, line: 241, type: !368)
!395 = !DILocalVariable(name: "ierr", scope: !365, file: !104, line: 244, type: !169)
!396 = !DILocalVariable(name: "maxops", scope: !365, file: !104, line: 245, type: !125)
!397 = !DILocalVariable(name: "reducetype", scope: !365, file: !104, line: 245, type: !250)
!398 = !DILocalVariable(name: "lvalues", scope: !365, file: !104, line: 246, type: !266)
!399 = !DILocalVariable(name: "gvalues", scope: !365, file: !104, line: 246, type: !266)
!400 = !DILocalVariable(name: "lvalues_mix", scope: !365, file: !104, line: 247, type: !363)
!401 = !DILocalVariable(name: "gvalues_mix", scope: !365, file: !104, line: 248, type: !363)
!402 = !DILocalVariable(name: "invecs", scope: !365, file: !104, line: 249, type: !379)
!403 = !DILocalVariable(name: "ierr__", scope: !404, file: !104, line: 253, type: !169)
!404 = distinct !DILexicalBlock(scope: !365, file: !104, line: 253, column: 166)
!405 = !DILocalVariable(name: "ierr__", scope: !406, file: !104, line: 254, type: !169)
!406 = distinct !DILexicalBlock(scope: !365, file: !104, line: 254, column: 52)
!407 = !DILocalVariable(name: "ierr__", scope: !408, file: !104, line: 255, type: !169)
!408 = distinct !DILexicalBlock(scope: !365, file: !104, line: 255, column: 52)
!409 = !DILocalVariable(name: "ierr__", scope: !410, file: !104, line: 256, type: !169)
!410 = distinct !DILexicalBlock(scope: !365, file: !104, line: 256, column: 58)
!411 = !DILocalVariable(name: "ierr__", scope: !412, file: !104, line: 257, type: !169)
!412 = distinct !DILexicalBlock(scope: !365, file: !104, line: 257, column: 50)
!413 = !DILocalVariable(name: "ierr__", scope: !414, file: !104, line: 258, type: !169)
!414 = distinct !DILexicalBlock(scope: !365, file: !104, line: 258, column: 60)
!415 = !DILocalVariable(name: "ierr__", scope: !416, file: !104, line: 259, type: !169)
!416 = distinct !DILexicalBlock(scope: !365, file: !104, line: 259, column: 60)
!417 = !DILocalVariable(name: "ierr__", scope: !418, file: !104, line: 260, type: !169)
!418 = distinct !DILexicalBlock(scope: !365, file: !104, line: 260, column: 80)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !364, file: !104, line: 243, baseType: !144, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !364, file: !104, line: 243, baseType: !125, size: 32, offset: 64)
!422 = !{!0, !423}
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "Petsc_Reduction_keyval", scope: !2, file: !104, line: 274, type: !110, isLocal: false, isDefinition: true)
!425 = !{i32 7, !"Dwarf Version", i32 4}
!426 = !{i32 2, !"Debug Info Version", i32 3}
!427 = !{i32 1, !"wchar_size", i32 4}
!428 = !{i32 7, !"PIC Level", i32 2}
!429 = !{i32 7, !"uwtable", i32 1}
!430 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!431 = !DILocation(line: 0, scope: !105)
!432 = !DILocation(line: 79, column: 32, scope: !105)
!433 = !DILocation(line: 80, column: 33, scope: !105)
!434 = !DILocation(line: 81, column: 45, scope: !105)
!435 = !{!436, !436, i64 0}
!436 = !{!"int", !437, i64 0}
!437 = !{!"omnipotent char", !438, i64 0}
!438 = !{!"Simple C/C++ TBAA"}
!439 = !DILocation(line: 83, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !104, line: 83, column: 3)
!441 = distinct !DILexicalBlock(scope: !442, file: !104, line: 83, column: 3)
!442 = distinct !DILexicalBlock(scope: !105, file: !104, line: 83, column: 3)
!443 = !{!444, !444, i64 0}
!444 = !{!"any pointer", !437, i64 0}
!445 = !DILocation(line: 83, column: 3, scope: !441)
!446 = !DILocation(line: 83, column: 3, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !104, line: 83, column: 3)
!448 = distinct !DILexicalBlock(scope: !440, file: !104, line: 83, column: 3)
!449 = !{!450, !436, i64 1536}
!450 = !{!"", !437, i64 0, !437, i64 512, !437, i64 1024, !437, i64 1280, !436, i64 1536, !436, i64 1540, !437, i64 1544}
!451 = !DILocation(line: 83, column: 3, scope: !448)
!452 = !DILocation(line: 83, column: 3, scope: !453)
!453 = distinct !DILexicalBlock(scope: !447, file: !104, line: 83, column: 3)
!454 = !{!450, !436, i64 1540}
!455 = !DILocation(line: 84, column: 7, scope: !130)
!456 = !DILocation(line: 84, column: 20, scope: !130)
!457 = !DILocation(line: 84, column: 17, scope: !130)
!458 = !DILocation(line: 84, column: 7, scope: !105)
!459 = !DILocation(line: 85, column: 7, scope: !129)
!460 = !DILocation(line: 85, column: 5, scope: !129)
!461 = !DILocation(line: 86, column: 5, scope: !128)
!462 = !DILocation(line: 0, scope: !128)
!463 = !DILocation(line: 86, column: 5, scope: !464)
!464 = distinct !DILexicalBlock(scope: !128, file: !104, line: 86, column: 5)
!465 = !{!437, !437, i64 0}
!466 = !DILocation(line: 86, column: 5, scope: !467)
!467 = distinct !DILexicalBlock(scope: !128, file: !104, line: 86, column: 5)
!468 = !DILocation(line: 86, column: 5, scope: !129)
!469 = !DILocation(line: 87, column: 3, scope: !129)
!470 = !DILocation(line: 88, column: 14, scope: !139)
!471 = !DILocation(line: 88, column: 3, scope: !140)
!472 = !DILocation(line: 89, column: 14, scope: !137)
!473 = !DILocation(line: 89, column: 21, scope: !137)
!474 = !{!475, !436, i64 8}
!475 = !{!"PetscScalarInt", !476, i64 0, !436, i64 8}
!476 = !{!"double", !437, i64 0}
!477 = !DILocation(line: 89, column: 14, scope: !138)
!478 = !DILocation(line: 89, column: 67, scope: !137)
!479 = !{!475, !476, i64 0}
!480 = !DILocation(line: 89, column: 55, scope: !137)
!481 = !DILocation(line: 89, column: 57, scope: !137)
!482 = !DILocation(line: 89, column: 47, scope: !137)
!483 = !DILocation(line: 90, column: 59, scope: !136)
!484 = !DILocation(line: 90, column: 57, scope: !136)
!485 = !DILocation(line: 90, column: 47, scope: !136)
!486 = !DILocation(line: 91, column: 59, scope: !135)
!487 = !DILocation(line: 91, column: 57, scope: !135)
!488 = !DILocation(line: 91, column: 47, scope: !135)
!489 = !DILocation(line: 93, column: 9, scope: !134)
!490 = !DILocation(line: 93, column: 7, scope: !134)
!491 = !DILocation(line: 94, column: 7, scope: !133)
!492 = !DILocation(line: 0, scope: !133)
!493 = !DILocation(line: 94, column: 7, scope: !494)
!494 = distinct !DILexicalBlock(scope: !133, file: !104, line: 94, column: 7)
!495 = !DILocation(line: 94, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !133, file: !104, line: 94, column: 7)
!497 = !DILocation(line: 94, column: 7, scope: !134)
!498 = !DILocation(line: 88, column: 23, scope: !139)
!499 = distinct !{!499, !471, !500, !501}
!500 = !DILocation(line: 96, column: 3, scope: !140)
!501 = !{!"llvm.loop.mustprogress"}
!502 = !DILocation(line: 97, column: 3, scope: !503)
!503 = distinct !DILexicalBlock(scope: !504, file: !104, line: 97, column: 3)
!504 = distinct !DILexicalBlock(scope: !505, file: !104, line: 97, column: 3)
!505 = distinct !DILexicalBlock(scope: !105, file: !104, line: 97, column: 3)
!506 = !DILocation(line: 97, column: 3, scope: !504)
!507 = !DILocation(line: 97, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !104, line: 97, column: 3)
!509 = distinct !DILexicalBlock(scope: !503, file: !104, line: 97, column: 3)
!510 = !DILocation(line: 97, column: 3, scope: !509)
!511 = !DILocation(line: 97, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !104, line: 97, column: 3)
!513 = distinct !DILexicalBlock(scope: !508, file: !104, line: 97, column: 3)
!514 = !{!450, !437, i64 1544}
!515 = !DILocation(line: 97, column: 3, scope: !513)
!516 = !DILocation(line: 97, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !512, file: !104, line: 97, column: 3)
!518 = !DILocation(line: 97, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !508, file: !104, line: 97, column: 3)
!520 = !DILocation(line: 97, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !519, file: !104, line: 97, column: 3)
!522 = !DILocation(line: 97, column: 3, scope: !523)
!523 = distinct !DILexicalBlock(scope: !524, file: !104, line: 97, column: 3)
!524 = distinct !DILexicalBlock(scope: !521, file: !104, line: 97, column: 3)
!525 = !DILocation(line: 97, column: 3, scope: !524)
!526 = !DILocation(line: 97, column: 3, scope: !527)
!527 = distinct !DILexicalBlock(scope: !523, file: !104, line: 97, column: 3)
!528 = !DILocation(line: 98, column: 1, scope: !105)
!529 = !DISubprogram(name: "PetscAbortFindSourceFile_Private", scope: !23, file: !23, line: 509, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!530 = !DISubroutineType(types: !531)
!531 = !{!111, !151, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!533 = !{}
!534 = !DISubprogram(name: "PetscSleep", scope: !535, file: !535, line: 1420, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!535 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!536 = !DISubroutineType(types: !537)
!537 = !{!111, !146}
!538 = !DISubprogram(name: "MPI_Abort", scope: !114, file: !114, line: 1195, type: !539, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!539 = !DISubroutineType(types: !540)
!540 = !{!111, !149, !111}
!541 = distinct !DISubprogram(name: "PetscCommSplitReductionBegin", scope: !104, file: !104, line: 116, type: !542, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!169, !148}
!544 = !{!545, !546, !547, !548, !550, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !565, !567, !573, !574, !578, !583, !587, !591, !594, !596}
!545 = !DILocalVariable(name: "comm", arg: 1, scope: !541, file: !104, line: 116, type: !148)
!546 = !DILocalVariable(name: "ierr", scope: !541, file: !104, line: 118, type: !169)
!547 = !DILocalVariable(name: "sr", scope: !541, file: !104, line: 119, type: !368)
!548 = !DILocalVariable(name: "ierr__", scope: !549, file: !104, line: 122, type: !169)
!549 = distinct !DILexicalBlock(scope: !541, file: !104, line: 122, column: 43)
!550 = !DILocalVariable(name: "i", scope: !551, file: !104, line: 125, type: !125)
!551 = distinct !DILexicalBlock(scope: !552, file: !104, line: 124, column: 18)
!552 = distinct !DILexicalBlock(scope: !541, file: !104, line: 124, column: 7)
!553 = !DILocalVariable(name: "numops", scope: !551, file: !104, line: 125, type: !125)
!554 = !DILocalVariable(name: "reducetype", scope: !551, file: !104, line: 125, type: !250)
!555 = !DILocalVariable(name: "lvalues", scope: !551, file: !104, line: 126, type: !266)
!556 = !DILocalVariable(name: "gvalues", scope: !551, file: !104, line: 126, type: !266)
!557 = !DILocalVariable(name: "sum_flg", scope: !551, file: !104, line: 127, type: !125)
!558 = !DILocalVariable(name: "max_flg", scope: !551, file: !104, line: 127, type: !125)
!559 = !DILocalVariable(name: "min_flg", scope: !551, file: !104, line: 127, type: !125)
!560 = !DILocalVariable(name: "comm", scope: !551, file: !104, line: 128, type: !148)
!561 = !DILocalVariable(name: "size", scope: !551, file: !104, line: 129, type: !110)
!562 = !DILocalVariable(name: "cmul", scope: !551, file: !104, line: 129, type: !110)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !104, line: 131, type: !169)
!564 = distinct !DILexicalBlock(scope: !551, file: !104, line: 131, column: 56)
!565 = !DILocalVariable(name: "_7_errorcode", scope: !566, file: !104, line: 132, type: !169)
!566 = distinct !DILexicalBlock(scope: !551, file: !104, line: 132, column: 42)
!567 = !DILocalVariable(name: "_7_errorstring", scope: !568, file: !104, line: 132, type: !570)
!568 = distinct !DILexicalBlock(scope: !569, file: !104, line: 132, column: 42)
!569 = distinct !DILexicalBlock(scope: !566, file: !104, line: 132, column: 42)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2048, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 256)
!573 = !DILocalVariable(name: "_7_resultlen", scope: !568, file: !104, line: 132, type: !110)
!574 = !DILocalVariable(name: "ierr__", scope: !575, file: !104, line: 134, type: !169)
!575 = distinct !DILexicalBlock(scope: !576, file: !104, line: 134, column: 52)
!576 = distinct !DILexicalBlock(scope: !577, file: !104, line: 133, column: 20)
!577 = distinct !DILexicalBlock(scope: !551, file: !104, line: 133, column: 9)
!578 = !DILocalVariable(name: "ierr__", scope: !579, file: !104, line: 147, type: !169)
!579 = distinct !DILexicalBlock(scope: !580, file: !104, line: 147, column: 133)
!580 = distinct !DILexicalBlock(scope: !581, file: !104, line: 144, column: 44)
!581 = distinct !DILexicalBlock(scope: !582, file: !104, line: 144, column: 11)
!582 = distinct !DILexicalBlock(scope: !577, file: !104, line: 135, column: 12)
!583 = !DILocalVariable(name: "ierr__", scope: !584, file: !104, line: 149, type: !169)
!584 = distinct !DILexicalBlock(scope: !585, file: !104, line: 149, column: 126)
!585 = distinct !DILexicalBlock(scope: !586, file: !104, line: 148, column: 27)
!586 = distinct !DILexicalBlock(scope: !581, file: !104, line: 148, column: 18)
!587 = !DILocalVariable(name: "ierr__", scope: !588, file: !104, line: 151, type: !169)
!588 = distinct !DILexicalBlock(scope: !589, file: !104, line: 151, column: 126)
!589 = distinct !DILexicalBlock(scope: !590, file: !104, line: 150, column: 27)
!590 = distinct !DILexicalBlock(scope: !586, file: !104, line: 150, column: 18)
!591 = !DILocalVariable(name: "ierr__", scope: !592, file: !104, line: 153, type: !169)
!592 = distinct !DILexicalBlock(scope: !593, file: !104, line: 153, column: 99)
!593 = distinct !DILexicalBlock(scope: !590, file: !104, line: 152, column: 14)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !104, line: 158, type: !169)
!595 = distinct !DILexicalBlock(scope: !551, file: !104, line: 158, column: 54)
!596 = !DILocalVariable(name: "ierr__", scope: !597, file: !104, line: 160, type: !169)
!597 = distinct !DILexicalBlock(scope: !598, file: !104, line: 160, column: 41)
!598 = distinct !DILexicalBlock(scope: !552, file: !104, line: 159, column: 10)
!599 = !DILocation(line: 0, scope: !541)
!600 = !DILocation(line: 119, column: 3, scope: !541)
!601 = !DILocation(line: 121, column: 3, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !104, line: 121, column: 3)
!603 = distinct !DILexicalBlock(scope: !604, file: !104, line: 121, column: 3)
!604 = distinct !DILexicalBlock(scope: !541, file: !104, line: 121, column: 3)
!605 = !DILocation(line: 121, column: 3, scope: !603)
!606 = !DILocation(line: 121, column: 3, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !104, line: 121, column: 3)
!608 = distinct !DILexicalBlock(scope: !602, file: !104, line: 121, column: 3)
!609 = !DILocation(line: 121, column: 3, scope: !608)
!610 = !DILocation(line: 121, column: 3, scope: !611)
!611 = distinct !DILexicalBlock(scope: !607, file: !104, line: 121, column: 3)
!612 = !DILocation(line: 122, column: 10, scope: !541)
!613 = !DILocation(line: 0, scope: !549)
!614 = !DILocation(line: 122, column: 43, scope: !615)
!615 = distinct !DILexicalBlock(scope: !549, file: !104, line: 122, column: 43)
!616 = !DILocation(line: 122, column: 43, scope: !549)
!617 = !{!"branch_weights", i32 2000, i32 1}
!618 = !DILocation(line: 123, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !541, file: !104, line: 123, column: 7)
!620 = !DILocation(line: 123, column: 11, scope: !619)
!621 = !{!622, !436, i64 84}
!622 = !{!"", !444, i64 0, !444, i64 8, !437, i64 16, !437, i64 20, !444, i64 24, !444, i64 32, !444, i64 40, !444, i64 48, !444, i64 56, !444, i64 64, !437, i64 72, !436, i64 76, !436, i64 80, !436, i64 84}
!623 = !DILocation(line: 123, column: 21, scope: !619)
!624 = !DILocation(line: 123, column: 7, scope: !541)
!625 = !DILocation(line: 123, column: 26, scope: !619)
!626 = !DILocation(line: 124, column: 11, scope: !552)
!627 = !{!622, !437, i64 20}
!628 = !DILocation(line: 124, column: 7, scope: !552)
!629 = !DILocation(line: 124, column: 7, scope: !541)
!630 = !DILocation(line: 125, column: 32, scope: !551)
!631 = !{!622, !436, i64 80}
!632 = !DILocation(line: 0, scope: !551)
!633 = !DILocation(line: 125, column: 62, scope: !551)
!634 = !{!622, !444, i64 48}
!635 = !DILocation(line: 126, column: 32, scope: !551)
!636 = !{!622, !444, i64 24}
!637 = !DILocation(line: 126, column: 55, scope: !551)
!638 = !{!622, !444, i64 32}
!639 = !DILocation(line: 128, column: 28, scope: !551)
!640 = !{!622, !444, i64 0}
!641 = !DILocation(line: 129, column: 5, scope: !551)
!642 = !DILocation(line: 131, column: 12, scope: !551)
!643 = !{!644, !444, i64 24}
!644 = !{!"_n_PetscStageLog", !436, i64 0, !436, i64 4, !444, i64 8, !436, i64 16, !444, i64 24, !444, i64 32, !444, i64 40}
!645 = !{!644, !436, i64 16}
!646 = !{!647, !437, i64 20}
!647 = !{!"_PetscStageInfo", !444, i64 0, !437, i64 8, !648, i64 16, !444, i64 280, !444, i64 288}
!648 = !{!"", !436, i64 0, !437, i64 4, !437, i64 8, !436, i64 12, !436, i64 16, !476, i64 24, !476, i64 32, !476, i64 40, !476, i64 48, !476, i64 56, !476, i64 64, !476, i64 72, !437, i64 80, !437, i64 144, !476, i64 208, !476, i64 216, !476, i64 224, !476, i64 232, !476, i64 240, !476, i64 248, !476, i64 256}
!649 = !{!647, !444, i64 280}
!650 = !{!651, !444, i64 8}
!651 = !{!"_n_PetscEventPerfLog", !436, i64 0, !436, i64 4, !444, i64 8}
!652 = !{!648, !437, i64 4}
!653 = !DILocation(line: 0, scope: !564)
!654 = !DILocation(line: 131, column: 56, scope: !655)
!655 = distinct !DILexicalBlock(scope: !564, file: !104, line: 131, column: 56)
!656 = !DILocation(line: 131, column: 56, scope: !564)
!657 = !DILocation(line: 132, column: 26, scope: !551)
!658 = !DILocation(line: 132, column: 30, scope: !551)
!659 = !DILocation(line: 132, column: 12, scope: !551)
!660 = !DILocation(line: 0, scope: !566)
!661 = !DILocation(line: 132, column: 42, scope: !569)
!662 = !DILocation(line: 132, column: 42, scope: !566)
!663 = !DILocation(line: 132, column: 42, scope: !568)
!664 = !DILocation(line: 0, scope: !568)
!665 = !DILocation(line: 133, column: 9, scope: !577)
!666 = !DILocation(line: 133, column: 14, scope: !577)
!667 = !DILocation(line: 133, column: 9, scope: !551)
!668 = !DILocation(line: 137, column: 18, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !104, line: 137, column: 7)
!670 = distinct !DILexicalBlock(scope: !582, file: !104, line: 137, column: 7)
!671 = !DILocation(line: 137, column: 7, scope: !670)
!672 = !DILocation(line: 134, column: 14, scope: !576)
!673 = !DILocation(line: 0, scope: !575)
!674 = !DILocation(line: 134, column: 52, scope: !575)
!675 = !DILocation(line: 134, column: 52, scope: !676)
!676 = distinct !DILexicalBlock(scope: !575, file: !104, line: 134, column: 52)
!677 = !DILocation(line: 138, column: 18, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !104, line: 138, column: 18)
!679 = distinct !DILexicalBlock(scope: !669, file: !104, line: 137, column: 32)
!680 = !DILocation(line: 138, column: 18, scope: !679)
!681 = !DILocation(line: 139, column: 56, scope: !682)
!682 = distinct !DILexicalBlock(scope: !678, file: !104, line: 139, column: 18)
!683 = !DILocation(line: 141, column: 14, scope: !684)
!684 = distinct !DILexicalBlock(scope: !682, file: !104, line: 140, column: 18)
!685 = !DILocation(line: 137, column: 28, scope: !669)
!686 = distinct !{!686, !671, !687, !501}
!687 = !DILocation(line: 142, column: 7, scope: !670)
!688 = !DILocation(line: 143, column: 19, scope: !689)
!689 = distinct !DILexicalBlock(scope: !582, file: !104, line: 143, column: 11)
!690 = !DILocation(line: 143, column: 29, scope: !689)
!691 = !DILocation(line: 143, column: 39, scope: !689)
!692 = !DILocation(line: 143, column: 43, scope: !689)
!693 = !DILocation(line: 143, column: 46, scope: !689)
!694 = !DILocation(line: 143, column: 50, scope: !689)
!695 = !{!622, !437, i64 16}
!696 = !DILocation(line: 143, column: 11, scope: !582)
!697 = !DILocation(line: 143, column: 55, scope: !689)
!698 = !DILocation(line: 145, column: 17, scope: !580)
!699 = !DILocation(line: 146, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !580, file: !104, line: 146, column: 9)
!701 = !DILocation(line: 147, column: 40, scope: !580)
!702 = !{!622, !444, i64 56}
!703 = !DILocation(line: 146, column: 59, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !104, line: 146, column: 34)
!705 = distinct !DILexicalBlock(scope: !700, file: !104, line: 146, column: 9)
!706 = !{!476, !476, i64 0}
!707 = !DILocation(line: 146, column: 55, scope: !704)
!708 = !DILocation(line: 146, column: 57, scope: !704)
!709 = !{!710, !476, i64 0}
!710 = !{!"", !476, i64 0, !436, i64 8}
!711 = !DILocation(line: 146, column: 94, scope: !704)
!712 = !DILocation(line: 146, column: 90, scope: !704)
!713 = !DILocation(line: 146, column: 92, scope: !704)
!714 = !{!710, !436, i64 8}
!715 = !DILocation(line: 146, column: 30, scope: !705)
!716 = distinct !{!716, !699, !717, !501}
!717 = !DILocation(line: 146, column: 109, scope: !700)
!718 = !DILocation(line: 147, column: 56, scope: !580)
!719 = !{!622, !444, i64 64}
!720 = !DILocation(line: 147, column: 75, scope: !580)
!721 = !DILocation(line: 147, column: 91, scope: !580)
!722 = !DILocation(line: 147, column: 124, scope: !580)
!723 = !DILocation(line: 147, column: 16, scope: !580)
!724 = !DILocation(line: 0, scope: !579)
!725 = !DILocation(line: 147, column: 133, scope: !726)
!726 = distinct !DILexicalBlock(scope: !579, file: !104, line: 147, column: 133)
!727 = !DILocation(line: 147, column: 133, scope: !579)
!728 = !DILocation(line: 148, column: 18, scope: !586)
!729 = !DILocation(line: 148, column: 18, scope: !581)
!730 = !DILocation(line: 149, column: 36, scope: !585)
!731 = !DILocation(line: 149, column: 56, scope: !585)
!732 = !DILocation(line: 149, column: 113, scope: !585)
!733 = !DILocation(line: 149, column: 117, scope: !585)
!734 = !DILocation(line: 149, column: 16, scope: !585)
!735 = !DILocation(line: 0, scope: !584)
!736 = !DILocation(line: 149, column: 126, scope: !737)
!737 = distinct !DILexicalBlock(scope: !584, file: !104, line: 149, column: 126)
!738 = !DILocation(line: 149, column: 126, scope: !584)
!739 = !DILocation(line: 150, column: 18, scope: !590)
!740 = !DILocation(line: 150, column: 18, scope: !586)
!741 = !DILocation(line: 151, column: 36, scope: !589)
!742 = !DILocation(line: 151, column: 56, scope: !589)
!743 = !DILocation(line: 151, column: 113, scope: !589)
!744 = !DILocation(line: 151, column: 117, scope: !589)
!745 = !DILocation(line: 151, column: 16, scope: !589)
!746 = !DILocation(line: 0, scope: !588)
!747 = !DILocation(line: 151, column: 126, scope: !748)
!748 = distinct !DILexicalBlock(scope: !588, file: !104, line: 151, column: 126)
!749 = !DILocation(line: 151, column: 126, scope: !588)
!750 = !DILocation(line: 153, column: 36, scope: !593)
!751 = !DILocation(line: 153, column: 44, scope: !593)
!752 = !DILocation(line: 153, column: 86, scope: !593)
!753 = !DILocation(line: 153, column: 90, scope: !593)
!754 = !DILocation(line: 153, column: 16, scope: !593)
!755 = !DILocation(line: 0, scope: !592)
!756 = !DILocation(line: 153, column: 99, scope: !757)
!757 = distinct !DILexicalBlock(scope: !592, file: !104, line: 153, column: 99)
!758 = !DILocation(line: 153, column: 99, scope: !592)
!759 = !DILocation(line: 156, column: 5, scope: !551)
!760 = !DILocation(line: 156, column: 9, scope: !551)
!761 = !DILocation(line: 156, column: 19, scope: !551)
!762 = !{!622, !437, i64 72}
!763 = !DILocation(line: 157, column: 9, scope: !551)
!764 = !DILocation(line: 157, column: 19, scope: !551)
!765 = !DILocation(line: 158, column: 12, scope: !551)
!766 = !DILocation(line: 0, scope: !595)
!767 = !DILocation(line: 158, column: 54, scope: !768)
!768 = distinct !DILexicalBlock(scope: !595, file: !104, line: 158, column: 54)
!769 = !DILocation(line: 158, column: 54, scope: !595)
!770 = !DILocation(line: 159, column: 3, scope: !552)
!771 = !DILocation(line: 160, column: 12, scope: !598)
!772 = !DILocation(line: 0, scope: !597)
!773 = !DILocation(line: 160, column: 41, scope: !774)
!774 = distinct !DILexicalBlock(scope: !597, file: !104, line: 160, column: 41)
!775 = !DILocation(line: 160, column: 41, scope: !597)
!776 = !DILocation(line: 162, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !104, line: 162, column: 3)
!778 = distinct !DILexicalBlock(scope: !779, file: !104, line: 162, column: 3)
!779 = distinct !DILexicalBlock(scope: !541, file: !104, line: 162, column: 3)
!780 = !DILocation(line: 162, column: 3, scope: !778)
!781 = !DILocation(line: 162, column: 3, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !104, line: 162, column: 3)
!783 = distinct !DILexicalBlock(scope: !777, file: !104, line: 162, column: 3)
!784 = !DILocation(line: 162, column: 3, scope: !783)
!785 = !DILocation(line: 162, column: 3, scope: !786)
!786 = distinct !DILexicalBlock(scope: !787, file: !104, line: 162, column: 3)
!787 = distinct !DILexicalBlock(scope: !782, file: !104, line: 162, column: 3)
!788 = !DILocation(line: 162, column: 3, scope: !787)
!789 = !DILocation(line: 162, column: 3, scope: !790)
!790 = distinct !DILexicalBlock(scope: !786, file: !104, line: 162, column: 3)
!791 = !DILocation(line: 162, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !782, file: !104, line: 162, column: 3)
!793 = !DILocation(line: 162, column: 3, scope: !794)
!794 = distinct !DILexicalBlock(scope: !792, file: !104, line: 162, column: 3)
!795 = !DILocation(line: 162, column: 3, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !104, line: 162, column: 3)
!797 = distinct !DILexicalBlock(scope: !794, file: !104, line: 162, column: 3)
!798 = !DILocation(line: 162, column: 3, scope: !797)
!799 = !DILocation(line: 162, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !796, file: !104, line: 162, column: 3)
!801 = !DILocation(line: 163, column: 1, scope: !541)
!802 = distinct !DISubprogram(name: "PetscSplitReductionGet", scope: !104, file: !104, line: 298, type: !803, scopeLine: 299, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !806)
!803 = !DISubroutineType(types: !804)
!804 = !{!169, !148, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!806 = !{!807, !808, !809, !810, !811, !815, !818, !819, !821, !824, !825, !829, !831, !834, !835}
!807 = !DILocalVariable(name: "comm", arg: 1, scope: !802, file: !104, line: 298, type: !148)
!808 = !DILocalVariable(name: "sr", arg: 2, scope: !802, file: !104, line: 298, type: !805)
!809 = !DILocalVariable(name: "ierr", scope: !802, file: !104, line: 300, type: !169)
!810 = !DILocalVariable(name: "flag", scope: !802, file: !104, line: 301, type: !110)
!811 = !DILocalVariable(name: "_7_errorcode", scope: !812, file: !104, line: 312, type: !169)
!812 = distinct !DILexicalBlock(scope: !813, file: !104, line: 312, column: 106)
!813 = distinct !DILexicalBlock(scope: !814, file: !104, line: 304, column: 53)
!814 = distinct !DILexicalBlock(scope: !802, file: !104, line: 304, column: 7)
!815 = !DILocalVariable(name: "_7_errorstring", scope: !816, file: !104, line: 312, type: !570)
!816 = distinct !DILexicalBlock(scope: !817, file: !104, line: 312, column: 106)
!817 = distinct !DILexicalBlock(scope: !812, file: !104, line: 312, column: 106)
!818 = !DILocalVariable(name: "_7_resultlen", scope: !816, file: !104, line: 312, type: !110)
!819 = !DILocalVariable(name: "_7_errorcode", scope: !820, file: !104, line: 314, type: !169)
!820 = distinct !DILexicalBlock(scope: !802, file: !104, line: 314, column: 74)
!821 = !DILocalVariable(name: "_7_errorstring", scope: !822, file: !104, line: 314, type: !570)
!822 = distinct !DILexicalBlock(scope: !823, file: !104, line: 314, column: 74)
!823 = distinct !DILexicalBlock(scope: !820, file: !104, line: 314, column: 74)
!824 = !DILocalVariable(name: "_7_resultlen", scope: !822, file: !104, line: 314, type: !110)
!825 = !DILocalVariable(name: "ierr__", scope: !826, file: !104, line: 316, type: !169)
!826 = distinct !DILexicalBlock(scope: !827, file: !104, line: 316, column: 47)
!827 = distinct !DILexicalBlock(scope: !828, file: !104, line: 315, column: 14)
!828 = distinct !DILexicalBlock(scope: !802, file: !104, line: 315, column: 7)
!829 = !DILocalVariable(name: "_7_errorcode", scope: !830, file: !104, line: 317, type: !169)
!830 = distinct !DILexicalBlock(scope: !827, file: !104, line: 317, column: 63)
!831 = !DILocalVariable(name: "_7_errorstring", scope: !832, file: !104, line: 317, type: !570)
!832 = distinct !DILexicalBlock(scope: !833, file: !104, line: 317, column: 63)
!833 = distinct !DILexicalBlock(scope: !830, file: !104, line: 317, column: 63)
!834 = !DILocalVariable(name: "_7_resultlen", scope: !832, file: !104, line: 317, type: !110)
!835 = !DILocalVariable(name: "ierr__", scope: !836, file: !104, line: 318, type: !169)
!836 = distinct !DILexicalBlock(scope: !827, file: !104, line: 318, column: 83)
!837 = !DILocation(line: 0, scope: !802)
!838 = !DILocation(line: 301, column: 3, scope: !802)
!839 = !DILocation(line: 303, column: 3, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !104, line: 303, column: 3)
!841 = distinct !DILexicalBlock(scope: !842, file: !104, line: 303, column: 3)
!842 = distinct !DILexicalBlock(scope: !802, file: !104, line: 303, column: 3)
!843 = !DILocation(line: 303, column: 3, scope: !841)
!844 = !DILocation(line: 303, column: 3, scope: !845)
!845 = distinct !DILexicalBlock(scope: !846, file: !104, line: 303, column: 3)
!846 = distinct !DILexicalBlock(scope: !840, file: !104, line: 303, column: 3)
!847 = !DILocation(line: 303, column: 3, scope: !846)
!848 = !DILocation(line: 303, column: 3, scope: !849)
!849 = distinct !DILexicalBlock(scope: !845, file: !104, line: 303, column: 3)
!850 = !DILocation(line: 304, column: 7, scope: !814)
!851 = !DILocation(line: 304, column: 30, scope: !814)
!852 = !DILocation(line: 304, column: 7, scope: !802)
!853 = !DILocation(line: 312, column: 12, scope: !813)
!854 = !DILocation(line: 0, scope: !812)
!855 = !DILocation(line: 312, column: 106, scope: !817)
!856 = !DILocation(line: 312, column: 106, scope: !812)
!857 = !DILocation(line: 314, column: 33, scope: !802)
!858 = !DILocation(line: 312, column: 106, scope: !816)
!859 = !DILocation(line: 0, scope: !816)
!860 = !DILocation(line: 314, column: 56, scope: !802)
!861 = !DILocation(line: 314, column: 10, scope: !802)
!862 = !DILocation(line: 0, scope: !820)
!863 = !DILocation(line: 314, column: 74, scope: !823)
!864 = !DILocation(line: 314, column: 74, scope: !820)
!865 = !DILocation(line: 314, column: 74, scope: !822)
!866 = !DILocation(line: 0, scope: !822)
!867 = !DILocation(line: 315, column: 8, scope: !828)
!868 = !DILocation(line: 315, column: 7, scope: !802)
!869 = !DILocalVariable(name: "comm", arg: 1, scope: !870, file: !104, line: 43, type: !148)
!870 = distinct !DISubprogram(name: "PetscSplitReductionCreate", scope: !104, file: !104, line: 43, type: !803, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!871 = !{!869, !872, !873, !874, !876, !878}
!872 = !DILocalVariable(name: "sr", arg: 2, scope: !870, file: !104, line: 43, type: !805)
!873 = !DILocalVariable(name: "ierr", scope: !870, file: !104, line: 45, type: !169)
!874 = !DILocalVariable(name: "ierr__", scope: !875, file: !104, line: 48, type: !169)
!875 = distinct !DILexicalBlock(scope: !870, file: !104, line: 48, column: 37)
!876 = !DILocalVariable(name: "ierr__", scope: !877, file: !104, line: 54, type: !169)
!877 = distinct !DILexicalBlock(scope: !870, file: !104, line: 54, column: 186)
!878 = !DILocalVariable(name: "ierr__", scope: !879, file: !104, line: 64, type: !169)
!879 = distinct !DILexicalBlock(scope: !870, file: !104, line: 64, column: 84)
!880 = !DILocation(line: 0, scope: !870, inlinedAt: !881)
!881 = distinct !DILocation(line: 316, column: 12, scope: !827)
!882 = !DILocation(line: 47, column: 3, scope: !883, inlinedAt: !881)
!883 = distinct !DILexicalBlock(scope: !884, file: !104, line: 47, column: 3)
!884 = distinct !DILexicalBlock(scope: !885, file: !104, line: 47, column: 3)
!885 = distinct !DILexicalBlock(scope: !870, file: !104, line: 47, column: 3)
!886 = !DILocation(line: 47, column: 3, scope: !884, inlinedAt: !881)
!887 = !DILocation(line: 47, column: 3, scope: !888, inlinedAt: !881)
!888 = distinct !DILexicalBlock(scope: !889, file: !104, line: 47, column: 3)
!889 = distinct !DILexicalBlock(scope: !883, file: !104, line: 47, column: 3)
!890 = !DILocation(line: 47, column: 3, scope: !889, inlinedAt: !881)
!891 = !DILocation(line: 47, column: 3, scope: !892, inlinedAt: !881)
!892 = distinct !DILexicalBlock(scope: !888, file: !104, line: 47, column: 3)
!893 = !DILocation(line: 48, column: 24, scope: !870, inlinedAt: !881)
!894 = !DILocation(line: 0, scope: !875, inlinedAt: !881)
!895 = !DILocation(line: 48, column: 37, scope: !896, inlinedAt: !881)
!896 = distinct !DILexicalBlock(scope: !875, file: !104, line: 48, column: 37)
!897 = !DILocation(line: 48, column: 37, scope: !875, inlinedAt: !881)
!898 = !DILocation(line: 49, column: 4, scope: !870, inlinedAt: !881)
!899 = !DILocation(line: 51, column: 10, scope: !870, inlinedAt: !881)
!900 = !DILocation(line: 51, column: 22, scope: !870, inlinedAt: !881)
!901 = !DILocation(line: 54, column: 24, scope: !870, inlinedAt: !881)
!902 = !DILocation(line: 0, scope: !877, inlinedAt: !881)
!903 = !DILocation(line: 54, column: 186, scope: !904, inlinedAt: !881)
!904 = distinct !DILexicalBlock(scope: !877, file: !104, line: 54, column: 186)
!905 = !DILocation(line: 54, column: 186, scope: !877, inlinedAt: !881)
!906 = !DILocation(line: 56, column: 4, scope: !870, inlinedAt: !881)
!907 = !DILocation(line: 56, column: 10, scope: !870, inlinedAt: !881)
!908 = !DILocation(line: 56, column: 22, scope: !870, inlinedAt: !881)
!909 = !DILocation(line: 57, column: 4, scope: !870, inlinedAt: !881)
!910 = !DILocation(line: 57, column: 10, scope: !870, inlinedAt: !881)
!911 = !DILocation(line: 57, column: 22, scope: !870, inlinedAt: !881)
!912 = !{!622, !444, i64 8}
!913 = !DILocation(line: 58, column: 4, scope: !870, inlinedAt: !881)
!914 = !DILocation(line: 58, column: 10, scope: !870, inlinedAt: !881)
!915 = !DILocation(line: 58, column: 22, scope: !870, inlinedAt: !881)
!916 = !DILocation(line: 61, column: 10, scope: !870, inlinedAt: !881)
!917 = !DILocation(line: 61, column: 16, scope: !870, inlinedAt: !881)
!918 = !DILocation(line: 64, column: 10, scope: !870, inlinedAt: !881)
!919 = !DILocation(line: 0, scope: !879, inlinedAt: !881)
!920 = !DILocation(line: 64, column: 84, scope: !921, inlinedAt: !881)
!921 = distinct !DILexicalBlock(scope: !879, file: !104, line: 64, column: 84)
!922 = !DILocation(line: 64, column: 84, scope: !879, inlinedAt: !881)
!923 = !DILocation(line: 65, column: 3, scope: !924, inlinedAt: !881)
!924 = distinct !DILexicalBlock(scope: !925, file: !104, line: 65, column: 3)
!925 = distinct !DILexicalBlock(scope: !926, file: !104, line: 65, column: 3)
!926 = distinct !DILexicalBlock(scope: !870, file: !104, line: 65, column: 3)
!927 = !DILocation(line: 65, column: 3, scope: !925, inlinedAt: !881)
!928 = !DILocation(line: 65, column: 3, scope: !929, inlinedAt: !881)
!929 = distinct !DILexicalBlock(scope: !930, file: !104, line: 65, column: 3)
!930 = distinct !DILexicalBlock(scope: !924, file: !104, line: 65, column: 3)
!931 = !DILocation(line: 65, column: 3, scope: !930, inlinedAt: !881)
!932 = !DILocation(line: 65, column: 3, scope: !933, inlinedAt: !881)
!933 = distinct !DILexicalBlock(scope: !934, file: !104, line: 65, column: 3)
!934 = distinct !DILexicalBlock(scope: !929, file: !104, line: 65, column: 3)
!935 = !DILocation(line: 65, column: 3, scope: !934, inlinedAt: !881)
!936 = !DILocation(line: 65, column: 3, scope: !937, inlinedAt: !881)
!937 = distinct !DILexicalBlock(scope: !933, file: !104, line: 65, column: 3)
!938 = !DILocation(line: 65, column: 3, scope: !939, inlinedAt: !881)
!939 = distinct !DILexicalBlock(scope: !929, file: !104, line: 65, column: 3)
!940 = !DILocation(line: 65, column: 3, scope: !941, inlinedAt: !881)
!941 = distinct !DILexicalBlock(scope: !939, file: !104, line: 65, column: 3)
!942 = !DILocation(line: 65, column: 3, scope: !943, inlinedAt: !881)
!943 = distinct !DILexicalBlock(scope: !944, file: !104, line: 65, column: 3)
!944 = distinct !DILexicalBlock(scope: !941, file: !104, line: 65, column: 3)
!945 = !DILocation(line: 65, column: 3, scope: !944, inlinedAt: !881)
!946 = !DILocation(line: 65, column: 3, scope: !947, inlinedAt: !881)
!947 = distinct !DILexicalBlock(scope: !943, file: !104, line: 65, column: 3)
!948 = !DILocation(line: 0, scope: !826)
!949 = !DILocation(line: 316, column: 47, scope: !950)
!950 = distinct !DILexicalBlock(scope: !826, file: !104, line: 316, column: 47)
!951 = !DILocation(line: 316, column: 47, scope: !826)
!952 = !DILocation(line: 317, column: 35, scope: !827)
!953 = !DILocation(line: 317, column: 58, scope: !827)
!954 = !DILocation(line: 317, column: 12, scope: !827)
!955 = !DILocation(line: 0, scope: !830)
!956 = !DILocation(line: 317, column: 63, scope: !833)
!957 = !DILocation(line: 317, column: 63, scope: !830)
!958 = !DILocation(line: 317, column: 63, scope: !832)
!959 = !DILocation(line: 0, scope: !832)
!960 = !DILocation(line: 318, column: 12, scope: !827)
!961 = !DILocation(line: 0, scope: !836)
!962 = !DILocation(line: 318, column: 83, scope: !963)
!963 = distinct !DILexicalBlock(scope: !836, file: !104, line: 318, column: 83)
!964 = !DILocation(line: 318, column: 83, scope: !836)
!965 = !DILocation(line: 320, column: 3, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !104, line: 320, column: 3)
!967 = distinct !DILexicalBlock(scope: !968, file: !104, line: 320, column: 3)
!968 = distinct !DILexicalBlock(scope: !802, file: !104, line: 320, column: 3)
!969 = !DILocation(line: 320, column: 3, scope: !967)
!970 = !DILocation(line: 320, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !104, line: 320, column: 3)
!972 = distinct !DILexicalBlock(scope: !966, file: !104, line: 320, column: 3)
!973 = !DILocation(line: 320, column: 3, scope: !972)
!974 = !DILocation(line: 320, column: 3, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !104, line: 320, column: 3)
!976 = distinct !DILexicalBlock(scope: !971, file: !104, line: 320, column: 3)
!977 = !DILocation(line: 320, column: 3, scope: !976)
!978 = !DILocation(line: 320, column: 3, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !104, line: 320, column: 3)
!980 = !DILocation(line: 320, column: 3, scope: !981)
!981 = distinct !DILexicalBlock(scope: !971, file: !104, line: 320, column: 3)
!982 = !DILocation(line: 320, column: 3, scope: !983)
!983 = distinct !DILexicalBlock(scope: !981, file: !104, line: 320, column: 3)
!984 = !DILocation(line: 320, column: 3, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !104, line: 320, column: 3)
!986 = distinct !DILexicalBlock(scope: !983, file: !104, line: 320, column: 3)
!987 = !DILocation(line: 320, column: 3, scope: !986)
!988 = !DILocation(line: 320, column: 3, scope: !989)
!989 = distinct !DILexicalBlock(scope: !985, file: !104, line: 320, column: 3)
!990 = !DILocation(line: 321, column: 1, scope: !802)
!991 = !DISubprogram(name: "PetscError", scope: !23, file: !23, line: 668, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!992 = !DISubroutineType(types: !993)
!993 = !{!169, !149, !111, !151, !151, !111, !22, !151, null}
!994 = !DISubprogram(name: "MPI_Comm_size", scope: !114, file: !114, line: 1331, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!995 = !DISubroutineType(types: !996)
!996 = !{!111, !149, !532}
!997 = !DISubprogram(name: "MPI_Error_string", scope: !114, file: !114, line: 1357, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !533)
!998 = !DISubroutineType(types: !999)
!999 = !{!111, !111, !232, !532}
!1000 = distinct !DISubprogram(name: "PetscMemcpy", scope: !535, file: !535, line: 1792, type: !1001, scopeLine: 1793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1005)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!169, !108, !1003, !314}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011}
!1006 = !DILocalVariable(name: "a", arg: 1, scope: !1000, file: !535, line: 1792, type: !108)
!1007 = !DILocalVariable(name: "b", arg: 2, scope: !1000, file: !535, line: 1792, type: !1003)
!1008 = !DILocalVariable(name: "n", arg: 3, scope: !1000, file: !535, line: 1792, type: !314)
!1009 = !DILocalVariable(name: "al", scope: !1000, file: !535, line: 1795, type: !314)
!1010 = !DILocalVariable(name: "bl", scope: !1000, file: !535, line: 1795, type: !314)
!1011 = !DILocalVariable(name: "nl", scope: !1000, file: !535, line: 1796, type: !314)
!1012 = !DILocation(line: 0, scope: !1000)
!1013 = !DILocation(line: 1795, column: 15, scope: !1000)
!1014 = !DILocation(line: 1795, column: 31, scope: !1000)
!1015 = !DILocation(line: 1797, column: 3, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !535, line: 1797, column: 3)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !535, line: 1797, column: 3)
!1018 = distinct !DILexicalBlock(scope: !1000, file: !535, line: 1797, column: 3)
!1019 = !DILocation(line: 1797, column: 3, scope: !1017)
!1020 = !DILocation(line: 1797, column: 3, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !535, line: 1797, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1016, file: !535, line: 1797, column: 3)
!1023 = !DILocation(line: 1797, column: 3, scope: !1022)
!1024 = !DILocation(line: 1797, column: 3, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !535, line: 1797, column: 3)
!1026 = !DILocation(line: 1798, column: 9, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1000, file: !535, line: 1798, column: 7)
!1028 = !DILocation(line: 1798, column: 13, scope: !1027)
!1029 = !DILocation(line: 1798, column: 20, scope: !1027)
!1030 = !DILocation(line: 1799, column: 13, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1000, file: !535, line: 1799, column: 7)
!1032 = !DILocation(line: 1799, column: 20, scope: !1031)
!1033 = !DILocation(line: 1803, column: 9, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1000, file: !535, line: 1803, column: 7)
!1035 = !DILocation(line: 1803, column: 14, scope: !1034)
!1036 = !DILocation(line: 1805, column: 13, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !535, line: 1805, column: 9)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !535, line: 1803, column: 24)
!1039 = !DILocation(line: 1805, column: 18, scope: !1037)
!1040 = !DILocation(line: 1805, column: 57, scope: !1037)
!1041 = !DILocation(line: 1828, column: 5, scope: !1038)
!1042 = !DILocation(line: 1831, column: 3, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !535, line: 1831, column: 3)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !535, line: 1831, column: 3)
!1045 = distinct !DILexicalBlock(scope: !1000, file: !535, line: 1831, column: 3)
!1046 = !DILocation(line: 1830, column: 3, scope: !1038)
!1047 = !DILocation(line: 1831, column: 3, scope: !1044)
!1048 = !DILocation(line: 1831, column: 3, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !535, line: 1831, column: 3)
!1050 = distinct !DILexicalBlock(scope: !1043, file: !535, line: 1831, column: 3)
!1051 = !DILocation(line: 1831, column: 3, scope: !1050)
!1052 = !DILocation(line: 1831, column: 3, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !535, line: 1831, column: 3)
!1054 = distinct !DILexicalBlock(scope: !1049, file: !535, line: 1831, column: 3)
!1055 = !DILocation(line: 1831, column: 3, scope: !1054)
!1056 = !DILocation(line: 1831, column: 3, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1053, file: !535, line: 1831, column: 3)
!1058 = !DILocation(line: 1831, column: 3, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1049, file: !535, line: 1831, column: 3)
!1060 = !DILocation(line: 1831, column: 3, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1059, file: !535, line: 1831, column: 3)
!1062 = !DILocation(line: 1831, column: 3, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !535, line: 1831, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1061, file: !535, line: 1831, column: 3)
!1065 = !DILocation(line: 1831, column: 3, scope: !1064)
!1066 = !DILocation(line: 1831, column: 3, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1063, file: !535, line: 1831, column: 3)
!1068 = !DILocation(line: 1832, column: 1, scope: !1000)
!1069 = distinct !DISubprogram(name: "MPIPetsc_Iallreduce", scope: !104, file: !104, line: 24, type: !1070, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1073)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!169, !108, !108, !110, !113, !348, !148, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1084, !1087}
!1074 = !DILocalVariable(name: "sendbuf", arg: 1, scope: !1069, file: !104, line: 24, type: !108)
!1075 = !DILocalVariable(name: "recvbuf", arg: 2, scope: !1069, file: !104, line: 24, type: !108)
!1076 = !DILocalVariable(name: "count", arg: 3, scope: !1069, file: !104, line: 24, type: !110)
!1077 = !DILocalVariable(name: "datatype", arg: 4, scope: !1069, file: !104, line: 24, type: !113)
!1078 = !DILocalVariable(name: "op", arg: 5, scope: !1069, file: !104, line: 24, type: !348)
!1079 = !DILocalVariable(name: "comm", arg: 6, scope: !1069, file: !104, line: 24, type: !148)
!1080 = !DILocalVariable(name: "request", arg: 7, scope: !1069, file: !104, line: 24, type: !1072)
!1081 = !DILocalVariable(name: "ierr", scope: !1069, file: !104, line: 26, type: !169)
!1082 = !DILocalVariable(name: "_7_errorcode", scope: !1083, file: !104, line: 30, type: !169)
!1083 = distinct !DILexicalBlock(scope: !1069, file: !104, line: 30, column: 73)
!1084 = !DILocalVariable(name: "_7_errorstring", scope: !1085, file: !104, line: 30, type: !570)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !104, line: 30, column: 73)
!1086 = distinct !DILexicalBlock(scope: !1083, file: !104, line: 30, column: 73)
!1087 = !DILocalVariable(name: "_7_resultlen", scope: !1085, file: !104, line: 30, type: !110)
!1088 = !DILocation(line: 0, scope: !1069)
!1089 = !DILocation(line: 28, column: 3, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !104, line: 28, column: 3)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !104, line: 28, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1069, file: !104, line: 28, column: 3)
!1093 = !DILocation(line: 28, column: 3, scope: !1091)
!1094 = !DILocation(line: 28, column: 3, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !104, line: 28, column: 3)
!1096 = distinct !DILexicalBlock(scope: !1090, file: !104, line: 28, column: 3)
!1097 = !DILocation(line: 28, column: 3, scope: !1096)
!1098 = !DILocation(line: 28, column: 3, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !104, line: 28, column: 3)
!1100 = !DILocation(line: 30, column: 10, scope: !1069)
!1101 = !DILocation(line: 0, scope: !1083)
!1102 = !DILocation(line: 30, column: 73, scope: !1086)
!1103 = !DILocation(line: 30, column: 73, scope: !1083)
!1104 = !DILocation(line: 30, column: 73, scope: !1085)
!1105 = !DILocation(line: 0, scope: !1085)
!1106 = !DILocation(line: 35, column: 3, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !104, line: 35, column: 3)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !104, line: 35, column: 3)
!1109 = distinct !DILexicalBlock(scope: !1069, file: !104, line: 35, column: 3)
!1110 = !DILocation(line: 35, column: 3, scope: !1108)
!1111 = !DILocation(line: 35, column: 3, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !104, line: 35, column: 3)
!1113 = distinct !DILexicalBlock(scope: !1107, file: !104, line: 35, column: 3)
!1114 = !DILocation(line: 35, column: 3, scope: !1113)
!1115 = !DILocation(line: 35, column: 3, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !104, line: 35, column: 3)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !104, line: 35, column: 3)
!1118 = !DILocation(line: 35, column: 3, scope: !1117)
!1119 = !DILocation(line: 35, column: 3, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1116, file: !104, line: 35, column: 3)
!1121 = !DILocation(line: 35, column: 3, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1112, file: !104, line: 35, column: 3)
!1123 = !DILocation(line: 35, column: 3, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1122, file: !104, line: 35, column: 3)
!1125 = !DILocation(line: 35, column: 3, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !104, line: 35, column: 3)
!1127 = distinct !DILexicalBlock(scope: !1124, file: !104, line: 35, column: 3)
!1128 = !DILocation(line: 35, column: 3, scope: !1127)
!1129 = !DILocation(line: 35, column: 3, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !104, line: 35, column: 3)
!1131 = !DILocation(line: 36, column: 1, scope: !1069)
!1132 = distinct !DISubprogram(name: "PetscSplitReductionApply", scope: !104, file: !104, line: 196, type: !366, scopeLine: 197, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1154, !1155, !1159, !1164, !1168, !1169, !1171, !1174, !1175, !1177, !1180, !1181, !1183, !1186, !1187, !1191, !1192, !1193, !1195, !1198, !1199, !1201, !1204, !1205, !1207, !1210, !1211, !1215, !1216, !1217, !1219, !1222, !1223, !1225, !1228, !1229, !1231, !1234, !1235, !1238, !1239, !1240, !1242, !1245, !1246, !1248, !1251, !1252, !1254, !1257, !1258}
!1134 = !DILocalVariable(name: "sr", arg: 1, scope: !1132, file: !104, line: 196, type: !368)
!1135 = !DILocalVariable(name: "ierr", scope: !1132, file: !104, line: 198, type: !169)
!1136 = !DILocalVariable(name: "i", scope: !1132, file: !104, line: 199, type: !125)
!1137 = !DILocalVariable(name: "numops", scope: !1132, file: !104, line: 199, type: !125)
!1138 = !DILocalVariable(name: "reducetype", scope: !1132, file: !104, line: 199, type: !250)
!1139 = !DILocalVariable(name: "lvalues", scope: !1132, file: !104, line: 200, type: !266)
!1140 = !DILocalVariable(name: "gvalues", scope: !1132, file: !104, line: 200, type: !266)
!1141 = !DILocalVariable(name: "sum_flg", scope: !1132, file: !104, line: 201, type: !125)
!1142 = !DILocalVariable(name: "max_flg", scope: !1132, file: !104, line: 201, type: !125)
!1143 = !DILocalVariable(name: "min_flg", scope: !1132, file: !104, line: 201, type: !125)
!1144 = !DILocalVariable(name: "comm", scope: !1132, file: !104, line: 202, type: !148)
!1145 = !DILocalVariable(name: "size", scope: !1132, file: !104, line: 203, type: !110)
!1146 = !DILocalVariable(name: "cmul", scope: !1132, file: !104, line: 203, type: !110)
!1147 = !DILocalVariable(name: "ierr__", scope: !1148, file: !104, line: 207, type: !169)
!1148 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 207, column: 62)
!1149 = !DILocalVariable(name: "_7_errorcode", scope: !1150, file: !104, line: 208, type: !169)
!1150 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 208, column: 40)
!1151 = !DILocalVariable(name: "_7_errorstring", scope: !1152, file: !104, line: 208, type: !570)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !104, line: 208, column: 40)
!1153 = distinct !DILexicalBlock(scope: !1150, file: !104, line: 208, column: 40)
!1154 = !DILocalVariable(name: "_7_resultlen", scope: !1152, file: !104, line: 208, type: !110)
!1155 = !DILocalVariable(name: "ierr__", scope: !1156, file: !104, line: 210, type: !169)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !104, line: 210, column: 50)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !104, line: 209, column: 18)
!1158 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 209, column: 7)
!1159 = !DILocalVariable(name: "_4_ierr", scope: !1160, file: !104, line: 222, type: !169)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !104, line: 222, column: 14)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !104, line: 219, column: 42)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !104, line: 219, column: 9)
!1163 = distinct !DILexicalBlock(scope: !1158, file: !104, line: 211, column: 10)
!1164 = !DILocalVariable(name: "a_b1", scope: !1160, file: !104, line: 222, type: !1165)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 192, elements: !1166)
!1166 = !{!1167}
!1167 = !DISubrange(count: 6)
!1168 = !DILocalVariable(name: "a_b2", scope: !1160, file: !104, line: 222, type: !1165)
!1169 = !DILocalVariable(name: "_7_errorcode", scope: !1170, file: !104, line: 222, type: !169)
!1170 = distinct !DILexicalBlock(scope: !1160, file: !104, line: 222, column: 14)
!1171 = !DILocalVariable(name: "_7_errorstring", scope: !1172, file: !104, line: 222, type: !570)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !104, line: 222, column: 14)
!1173 = distinct !DILexicalBlock(scope: !1170, file: !104, line: 222, column: 14)
!1174 = !DILocalVariable(name: "_7_resultlen", scope: !1172, file: !104, line: 222, type: !110)
!1175 = !DILocalVariable(name: "_7_errorcode", scope: !1176, file: !104, line: 222, type: !169)
!1176 = distinct !DILexicalBlock(scope: !1160, file: !104, line: 222, column: 14)
!1177 = !DILocalVariable(name: "_7_errorstring", scope: !1178, file: !104, line: 222, type: !570)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !104, line: 222, column: 14)
!1179 = distinct !DILexicalBlock(scope: !1176, file: !104, line: 222, column: 14)
!1180 = !DILocalVariable(name: "_7_resultlen", scope: !1178, file: !104, line: 222, type: !110)
!1181 = !DILocalVariable(name: "_7_errorcode", scope: !1182, file: !104, line: 222, type: !169)
!1182 = distinct !DILexicalBlock(scope: !1161, file: !104, line: 222, column: 113)
!1183 = !DILocalVariable(name: "_7_errorstring", scope: !1184, file: !104, line: 222, type: !570)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !104, line: 222, column: 113)
!1185 = distinct !DILexicalBlock(scope: !1182, file: !104, line: 222, column: 113)
!1186 = !DILocalVariable(name: "_7_resultlen", scope: !1184, file: !104, line: 222, type: !110)
!1187 = !DILocalVariable(name: "_4_ierr", scope: !1188, file: !104, line: 225, type: !169)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !104, line: 225, column: 14)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !104, line: 224, column: 25)
!1190 = distinct !DILexicalBlock(scope: !1162, file: !104, line: 224, column: 16)
!1191 = !DILocalVariable(name: "a_b1", scope: !1188, file: !104, line: 225, type: !1165)
!1192 = !DILocalVariable(name: "a_b2", scope: !1188, file: !104, line: 225, type: !1165)
!1193 = !DILocalVariable(name: "_7_errorcode", scope: !1194, file: !104, line: 225, type: !169)
!1194 = distinct !DILexicalBlock(scope: !1188, file: !104, line: 225, column: 14)
!1195 = !DILocalVariable(name: "_7_errorstring", scope: !1196, file: !104, line: 225, type: !570)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !104, line: 225, column: 14)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !104, line: 225, column: 14)
!1198 = !DILocalVariable(name: "_7_resultlen", scope: !1196, file: !104, line: 225, type: !110)
!1199 = !DILocalVariable(name: "_7_errorcode", scope: !1200, file: !104, line: 225, type: !169)
!1200 = distinct !DILexicalBlock(scope: !1188, file: !104, line: 225, column: 14)
!1201 = !DILocalVariable(name: "_7_errorstring", scope: !1202, file: !104, line: 225, type: !570)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !104, line: 225, column: 14)
!1203 = distinct !DILexicalBlock(scope: !1200, file: !104, line: 225, column: 14)
!1204 = !DILocalVariable(name: "_7_resultlen", scope: !1202, file: !104, line: 225, type: !110)
!1205 = !DILocalVariable(name: "_7_errorcode", scope: !1206, file: !104, line: 225, type: !169)
!1206 = distinct !DILexicalBlock(scope: !1189, file: !104, line: 225, column: 106)
!1207 = !DILocalVariable(name: "_7_errorstring", scope: !1208, file: !104, line: 225, type: !570)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !104, line: 225, column: 106)
!1209 = distinct !DILexicalBlock(scope: !1206, file: !104, line: 225, column: 106)
!1210 = !DILocalVariable(name: "_7_resultlen", scope: !1208, file: !104, line: 225, type: !110)
!1211 = !DILocalVariable(name: "_4_ierr", scope: !1212, file: !104, line: 227, type: !169)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !104, line: 227, column: 14)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !104, line: 226, column: 25)
!1214 = distinct !DILexicalBlock(scope: !1190, file: !104, line: 226, column: 16)
!1215 = !DILocalVariable(name: "a_b1", scope: !1212, file: !104, line: 227, type: !1165)
!1216 = !DILocalVariable(name: "a_b2", scope: !1212, file: !104, line: 227, type: !1165)
!1217 = !DILocalVariable(name: "_7_errorcode", scope: !1218, file: !104, line: 227, type: !169)
!1218 = distinct !DILexicalBlock(scope: !1212, file: !104, line: 227, column: 14)
!1219 = !DILocalVariable(name: "_7_errorstring", scope: !1220, file: !104, line: 227, type: !570)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !104, line: 227, column: 14)
!1221 = distinct !DILexicalBlock(scope: !1218, file: !104, line: 227, column: 14)
!1222 = !DILocalVariable(name: "_7_resultlen", scope: !1220, file: !104, line: 227, type: !110)
!1223 = !DILocalVariable(name: "_7_errorcode", scope: !1224, file: !104, line: 227, type: !169)
!1224 = distinct !DILexicalBlock(scope: !1212, file: !104, line: 227, column: 14)
!1225 = !DILocalVariable(name: "_7_errorstring", scope: !1226, file: !104, line: 227, type: !570)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !104, line: 227, column: 14)
!1227 = distinct !DILexicalBlock(scope: !1224, file: !104, line: 227, column: 14)
!1228 = !DILocalVariable(name: "_7_resultlen", scope: !1226, file: !104, line: 227, type: !110)
!1229 = !DILocalVariable(name: "_7_errorcode", scope: !1230, file: !104, line: 227, type: !169)
!1230 = distinct !DILexicalBlock(scope: !1213, file: !104, line: 227, column: 106)
!1231 = !DILocalVariable(name: "_7_errorstring", scope: !1232, file: !104, line: 227, type: !570)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !104, line: 227, column: 106)
!1233 = distinct !DILexicalBlock(scope: !1230, file: !104, line: 227, column: 106)
!1234 = !DILocalVariable(name: "_7_resultlen", scope: !1232, file: !104, line: 227, type: !110)
!1235 = !DILocalVariable(name: "_4_ierr", scope: !1236, file: !104, line: 229, type: !169)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !104, line: 229, column: 14)
!1237 = distinct !DILexicalBlock(scope: !1214, file: !104, line: 228, column: 12)
!1238 = !DILocalVariable(name: "a_b1", scope: !1236, file: !104, line: 229, type: !1165)
!1239 = !DILocalVariable(name: "a_b2", scope: !1236, file: !104, line: 229, type: !1165)
!1240 = !DILocalVariable(name: "_7_errorcode", scope: !1241, file: !104, line: 229, type: !169)
!1241 = distinct !DILexicalBlock(scope: !1236, file: !104, line: 229, column: 14)
!1242 = !DILocalVariable(name: "_7_errorstring", scope: !1243, file: !104, line: 229, type: !570)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !104, line: 229, column: 14)
!1244 = distinct !DILexicalBlock(scope: !1241, file: !104, line: 229, column: 14)
!1245 = !DILocalVariable(name: "_7_resultlen", scope: !1243, file: !104, line: 229, type: !110)
!1246 = !DILocalVariable(name: "_7_errorcode", scope: !1247, file: !104, line: 229, type: !169)
!1247 = distinct !DILexicalBlock(scope: !1236, file: !104, line: 229, column: 14)
!1248 = !DILocalVariable(name: "_7_errorstring", scope: !1249, file: !104, line: 229, type: !570)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !104, line: 229, column: 14)
!1250 = distinct !DILexicalBlock(scope: !1247, file: !104, line: 229, column: 14)
!1251 = !DILocalVariable(name: "_7_resultlen", scope: !1249, file: !104, line: 229, type: !110)
!1252 = !DILocalVariable(name: "_7_errorcode", scope: !1253, file: !104, line: 229, type: !169)
!1253 = distinct !DILexicalBlock(scope: !1237, file: !104, line: 229, column: 79)
!1254 = !DILocalVariable(name: "_7_errorstring", scope: !1255, file: !104, line: 229, type: !570)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !104, line: 229, column: 79)
!1256 = distinct !DILexicalBlock(scope: !1253, file: !104, line: 229, column: 79)
!1257 = !DILocalVariable(name: "_7_resultlen", scope: !1255, file: !104, line: 229, type: !110)
!1258 = !DILocalVariable(name: "ierr__", scope: !1259, file: !104, line: 234, type: !169)
!1259 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 234, column: 60)
!1260 = !DILocation(line: 0, scope: !1132)
!1261 = !DILocation(line: 199, column: 33, scope: !1132)
!1262 = !DILocation(line: 199, column: 63, scope: !1132)
!1263 = !DILocation(line: 200, column: 33, scope: !1132)
!1264 = !DILocation(line: 200, column: 56, scope: !1132)
!1265 = !DILocation(line: 202, column: 33, scope: !1132)
!1266 = !DILocation(line: 203, column: 3, scope: !1132)
!1267 = !DILocation(line: 205, column: 3, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !104, line: 205, column: 3)
!1269 = distinct !DILexicalBlock(scope: !1270, file: !104, line: 205, column: 3)
!1270 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 205, column: 3)
!1271 = !DILocation(line: 205, column: 3, scope: !1269)
!1272 = !DILocation(line: 205, column: 3, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !104, line: 205, column: 3)
!1274 = distinct !DILexicalBlock(scope: !1268, file: !104, line: 205, column: 3)
!1275 = !DILocation(line: 205, column: 3, scope: !1274)
!1276 = !DILocation(line: 205, column: 3, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1273, file: !104, line: 205, column: 3)
!1278 = !DILocation(line: 206, column: 11, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1132, file: !104, line: 206, column: 7)
!1280 = !DILocation(line: 206, column: 21, scope: !1279)
!1281 = !DILocation(line: 206, column: 7, scope: !1132)
!1282 = !DILocation(line: 206, column: 26, scope: !1279)
!1283 = !DILocation(line: 207, column: 10, scope: !1132)
!1284 = !DILocation(line: 0, scope: !1148)
!1285 = !DILocation(line: 207, column: 62, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1148, file: !104, line: 207, column: 62)
!1287 = !DILocation(line: 207, column: 62, scope: !1148)
!1288 = !DILocation(line: 208, column: 28, scope: !1132)
!1289 = !DILocation(line: 208, column: 10, scope: !1132)
!1290 = !DILocation(line: 0, scope: !1150)
!1291 = !DILocation(line: 208, column: 40, scope: !1153)
!1292 = !DILocation(line: 208, column: 40, scope: !1150)
!1293 = !DILocation(line: 208, column: 40, scope: !1152)
!1294 = !DILocation(line: 0, scope: !1152)
!1295 = !DILocation(line: 209, column: 7, scope: !1158)
!1296 = !DILocation(line: 209, column: 12, scope: !1158)
!1297 = !DILocation(line: 209, column: 7, scope: !1132)
!1298 = !DILocation(line: 213, column: 16, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !104, line: 213, column: 5)
!1300 = distinct !DILexicalBlock(scope: !1163, file: !104, line: 213, column: 5)
!1301 = !DILocation(line: 213, column: 5, scope: !1300)
!1302 = !DILocation(line: 210, column: 12, scope: !1157)
!1303 = !DILocation(line: 0, scope: !1156)
!1304 = !DILocation(line: 210, column: 50, scope: !1156)
!1305 = !DILocation(line: 210, column: 50, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1156, file: !104, line: 210, column: 50)
!1307 = !DILocation(line: 214, column: 16, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !104, line: 214, column: 16)
!1309 = distinct !DILexicalBlock(scope: !1299, file: !104, line: 213, column: 30)
!1310 = !DILocation(line: 214, column: 16, scope: !1309)
!1311 = !DILocation(line: 215, column: 54, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1308, file: !104, line: 215, column: 16)
!1313 = !DILocation(line: 217, column: 12, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1312, file: !104, line: 216, column: 16)
!1315 = !DILocation(line: 213, column: 26, scope: !1299)
!1316 = distinct !{!1316, !1301, !1317, !501}
!1317 = !DILocation(line: 218, column: 5, scope: !1300)
!1318 = !DILocation(line: 219, column: 17, scope: !1162)
!1319 = !DILocation(line: 219, column: 27, scope: !1162)
!1320 = !DILocation(line: 219, column: 37, scope: !1162)
!1321 = !DILocation(line: 219, column: 9, scope: !1163)
!1322 = !DILocation(line: 220, column: 15, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1161, file: !104, line: 220, column: 11)
!1324 = !DILocation(line: 220, column: 11, scope: !1323)
!1325 = !DILocation(line: 220, column: 11, scope: !1161)
!1326 = !DILocation(line: 221, column: 7, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1161, file: !104, line: 221, column: 7)
!1328 = !DILocation(line: 220, column: 20, scope: !1323)
!1329 = !DILocation(line: 221, column: 57, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1331, file: !104, line: 221, column: 32)
!1331 = distinct !DILexicalBlock(scope: !1327, file: !104, line: 221, column: 7)
!1332 = !DILocation(line: 221, column: 53, scope: !1330)
!1333 = !DILocation(line: 221, column: 55, scope: !1330)
!1334 = !DILocation(line: 221, column: 92, scope: !1330)
!1335 = !DILocation(line: 221, column: 88, scope: !1330)
!1336 = !DILocation(line: 221, column: 90, scope: !1330)
!1337 = !DILocation(line: 221, column: 28, scope: !1331)
!1338 = distinct !{!1338, !1326, !1339, !501}
!1339 = !DILocation(line: 221, column: 107, scope: !1327)
!1340 = !DILocation(line: 222, column: 14, scope: !1160)
!1341 = !DILocalVariable(name: "comm", arg: 1, scope: !1342, file: !1343, line: 498, type: !148)
