; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/util.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tag", file: !301, line: 69, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcgamgimpl.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!303 = !DIEnumerator(name: "SET1", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "SET2", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "GRAPH", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "GRAPH_MAT", value: 3, isUnsigned: true)
!307 = !DIEnumerator(name: "GRAPH_FILTER", value: 4, isUnsigned: true)
!308 = !DIEnumerator(name: "GRAPH_SQR", value: 5, isUnsigned: true)
!309 = !DIEnumerator(name: "SET4", value: 6, isUnsigned: true)
!310 = !DIEnumerator(name: "SET5", value: 7, isUnsigned: true)
!311 = !DIEnumerator(name: "SET6", value: 8, isUnsigned: true)
!312 = !DIEnumerator(name: "FIND_V", value: 9, isUnsigned: true)
!313 = !DIEnumerator(name: "SET7", value: 10, isUnsigned: true)
!314 = !DIEnumerator(name: "SET8", value: 11, isUnsigned: true)
!315 = !DIEnumerator(name: "SET9", value: 12, isUnsigned: true)
!316 = !DIEnumerator(name: "SET10", value: 13, isUnsigned: true)
!317 = !DIEnumerator(name: "SET11", value: 14, isUnsigned: true)
!318 = !DIEnumerator(name: "SET12", value: 15, isUnsigned: true)
!319 = !DIEnumerator(name: "SET13", value: 16, isUnsigned: true)
!320 = !DIEnumerator(name: "SET14", value: 17, isUnsigned: true)
!321 = !DIEnumerator(name: "SET15", value: 18, isUnsigned: true)
!322 = !DIEnumerator(name: "SET16", value: 19, isUnsigned: true)
!323 = !DIEnumerator(name: "NUM_SET", value: 20, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329, !330}
!326 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!327 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!330 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!331 = !{!332, !350, !431, !506, !371, !540, !421, !72, !397, !458, !394, !403}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !335, line: 73, size: 4480, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !339, !392, !393, !395, !398, !399, !400, !401, !409, !410, !412, !416, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !432, !434, !435, !436, !438, !439, !441, !443, !444, !445, !446, !447, !450, !452, !453, !454, !455, !456, !459, !461, !462, !463, !473, !475, !476, !480, !481, !530, !535, !537, !538, !539}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !334, file: !335, line: 74, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !334, file: !335, line: 75, baseType: !340, size: 448, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 448, elements: !390)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !335, line: 53, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 45, size: 448, elements: !343)
!343 = !{!344, !354, !362, !367, !374, !378, !385}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !342, file: !335, line: 46, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !332, !349}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !351, line: 330, baseType: !352)
!351 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !351, line: 330, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !335, line: 47, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!348, !332, !358}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !359, line: 16, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !359, line: 16, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !335, line: 48, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!348, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !342, file: !335, line: 49, baseType: !368, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!348, !332, !371, !332}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !342, file: !335, line: 50, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!348, !332, !371, !366}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !342, file: !335, line: 51, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!348, !332, !371, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !342, file: !335, line: 52, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!348, !332, !371, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!390 = !{!391}
!391 = !DISubrange(count: 1)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !334, file: !335, line: 76, baseType: !350, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !335, line: 77, baseType: !394, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !334, file: !335, line: 78, baseType: !396, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !397)
!397 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !334, file: !335, line: 78, baseType: !396, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !334, file: !335, line: 78, baseType: !396, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !334, file: !335, line: 78, baseType: !396, size: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !334, file: !335, line: 79, baseType: !402, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !405, line: 27, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !407, line: 43, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!408 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !334, file: !335, line: 80, baseType: !394, size: 32, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !334, file: !335, line: 81, baseType: !411, size: 32, offset: 992)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !334, file: !335, line: 82, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !334, file: !335, line: 83, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !334, file: !335, line: 84, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !334, file: !335, line: 85, baseType: !421, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !334, file: !335, line: 86, baseType: !421, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !334, file: !335, line: 87, baseType: !421, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !334, file: !335, line: 88, baseType: !332, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !334, file: !335, line: 89, baseType: !402, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !335, line: 90, baseType: !421, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !334, file: !335, line: 91, baseType: !421, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !334, file: !335, line: 92, baseType: !394, size: 32, offset: 1664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !334, file: !335, line: 93, baseType: !431, size: 64, offset: 1728)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !335, line: 94, baseType: !433, size: 64, offset: 1792)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !403)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !334, file: !335, line: 95, baseType: !394, size: 32, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !334, file: !335, line: 95, baseType: !394, size: 32, offset: 1888)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !334, file: !335, line: 96, baseType: !437, size: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !334, file: !335, line: 96, baseType: !437, size: 64, offset: 1984)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !334, file: !335, line: 97, baseType: !440, size: 64, offset: 2048)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !334, file: !335, line: 97, baseType: !442, size: 64, offset: 2112)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !334, file: !335, line: 98, baseType: !394, size: 32, offset: 2176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !334, file: !335, line: 98, baseType: !394, size: 32, offset: 2208)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !334, file: !335, line: 99, baseType: !437, size: 64, offset: 2240)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !334, file: !335, line: 99, baseType: !437, size: 64, offset: 2304)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !334, file: !335, line: 100, baseType: !448, size: 64, offset: 2368)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !397)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !334, file: !335, line: 100, baseType: !451, size: 64, offset: 2432)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !334, file: !335, line: 101, baseType: !394, size: 32, offset: 2496)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !334, file: !335, line: 101, baseType: !394, size: 32, offset: 2528)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !334, file: !335, line: 102, baseType: !437, size: 64, offset: 2560)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !334, file: !335, line: 102, baseType: !437, size: 64, offset: 2624)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !334, file: !335, line: 103, baseType: !457, size: 64, offset: 2688)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !449)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !334, file: !335, line: 103, baseType: !460, size: 64, offset: 2752)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !334, file: !335, line: 104, baseType: !389, size: 64, offset: 2816)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !334, file: !335, line: 105, baseType: !394, size: 32, offset: 2880)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !334, file: !335, line: 106, baseType: !464, size: 128, offset: 2944)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 128, elements: !471)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !335, line: 64, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 61, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !467, file: !335, line: 62, baseType: !382, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !467, file: !335, line: 63, baseType: !431, size: 64, offset: 64)
!471 = !{!472}
!472 = !DISubrange(count: 2)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !334, file: !335, line: 107, baseType: !474, size: 64, offset: 3072)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !471)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !334, file: !335, line: 108, baseType: !431, size: 64, offset: 3136)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !334, file: !335, line: 109, baseType: !477, size: 64, offset: 3200)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!348, !431}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !334, file: !335, line: 111, baseType: !394, size: 32, offset: 3264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !334, file: !335, line: 112, baseType: !482, size: 320, offset: 3328)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 320, elements: !528)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!348, !486, !332, !431}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !489)
!489 = !{!490, !491, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !488, file: !10, line: 100, baseType: !394, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 101, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !503, !504, !505, !509, !511, !513, !514, !515}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !494, file: !10, line: 84, baseType: !421, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !494, file: !10, line: 85, baseType: !421, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !10, line: 86, baseType: !431, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !494, file: !10, line: 87, baseType: !413, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !494, file: !10, line: 88, baseType: !501, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !494, file: !10, line: 89, baseType: !373, size: 8, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !494, file: !10, line: 90, baseType: !421, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !494, file: !10, line: 91, baseType: !506, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !507, line: 46, baseType: !508)
!507 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!508 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !494, file: !10, line: 92, baseType: !510, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !10, line: 93, baseType: !512, size: 32, offset: 544)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !10, line: 94, baseType: !492, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !494, file: !10, line: 95, baseType: !421, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !494, file: !10, line: 96, baseType: !431, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !488, file: !10, line: 102, baseType: !421, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !488, file: !10, line: 102, baseType: !421, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !488, file: !10, line: 103, baseType: !421, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !488, file: !10, line: 104, baseType: !350, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !488, file: !10, line: 106, baseType: !332, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !488, file: !10, line: 107, baseType: !525, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!528 = !{!529}
!529 = !DISubrange(count: 5)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !334, file: !335, line: 113, baseType: !531, size: 320, offset: 3648)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 320, elements: !528)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!348, !332, !431}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !334, file: !335, line: 114, baseType: !536, size: 320, offset: 3968)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 320, elements: !528)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !334, file: !335, line: 115, baseType: !510, size: 32, offset: 4288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !334, file: !335, line: 120, baseType: !525, size: 64, offset: 4352)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !334, file: !335, line: 121, baseType: !510, size: 32, offset: 4416)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !542, line: 70, baseType: !543)
!542 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 34, size: 1344, elements: !544)
!544 = !{!545, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1340, !1341, !1342, !1343, !1349, !1350, !1351, !1352, !1353, !1354}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !543, file: !542, line: 35, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !549, line: 436, size: 23424, elements: !550)
!549 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!550 = !{!551, !553, !1060, !1080, !1081, !1082, !1084, !1085, !1086, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1213, !1214, !1230, !1231, !1232, !1233, !1234, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1269, !1289, !1290, !1292, !1293, !1294, !1295, !1296, !1297, !1315, !1316}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !548, file: !549, line: 437, baseType: !552, size: 4480)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !335, line: 122, baseType: !334)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !548, file: !549, line: 437, baseType: !554, size: 9472, offset: 4480)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 9472, elements: !390)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !549, line: 32, size: 9472, elements: !556)
!556 = !{!557, !566, !570, !571, !578, !582, !583, !584, !585, !586, !587, !588, !612, !616, !621, !627, !646, !651, !655, !656, !661, !666, !667, !672, !676, !680, !684, !688, !692, !693, !694, !695, !696, !700, !701, !706, !707, !708, !709, !710, !715, !722, !727, !731, !735, !739, !743, !744, !748, !749, !756, !761, !762, !763, !764, !826, !834, !835, !839, !840, !844, !845, !849, !854, !855, !859, !863, !870, !871, !872, !873, !874, !875, !880, !881, !885, !889, !893, !894, !895, !899, !909, !910, !914, !915, !919, !920, !924, !925, !930, !931, !935, !939, !940, !941, !942, !943, !944, !945, !949, !950, !951, !952, !953, !954, !958, !959, !960, !961, !962, !963, !964, !965, !969, !973, !974, !975, !979, !980, !981, !982, !983, !984, !985, !989, !990, !991, !996, !1000, !1001, !1005, !1006, !1007, !1008, !1034, !1038, !1039, !1040, !1041, !1042, !1046, !1047, !1048, !1049, !1050, !1054, !1058, !1059}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !555, file: !549, line: 34, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!348, !546, !394, !561, !394, !561, !563, !565}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !555, file: !549, line: 35, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!348, !546, !394, !440, !442, !460}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !555, file: !549, line: 36, baseType: !567, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !555, file: !549, line: 37, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!348, !546, !575, !575}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !555, file: !549, line: 38, baseType: !579, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!348, !546, !575, !575, !575}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !555, file: !549, line: 40, baseType: !572, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !555, file: !549, line: 41, baseType: !579, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !555, file: !549, line: 42, baseType: !572, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !555, file: !549, line: 43, baseType: !579, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !555, file: !549, line: 44, baseType: !572, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !555, file: !549, line: 46, baseType: !579, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !555, file: !549, line: 47, baseType: !589, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!348, !546, !592, !592, !596}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !593, line: 11, baseType: !594)
!593 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !593, line: 11, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !599, file: !36, line: 1227, baseType: !449, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !599, file: !36, line: 1228, baseType: !449, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !599, file: !36, line: 1229, baseType: !449, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !599, file: !36, line: 1230, baseType: !449, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !599, file: !36, line: 1231, baseType: !449, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !599, file: !36, line: 1232, baseType: !449, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !599, file: !36, line: 1233, baseType: !449, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !599, file: !36, line: 1234, baseType: !449, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !599, file: !36, line: 1236, baseType: !449, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !599, file: !36, line: 1237, baseType: !449, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !599, file: !36, line: 1238, baseType: !449, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !555, file: !549, line: 48, baseType: !613, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!348, !546, !592, !596}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !555, file: !549, line: 49, baseType: !617, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!348, !546, !575, !449, !620, !449, !394, !394, !575}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !555, file: !549, line: 50, baseType: !622, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!348, !546, !625, !626}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !555, file: !549, line: 52, baseType: !628, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!348, !546, !631, !632}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !634, file: !36, line: 593, baseType: !396, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !634, file: !36, line: 594, baseType: !396, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !634, file: !36, line: 594, baseType: !396, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !634, file: !36, line: 594, baseType: !396, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !634, file: !36, line: 595, baseType: !396, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !634, file: !36, line: 596, baseType: !396, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !634, file: !36, line: 597, baseType: !396, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !634, file: !36, line: 598, baseType: !396, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !634, file: !36, line: 598, baseType: !396, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !634, file: !36, line: 599, baseType: !396, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !555, file: !549, line: 53, baseType: !647, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!348, !546, !546, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !555, file: !549, line: 54, baseType: !652, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!348, !546, !575}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !555, file: !549, line: 55, baseType: !572, size: 64, offset: 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !555, file: !549, line: 56, baseType: !657, size: 64, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!348, !546, !660, !448}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !555, file: !549, line: 58, baseType: !662, size: 64, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!348, !546, !665}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !555, file: !549, line: 59, baseType: !662, size: 64, offset: 1344)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !555, file: !549, line: 60, baseType: !668, size: 64, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!348, !546, !671, !510}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !555, file: !549, line: 61, baseType: !673, size: 64, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!348, !546}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !555, file: !549, line: 63, baseType: !677, size: 64, offset: 1536)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!348, !546, !394, !561, !458, !575, !575}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !555, file: !549, line: 64, baseType: !681, size: 64, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!348, !546, !546, !592, !592, !596}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !555, file: !549, line: 65, baseType: !685, size: 64, offset: 1664)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!348, !546, !546, !596}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !555, file: !549, line: 66, baseType: !689, size: 64, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!348, !546, !546, !592, !596}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !555, file: !549, line: 67, baseType: !685, size: 64, offset: 1792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !555, file: !549, line: 69, baseType: !673, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !555, file: !549, line: 70, baseType: !681, size: 64, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !555, file: !549, line: 71, baseType: !689, size: 64, offset: 1984)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !555, file: !549, line: 72, baseType: !697, size: 64, offset: 2048)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!348, !546, !626}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !555, file: !549, line: 73, baseType: !673, size: 64, offset: 2112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !555, file: !549, line: 75, baseType: !702, size: 64, offset: 2176)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!348, !546, !705, !626}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !555, file: !549, line: 76, baseType: !572, size: 64, offset: 2240)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !555, file: !549, line: 77, baseType: !572, size: 64, offset: 2304)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !555, file: !549, line: 78, baseType: !589, size: 64, offset: 2368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !555, file: !549, line: 79, baseType: !613, size: 64, offset: 2432)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !555, file: !549, line: 81, baseType: !711, size: 64, offset: 2496)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!348, !546, !458, !546, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !555, file: !549, line: 82, baseType: !716, size: 64, offset: 2560)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!348, !546, !394, !719, !719, !625, !721}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !555, file: !549, line: 83, baseType: !723, size: 64, offset: 2624)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!348, !546, !394, !726, !394}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !555, file: !549, line: 84, baseType: !728, size: 64, offset: 2688)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!348, !546, !394, !561, !394, !561, !457}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !555, file: !549, line: 85, baseType: !732, size: 64, offset: 2752)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!348, !546, !546, !714}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !555, file: !549, line: 87, baseType: !736, size: 64, offset: 2816)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!348, !546, !575, !440}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !555, file: !549, line: 88, baseType: !740, size: 64, offset: 2880)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!348, !546, !458}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !555, file: !549, line: 89, baseType: !740, size: 64, offset: 2944)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !555, file: !549, line: 90, baseType: !745, size: 64, offset: 3008)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!348, !546, !575, !565}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !555, file: !549, line: 91, baseType: !677, size: 64, offset: 3072)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !555, file: !549, line: 93, baseType: !750, size: 64, offset: 3136)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!348, !546, !753}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !555, file: !549, line: 94, baseType: !757, size: 64, offset: 3200)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!348, !546, !394, !510, !510, !440, !760, !760, !650}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !555, file: !549, line: 95, baseType: !757, size: 64, offset: 3264)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !555, file: !549, line: 96, baseType: !757, size: 64, offset: 3328)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !555, file: !549, line: 97, baseType: !757, size: 64, offset: 3392)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !555, file: !549, line: 99, baseType: !765, size: 64, offset: 3456)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!348, !546, !768, !771}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !593, line: 51, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !593, line: 51, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !549, line: 609, size: 6208, elements: !774)
!774 = !{!775, !776, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !795, !802, !803, !804, !805, !806, !807, !808, !809, !813, !814, !815, !816, !817, !819, !820, !821, !822, !823, !824, !825}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !773, file: !549, line: 610, baseType: !552, size: 4480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !773, file: !549, line: 610, baseType: !777, size: 32, offset: 4480)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !390)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !773, file: !549, line: 611, baseType: !394, size: 32, offset: 4512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !773, file: !549, line: 611, baseType: !394, size: 32, offset: 4544)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !773, file: !549, line: 611, baseType: !394, size: 32, offset: 4576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !773, file: !549, line: 612, baseType: !394, size: 32, offset: 4608)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !773, file: !549, line: 613, baseType: !394, size: 32, offset: 4640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !773, file: !549, line: 614, baseType: !440, size: 64, offset: 4672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !773, file: !549, line: 615, baseType: !442, size: 64, offset: 4736)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !773, file: !549, line: 616, baseType: !726, size: 64, offset: 4800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !773, file: !549, line: 617, baseType: !440, size: 64, offset: 4864)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !773, file: !549, line: 618, baseType: !788, size: 64, offset: 4928)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !549, line: 602, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 598, size: 128, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !790, file: !549, line: 599, baseType: !394, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !790, file: !549, line: 600, baseType: !394, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !790, file: !549, line: 601, baseType: !457, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !773, file: !549, line: 619, baseType: !796, size: 64, offset: 4992)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !549, line: 607, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 604, size: 128, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !798, file: !549, line: 605, baseType: !394, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !798, file: !549, line: 606, baseType: !457, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !773, file: !549, line: 620, baseType: !457, size: 64, offset: 5056)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !773, file: !549, line: 621, baseType: !449, size: 64, offset: 5120)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !773, file: !549, line: 622, baseType: !449, size: 64, offset: 5184)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !773, file: !549, line: 623, baseType: !575, size: 64, offset: 5248)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !773, file: !549, line: 623, baseType: !575, size: 64, offset: 5312)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !773, file: !549, line: 623, baseType: !575, size: 64, offset: 5376)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !773, file: !549, line: 624, baseType: !510, size: 32, offset: 5440)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !773, file: !549, line: 625, baseType: !810, size: 64, offset: 5504)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!348}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !773, file: !549, line: 626, baseType: !431, size: 64, offset: 5568)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !773, file: !549, line: 627, baseType: !575, size: 64, offset: 5632)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !773, file: !549, line: 628, baseType: !394, size: 32, offset: 5696)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !773, file: !549, line: 629, baseType: !371, size: 64, offset: 5760)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !773, file: !549, line: 630, baseType: !818, size: 32, offset: 5824)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !773, file: !549, line: 631, baseType: !394, size: 32, offset: 5856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !773, file: !549, line: 631, baseType: !394, size: 32, offset: 5888)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !773, file: !549, line: 632, baseType: !510, size: 32, offset: 5920)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !773, file: !549, line: 633, baseType: !510, size: 32, offset: 5952)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !773, file: !549, line: 634, baseType: !382, size: 64, offset: 6016)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !773, file: !549, line: 634, baseType: !431, size: 64, offset: 6080)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !773, file: !549, line: 635, baseType: !402, size: 64, offset: 6144)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !555, file: !549, line: 100, baseType: !827, size: 64, offset: 3520)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!348, !546, !394, !394, !830, !833}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !832)
!832 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !555, file: !549, line: 101, baseType: !673, size: 64, offset: 3584)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !555, file: !549, line: 102, baseType: !836, size: 64, offset: 3648)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!348, !546, !592, !592, !626}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !555, file: !549, line: 103, baseType: !558, size: 64, offset: 3712)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !555, file: !549, line: 105, baseType: !841, size: 64, offset: 3776)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!348, !546, !592, !592, !625, !626}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !555, file: !549, line: 106, baseType: !673, size: 64, offset: 3840)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !555, file: !549, line: 107, baseType: !846, size: 64, offset: 3904)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!348, !546, !358}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !555, file: !549, line: 108, baseType: !850, size: 64, offset: 3968)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!348, !546, !853, !625, !626}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !371)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !555, file: !549, line: 109, baseType: !810, size: 64, offset: 4032)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !555, file: !549, line: 111, baseType: !856, size: 64, offset: 4096)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!348, !546, !546, !546, !449, !546}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !555, file: !549, line: 112, baseType: !860, size: 64, offset: 4160)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!348, !546, !546, !546, !546}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !555, file: !549, line: 113, baseType: !864, size: 64, offset: 4224)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!348, !546, !867, !867}
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !593, line: 30, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !593, line: 30, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !555, file: !549, line: 114, baseType: !558, size: 64, offset: 4288)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !555, file: !549, line: 115, baseType: !677, size: 64, offset: 4352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !555, file: !549, line: 117, baseType: !736, size: 64, offset: 4416)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !555, file: !549, line: 118, baseType: !736, size: 64, offset: 4480)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !555, file: !549, line: 119, baseType: !850, size: 64, offset: 4544)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !555, file: !549, line: 120, baseType: !876, size: 64, offset: 4608)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!348, !546, !879, !650}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !555, file: !549, line: 121, baseType: !810, size: 64, offset: 4672)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !555, file: !549, line: 123, baseType: !882, size: 64, offset: 4736)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!348, !546, !394, !431}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !555, file: !549, line: 124, baseType: !886, size: 64, offset: 4800)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!348, !546, !771, !575, !431}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !555, file: !549, line: 125, baseType: !890, size: 64, offset: 4864)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!348, !486, !546}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !555, file: !549, line: 126, baseType: !572, size: 64, offset: 4928)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !555, file: !549, line: 127, baseType: !572, size: 64, offset: 4992)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !555, file: !549, line: 129, baseType: !896, size: 64, offset: 5056)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!348, !546, !726}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !555, file: !549, line: 130, baseType: !900, size: 64, offset: 5120)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!348, !546, !903, !903}
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !905, file: !60, line: 653, baseType: !394, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !905, file: !60, line: 653, baseType: !575, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !555, file: !549, line: 131, baseType: !900, size: 64, offset: 5184)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !555, file: !549, line: 132, baseType: !911, size: 64, offset: 5248)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!348, !546, !440, !440, !440}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !555, file: !549, line: 133, baseType: !846, size: 64, offset: 5312)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !555, file: !549, line: 135, baseType: !916, size: 64, offset: 5376)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!348, !546, !449, !650}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !555, file: !549, line: 136, baseType: !916, size: 64, offset: 5440)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !555, file: !549, line: 137, baseType: !921, size: 64, offset: 5504)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!348, !546, !650}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !555, file: !549, line: 138, baseType: !558, size: 64, offset: 5568)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !555, file: !549, line: 139, baseType: !926, size: 64, offset: 5632)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!348, !546, !929, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !555, file: !549, line: 141, baseType: !810, size: 64, offset: 5696)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !555, file: !549, line: 142, baseType: !932, size: 64, offset: 5760)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!348, !546, !546, !449, !546}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !555, file: !549, line: 143, baseType: !936, size: 64, offset: 5824)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!348, !546, !546, !546}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !555, file: !549, line: 144, baseType: !810, size: 64, offset: 5888)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !555, file: !549, line: 145, baseType: !932, size: 64, offset: 5952)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !555, file: !549, line: 147, baseType: !936, size: 64, offset: 6016)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !555, file: !549, line: 148, baseType: !810, size: 64, offset: 6080)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !555, file: !549, line: 149, baseType: !932, size: 64, offset: 6144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !555, file: !549, line: 150, baseType: !936, size: 64, offset: 6208)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !555, file: !549, line: 151, baseType: !946, size: 64, offset: 6272)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!348, !546, !510}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !555, file: !549, line: 153, baseType: !673, size: 64, offset: 6336)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !555, file: !549, line: 154, baseType: !673, size: 64, offset: 6400)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !555, file: !549, line: 155, baseType: !673, size: 64, offset: 6464)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !555, file: !549, line: 156, baseType: !673, size: 64, offset: 6528)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !555, file: !549, line: 157, baseType: !846, size: 64, offset: 6592)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !555, file: !549, line: 159, baseType: !955, size: 64, offset: 6656)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!348, !546, !394, !563}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !555, file: !549, line: 160, baseType: !673, size: 64, offset: 6720)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !555, file: !549, line: 161, baseType: !673, size: 64, offset: 6784)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !555, file: !549, line: 162, baseType: !673, size: 64, offset: 6848)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !555, file: !549, line: 163, baseType: !673, size: 64, offset: 6912)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !555, file: !549, line: 165, baseType: !936, size: 64, offset: 6976)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !555, file: !549, line: 166, baseType: !936, size: 64, offset: 7040)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !555, file: !549, line: 167, baseType: !736, size: 64, offset: 7104)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !555, file: !549, line: 168, baseType: !966, size: 64, offset: 7168)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!348, !546, !575, !394}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !555, file: !549, line: 169, baseType: !970, size: 64, offset: 7232)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!348, !546, !650, !440}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !555, file: !549, line: 171, baseType: !697, size: 64, offset: 7296)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !555, file: !549, line: 172, baseType: !673, size: 64, offset: 7360)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !555, file: !549, line: 173, baseType: !976, size: 64, offset: 7424)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!348, !546, !440, !760}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !555, file: !549, line: 174, baseType: !836, size: 64, offset: 7488)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !555, file: !549, line: 175, baseType: !836, size: 64, offset: 7552)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !555, file: !549, line: 177, baseType: !572, size: 64, offset: 7616)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !555, file: !549, line: 178, baseType: !622, size: 64, offset: 7680)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !555, file: !549, line: 179, baseType: !572, size: 64, offset: 7744)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !555, file: !549, line: 180, baseType: !579, size: 64, offset: 7808)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !555, file: !549, line: 181, baseType: !986, size: 64, offset: 7872)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!348, !546, !350, !625, !626}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !555, file: !549, line: 183, baseType: !896, size: 64, offset: 7936)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !555, file: !549, line: 184, baseType: !657, size: 64, offset: 8000)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !555, file: !549, line: 185, baseType: !992, size: 64, offset: 8064)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!348, !546, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !555, file: !549, line: 186, baseType: !997, size: 64, offset: 8128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!348, !546, !394, !561, !457}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !555, file: !549, line: 187, baseType: !716, size: 64, offset: 8192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !555, file: !549, line: 189, baseType: !1002, size: 64, offset: 8256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!348, !546, !394, !394, !440, !563}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !555, file: !549, line: 190, baseType: !810, size: 64, offset: 8320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !555, file: !549, line: 191, baseType: !932, size: 64, offset: 8384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !555, file: !549, line: 192, baseType: !936, size: 64, offset: 8448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !555, file: !549, line: 193, baseType: !1009, size: 64, offset: 8512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!348, !546, !768, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !549, line: 660, size: 5312, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1014, file: !549, line: 661, baseType: !552, size: 4480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1014, file: !549, line: 661, baseType: !777, size: 32, offset: 4480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1014, file: !549, line: 662, baseType: !394, size: 32, offset: 4512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1014, file: !549, line: 662, baseType: !394, size: 32, offset: 4544)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1014, file: !549, line: 662, baseType: !394, size: 32, offset: 4576)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1014, file: !549, line: 663, baseType: !394, size: 32, offset: 4608)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1014, file: !549, line: 664, baseType: !394, size: 32, offset: 4640)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1014, file: !549, line: 665, baseType: !440, size: 64, offset: 4672)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1014, file: !549, line: 666, baseType: !440, size: 64, offset: 4736)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1014, file: !549, line: 667, baseType: !394, size: 32, offset: 4800)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1014, file: !549, line: 668, baseType: !818, size: 32, offset: 4832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1014, file: !549, line: 670, baseType: !440, size: 64, offset: 4864)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1014, file: !549, line: 670, baseType: !440, size: 64, offset: 4928)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1014, file: !549, line: 671, baseType: !440, size: 64, offset: 4992)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1014, file: !549, line: 672, baseType: !440, size: 64, offset: 5056)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1014, file: !549, line: 673, baseType: !440, size: 64, offset: 5120)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1014, file: !549, line: 674, baseType: !394, size: 32, offset: 5184)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1014, file: !549, line: 675, baseType: !440, size: 64, offset: 5248)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !555, file: !549, line: 195, baseType: !1035, size: 64, offset: 8576)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!348, !1012, !546, !546}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !555, file: !549, line: 196, baseType: !1035, size: 64, offset: 8640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !555, file: !549, line: 197, baseType: !810, size: 64, offset: 8704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !555, file: !549, line: 198, baseType: !932, size: 64, offset: 8768)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !555, file: !549, line: 199, baseType: !936, size: 64, offset: 8832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !555, file: !549, line: 201, baseType: !1043, size: 64, offset: 8896)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!348, !546, !394, !394}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !555, file: !549, line: 202, baseType: !711, size: 64, offset: 8960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !555, file: !549, line: 203, baseType: !579, size: 64, offset: 9024)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !555, file: !549, line: 204, baseType: !765, size: 64, offset: 9088)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !555, file: !549, line: 205, baseType: !896, size: 64, offset: 9152)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !555, file: !549, line: 206, baseType: !1051, size: 64, offset: 9216)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!348, !350, !546, !394, !625, !626}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !555, file: !549, line: 208, baseType: !1055, size: 64, offset: 9280)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!348, !394, !721}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !555, file: !549, line: 209, baseType: !936, size: 64, offset: 9344)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !555, file: !549, line: 210, baseType: !728, size: 64, offset: 9408)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !548, file: !549, line: 438, baseType: !1061, size: 64, offset: 13952)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !593, line: 60, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1063, file: !114, line: 241, baseType: !350, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !114, line: 242, baseType: !411, size: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1063, file: !114, line: 243, baseType: !394, size: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1063, file: !114, line: 243, baseType: !394, size: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1063, file: !114, line: 244, baseType: !394, size: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1063, file: !114, line: 244, baseType: !394, size: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1063, file: !114, line: 245, baseType: !440, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1063, file: !114, line: 246, baseType: !510, size: 32, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1063, file: !114, line: 247, baseType: !394, size: 32, offset: 352)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1063, file: !114, line: 251, baseType: !394, size: 32, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1063, file: !114, line: 252, baseType: !867, size: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1063, file: !114, line: 253, baseType: !510, size: 32, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1063, file: !114, line: 254, baseType: !394, size: 32, offset: 544)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1063, file: !114, line: 254, baseType: !394, size: 32, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1063, file: !114, line: 255, baseType: !394, size: 32, offset: 608)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !548, file: !549, line: 438, baseType: !1061, size: 64, offset: 14016)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !548, file: !549, line: 439, baseType: !431, size: 64, offset: 14080)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !548, file: !549, line: 440, baseType: !1083, size: 32, offset: 14144)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !548, file: !549, line: 441, baseType: !510, size: 32, offset: 14176)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !548, file: !549, line: 442, baseType: !510, size: 32, offset: 14208)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !548, file: !549, line: 443, baseType: !1087, size: 448, offset: 14272)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 448, elements: !1089)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !371)
!1089 = !{!1090}
!1090 = !DISubrange(count: 7)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !548, file: !549, line: 444, baseType: !510, size: 32, offset: 14720)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !548, file: !549, line: 445, baseType: !510, size: 32, offset: 14752)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !548, file: !549, line: 446, baseType: !394, size: 32, offset: 14784)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !548, file: !549, line: 447, baseType: !433, size: 64, offset: 14848)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !548, file: !549, line: 448, baseType: !433, size: 64, offset: 14912)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !548, file: !549, line: 449, baseType: !633, size: 640, offset: 14976)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !548, file: !549, line: 450, baseType: !565, size: 32, offset: 15616)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !548, file: !549, line: 451, baseType: !1099, size: 2880, offset: 15680)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !549, line: 318, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !549, line: 319, size: 2880, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1121, !1122, !1127, !1132, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1147, !1148, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1180, !1181, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1204, !1205, !1206, !1210, !1211}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1100, file: !549, line: 320, baseType: !394, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1100, file: !549, line: 321, baseType: !394, size: 32, offset: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1100, file: !549, line: 322, baseType: !394, size: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1100, file: !549, line: 323, baseType: !394, size: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1100, file: !549, line: 324, baseType: !394, size: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1100, file: !549, line: 325, baseType: !394, size: 32, offset: 160)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1100, file: !549, line: 326, baseType: !1109, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !549, line: 293, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !549, line: 295, size: 448, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1111, file: !549, line: 296, baseType: !1109, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1111, file: !549, line: 297, baseType: !457, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1111, file: !549, line: 297, baseType: !457, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1111, file: !549, line: 298, baseType: !440, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1111, file: !549, line: 298, baseType: !440, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1111, file: !549, line: 299, baseType: !394, size: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1111, file: !549, line: 300, baseType: !394, size: 32, offset: 352)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1111, file: !549, line: 301, baseType: !394, size: 32, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1100, file: !549, line: 326, baseType: !1109, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1100, file: !549, line: 328, baseType: !1123, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!348, !546, !1126, !440}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1100, file: !549, line: 329, baseType: !1128, size: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!348, !1126, !1131, !442, !442, !460, !440}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1100, file: !549, line: 330, baseType: !1133, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!348, !1126}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1100, file: !549, line: 331, baseType: !1133, size: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1100, file: !549, line: 334, baseType: !350, size: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1100, file: !549, line: 335, baseType: !411, size: 32, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1100, file: !549, line: 335, baseType: !411, size: 32, offset: 672)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1100, file: !549, line: 336, baseType: !411, size: 32, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1100, file: !549, line: 336, baseType: !411, size: 32, offset: 736)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1100, file: !549, line: 337, baseType: !1143, size: 64, offset: 768)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !351, line: 339, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !351, line: 339, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1100, file: !549, line: 338, baseType: !1143, size: 64, offset: 832)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1100, file: !549, line: 339, baseType: !1149, size: 64, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !351, line: 341, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !351, line: 351, size: 192, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1151, file: !351, line: 354, baseType: !72, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1151, file: !351, line: 355, baseType: !72, size: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1151, file: !351, line: 356, baseType: !72, size: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1151, file: !351, line: 361, baseType: !72, size: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1151, file: !351, line: 362, baseType: !506, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1100, file: !549, line: 340, baseType: !394, size: 32, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1100, file: !549, line: 340, baseType: !394, size: 32, offset: 992)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1100, file: !549, line: 341, baseType: !457, size: 64, offset: 1024)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1100, file: !549, line: 342, baseType: !440, size: 64, offset: 1088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1100, file: !549, line: 343, baseType: !460, size: 64, offset: 1152)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1100, file: !549, line: 344, baseType: !442, size: 64, offset: 1216)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1100, file: !549, line: 345, baseType: !394, size: 32, offset: 1280)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1100, file: !549, line: 346, baseType: !1131, size: 64, offset: 1344)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1100, file: !549, line: 347, baseType: !510, size: 32, offset: 1408)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1100, file: !549, line: 348, baseType: !394, size: 32, offset: 1440)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1100, file: !549, line: 351, baseType: !510, size: 32, offset: 1472)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1100, file: !549, line: 352, baseType: !510, size: 32, offset: 1504)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1100, file: !549, line: 353, baseType: !411, size: 32, offset: 1536)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1100, file: !549, line: 354, baseType: !411, size: 32, offset: 1568)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1100, file: !549, line: 355, baseType: !1131, size: 64, offset: 1600)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1100, file: !549, line: 356, baseType: !1131, size: 64, offset: 1664)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1100, file: !549, line: 357, baseType: !1175, size: 64, offset: 1728)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !549, line: 310, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 308, size: 32, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1177, file: !549, line: 309, baseType: !394, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1100, file: !549, line: 357, baseType: !1175, size: 64, offset: 1792)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1100, file: !549, line: 358, baseType: !1182, size: 64, offset: 1856)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !549, line: 316, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 312, size: 128, elements: !1185)
!1185 = !{!1186, !1187, !1188}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1184, file: !549, line: 313, baseType: !431, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1184, file: !549, line: 314, baseType: !394, size: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1184, file: !549, line: 315, baseType: !373, size: 8, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1100, file: !549, line: 359, baseType: !1182, size: 64, offset: 1920)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1100, file: !549, line: 360, baseType: !1182, size: 64, offset: 1984)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1100, file: !549, line: 361, baseType: !394, size: 32, offset: 2048)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1100, file: !549, line: 362, baseType: !411, size: 32, offset: 2080)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1100, file: !549, line: 363, baseType: !394, size: 32, offset: 2112)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1100, file: !549, line: 364, baseType: !1131, size: 64, offset: 2176)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1100, file: !549, line: 365, baseType: !1149, size: 64, offset: 2240)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1100, file: !549, line: 366, baseType: !411, size: 32, offset: 2304)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1100, file: !549, line: 367, baseType: !411, size: 32, offset: 2336)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1100, file: !549, line: 368, baseType: !1143, size: 64, offset: 2368)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1100, file: !549, line: 369, baseType: !1143, size: 64, offset: 2432)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1100, file: !549, line: 370, baseType: !1201, size: 64, offset: 2496)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1100, file: !549, line: 371, baseType: !1201, size: 64, offset: 2560)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1100, file: !549, line: 372, baseType: !1201, size: 64, offset: 2624)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1100, file: !549, line: 373, baseType: !1207, size: 64, offset: 2688)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !351, line: 331, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !351, line: 331, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1100, file: !549, line: 374, baseType: !506, size: 64, offset: 2752)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1100, file: !549, line: 375, baseType: !1212, size: 64, offset: 2816)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !548, file: !549, line: 451, baseType: !1099, size: 2880, offset: 18560)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !548, file: !549, line: 452, baseType: !1215, size: 64, offset: 21440)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !549, line: 681, size: 4864, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223, !1224, !1225, !1229}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1217, file: !549, line: 682, baseType: !552, size: 4480)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1217, file: !549, line: 682, baseType: !777, size: 32, offset: 4480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1217, file: !549, line: 683, baseType: !510, size: 32, offset: 4512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1217, file: !549, line: 684, baseType: !394, size: 32, offset: 4544)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1217, file: !549, line: 685, baseType: !929, size: 64, offset: 4608)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1217, file: !549, line: 686, baseType: !457, size: 64, offset: 4672)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1217, file: !549, line: 687, baseType: !1226, size: 64, offset: 4736)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!348, !1215, !575, !431}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1217, file: !549, line: 688, baseType: !431, size: 64, offset: 4800)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !548, file: !549, line: 453, baseType: !1215, size: 64, offset: 21504)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !548, file: !549, line: 454, baseType: !1215, size: 64, offset: 21568)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !548, file: !549, line: 455, baseType: !394, size: 32, offset: 21632)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !548, file: !549, line: 456, baseType: !510, size: 32, offset: 21664)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !548, file: !549, line: 457, baseType: !1235, size: 320, offset: 21696)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !549, line: 399, baseType: !1236)
