; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/memory/mem.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/memory/mem.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_communicator_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscMemoryGetCurrentUsage = private unnamed_addr constant [27 x i8] c"PetscMemoryGetCurrentUsage\00", align 1
@.str = private unnamed_addr constant [74 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/memory/mem.c\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"/proc/%d/statm\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@.str.3 = private unnamed_addr constant [57 x i8] c"Unable to access system file %s to get memory usage data\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PetscMemoryCollectMaximumUsage", scope: !2, file: !32, line: 114, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !29, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/memory/mem.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !{!18, !19, !23, !24, !26}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !20, line: 330, baseType: !21)
!20 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !20, line: 330, flags: DIFlagFwdDecl)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !25)
!25 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{!0, !30}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "PetscMemoryMaximumUsage", scope: !2, file: !32, line: 115, type: !24, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/memory/mem.c", directory: "/home/users/ndemeye/xSDK")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!34 = !{i32 7, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{i32 7, !"PIC Level", i32 2}
!38 = !{i32 7, !"uwtable", i32 1}
!39 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!40 = distinct !DISubprogram(name: "PetscMemoryGetCurrentUsage", scope: !32, file: !32, line: 56, type: !41, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !18)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!45 = !{!46, !47, !108, !112, !113, !114}
!46 = !DILocalVariable(name: "mem", arg: 1, scope: !40, file: !32, line: 56, type: !44)
!47 = !DILocalVariable(name: "file", scope: !40, file: !32, line: 67, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !50, line: 7, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 245, size: 1728, elements: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!53 = !{!54, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !75, !76, !77, !78, !82, !84, !86, !90, !93, !95, !96, !97, !98, !99, !103, !104}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !52, line: 246, baseType: !18, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !51, file: !52, line: 251, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !51, file: !52, line: 252, baseType: !56, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !51, file: !52, line: 253, baseType: !56, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !51, file: !52, line: 254, baseType: !56, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !51, file: !52, line: 255, baseType: !56, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !51, file: !52, line: 256, baseType: !56, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !51, file: !52, line: 257, baseType: !56, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !51, file: !52, line: 258, baseType: !56, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !51, file: !52, line: 260, baseType: !56, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !51, file: !52, line: 261, baseType: !56, size: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !51, file: !52, line: 262, baseType: !56, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !51, file: !52, line: 264, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !52, line: 160, size: 192, elements: !70)
!70 = !{!71, !72, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !69, file: !52, line: 161, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !69, file: !52, line: 162, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !69, file: !52, line: 166, baseType: !18, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !51, file: !52, line: 266, baseType: !73, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !51, file: !52, line: 268, baseType: !18, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !51, file: !52, line: 272, baseType: !18, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !51, file: !52, line: 274, baseType: !79, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 140, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !51, file: !52, line: 278, baseType: !83, size: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !51, file: !52, line: 279, baseType: !85, size: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !51, file: !52, line: 280, baseType: !87, size: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !51, file: !52, line: 284, baseType: !91, size: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !52, line: 154, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !52, line: 293, baseType: !94, size: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 141, baseType: !81)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !51, file: !52, line: 301, baseType: !23, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !51, file: !52, line: 302, baseType: !23, size: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !51, file: !52, line: 303, baseType: !23, size: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !51, file: !52, line: 304, baseType: !23, size: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !51, file: !52, line: 306, baseType: !100, size: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 46, baseType: !102)
!101 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!102 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !51, file: !52, line: 307, baseType: !18, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !51, file: !52, line: 309, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DILocalVariable(name: "proc", scope: !40, file: !32, line: 68, type: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32768, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 4096)
!112 = !DILocalVariable(name: "mm", scope: !40, file: !32, line: 69, type: !18)
!113 = !DILocalVariable(name: "rss", scope: !40, file: !32, line: 69, type: !18)
!114 = !DILocalVariable(name: "err", scope: !40, file: !32, line: 69, type: !18)
!115 = !DILocation(line: 0, scope: !40)
!116 = !DILocation(line: 68, column: 3, scope: !40)
!117 = !DILocation(line: 68, column: 14, scope: !40)
!118 = !DILocation(line: 69, column: 3, scope: !40)
!119 = !DILocation(line: 74, column: 3, scope: !120)
!120 = distinct !DILexicalBlock(scope: !121, file: !32, line: 74, column: 3)
!121 = distinct !DILexicalBlock(scope: !122, file: !32, line: 74, column: 3)
!122 = distinct !DILexicalBlock(scope: !40, file: !32, line: 74, column: 3)
!123 = !{!124, !124, i64 0}
!124 = !{!"any pointer", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !DILocation(line: 74, column: 3, scope: !121)
!128 = !DILocation(line: 74, column: 3, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !32, line: 74, column: 3)
!130 = distinct !DILexicalBlock(scope: !120, file: !32, line: 74, column: 3)
!131 = !{!132, !133, i64 1536}
!132 = !{!"", !125, i64 0, !125, i64 512, !125, i64 1024, !125, i64 1280, !133, i64 1536, !133, i64 1540, !125, i64 1544}
!133 = !{!"int", !125, i64 0}
!134 = !DILocation(line: 74, column: 3, scope: !130)
!135 = !DILocation(line: 74, column: 3, scope: !136)
!136 = distinct !DILexicalBlock(scope: !129, file: !32, line: 74, column: 3)
!137 = !{!133, !133, i64 0}
!138 = !{!132, !133, i64 1540}
!139 = !DILocation(line: 88, column: 38, scope: !40)
!140 = !DILocation(line: 88, column: 3, scope: !40)
!141 = !DILocation(line: 89, column: 16, scope: !142)
!142 = distinct !DILexicalBlock(scope: !40, file: !32, line: 89, column: 7)
!143 = !DILocation(line: 89, column: 14, scope: !142)
!144 = !DILocation(line: 89, column: 7, scope: !40)
!145 = !DILocation(line: 89, column: 34, scope: !142)
!146 = !DILocation(line: 90, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !40, file: !32, line: 90, column: 7)
!148 = !DILocation(line: 90, column: 37, scope: !147)
!149 = !DILocation(line: 90, column: 7, scope: !40)
!150 = !DILocation(line: 90, column: 43, scope: !147)
!151 = !DILocation(line: 91, column: 27, scope: !40)
!152 = !DILocation(line: 91, column: 11, scope: !40)
!153 = !DILocation(line: 91, column: 51, scope: !40)
!154 = !DILocation(line: 91, column: 35, scope: !40)
!155 = !DILocation(line: 91, column: 32, scope: !40)
!156 = !DILocation(line: 91, column: 8, scope: !40)
!157 = !{!158, !158, i64 0}
!158 = !{!"double", !125, i64 0}
!159 = !DILocation(line: 92, column: 10, scope: !40)
!160 = !DILocation(line: 93, column: 7, scope: !161)
!161 = distinct !DILexicalBlock(scope: !40, file: !32, line: 93, column: 7)
!162 = !DILocation(line: 93, column: 7, scope: !40)
!163 = !DILocation(line: 93, column: 12, scope: !161)
!164 = !DILocation(line: 108, column: 3, scope: !165)
!165 = distinct !DILexicalBlock(scope: !166, file: !32, line: 108, column: 3)
!166 = distinct !DILexicalBlock(scope: !167, file: !32, line: 108, column: 3)
!167 = distinct !DILexicalBlock(scope: !40, file: !32, line: 108, column: 3)
!168 = !DILocation(line: 108, column: 3, scope: !166)
!169 = !DILocation(line: 108, column: 3, scope: !170)
!170 = distinct !DILexicalBlock(scope: !171, file: !32, line: 108, column: 3)
!171 = distinct !DILexicalBlock(scope: !165, file: !32, line: 108, column: 3)
!172 = !DILocation(line: 108, column: 3, scope: !171)
