; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/vi/vi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/vi/vi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!202 = !DIEnumerator(name: "MATOP_REAL_PART", value: 105, isUnsigned: true)
!203 = !DIEnumerator(name: "MATOP_IMAGINARY_PART", value: 106, isUnsigned: true)
!204 = !DIEnumerator(name: "MATOP_GET_ROW_UPPER_TRIANGULAR", value: 107, isUnsigned: true)
!205 = !DIEnumerator(name: "MATOP_RESTORE_ROW_UPPER_TRIANG", value: 108, isUnsigned: true)
!206 = !DIEnumerator(name: "MATOP_MAT_SOLVE", value: 109, isUnsigned: true)
!207 = !DIEnumerator(name: "MATOP_MAT_SOLVE_TRANSPOSE", value: 110, isUnsigned: true)
!208 = !DIEnumerator(name: "MATOP_GET_ROW_MIN", value: 111, isUnsigned: true)
!209 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!210 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!211 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!212 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!213 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!214 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!215 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!216 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!217 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!218 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!219 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!220 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!221 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!222 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!223 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!224 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!225 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!226 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!227 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!228 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!229 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!236 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!237 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!238 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 155, baseType: !5, size: 32, elements: !245)
!244 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!245 = !{!246, !247, !248, !249, !250}
!246 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!247 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!248 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!249 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!250 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!256 = !{!257, !261, !262, !465, !297, !284, !337, !468, !471, !347, !26, !323, !431, !466, !5}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !258, line: 330, baseType: !259)
!258 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !258, line: 330, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !265, line: 73, size: 4480, elements: !266)
!265 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!266 = !{!267, !269, !318, !319, !321, !324, !325, !326, !327, !335, !336, !338, !342, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !359, !360, !361, !363, !364, !366, !368, !369, !370, !371, !372, !375, !377, !378, !379, !380, !381, !384, !386, !387, !388, !398, !400, !401, !405, !406, !455, !460, !462, !463, !464}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !264, file: !265, line: 74, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !264, file: !265, line: 75, baseType: !270, size: 448, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 448, elements: !316)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !265, line: 53, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 45, size: 448, elements: !273)
!273 = !{!274, !280, !288, !293, !300, !304, !311}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !272, file: !265, line: 46, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !262, !279}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !272, file: !265, line: 47, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!278, !262, !284}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !285, line: 16, baseType: !286)
!285 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !285, line: 16, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !272, file: !265, line: 48, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!278, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !272, file: !265, line: 49, baseType: !294, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!278, !262, !297, !262}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !272, file: !265, line: 50, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!278, !262, !297, !292}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !272, file: !265, line: 51, baseType: !305, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!278, !262, !297, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !272, file: !265, line: 52, baseType: !312, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!278, !262, !297, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!316 = !{!317}
!317 = !DISubrange(count: 1)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !264, file: !265, line: 76, baseType: !257, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !265, line: 77, baseType: !320, size: 32, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !264, file: !265, line: 78, baseType: !322, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !323)
!323 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !264, file: !265, line: 78, baseType: !322, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !264, file: !265, line: 78, baseType: !322, size: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !264, file: !265, line: 78, baseType: !322, size: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !264, file: !265, line: 79, baseType: !328, size: 64, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !331, line: 27, baseType: !332)
!331 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !333, line: 43, baseType: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!334 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !264, file: !265, line: 80, baseType: !320, size: 32, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !264, file: !265, line: 81, baseType: !337, size: 32, offset: 992)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !264, file: !265, line: 82, baseType: !339, size: 64, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !264, file: !265, line: 83, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !264, file: !265, line: 84, baseType: !347, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !264, file: !265, line: 85, baseType: !347, size: 64, offset: 1216)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !264, file: !265, line: 86, baseType: !347, size: 64, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !264, file: !265, line: 87, baseType: !347, size: 64, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !264, file: !265, line: 88, baseType: !262, size: 64, offset: 1408)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !264, file: !265, line: 89, baseType: !328, size: 64, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !265, line: 90, baseType: !347, size: 64, offset: 1536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !264, file: !265, line: 91, baseType: !347, size: 64, offset: 1600)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !264, file: !265, line: 92, baseType: !320, size: 32, offset: 1664)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !264, file: !265, line: 93, baseType: !261, size: 64, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !265, line: 94, baseType: !358, size: 64, offset: 1792)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !329)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !264, file: !265, line: 95, baseType: !320, size: 32, offset: 1856)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !264, file: !265, line: 95, baseType: !320, size: 32, offset: 1888)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !264, file: !265, line: 96, baseType: !362, size: 64, offset: 1920)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !264, file: !265, line: 96, baseType: !362, size: 64, offset: 1984)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !264, file: !265, line: 97, baseType: !365, size: 64, offset: 2048)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !264, file: !265, line: 97, baseType: !367, size: 64, offset: 2112)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !264, file: !265, line: 98, baseType: !320, size: 32, offset: 2176)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !264, file: !265, line: 98, baseType: !320, size: 32, offset: 2208)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !264, file: !265, line: 99, baseType: !362, size: 64, offset: 2240)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !264, file: !265, line: 99, baseType: !362, size: 64, offset: 2304)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !264, file: !265, line: 100, baseType: !373, size: 64, offset: 2368)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !323)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !264, file: !265, line: 100, baseType: !376, size: 64, offset: 2432)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !264, file: !265, line: 101, baseType: !320, size: 32, offset: 2496)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !264, file: !265, line: 101, baseType: !320, size: 32, offset: 2528)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !264, file: !265, line: 102, baseType: !362, size: 64, offset: 2560)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !264, file: !265, line: 102, baseType: !362, size: 64, offset: 2624)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !264, file: !265, line: 103, baseType: !382, size: 64, offset: 2688)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !374)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !264, file: !265, line: 103, baseType: !385, size: 64, offset: 2752)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !264, file: !265, line: 104, baseType: !315, size: 64, offset: 2816)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !264, file: !265, line: 105, baseType: !320, size: 32, offset: 2880)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !264, file: !265, line: 106, baseType: !389, size: 128, offset: 2944)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 128, elements: !396)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !265, line: 64, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 61, size: 128, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !392, file: !265, line: 62, baseType: !308, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !392, file: !265, line: 63, baseType: !261, size: 64, offset: 64)
!396 = !{!397}
!397 = !DISubrange(count: 2)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !264, file: !265, line: 107, baseType: !399, size: 64, offset: 3072)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !396)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !264, file: !265, line: 108, baseType: !261, size: 64, offset: 3136)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !264, file: !265, line: 109, baseType: !402, size: 64, offset: 3200)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!278, !261}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !264, file: !265, line: 111, baseType: !320, size: 32, offset: 3264)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !264, file: !265, line: 112, baseType: !407, size: 320, offset: 3328)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 320, elements: !453)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!278, !411, !262, !261}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !414)
!414 = !{!415, !416, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !413, file: !10, line: 100, baseType: !320, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !10, line: 101, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !428, !429, !430, !434, !436, !438, !439, !440}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !419, file: !10, line: 84, baseType: !347, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !419, file: !10, line: 85, baseType: !347, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !10, line: 86, baseType: !261, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !419, file: !10, line: 87, baseType: !339, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !419, file: !10, line: 88, baseType: !426, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !419, file: !10, line: 89, baseType: !299, size: 8, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !419, file: !10, line: 90, baseType: !347, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !419, file: !10, line: 91, baseType: !431, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !432, line: 46, baseType: !433)
!432 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!433 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !419, file: !10, line: 92, baseType: !435, size: 32, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !10, line: 93, baseType: !437, size: 32, offset: 544)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !10, line: 94, baseType: !417, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !419, file: !10, line: 95, baseType: !347, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !419, file: !10, line: 96, baseType: !261, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !413, file: !10, line: 102, baseType: !347, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !413, file: !10, line: 102, baseType: !347, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !413, file: !10, line: 103, baseType: !347, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !413, file: !10, line: 104, baseType: !257, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !413, file: !10, line: 105, baseType: !435, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !413, file: !10, line: 105, baseType: !435, size: 32, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !413, file: !10, line: 105, baseType: !435, size: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !413, file: !10, line: 106, baseType: !262, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !413, file: !10, line: 107, baseType: !450, size: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!453 = !{!454}
!454 = !DISubrange(count: 5)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !264, file: !265, line: 113, baseType: !456, size: 320, offset: 3648)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !453)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!278, !262, !261}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !264, file: !265, line: 114, baseType: !461, size: 320, offset: 3968)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !453)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !264, file: !265, line: 115, baseType: !435, size: 32, offset: 4288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !264, file: !265, line: 120, baseType: !450, size: 64, offset: 4352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !264, file: !265, line: 121, baseType: !435, size: 32, offset: 4416)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !467, line: 1451, baseType: !308)
!467 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !258, line: 331, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !258, line: 331, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !258, line: 338, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !258, line: 338, flags: DIFlagFwdDecl)
!474 = !{i32 7, !"Dwarf Version", i32 4}
!475 = !{i32 2, !"Debug Info Version", i32 3}
!476 = !{i32 1, !"wchar_size", i32 4}
!477 = !{i32 7, !"PIC Level", i32 2}
!478 = !{i32 7, !"uwtable", i32 1}
!479 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!480 = distinct !DISubprogram(name: "SNESVISetComputeVariableBounds", scope: !481, file: !481, line: 16, type: !482, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !673)
!481 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/vi/vi.c", directory: "/home/users/ndemeye/xSDK")
!482 = !DISubroutineType(types: !483)
!483 = !{!278, !484, !542}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !487, line: 38, size: 11648, elements: !488)
!487 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!488 = !{!489, !491, !557, !562, !563, !564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !580, !584, !585, !587, !588, !589, !590, !591, !596, !598, !599, !600, !601, !602, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !638, !640, !641, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !486, file: !487, line: 39, baseType: !490, size: 4480)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !265, line: 122, baseType: !264)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !486, file: !487, line: 39, baseType: !492, size: 1088, offset: 4480)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1088, elements: !316)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !487, line: 12, size: 1088, elements: !494)
!494 = !{!495, !502, !506, !510, !516, !517, !521, !522, !526, !530, !531, !532, !537, !541, !545, !549, !556}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !493, file: !487, line: 13, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!278, !484, !499, !261}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !244, line: 21, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !244, line: 21, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !493, file: !487, line: 14, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!278, !499, !499, !261}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !493, file: !487, line: 15, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!278, !484, !320}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !493, file: !487, line: 16, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!278, !484, !320, !374, !374, !374, !514, !261}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !493, file: !487, line: 17, baseType: !402, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !493, file: !487, line: 18, baseType: !518, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!278, !484}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !493, file: !487, line: 19, baseType: !518, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !493, file: !487, line: 20, baseType: !523, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!278, !484, !284}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !493, file: !487, line: 21, baseType: !527, size: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!278, !411, !484}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !493, file: !487, line: 22, baseType: !518, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !493, file: !487, line: 23, baseType: !518, size: 64, offset: 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !493, file: !487, line: 24, baseType: !533, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!278, !484, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !493, file: !487, line: 25, baseType: !538, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!278, !536}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !493, file: !487, line: 26, baseType: !542, size: 64, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!278, !484, !499, !499}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !493, file: !487, line: 27, baseType: !546, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!278, !484, !499, !499, !261}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !493, file: !487, line: 28, baseType: !550, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!278, !484, !499, !553, !553, !261}
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !493, file: !487, line: 29, baseType: !523, size: 64, offset: 1024)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !486, file: !487, line: 40, baseType: !558, size: 64, offset: 5568)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !559, line: 14, baseType: !560)
!559 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !559, line: 14, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !486, file: !487, line: 41, baseType: !435, size: 32, offset: 5632)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !486, file: !487, line: 42, baseType: !484, size: 64, offset: 5696)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !486, file: !487, line: 43, baseType: !565, size: 32, offset: 5760)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !486, file: !487, line: 44, baseType: !435, size: 32, offset: 5792)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !486, file: !487, line: 47, baseType: !261, size: 64, offset: 5824)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !486, file: !487, line: 49, baseType: !499, size: 64, offset: 5888)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !486, file: !487, line: 50, baseType: !499, size: 64, offset: 5952)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !486, file: !487, line: 52, baseType: !499, size: 64, offset: 6016)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !486, file: !487, line: 54, baseType: !553, size: 64, offset: 6080)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !486, file: !487, line: 55, baseType: !553, size: 64, offset: 6144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !486, file: !487, line: 56, baseType: !553, size: 64, offset: 6208)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !486, file: !487, line: 57, baseType: !261, size: 64, offset: 6272)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !486, file: !487, line: 58, baseType: !576, size: 64, offset: 6336)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !577, line: 22, baseType: !578)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !577, line: 22, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !486, file: !487, line: 59, baseType: !581, size: 64, offset: 6400)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !486, file: !487, line: 60, baseType: !435, size: 32, offset: 6464)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !486, file: !487, line: 61, baseType: !586, size: 32, offset: 6496)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !486, file: !487, line: 63, baseType: !499, size: 64, offset: 6528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !486, file: !487, line: 65, baseType: !499, size: 64, offset: 6592)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !486, file: !487, line: 66, baseType: !261, size: 64, offset: 6656)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !486, file: !487, line: 68, baseType: !374, size: 64, offset: 6720)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !486, file: !487, line: 74, baseType: !592, size: 320, offset: 6784)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 320, elements: !453)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!278, !484, !320, !374, !261}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !486, file: !487, line: 75, baseType: !597, size: 320, offset: 7104)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !453)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !486, file: !487, line: 76, baseType: !461, size: 320, offset: 7424)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !486, file: !487, line: 77, baseType: !320, size: 32, offset: 7744)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !486, file: !487, line: 78, baseType: !261, size: 64, offset: 7808)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !486, file: !487, line: 79, baseType: !515, size: 32, offset: 7872)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !486, file: !487, line: 80, baseType: !603, size: 320, offset: 7936)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 320, elements: !453)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!278, !484, !261}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !486, file: !487, line: 81, baseType: !597, size: 320, offset: 8256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !486, file: !487, line: 82, baseType: !461, size: 320, offset: 8576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !486, file: !487, line: 83, baseType: !320, size: 32, offset: 8896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !486, file: !487, line: 84, baseType: !435, size: 32, offset: 8928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !486, file: !487, line: 88, baseType: !435, size: 32, offset: 8960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !487, line: 89, baseType: !261, size: 64, offset: 9024)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !486, file: !487, line: 93, baseType: !320, size: 32, offset: 9088)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !486, file: !487, line: 94, baseType: !320, size: 32, offset: 9120)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !486, file: !487, line: 95, baseType: !320, size: 32, offset: 9152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !486, file: !487, line: 96, baseType: !320, size: 32, offset: 9184)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !486, file: !487, line: 97, baseType: !320, size: 32, offset: 9216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !486, file: !487, line: 98, baseType: !374, size: 64, offset: 9280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !486, file: !487, line: 99, baseType: !374, size: 64, offset: 9344)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !486, file: !487, line: 100, baseType: !374, size: 64, offset: 9408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !486, file: !487, line: 101, baseType: !374, size: 64, offset: 9472)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !486, file: !487, line: 102, baseType: !374, size: 64, offset: 9536)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !486, file: !487, line: 103, baseType: !374, size: 64, offset: 9600)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !486, file: !487, line: 104, baseType: !374, size: 64, offset: 9664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !486, file: !487, line: 105, baseType: !374, size: 64, offset: 9728)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !486, file: !487, line: 106, baseType: !435, size: 32, offset: 9792)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !486, file: !487, line: 107, baseType: !320, size: 32, offset: 9824)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !486, file: !487, line: 108, baseType: !320, size: 32, offset: 9856)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !486, file: !487, line: 109, baseType: !320, size: 32, offset: 9888)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !486, file: !487, line: 110, baseType: !435, size: 32, offset: 9920)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !486, file: !487, line: 111, baseType: !320, size: 32, offset: 9952)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !486, file: !487, line: 112, baseType: !435, size: 32, offset: 9984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !486, file: !487, line: 113, baseType: !320, size: 32, offset: 10016)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !486, file: !487, line: 115, baseType: !435, size: 32, offset: 10048)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !486, file: !487, line: 117, baseType: !435, size: 32, offset: 10080)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !486, file: !487, line: 119, baseType: !637, size: 32, offset: 10112)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !486, file: !487, line: 120, baseType: !639, size: 32, offset: 10144)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !486, file: !487, line: 124, baseType: !320, size: 32, offset: 10176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !486, file: !487, line: 125, baseType: !642, size: 64, offset: 10240)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !486, file: !487, line: 129, baseType: !320, size: 32, offset: 10304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !486, file: !487, line: 130, baseType: !373, size: 64, offset: 10368)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !486, file: !487, line: 132, baseType: !365, size: 64, offset: 10432)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !486, file: !487, line: 133, baseType: !320, size: 32, offset: 10496)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !486, file: !487, line: 134, baseType: !320, size: 32, offset: 10528)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !486, file: !487, line: 135, baseType: !435, size: 32, offset: 10560)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !486, file: !487, line: 136, baseType: !435, size: 32, offset: 10592)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !486, file: !487, line: 137, baseType: !435, size: 32, offset: 10624)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !486, file: !487, line: 140, baseType: !320, size: 32, offset: 10656)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !486, file: !487, line: 141, baseType: !320, size: 32, offset: 10688)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !486, file: !487, line: 143, baseType: !320, size: 32, offset: 10720)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !486, file: !487, line: 144, baseType: !320, size: 32, offset: 10752)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !486, file: !487, line: 146, baseType: !435, size: 32, offset: 10784)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !486, file: !487, line: 147, baseType: !435, size: 32, offset: 10816)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !486, file: !487, line: 148, baseType: !435, size: 32, offset: 10848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !486, file: !487, line: 150, baseType: !435, size: 32, offset: 10880)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !486, file: !487, line: 151, baseType: !261, size: 64, offset: 10944)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !486, file: !487, line: 154, baseType: !374, size: 64, offset: 11008)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !486, file: !487, line: 155, baseType: !374, size: 64, offset: 11072)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !486, file: !487, line: 157, baseType: !642, size: 64, offset: 11136)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !486, file: !487, line: 158, baseType: !320, size: 32, offset: 11200)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !486, file: !487, line: 160, baseType: !435, size: 32, offset: 11232)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !486, file: !487, line: 161, baseType: !435, size: 32, offset: 11264)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !486, file: !487, line: 162, baseType: !320, size: 32, offset: 11296)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !486, file: !487, line: 164, baseType: !374, size: 64, offset: 11328)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !486, file: !487, line: 165, baseType: !499, size: 64, offset: 11392)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !486, file: !487, line: 165, baseType: !499, size: 64, offset: 11456)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !486, file: !487, line: 166, baseType: !320, size: 32, offset: 11520)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !486, file: !487, line: 167, baseType: !435, size: 32, offset: 11552)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !486, file: !487, line: 169, baseType: !435, size: 32, offset: 11584)
!673 = !{!674, !675, !676, !677, !679, !681, !685, !688, !689, !691, !695}
!674 = !DILocalVariable(name: "snes", arg: 1, scope: !480, file: !481, line: 16, type: !484)
!675 = !DILocalVariable(name: "compute", arg: 2, scope: !480, file: !481, line: 16, type: !542)
!676 = !DILocalVariable(name: "ierr", scope: !480, file: !481, line: 18, type: !278)
!677 = !DILocalVariable(name: "f", scope: !480, file: !481, line: 18, type: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!679 = !DILocalVariable(name: "ierr__", scope: !680, file: !481, line: 22, type: !278)
!680 = distinct !DILexicalBlock(scope: !480, file: !481, line: 22, column: 92)
!681 = !DILocalVariable(name: "ierr__", scope: !682, file: !481, line: 24, type: !278)
!682 = distinct !DILexicalBlock(scope: !683, file: !481, line: 24, column: 60)
!683 = distinct !DILexicalBlock(scope: !684, file: !481, line: 23, column: 11)
!684 = distinct !DILexicalBlock(scope: !480, file: !481, line: 23, column: 7)
!685 = !DILocalVariable(name: "_7_f", scope: !686, file: !481, line: 26, type: !678)
!686 = distinct !DILexicalBlock(scope: !687, file: !481, line: 26, column: 12)
!687 = distinct !DILexicalBlock(scope: !684, file: !481, line: 25, column: 10)
!688 = !DILocalVariable(name: "_7_ierr", scope: !686, file: !481, line: 26, type: !278)
!689 = !DILocalVariable(name: "ierr__", scope: !690, file: !481, line: 26, type: !278)
!690 = distinct !DILexicalBlock(scope: !686, file: !481, line: 26, column: 12)
!691 = !DILocalVariable(name: "ierr__", scope: !692, file: !481, line: 26, type: !278)
!692 = distinct !DILexicalBlock(scope: !693, file: !481, line: 26, column: 12)
!693 = distinct !DILexicalBlock(scope: !694, file: !481, line: 26, column: 12)
!694 = distinct !DILexicalBlock(scope: !686, file: !481, line: 26, column: 12)
!695 = !DILocalVariable(name: "ierr__", scope: !696, file: !481, line: 26, type: !278)
!696 = distinct !DILexicalBlock(scope: !687, file: !481, line: 26, column: 123)
!697 = !DILocation(line: 0, scope: !480)
!698 = !DILocation(line: 18, column: 3, scope: !480)
!699 = !DILocation(line: 20, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !481, line: 20, column: 3)
!701 = distinct !DILexicalBlock(scope: !702, file: !481, line: 20, column: 3)
!702 = distinct !DILexicalBlock(scope: !480, file: !481, line: 20, column: 3)
!703 = !{!704, !704, i64 0}
!704 = !{!"any pointer", !705, i64 0}
!705 = !{!"omnipotent char", !706, i64 0}
!706 = !{!"Simple C/C++ TBAA"}
!707 = !DILocation(line: 20, column: 3, scope: !701)
!708 = !DILocation(line: 20, column: 3, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !481, line: 20, column: 3)
!710 = distinct !DILexicalBlock(scope: !700, file: !481, line: 20, column: 3)
!711 = !{!712, !713, i64 1536}
!712 = !{!"", !705, i64 0, !705, i64 512, !705, i64 1024, !705, i64 1280, !713, i64 1536, !713, i64 1540, !705, i64 1544}
!713 = !{!"int", !705, i64 0}
!714 = !DILocation(line: 20, column: 3, scope: !710)
!715 = !DILocation(line: 20, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !709, file: !481, line: 20, column: 3)
!717 = !{!713, !713, i64 0}
!718 = !{!712, !713, i64 1540}
!719 = !DILocation(line: 21, column: 3, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !481, line: 21, column: 3)
!721 = distinct !DILexicalBlock(scope: !480, file: !481, line: 21, column: 3)
!722 = !DILocation(line: 21, column: 3, scope: !721)
!723 = !DILocation(line: 21, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !481, line: 21, column: 3)
!725 = !DILocation(line: 21, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !481, line: 21, column: 3)
!727 = !{!728, !713, i64 0}
