; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/coarsen.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/coarsen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1203, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 187, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 663, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!304 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 624, baseType: !7, size: 32, elements: !324)
!323 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!324 = !{!325, !326, !327, !328}
!325 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!329 = !{!330, !333, !334, !339, !342, !505, !539, !540, !421, !74, !541}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !323, line: 330, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !323, line: 330, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !335, line: 1451, baseType: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !345, line: 73, size: 4480, elements: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!346 = !{!347, !349, !392, !393, !395, !398, !399, !400, !401, !409, !410, !412, !416, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !433, !434, !435, !437, !438, !440, !442, !443, !444, !445, !446, !449, !451, !452, !453, !454, !455, !458, !460, !461, !462, !472, !474, !475, !479, !480, !529, !534, !536, !537, !538}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !344, file: !345, line: 74, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !344, file: !345, line: 75, baseType: !350, size: 448, offset: 64)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 448, elements: !390)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !345, line: 53, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 45, size: 448, elements: !353)
!353 = !{!354, !360, !368, !373, !377, !381, !385}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !352, file: !345, line: 46, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !342, !359}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !352, file: !345, line: 47, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!358, !342, !364}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !365, line: 16, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !365, line: 16, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !352, file: !345, line: 48, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!358, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !352, file: !345, line: 49, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!358, !342, !339, !342}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !352, file: !345, line: 50, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!358, !342, !339, !372}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !352, file: !345, line: 51, baseType: !382, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!358, !342, !339, !336}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !352, file: !345, line: 52, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!358, !342, !339, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!390 = !{!391}
!391 = !DISubrange(count: 1)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !344, file: !345, line: 76, baseType: !330, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !345, line: 77, baseType: !394, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !344, file: !345, line: 78, baseType: !396, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !397)
!397 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !344, file: !345, line: 78, baseType: !396, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !344, file: !345, line: 78, baseType: !396, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !344, file: !345, line: 78, baseType: !396, size: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !344, file: !345, line: 79, baseType: !402, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !405, line: 27, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !407, line: 43, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!408 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !344, file: !345, line: 80, baseType: !394, size: 32, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !344, file: !345, line: 81, baseType: !411, size: 32, offset: 992)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !344, file: !345, line: 82, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !344, file: !345, line: 83, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !344, file: !345, line: 84, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !344, file: !345, line: 85, baseType: !421, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !344, file: !345, line: 86, baseType: !421, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !344, file: !345, line: 87, baseType: !421, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !344, file: !345, line: 88, baseType: !342, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !344, file: !345, line: 89, baseType: !402, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !345, line: 90, baseType: !421, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !344, file: !345, line: 91, baseType: !421, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !344, file: !345, line: 92, baseType: !394, size: 32, offset: 1664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !344, file: !345, line: 93, baseType: !333, size: 64, offset: 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !345, line: 94, baseType: !432, size: 64, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !403)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !344, file: !345, line: 95, baseType: !394, size: 32, offset: 1856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !344, file: !345, line: 95, baseType: !394, size: 32, offset: 1888)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !344, file: !345, line: 96, baseType: !436, size: 64, offset: 1920)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !344, file: !345, line: 96, baseType: !436, size: 64, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !344, file: !345, line: 97, baseType: !439, size: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !344, file: !345, line: 97, baseType: !441, size: 64, offset: 2112)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !344, file: !345, line: 98, baseType: !394, size: 32, offset: 2176)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !344, file: !345, line: 98, baseType: !394, size: 32, offset: 2208)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !344, file: !345, line: 99, baseType: !436, size: 64, offset: 2240)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !344, file: !345, line: 99, baseType: !436, size: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !344, file: !345, line: 100, baseType: !447, size: 64, offset: 2368)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !397)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !344, file: !345, line: 100, baseType: !450, size: 64, offset: 2432)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !344, file: !345, line: 101, baseType: !394, size: 32, offset: 2496)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !344, file: !345, line: 101, baseType: !394, size: 32, offset: 2528)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !344, file: !345, line: 102, baseType: !436, size: 64, offset: 2560)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !344, file: !345, line: 102, baseType: !436, size: 64, offset: 2624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !344, file: !345, line: 103, baseType: !456, size: 64, offset: 2688)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !344, file: !345, line: 103, baseType: !459, size: 64, offset: 2752)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !344, file: !345, line: 104, baseType: !389, size: 64, offset: 2816)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !344, file: !345, line: 105, baseType: !394, size: 32, offset: 2880)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !344, file: !345, line: 106, baseType: !463, size: 128, offset: 2944)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 128, elements: !470)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !345, line: 64, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 61, size: 128, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !466, file: !345, line: 62, baseType: !336, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !466, file: !345, line: 63, baseType: !333, size: 64, offset: 64)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !344, file: !345, line: 107, baseType: !473, size: 64, offset: 3072)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !470)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !344, file: !345, line: 108, baseType: !333, size: 64, offset: 3136)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !344, file: !345, line: 109, baseType: !476, size: 64, offset: 3200)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!358, !333}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !344, file: !345, line: 111, baseType: !394, size: 32, offset: 3264)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !344, file: !345, line: 112, baseType: !481, size: 320, offset: 3328)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 320, elements: !527)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!358, !485, !342, !333}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !488)
!488 = !{!489, !490, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !487, file: !12, line: 100, baseType: !394, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !12, line: 101, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !502, !503, !504, !508, !510, !512, !513, !514}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !493, file: !12, line: 84, baseType: !421, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !493, file: !12, line: 85, baseType: !421, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !12, line: 86, baseType: !333, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !493, file: !12, line: 87, baseType: !413, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !493, file: !12, line: 88, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !493, file: !12, line: 89, baseType: !341, size: 8, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !493, file: !12, line: 90, baseType: !421, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !493, file: !12, line: 91, baseType: !505, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !506, line: 46, baseType: !507)
!506 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!507 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !493, file: !12, line: 92, baseType: !509, size: 32, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !12, line: 93, baseType: !511, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !12, line: 94, baseType: !491, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !493, file: !12, line: 95, baseType: !421, size: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !493, file: !12, line: 96, baseType: !333, size: 64, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !487, file: !12, line: 102, baseType: !421, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !487, file: !12, line: 102, baseType: !421, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !487, file: !12, line: 103, baseType: !421, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !487, file: !12, line: 104, baseType: !330, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !487, file: !12, line: 106, baseType: !342, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !487, file: !12, line: 107, baseType: !524, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!527 = !{!528}
!528 = !DISubrange(count: 5)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !344, file: !345, line: 113, baseType: !530, size: 320, offset: 3648)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 320, elements: !527)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!358, !342, !333}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !344, file: !345, line: 114, baseType: !535, size: 320, offset: 3968)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 320, elements: !527)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !344, file: !345, line: 115, baseType: !509, size: 32, offset: 4288)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !344, file: !345, line: 120, baseType: !524, size: 64, offset: 4352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !344, file: !345, line: 121, baseType: !509, size: 32, offset: 4416)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !345, line: 130, baseType: !369)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !345, line: 131, baseType: !361)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!542 = !{!0, !543, !546}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "MatCoarsenRegisterAllCalled", scope: !2, file: !545, line: 8, type: !509, isLocal: false, isDefinition: true)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/coarsen.c", directory: "/home/users/ndemeye/xSDK")
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "MAT_COARSEN_CLASSID", scope: !2, file: !545, line: 5, type: !348, isLocal: false, isDefinition: true)
!548 = !{i32 7, !"Dwarf Version", i32 4}
!549 = !{i32 2, !"Debug Info Version", i32 3}
!550 = !{i32 1, !"wchar_size", i32 4}
!551 = !{i32 7, !"PIC Level", i32 2}
!552 = !{i32 7, !"uwtable", i32 1}
!553 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!554 = distinct !DISubprogram(name: "MatCoarsenRegister", scope: !545, file: !545, line: 33, type: !555, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1382)
!555 = !DISubroutineType(types: !556)
!556 = !{!358, !339, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!358, !560}
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatCoarsen", file: !561, line: 18, baseType: !562)
!561 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmatcoarsen.h", directory: "/home/users/ndemeye/xSDK")
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatCoarsen", file: !564, line: 552, size: 5056, elements: !565)
!564 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!565 = !{!566, !568, !582, !1352, !1353, !1354, !1355}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !563, file: !564, line: 553, baseType: !567, size: 4480)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !345, line: 122, baseType: !344)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !563, file: !564, line: 553, baseType: !569, size: 256, offset: 4480)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 256, elements: !390)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatCoarsenOps", file: !564, line: 545, size: 256, elements: !571)
!571 = !{!572, !573, !577, !578}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !570, file: !564, line: 546, baseType: !557, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !570, file: !564, line: 547, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!358, !485, !560}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !570, file: !564, line: 548, baseType: !557, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !570, file: !564, line: 549, baseType: !579, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!358, !560, !364}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !563, file: !564, line: 554, baseType: !583, size: 64, offset: 4736)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !564, line: 436, size: 23424, elements: !586)
!586 = !{!587, !588, !1095, !1115, !1116, !1117, !1119, !1120, !1121, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1248, !1249, !1265, !1266, !1267, !1268, !1269, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1304, !1324, !1325, !1327, !1328, !1329, !1330, !1331, !1332, !1350, !1351}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !585, file: !564, line: 437, baseType: !567, size: 4480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !585, file: !564, line: 437, baseType: !589, size: 9472, offset: 4480)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 9472, elements: !390)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !564, line: 32, size: 9472, elements: !591)
!591 = !{!592, !601, !605, !606, !613, !617, !618, !619, !620, !621, !622, !623, !647, !651, !656, !662, !681, !686, !690, !691, !696, !701, !702, !707, !711, !715, !719, !723, !727, !728, !729, !730, !731, !735, !736, !741, !742, !743, !744, !745, !750, !757, !762, !766, !770, !774, !778, !779, !783, !784, !791, !796, !797, !798, !799, !861, !869, !870, !874, !875, !879, !880, !884, !889, !890, !894, !898, !905, !906, !907, !908, !909, !910, !915, !916, !920, !924, !928, !929, !930, !934, !944, !945, !949, !950, !954, !955, !959, !960, !965, !966, !970, !974, !975, !976, !977, !978, !979, !980, !984, !985, !986, !987, !988, !989, !993, !994, !995, !996, !997, !998, !999, !1000, !1004, !1008, !1009, !1010, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1024, !1025, !1026, !1031, !1035, !1036, !1040, !1041, !1042, !1043, !1069, !1073, !1074, !1075, !1076, !1077, !1081, !1082, !1083, !1084, !1085, !1089, !1093, !1094}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !590, file: !564, line: 34, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!358, !583, !394, !596, !394, !596, !598, !600}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !590, file: !564, line: 35, baseType: !602, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!358, !583, !394, !439, !441, !459}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !590, file: !564, line: 36, baseType: !602, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !590, file: !564, line: 37, baseType: !607, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!358, !583, !610, !610}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !590, file: !564, line: 38, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!358, !583, !610, !610, !610}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !590, file: !564, line: 40, baseType: !607, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !590, file: !564, line: 41, baseType: !614, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !590, file: !564, line: 42, baseType: !607, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !590, file: !564, line: 43, baseType: !614, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !590, file: !564, line: 44, baseType: !607, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !590, file: !564, line: 46, baseType: !614, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !590, file: !564, line: 47, baseType: !624, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!358, !583, !627, !627, !631}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !628, line: 11, baseType: !629)
!628 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !628, line: 11, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !634, file: !38, line: 1227, baseType: !448, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !634, file: !38, line: 1228, baseType: !448, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !634, file: !38, line: 1229, baseType: !448, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !634, file: !38, line: 1230, baseType: !448, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !634, file: !38, line: 1231, baseType: !448, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !634, file: !38, line: 1232, baseType: !448, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !634, file: !38, line: 1233, baseType: !448, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !634, file: !38, line: 1234, baseType: !448, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !634, file: !38, line: 1236, baseType: !448, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !634, file: !38, line: 1237, baseType: !448, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !634, file: !38, line: 1238, baseType: !448, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !590, file: !564, line: 48, baseType: !648, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!358, !583, !627, !631}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !590, file: !564, line: 49, baseType: !652, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!358, !583, !610, !448, !655, !448, !394, !394, !610}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !590, file: !564, line: 50, baseType: !657, size: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!358, !583, !660, !661}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !590, file: !564, line: 52, baseType: !663, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!358, !583, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !669, file: !38, line: 593, baseType: !396, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !669, file: !38, line: 594, baseType: !396, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !669, file: !38, line: 594, baseType: !396, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !669, file: !38, line: 594, baseType: !396, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !669, file: !38, line: 595, baseType: !396, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !669, file: !38, line: 596, baseType: !396, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !669, file: !38, line: 597, baseType: !396, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !669, file: !38, line: 598, baseType: !396, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !669, file: !38, line: 598, baseType: !396, size: 64, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !669, file: !38, line: 599, baseType: !396, size: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !590, file: !564, line: 53, baseType: !682, size: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!358, !583, !583, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !590, file: !564, line: 54, baseType: !687, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!358, !583, !610}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !590, file: !564, line: 55, baseType: !607, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !590, file: !564, line: 56, baseType: !692, size: 64, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!358, !583, !695, !447}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !590, file: !564, line: 58, baseType: !697, size: 64, offset: 1280)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!358, !583, !700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !590, file: !564, line: 59, baseType: !697, size: 64, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !590, file: !564, line: 60, baseType: !703, size: 64, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!358, !583, !706, !509}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !590, file: !564, line: 61, baseType: !708, size: 64, offset: 1472)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!358, !583}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !590, file: !564, line: 63, baseType: !712, size: 64, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!358, !583, !394, !596, !457, !610, !610}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !590, file: !564, line: 64, baseType: !716, size: 64, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!358, !583, !583, !627, !627, !631}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !590, file: !564, line: 65, baseType: !720, size: 64, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!358, !583, !583, !631}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !590, file: !564, line: 66, baseType: !724, size: 64, offset: 1728)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!358, !583, !583, !627, !631}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !590, file: !564, line: 67, baseType: !720, size: 64, offset: 1792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !590, file: !564, line: 69, baseType: !708, size: 64, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !590, file: !564, line: 70, baseType: !716, size: 64, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !590, file: !564, line: 71, baseType: !724, size: 64, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !590, file: !564, line: 72, baseType: !732, size: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!358, !583, !661}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !590, file: !564, line: 73, baseType: !708, size: 64, offset: 2112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !590, file: !564, line: 75, baseType: !737, size: 64, offset: 2176)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!358, !583, !740, !661}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !590, file: !564, line: 76, baseType: !607, size: 64, offset: 2240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !590, file: !564, line: 77, baseType: !607, size: 64, offset: 2304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !590, file: !564, line: 78, baseType: !624, size: 64, offset: 2368)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !590, file: !564, line: 79, baseType: !648, size: 64, offset: 2432)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !590, file: !564, line: 81, baseType: !746, size: 64, offset: 2496)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!358, !583, !457, !583, !749}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !590, file: !564, line: 82, baseType: !751, size: 64, offset: 2560)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!358, !583, !394, !754, !754, !660, !756}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !590, file: !564, line: 83, baseType: !758, size: 64, offset: 2624)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!358, !583, !394, !761, !394}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !590, file: !564, line: 84, baseType: !763, size: 64, offset: 2688)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!358, !583, !394, !596, !394, !596, !456}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !590, file: !564, line: 85, baseType: !767, size: 64, offset: 2752)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!358, !583, !583, !749}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !590, file: !564, line: 87, baseType: !771, size: 64, offset: 2816)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!358, !583, !610, !439}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !590, file: !564, line: 88, baseType: !775, size: 64, offset: 2880)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!358, !583, !457}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !590, file: !564, line: 89, baseType: !775, size: 64, offset: 2944)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !590, file: !564, line: 90, baseType: !780, size: 64, offset: 3008)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!358, !583, !610, !600}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !590, file: !564, line: 91, baseType: !712, size: 64, offset: 3072)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !590, file: !564, line: 93, baseType: !785, size: 64, offset: 3136)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!358, !583, !788}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !590, file: !564, line: 94, baseType: !792, size: 64, offset: 3200)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!358, !583, !394, !509, !509, !439, !795, !795, !685}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !590, file: !564, line: 95, baseType: !792, size: 64, offset: 3264)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !590, file: !564, line: 96, baseType: !792, size: 64, offset: 3328)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !590, file: !564, line: 97, baseType: !792, size: 64, offset: 3392)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !590, file: !564, line: 99, baseType: !800, size: 64, offset: 3456)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!358, !583, !803, !806}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !628, line: 51, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !628, line: 51, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !564, line: 609, size: 6208, elements: !809)
!809 = !{!810, !811, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !830, !837, !838, !839, !840, !841, !842, !843, !844, !848, !849, !850, !851, !852, !854, !855, !856, !857, !858, !859, !860}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !808, file: !564, line: 610, baseType: !567, size: 4480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !808, file: !564, line: 610, baseType: !812, size: 32, offset: 4480)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !390)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !808, file: !564, line: 611, baseType: !394, size: 32, offset: 4512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !808, file: !564, line: 611, baseType: !394, size: 32, offset: 4544)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !808, file: !564, line: 611, baseType: !394, size: 32, offset: 4576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !808, file: !564, line: 612, baseType: !394, size: 32, offset: 4608)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !808, file: !564, line: 613, baseType: !394, size: 32, offset: 4640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !808, file: !564, line: 614, baseType: !439, size: 64, offset: 4672)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !808, file: !564, line: 615, baseType: !441, size: 64, offset: 4736)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !808, file: !564, line: 616, baseType: !761, size: 64, offset: 4800)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !808, file: !564, line: 617, baseType: !439, size: 64, offset: 4864)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !808, file: !564, line: 618, baseType: !823, size: 64, offset: 4928)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !564, line: 602, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 598, size: 128, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !825, file: !564, line: 599, baseType: !394, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !825, file: !564, line: 600, baseType: !394, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !825, file: !564, line: 601, baseType: !456, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !808, file: !564, line: 619, baseType: !831, size: 64, offset: 4992)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !564, line: 607, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 604, size: 128, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !833, file: !564, line: 605, baseType: !394, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !833, file: !564, line: 606, baseType: !456, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !808, file: !564, line: 620, baseType: !456, size: 64, offset: 5056)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !808, file: !564, line: 621, baseType: !448, size: 64, offset: 5120)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !808, file: !564, line: 622, baseType: !448, size: 64, offset: 5184)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !808, file: !564, line: 623, baseType: !610, size: 64, offset: 5248)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !808, file: !564, line: 623, baseType: !610, size: 64, offset: 5312)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !808, file: !564, line: 623, baseType: !610, size: 64, offset: 5376)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !808, file: !564, line: 624, baseType: !509, size: 32, offset: 5440)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !808, file: !564, line: 625, baseType: !845, size: 64, offset: 5504)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!358}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !808, file: !564, line: 626, baseType: !333, size: 64, offset: 5568)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !808, file: !564, line: 627, baseType: !610, size: 64, offset: 5632)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !808, file: !564, line: 628, baseType: !394, size: 32, offset: 5696)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !808, file: !564, line: 629, baseType: !339, size: 64, offset: 5760)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !808, file: !564, line: 630, baseType: !853, size: 32, offset: 5824)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !808, file: !564, line: 631, baseType: !394, size: 32, offset: 5856)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !808, file: !564, line: 631, baseType: !394, size: 32, offset: 5888)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !808, file: !564, line: 632, baseType: !509, size: 32, offset: 5920)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !808, file: !564, line: 633, baseType: !509, size: 32, offset: 5952)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !808, file: !564, line: 634, baseType: !336, size: 64, offset: 6016)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !808, file: !564, line: 634, baseType: !333, size: 64, offset: 6080)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !808, file: !564, line: 635, baseType: !402, size: 64, offset: 6144)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !590, file: !564, line: 100, baseType: !862, size: 64, offset: 3520)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!358, !583, !394, !394, !865, !868}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !867)
!867 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !590, file: !564, line: 101, baseType: !708, size: 64, offset: 3584)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !590, file: !564, line: 102, baseType: !871, size: 64, offset: 3648)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!358, !583, !627, !627, !661}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !590, file: !564, line: 103, baseType: !593, size: 64, offset: 3712)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !590, file: !564, line: 105, baseType: !876, size: 64, offset: 3776)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!358, !583, !627, !627, !660, !661}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !590, file: !564, line: 106, baseType: !708, size: 64, offset: 3840)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !590, file: !564, line: 107, baseType: !881, size: 64, offset: 3904)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!358, !583, !364}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !590, file: !564, line: 108, baseType: !885, size: 64, offset: 3968)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!358, !583, !888, !660, !661}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !339)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !590, file: !564, line: 109, baseType: !845, size: 64, offset: 4032)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !590, file: !564, line: 111, baseType: !891, size: 64, offset: 4096)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!358, !583, !583, !583, !448, !583}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !590, file: !564, line: 112, baseType: !895, size: 64, offset: 4160)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!358, !583, !583, !583, !583}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !590, file: !564, line: 113, baseType: !899, size: 64, offset: 4224)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!358, !583, !902, !902}
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !628, line: 30, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !628, line: 30, flags: DIFlagFwdDecl)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !590, file: !564, line: 114, baseType: !593, size: 64, offset: 4288)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !590, file: !564, line: 115, baseType: !712, size: 64, offset: 4352)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !590, file: !564, line: 117, baseType: !771, size: 64, offset: 4416)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !590, file: !564, line: 118, baseType: !771, size: 64, offset: 4480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !590, file: !564, line: 119, baseType: !885, size: 64, offset: 4544)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !590, file: !564, line: 120, baseType: !911, size: 64, offset: 4608)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!358, !583, !914, !685}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !590, file: !564, line: 121, baseType: !845, size: 64, offset: 4672)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !590, file: !564, line: 123, baseType: !917, size: 64, offset: 4736)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!358, !583, !394, !333}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !590, file: !564, line: 124, baseType: !921, size: 64, offset: 4800)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!358, !583, !806, !610, !333}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !590, file: !564, line: 125, baseType: !925, size: 64, offset: 4864)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!358, !485, !583}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !590, file: !564, line: 126, baseType: !607, size: 64, offset: 4928)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !590, file: !564, line: 127, baseType: !607, size: 64, offset: 4992)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !590, file: !564, line: 129, baseType: !931, size: 64, offset: 5056)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!358, !583, !761}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !590, file: !564, line: 130, baseType: !935, size: 64, offset: 5120)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!358, !583, !938, !938}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !940, file: !62, line: 653, baseType: !394, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !940, file: !62, line: 653, baseType: !610, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !590, file: !564, line: 131, baseType: !935, size: 64, offset: 5184)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !590, file: !564, line: 132, baseType: !946, size: 64, offset: 5248)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!358, !583, !439, !439, !439}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !590, file: !564, line: 133, baseType: !881, size: 64, offset: 5312)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !590, file: !564, line: 135, baseType: !951, size: 64, offset: 5376)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!358, !583, !448, !685}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !590, file: !564, line: 136, baseType: !951, size: 64, offset: 5440)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !590, file: !564, line: 137, baseType: !956, size: 64, offset: 5504)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!358, !583, !685}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !590, file: !564, line: 138, baseType: !593, size: 64, offset: 5568)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !590, file: !564, line: 139, baseType: !961, size: 64, offset: 5632)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!358, !583, !964, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !590, file: !564, line: 141, baseType: !845, size: 64, offset: 5696)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !590, file: !564, line: 142, baseType: !967, size: 64, offset: 5760)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!358, !583, !583, !448, !583}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !590, file: !564, line: 143, baseType: !971, size: 64, offset: 5824)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!358, !583, !583, !583}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !590, file: !564, line: 144, baseType: !845, size: 64, offset: 5888)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !590, file: !564, line: 145, baseType: !967, size: 64, offset: 5952)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !590, file: !564, line: 147, baseType: !971, size: 64, offset: 6016)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !590, file: !564, line: 148, baseType: !845, size: 64, offset: 6080)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !590, file: !564, line: 149, baseType: !967, size: 64, offset: 6144)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !590, file: !564, line: 150, baseType: !971, size: 64, offset: 6208)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !590, file: !564, line: 151, baseType: !981, size: 64, offset: 6272)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!358, !583, !509}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !590, file: !564, line: 153, baseType: !708, size: 64, offset: 6336)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !590, file: !564, line: 154, baseType: !708, size: 64, offset: 6400)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !590, file: !564, line: 155, baseType: !708, size: 64, offset: 6464)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !590, file: !564, line: 156, baseType: !708, size: 64, offset: 6528)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !590, file: !564, line: 157, baseType: !881, size: 64, offset: 6592)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !590, file: !564, line: 159, baseType: !990, size: 64, offset: 6656)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!358, !583, !394, !598}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !590, file: !564, line: 160, baseType: !708, size: 64, offset: 6720)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !590, file: !564, line: 161, baseType: !708, size: 64, offset: 6784)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !590, file: !564, line: 162, baseType: !708, size: 64, offset: 6848)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !590, file: !564, line: 163, baseType: !708, size: 64, offset: 6912)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !590, file: !564, line: 165, baseType: !971, size: 64, offset: 6976)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !590, file: !564, line: 166, baseType: !971, size: 64, offset: 7040)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !590, file: !564, line: 167, baseType: !771, size: 64, offset: 7104)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !590, file: !564, line: 168, baseType: !1001, size: 64, offset: 7168)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!358, !583, !610, !394}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !590, file: !564, line: 169, baseType: !1005, size: 64, offset: 7232)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!358, !583, !685, !439}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !590, file: !564, line: 171, baseType: !732, size: 64, offset: 7296)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !590, file: !564, line: 172, baseType: !708, size: 64, offset: 7360)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !590, file: !564, line: 173, baseType: !1011, size: 64, offset: 7424)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!358, !583, !439, !795}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !590, file: !564, line: 174, baseType: !871, size: 64, offset: 7488)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !590, file: !564, line: 175, baseType: !871, size: 64, offset: 7552)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !590, file: !564, line: 177, baseType: !607, size: 64, offset: 7616)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !590, file: !564, line: 178, baseType: !657, size: 64, offset: 7680)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !590, file: !564, line: 179, baseType: !607, size: 64, offset: 7744)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !590, file: !564, line: 180, baseType: !614, size: 64, offset: 7808)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !590, file: !564, line: 181, baseType: !1021, size: 64, offset: 7872)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!358, !583, !330, !660, !661}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !590, file: !564, line: 183, baseType: !931, size: 64, offset: 7936)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !590, file: !564, line: 184, baseType: !692, size: 64, offset: 8000)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !590, file: !564, line: 185, baseType: !1027, size: 64, offset: 8064)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!358, !583, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !590, file: !564, line: 186, baseType: !1032, size: 64, offset: 8128)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!358, !583, !394, !596, !456}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !590, file: !564, line: 187, baseType: !751, size: 64, offset: 8192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !590, file: !564, line: 189, baseType: !1037, size: 64, offset: 8256)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!358, !583, !394, !394, !439, !598}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !590, file: !564, line: 190, baseType: !845, size: 64, offset: 8320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !590, file: !564, line: 191, baseType: !967, size: 64, offset: 8384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !590, file: !564, line: 192, baseType: !971, size: 64, offset: 8448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !590, file: !564, line: 193, baseType: !1044, size: 64, offset: 8512)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!358, !583, !803, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !564, line: 660, size: 5312, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1049, file: !564, line: 661, baseType: !567, size: 4480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1049, file: !564, line: 661, baseType: !812, size: 32, offset: 4480)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1049, file: !564, line: 662, baseType: !394, size: 32, offset: 4512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1049, file: !564, line: 662, baseType: !394, size: 32, offset: 4544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1049, file: !564, line: 662, baseType: !394, size: 32, offset: 4576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1049, file: !564, line: 663, baseType: !394, size: 32, offset: 4608)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1049, file: !564, line: 664, baseType: !394, size: 32, offset: 4640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1049, file: !564, line: 665, baseType: !439, size: 64, offset: 4672)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1049, file: !564, line: 666, baseType: !439, size: 64, offset: 4736)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1049, file: !564, line: 667, baseType: !394, size: 32, offset: 4800)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1049, file: !564, line: 668, baseType: !853, size: 32, offset: 4832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1049, file: !564, line: 670, baseType: !439, size: 64, offset: 4864)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1049, file: !564, line: 670, baseType: !439, size: 64, offset: 4928)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1049, file: !564, line: 671, baseType: !439, size: 64, offset: 4992)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1049, file: !564, line: 672, baseType: !439, size: 64, offset: 5056)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1049, file: !564, line: 673, baseType: !439, size: 64, offset: 5120)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1049, file: !564, line: 674, baseType: !394, size: 32, offset: 5184)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1049, file: !564, line: 675, baseType: !439, size: 64, offset: 5248)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !590, file: !564, line: 195, baseType: !1070, size: 64, offset: 8576)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!358, !1047, !583, !583}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !590, file: !564, line: 196, baseType: !1070, size: 64, offset: 8640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !590, file: !564, line: 197, baseType: !845, size: 64, offset: 8704)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !590, file: !564, line: 198, baseType: !967, size: 64, offset: 8768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !590, file: !564, line: 199, baseType: !971, size: 64, offset: 8832)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !590, file: !564, line: 201, baseType: !1078, size: 64, offset: 8896)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!358, !583, !394, !394}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !590, file: !564, line: 202, baseType: !746, size: 64, offset: 8960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !590, file: !564, line: 203, baseType: !614, size: 64, offset: 9024)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !590, file: !564, line: 204, baseType: !800, size: 64, offset: 9088)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !590, file: !564, line: 205, baseType: !931, size: 64, offset: 9152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !590, file: !564, line: 206, baseType: !1086, size: 64, offset: 9216)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!358, !330, !583, !394, !660, !661}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !590, file: !564, line: 208, baseType: !1090, size: 64, offset: 9280)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!358, !394, !756}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !590, file: !564, line: 209, baseType: !971, size: 64, offset: 9344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !590, file: !564, line: 210, baseType: !763, size: 64, offset: 9408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !585, file: !564, line: 438, baseType: !1096, size: 64, offset: 13952)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !628, line: 60, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1098, file: !116, line: 241, baseType: !330, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !116, line: 242, baseType: !411, size: 32, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1098, file: !116, line: 243, baseType: !394, size: 32, offset: 96)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1098, file: !116, line: 243, baseType: !394, size: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1098, file: !116, line: 244, baseType: !394, size: 32, offset: 160)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1098, file: !116, line: 244, baseType: !394, size: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1098, file: !116, line: 245, baseType: !439, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1098, file: !116, line: 246, baseType: !509, size: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1098, file: !116, line: 247, baseType: !394, size: 32, offset: 352)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1098, file: !116, line: 251, baseType: !394, size: 32, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1098, file: !116, line: 252, baseType: !902, size: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1098, file: !116, line: 253, baseType: !509, size: 32, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1098, file: !116, line: 254, baseType: !394, size: 32, offset: 544)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1098, file: !116, line: 254, baseType: !394, size: 32, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1098, file: !116, line: 255, baseType: !394, size: 32, offset: 608)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !585, file: !564, line: 438, baseType: !1096, size: 64, offset: 14016)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !564, line: 439, baseType: !333, size: 64, offset: 14080)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !585, file: !564, line: 440, baseType: !1118, size: 32, offset: 14144)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !585, file: !564, line: 441, baseType: !509, size: 32, offset: 14176)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !585, file: !564, line: 442, baseType: !509, size: 32, offset: 14208)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !585, file: !564, line: 443, baseType: !1122, size: 448, offset: 14272)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 448, elements: !1124)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !339)
!1124 = !{!1125}
!1125 = !DISubrange(count: 7)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !585, file: !564, line: 444, baseType: !509, size: 32, offset: 14720)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !585, file: !564, line: 445, baseType: !509, size: 32, offset: 14752)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !585, file: !564, line: 446, baseType: !394, size: 32, offset: 14784)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !585, file: !564, line: 447, baseType: !432, size: 64, offset: 14848)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !585, file: !564, line: 448, baseType: !432, size: 64, offset: 14912)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !585, file: !564, line: 449, baseType: !668, size: 640, offset: 14976)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !585, file: !564, line: 450, baseType: !600, size: 32, offset: 15616)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !585, file: !564, line: 451, baseType: !1134, size: 2880, offset: 15680)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !564, line: 318, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !564, line: 319, size: 2880, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1156, !1157, !1162, !1167, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1182, !1183, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1215, !1216, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1239, !1240, !1241, !1245, !1246}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1135, file: !564, line: 320, baseType: !394, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1135, file: !564, line: 321, baseType: !394, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1135, file: !564, line: 322, baseType: !394, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1135, file: !564, line: 323, baseType: !394, size: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1135, file: !564, line: 324, baseType: !394, size: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1135, file: !564, line: 325, baseType: !394, size: 32, offset: 160)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1135, file: !564, line: 326, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !564, line: 293, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !564, line: 295, size: 448, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !564, line: 296, baseType: !1144, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1146, file: !564, line: 297, baseType: !456, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1146, file: !564, line: 297, baseType: !456, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1146, file: !564, line: 298, baseType: !439, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1146, file: !564, line: 298, baseType: !439, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1146, file: !564, line: 299, baseType: !394, size: 32, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1146, file: !564, line: 300, baseType: !394, size: 32, offset: 352)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1146, file: !564, line: 301, baseType: !394, size: 32, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1135, file: !564, line: 326, baseType: !1144, size: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1135, file: !564, line: 328, baseType: !1158, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!358, !583, !1161, !439}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1135, file: !564, line: 329, baseType: !1163, size: 64, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!358, !1161, !1166, !441, !441, !459, !439}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1135, file: !564, line: 330, baseType: !1168, size: 64, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!358, !1161}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1135, file: !564, line: 331, baseType: !1168, size: 64, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1135, file: !564, line: 334, baseType: !330, size: 64, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !564, line: 335, baseType: !411, size: 32, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1135, file: !564, line: 335, baseType: !411, size: 32, offset: 672)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1135, file: !564, line: 336, baseType: !411, size: 32, offset: 704)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1135, file: !564, line: 336, baseType: !411, size: 32, offset: 736)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1135, file: !564, line: 337, baseType: !1178, size: 64, offset: 768)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !323, line: 339, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !323, line: 339, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1135, file: !564, line: 338, baseType: !1178, size: 64, offset: 832)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1135, file: !564, line: 339, baseType: !1184, size: 64, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !323, line: 341, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !323, line: 351, size: 192, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1186, file: !323, line: 354, baseType: !74, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1186, file: !323, line: 355, baseType: !74, size: 32, offset: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1186, file: !323, line: 356, baseType: !74, size: 32, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1186, file: !323, line: 361, baseType: !74, size: 32, offset: 96)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1186, file: !323, line: 362, baseType: !505, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1135, file: !564, line: 340, baseType: !394, size: 32, offset: 960)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1135, file: !564, line: 340, baseType: !394, size: 32, offset: 992)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1135, file: !564, line: 341, baseType: !456, size: 64, offset: 1024)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1135, file: !564, line: 342, baseType: !439, size: 64, offset: 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1135, file: !564, line: 343, baseType: !459, size: 64, offset: 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1135, file: !564, line: 344, baseType: !441, size: 64, offset: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1135, file: !564, line: 345, baseType: !394, size: 32, offset: 1280)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1135, file: !564, line: 346, baseType: !1166, size: 64, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1135, file: !564, line: 347, baseType: !509, size: 32, offset: 1408)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1135, file: !564, line: 348, baseType: !394, size: 32, offset: 1440)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1135, file: !564, line: 351, baseType: !509, size: 32, offset: 1472)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1135, file: !564, line: 352, baseType: !509, size: 32, offset: 1504)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1135, file: !564, line: 353, baseType: !411, size: 32, offset: 1536)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1135, file: !564, line: 354, baseType: !411, size: 32, offset: 1568)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1135, file: !564, line: 355, baseType: !1166, size: 64, offset: 1600)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1135, file: !564, line: 356, baseType: !1166, size: 64, offset: 1664)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1135, file: !564, line: 357, baseType: !1210, size: 64, offset: 1728)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !564, line: 310, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 308, size: 32, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1212, file: !564, line: 309, baseType: !394, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1135, file: !564, line: 357, baseType: !1210, size: 64, offset: 1792)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1135, file: !564, line: 358, baseType: !1217, size: 64, offset: 1856)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !564, line: 316, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 312, size: 128, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1219, file: !564, line: 313, baseType: !333, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1219, file: !564, line: 314, baseType: !394, size: 32, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1219, file: !564, line: 315, baseType: !341, size: 8, offset: 96)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1135, file: !564, line: 359, baseType: !1217, size: 64, offset: 1920)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1135, file: !564, line: 360, baseType: !1217, size: 64, offset: 1984)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1135, file: !564, line: 361, baseType: !394, size: 32, offset: 2048)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1135, file: !564, line: 362, baseType: !411, size: 32, offset: 2080)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1135, file: !564, line: 363, baseType: !394, size: 32, offset: 2112)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1135, file: !564, line: 364, baseType: !1166, size: 64, offset: 2176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1135, file: !564, line: 365, baseType: !1184, size: 64, offset: 2240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1135, file: !564, line: 366, baseType: !411, size: 32, offset: 2304)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1135, file: !564, line: 367, baseType: !411, size: 32, offset: 2336)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1135, file: !564, line: 368, baseType: !1178, size: 64, offset: 2368)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1135, file: !564, line: 369, baseType: !1178, size: 64, offset: 2432)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1135, file: !564, line: 370, baseType: !1236, size: 64, offset: 2496)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1237)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1135, file: !564, line: 371, baseType: !1236, size: 64, offset: 2560)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1135, file: !564, line: 372, baseType: !1236, size: 64, offset: 2624)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1135, file: !564, line: 373, baseType: !1242, size: 64, offset: 2688)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !323, line: 331, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !323, line: 331, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1135, file: !564, line: 374, baseType: !505, size: 64, offset: 2752)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1135, file: !564, line: 375, baseType: !1247, size: 64, offset: 2816)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !585, file: !564, line: 451, baseType: !1134, size: 2880, offset: 18560)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !585, file: !564, line: 452, baseType: !1250, size: 64, offset: 21440)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
