; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cgne/cgne.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cgne/cgne.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 719, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117}
!116 = !DIEnumerator(name: "KSP_CG_SYMMETRIC", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_CG_HERMITIAN", value: 1, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 663, baseType: !5, size: 32, elements: !120)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!120 = !{!121, !122, !123}
!121 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 155, baseType: !5, size: 32, elements: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140}
!134 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!135 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!136 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!137 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!138 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!139 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!140 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!141 = !{!142, !145, !163, !244, !350, !184, !352, !207, !367, !370, !234, !26, !373}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 46, baseType: !144)
!143 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!144 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !148, line: 73, size: 4480, elements: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!149 = !{!150, !152, !205, !206, !208, !211, !212, !213, !214, !222, !223, !225, !229, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !247, !248, !249, !251, !252, !254, !256, !257, !258, !259, !260, !263, !265, !266, !267, !268, !269, !272, !274, !275, !276, !286, !288, !289, !293, !294, !340, !345, !347, !348, !349}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !147, file: !148, line: 74, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !147, file: !148, line: 75, baseType: !153, size: 448, offset: 64)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 448, elements: !203)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !148, line: 53, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 45, size: 448, elements: !156)
!156 = !{!157, !167, !175, !180, !187, !191, !198}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !155, file: !148, line: 46, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !145, !162}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !164, line: 330, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !164, line: 330, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !155, file: !148, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!161, !145, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !155, file: !148, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!161, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !155, file: !148, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!161, !145, !184, !145}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !155, file: !148, line: 50, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!161, !145, !184, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !155, file: !148, line: 51, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!161, !145, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !155, file: !148, line: 52, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!161, !145, !184, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!203 = !{!204}
!204 = !DISubrange(count: 1)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !147, file: !148, line: 76, baseType: !163, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 77, baseType: !207, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !147, file: !148, line: 78, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !210)
!210 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !147, file: !148, line: 78, baseType: !209, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !147, file: !148, line: 78, baseType: !209, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !147, file: !148, line: 78, baseType: !209, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !148, line: 79, baseType: !215, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !218, line: 27, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !220, line: 43, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!221 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !147, file: !148, line: 80, baseType: !207, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !148, line: 81, baseType: !224, size: 32, offset: 992)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !147, file: !148, line: 82, baseType: !226, size: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !147, file: !148, line: 83, baseType: !230, size: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !148, line: 84, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !147, file: !148, line: 85, baseType: !234, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !147, file: !148, line: 86, baseType: !234, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !147, file: !148, line: 87, baseType: !234, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 88, baseType: !145, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !147, file: !148, line: 89, baseType: !215, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 90, baseType: !234, size: 64, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !147, file: !148, line: 91, baseType: !234, size: 64, offset: 1600)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !147, file: !148, line: 92, baseType: !207, size: 32, offset: 1664)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !147, file: !148, line: 93, baseType: !244, size: 64, offset: 1728)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 94, baseType: !246, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !147, file: !148, line: 95, baseType: !207, size: 32, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !147, file: !148, line: 95, baseType: !207, size: 32, offset: 1888)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !147, file: !148, line: 96, baseType: !250, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !147, file: !148, line: 96, baseType: !250, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !147, file: !148, line: 97, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !147, file: !148, line: 97, baseType: !255, size: 64, offset: 2112)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !147, file: !148, line: 98, baseType: !207, size: 32, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !147, file: !148, line: 98, baseType: !207, size: 32, offset: 2208)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !147, file: !148, line: 99, baseType: !250, size: 64, offset: 2240)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !147, file: !148, line: 99, baseType: !250, size: 64, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !147, file: !148, line: 100, baseType: !261, size: 64, offset: 2368)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !210)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !147, file: !148, line: 100, baseType: !264, size: 64, offset: 2432)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !147, file: !148, line: 101, baseType: !207, size: 32, offset: 2496)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !147, file: !148, line: 101, baseType: !207, size: 32, offset: 2528)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !147, file: !148, line: 102, baseType: !250, size: 64, offset: 2560)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !147, file: !148, line: 102, baseType: !250, size: 64, offset: 2624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !147, file: !148, line: 103, baseType: !270, size: 64, offset: 2688)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !262)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !147, file: !148, line: 103, baseType: !273, size: 64, offset: 2752)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !147, file: !148, line: 104, baseType: !202, size: 64, offset: 2816)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !147, file: !148, line: 105, baseType: !207, size: 32, offset: 2880)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !147, file: !148, line: 106, baseType: !277, size: 128, offset: 2944)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !284)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !148, line: 64, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 61, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !280, file: !148, line: 62, baseType: !195, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !280, file: !148, line: 63, baseType: !244, size: 64, offset: 64)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !147, file: !148, line: 107, baseType: !287, size: 64, offset: 3072)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !284)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !147, file: !148, line: 108, baseType: !244, size: 64, offset: 3136)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !147, file: !148, line: 109, baseType: !290, size: 64, offset: 3200)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!161, !244}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !147, file: !148, line: 111, baseType: !207, size: 32, offset: 3264)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !147, file: !148, line: 112, baseType: !295, size: 320, offset: 3328)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !338)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!161, !299, !145, !244}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !302)
!302 = !{!303, !304, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !301, file: !10, line: 100, baseType: !207, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !10, line: 101, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !316, !317, !318, !319, !321, !323, !324, !325}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !307, file: !10, line: 84, baseType: !234, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !307, file: !10, line: 85, baseType: !234, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !10, line: 86, baseType: !244, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !307, file: !10, line: 87, baseType: !226, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !10, line: 88, baseType: !314, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !307, file: !10, line: 89, baseType: !186, size: 8, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !307, file: !10, line: 90, baseType: !234, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !307, file: !10, line: 91, baseType: !142, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !10, line: 92, baseType: !320, size: 32, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !10, line: 93, baseType: !322, size: 32, offset: 544)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !10, line: 94, baseType: !305, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !307, file: !10, line: 95, baseType: !234, size: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !307, file: !10, line: 96, baseType: !244, size: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !301, file: !10, line: 102, baseType: !234, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !301, file: !10, line: 102, baseType: !234, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !301, file: !10, line: 103, baseType: !234, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !301, file: !10, line: 104, baseType: !163, size: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !301, file: !10, line: 105, baseType: !320, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !301, file: !10, line: 105, baseType: !320, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !301, file: !10, line: 105, baseType: !320, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !301, file: !10, line: 106, baseType: !145, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !301, file: !10, line: 107, baseType: !335, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!338 = !{!339}
!339 = !DISubrange(count: 5)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !147, file: !148, line: 113, baseType: !341, size: 320, offset: 3648)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, elements: !338)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!161, !145, !244}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !147, file: !148, line: 114, baseType: !346, size: 320, offset: 3968)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 320, elements: !338)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !147, file: !148, line: 115, baseType: !320, size: 32, offset: 4288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !147, file: !148, line: 120, baseType: !335, size: 64, offset: 4352)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !147, file: !148, line: 121, baseType: !320, size: 32, offset: 4416)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !351, line: 1451, baseType: !195)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_CG", file: !354, line: 37, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/cg/cgimpl.h", directory: "/home/users/ndemeye/xSDK")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 29, size: 576, elements: !356)
!356 = !{!357, !359, !360, !361, !362, !363, !364, !365, !366}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !354, line: 30, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCGType", file: !33, line: 719, baseType: !114)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !355, file: !354, line: 31, baseType: !271, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !355, file: !354, line: 31, baseType: !271, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ned", scope: !355, file: !354, line: 32, baseType: !207, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !355, file: !354, line: 33, baseType: !270, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !355, file: !354, line: 33, baseType: !270, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !355, file: !354, line: 34, baseType: !261, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !355, file: !354, line: 34, baseType: !261, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "singlereduction", scope: !355, file: !354, line: 36, baseType: !320, size: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !164, line: 331, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !164, line: 331, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !164, line: 338, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !164, line: 338, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !132)
!374 = !{i32 7, !"Dwarf Version", i32 4}
!375 = !{i32 2, !"Debug Info Version", i32 3}
!376 = !{i32 1, !"wchar_size", i32 4}
!377 = !{i32 7, !"PIC Level", i32 2}
!378 = !{i32 7, !"uwtable", i32 1}
!379 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!380 = distinct !DISubprogram(name: "KSPCreate_CGNE", scope: !381, file: !381, line: 233, type: !382, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !626)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cgne/cgne.c", directory: "/home/users/ndemeye/xSDK")
!382 = !DISubroutineType(types: !383)
!383 = !{!161, !384}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !387)
!387 = !{!388, !390, !441, !446, !447, !448, !449, !479, !480, !481, !482, !483, !485, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !519, !525, !526, !527, !528, !533, !534, !535, !536, !541, !542, !543, !544, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !596, !597, !598, !599, !600, !607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !623, !624, !625}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !386, file: !102, line: 76, baseType: !389, size: 4480)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !148, line: 122, baseType: !147)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !386, file: !102, line: 76, baseType: !391, size: 896, offset: 4480)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 896, elements: !203)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !393)
!393 = !{!394, !402, !406, !408, !416, !417, !421, !422, !426, !430, !434, !435, !439, !440}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !392, file: !102, line: 19, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!161, !384, !398, !401}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !125, line: 21, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !125, line: 21, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !392, file: !102, line: 22, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!161, !384, !398, !398, !401}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !392, file: !102, line: 25, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !392, file: !102, line: 26, baseType: !409, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!161, !384, !412, !412}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !413, line: 16, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !413, line: 16, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !392, file: !102, line: 27, baseType: !407, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !392, file: !102, line: 28, baseType: !418, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!161, !299, !384}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !392, file: !102, line: 29, baseType: !407, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !392, file: !102, line: 30, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!161, !384, !261, !261}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !392, file: !102, line: 31, baseType: !427, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!161, !384, !207, !261, !261, !253}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !392, file: !102, line: 32, baseType: !431, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!161, !384, !320, !320, !253, !401, !261, !261}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !392, file: !102, line: 33, baseType: !407, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !392, file: !102, line: 34, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!161, !384, !171}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !392, file: !102, line: 35, baseType: !407, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !392, file: !102, line: 36, baseType: !436, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !386, file: !102, line: 77, baseType: !442, size: 64, offset: 5376)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !443, line: 14, baseType: !444)
!443 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !443, line: 14, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !386, file: !102, line: 78, baseType: !320, size: 32, offset: 5440)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !386, file: !102, line: 79, baseType: !320, size: 32, offset: 5472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !386, file: !102, line: 81, baseType: !207, size: 32, offset: 5504)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !386, file: !102, line: 82, baseType: !450, size: 64, offset: 5568)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !453)
!453 = !{!454, !455, !475, !476, !477, !478}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !452, file: !102, line: 55, baseType: !389, size: 4480)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !452, file: !102, line: 55, baseType: !456, size: 448, offset: 4480)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 448, elements: !203)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !458)
!458 = !{!459, !463, !464, !468, !469, !470, !474}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !457, file: !102, line: 42, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!161, !450, !398, !398}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !457, file: !102, line: 43, baseType: !460, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !457, file: !102, line: 44, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!161, !450}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !457, file: !102, line: 45, baseType: !465, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !457, file: !102, line: 46, baseType: !465, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !457, file: !102, line: 47, baseType: !471, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!161, !450, !171}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !457, file: !102, line: 48, baseType: !465, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !452, file: !102, line: 56, baseType: !384, size: 64, offset: 4928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !452, file: !102, line: 57, baseType: !412, size: 64, offset: 4992)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !452, file: !102, line: 58, baseType: !246, size: 64, offset: 5056)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !102, line: 59, baseType: !244, size: 64, offset: 5120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !386, file: !102, line: 83, baseType: !320, size: 32, offset: 5632)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !386, file: !102, line: 84, baseType: !320, size: 32, offset: 5664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !386, file: !102, line: 85, baseType: !320, size: 32, offset: 5696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !386, file: !102, line: 86, baseType: !320, size: 32, offset: 5728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !386, file: !102, line: 87, baseType: !484, size: 32, offset: 5760)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !386, file: !102, line: 88, baseType: !486, size: 384, offset: 5792)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 384, elements: !487)
!487 = !{!488, !489}
!488 = !DISubrange(count: 4)
!489 = !DISubrange(count: 3)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !386, file: !102, line: 89, baseType: !262, size: 64, offset: 6208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !386, file: !102, line: 90, baseType: !262, size: 64, offset: 6272)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !386, file: !102, line: 91, baseType: !262, size: 64, offset: 6336)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !386, file: !102, line: 92, baseType: !262, size: 64, offset: 6400)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !386, file: !102, line: 93, baseType: !262, size: 64, offset: 6464)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !386, file: !102, line: 94, baseType: !262, size: 64, offset: 6528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !386, file: !102, line: 95, baseType: !497, size: 32, offset: 6592)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !386, file: !102, line: 96, baseType: !320, size: 32, offset: 6624)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !386, file: !102, line: 98, baseType: !398, size: 64, offset: 6656)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !386, file: !102, line: 98, baseType: !398, size: 64, offset: 6720)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !386, file: !102, line: 102, baseType: !261, size: 64, offset: 6784)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !386, file: !102, line: 103, baseType: !261, size: 64, offset: 6848)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !386, file: !102, line: 104, baseType: !207, size: 32, offset: 6912)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !386, file: !102, line: 105, baseType: !207, size: 32, offset: 6944)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !386, file: !102, line: 106, baseType: !320, size: 32, offset: 6976)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !386, file: !102, line: 107, baseType: !261, size: 64, offset: 7040)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !386, file: !102, line: 108, baseType: !261, size: 64, offset: 7104)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !386, file: !102, line: 109, baseType: !207, size: 32, offset: 7168)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !386, file: !102, line: 110, baseType: !207, size: 32, offset: 7200)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !386, file: !102, line: 111, baseType: !320, size: 32, offset: 7232)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !386, file: !102, line: 113, baseType: !207, size: 32, offset: 7264)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !386, file: !102, line: 114, baseType: !320, size: 32, offset: 7296)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !386, file: !102, line: 117, baseType: !207, size: 32, offset: 7328)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !386, file: !102, line: 120, baseType: !515, size: 320, offset: 7360)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 320, elements: !338)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!161, !384, !207, !262, !244}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !386, file: !102, line: 121, baseType: !520, size: 320, offset: 7680)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !338)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!161, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !386, file: !102, line: 122, baseType: !346, size: 320, offset: 8000)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !386, file: !102, line: 123, baseType: !207, size: 32, offset: 8320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !386, file: !102, line: 124, baseType: !320, size: 32, offset: 8352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !386, file: !102, line: 126, baseType: !529, size: 320, offset: 8384)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 320, elements: !338)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!161, !384, !244}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !386, file: !102, line: 127, baseType: !520, size: 320, offset: 8704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !386, file: !102, line: 128, baseType: !346, size: 320, offset: 9024)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !386, file: !102, line: 129, baseType: !207, size: 32, offset: 9344)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !386, file: !102, line: 131, baseType: !537, size: 64, offset: 9408)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!161, !384, !207, !262, !540, !244}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !386, file: !102, line: 132, baseType: !290, size: 64, offset: 9472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !386, file: !102, line: 133, baseType: !244, size: 64, offset: 9536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !386, file: !102, line: 135, baseType: !244, size: 64, offset: 9600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !386, file: !102, line: 137, baseType: !545, size: 64, offset: 9664)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !102, line: 139, baseType: !244, size: 64, offset: 9728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9792)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9824)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9888)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 9984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !386, file: !102, line: 142, baseType: !320, size: 32, offset: 10208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10304)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10368)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10432)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10496)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10624)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10688)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10816)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10880)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 10944)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 11008)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !386, file: !102, line: 143, baseType: !171, size: 64, offset: 11072)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11136)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11168)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11200)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11232)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11264)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11296)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11328)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11360)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11392)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11424)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11456)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11488)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11520)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11552)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !386, file: !102, line: 147, baseType: !207, size: 32, offset: 11584)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !386, file: !102, line: 148, baseType: !401, size: 64, offset: 11648)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !386, file: !102, line: 150, baseType: !595, size: 32, offset: 11712)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !386, file: !102, line: 151, baseType: !320, size: 32, offset: 11744)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !386, file: !102, line: 153, baseType: !207, size: 32, offset: 11776)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !386, file: !102, line: 154, baseType: !207, size: 32, offset: 11808)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !386, file: !102, line: 156, baseType: !320, size: 32, offset: 11840)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !386, file: !102, line: 161, baseType: !601, size: 192, offset: 11904)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !102, line: 157, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !601, file: !102, line: 158, baseType: !412, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !601, file: !102, line: 158, baseType: !412, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !601, file: !102, line: 159, baseType: !320, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !601, file: !102, line: 160, baseType: !320, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !386, file: !102, line: 163, baseType: !608, size: 32, offset: 12096)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !386, file: !102, line: 165, baseType: !484, size: 32, offset: 12128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !386, file: !102, line: 166, baseType: !608, size: 32, offset: 12160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !386, file: !102, line: 171, baseType: !320, size: 32, offset: 12192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !386, file: !102, line: 172, baseType: !320, size: 32, offset: 12224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !386, file: !102, line: 173, baseType: !320, size: 32, offset: 12256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !386, file: !102, line: 174, baseType: !398, size: 64, offset: 12288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !386, file: !102, line: 175, baseType: !398, size: 64, offset: 12352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !386, file: !102, line: 177, baseType: !207, size: 32, offset: 12416)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !386, file: !102, line: 178, baseType: !320, size: 32, offset: 12448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !386, file: !102, line: 180, baseType: !171, size: 64, offset: 12480)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !386, file: !102, line: 182, baseType: !620, size: 64, offset: 12544)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!161, !384, !398, !398, !244}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !386, file: !102, line: 183, baseType: !620, size: 64, offset: 12608)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !386, file: !102, line: 184, baseType: !244, size: 64, offset: 12672)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !386, file: !102, line: 184, baseType: !244, size: 64, offset: 12736)
!626 = !{!627, !628, !629, !630, !632, !634, !636, !638, !640}
!627 = !DILocalVariable(name: "ksp", arg: 1, scope: !380, file: !381, line: 233, type: !384)
!628 = !DILocalVariable(name: "ierr", scope: !380, file: !381, line: 235, type: !161)
!629 = !DILocalVariable(name: "cg", scope: !380, file: !381, line: 236, type: !352)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !381, line: 239, type: !161)
!631 = distinct !DILexicalBlock(scope: !380, file: !381, line: 239, column: 31)
!632 = !DILocalVariable(name: "ierr__", scope: !633, file: !381, line: 246, type: !161)
!633 = distinct !DILexicalBlock(scope: !380, file: !381, line: 246, column: 74)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !381, line: 247, type: !161)
!635 = distinct !DILexicalBlock(scope: !380, file: !381, line: 247, column: 76)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !381, line: 248, type: !161)
!637 = distinct !DILexicalBlock(scope: !380, file: !381, line: 248, column: 67)
!638 = !DILocalVariable(name: "ierr__", scope: !639, file: !381, line: 249, type: !161)
!639 = distinct !DILexicalBlock(scope: !380, file: !381, line: 249, column: 64)
!640 = !DILocalVariable(name: "ierr__", scope: !641, file: !381, line: 268, type: !161)
!641 = distinct !DILexicalBlock(scope: !380, file: !381, line: 268, column: 90)
!642 = !DILocation(line: 0, scope: !380)
!643 = !DILocation(line: 236, column: 3, scope: !380)
!644 = !DILocation(line: 238, column: 3, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !381, line: 238, column: 3)
!646 = distinct !DILexicalBlock(scope: !647, file: !381, line: 238, column: 3)
!647 = distinct !DILexicalBlock(scope: !380, file: !381, line: 238, column: 3)
!648 = !{!649, !649, i64 0}
!649 = !{!"any pointer", !650, i64 0}
!650 = !{!"omnipotent char", !651, i64 0}
!651 = !{!"Simple C/C++ TBAA"}
!652 = !DILocation(line: 238, column: 3, scope: !646)
!653 = !DILocation(line: 238, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !381, line: 238, column: 3)
!655 = distinct !DILexicalBlock(scope: !645, file: !381, line: 238, column: 3)
!656 = !{!657, !658, i64 1536}
!657 = !{!"", !650, i64 0, !650, i64 512, !650, i64 1024, !650, i64 1280, !658, i64 1536, !658, i64 1540, !650, i64 1544}
!658 = !{!"int", !650, i64 0}
!659 = !DILocation(line: 238, column: 3, scope: !655)
!660 = !DILocation(line: 238, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !654, file: !381, line: 238, column: 3)
!662 = !{!658, !658, i64 0}
!663 = !{!657, !658, i64 1540}
!664 = !DILocation(line: 239, column: 10, scope: !380)
!665 = !{!"branch_weights", i32 2146410443, i32 1073205}
!666 = !DILocation(line: 0, scope: !631)
!667 = !DILocation(line: 239, column: 31, scope: !631)
!668 = !{!"branch_weights", i32 2000, i32 1}
!669 = !DILocation(line: 239, column: 31, scope: !670)
!670 = distinct !DILexicalBlock(scope: !631, file: !381, line: 239, column: 31)
!671 = !DILocation(line: 241, column: 3, scope: !380)
!672 = !DILocation(line: 241, column: 7, scope: !380)
!673 = !DILocation(line: 241, column: 12, scope: !380)
!674 = !{!675, !650, i64 0}
!675 = !{!"", !650, i64 0, !676, i64 8, !676, i64 16, !658, i64 24, !649, i64 32, !649, i64 40, !649, i64 48, !649, i64 56, !650, i64 64}
!676 = !{!"double", !650, i64 0}
!677 = !DILocation(line: 245, column: 8, scope: !380)
!678 = !DILocation(line: 245, column: 13, scope: !380)
!679 = !{!680, !649, i64 1216}
