; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/pcregis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/pcregis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!352 = !DILocation(line: 118, column: 10, scope: !75)
!353 = !DILocation(line: 0, scope: !141)
!354 = !DILocation(line: 118, column: 56, scope: !355)
!355 = distinct !DILexicalBlock(scope: !141, file: !76, line: 118, column: 56)
!356 = !DILocation(line: 118, column: 56, scope: !141)
!357 = !DILocation(line: 119, column: 10, scope: !75)
!358 = !DILocation(line: 0, scope: !143)
!359 = !DILocation(line: 119, column: 57, scope: !360)
!360 = distinct !DILexicalBlock(scope: !143, file: !76, line: 119, column: 57)
!361 = !DILocation(line: 119, column: 57, scope: !143)
!362 = !DILocation(line: 120, column: 10, scope: !75)
!363 = !DILocation(line: 0, scope: !145)
!364 = !DILocation(line: 120, column: 53, scope: !365)
!365 = distinct !DILexicalBlock(scope: !145, file: !76, line: 120, column: 53)
!366 = !DILocation(line: 120, column: 53, scope: !145)
!367 = !DILocation(line: 121, column: 10, scope: !75)
!368 = !DILocation(line: 0, scope: !147)
!369 = !DILocation(line: 121, column: 51, scope: !370)
!370 = distinct !DILexicalBlock(scope: !147, file: !76, line: 121, column: 51)
!371 = !DILocation(line: 121, column: 51, scope: !147)
!372 = !DILocation(line: 134, column: 10, scope: !75)
!373 = !DILocation(line: 0, scope: !149)
!374 = !DILocation(line: 134, column: 51, scope: !375)
!375 = distinct !DILexicalBlock(scope: !149, file: !76, line: 134, column: 51)
!376 = !DILocation(line: 134, column: 51, scope: !149)
!377 = !DILocation(line: 144, column: 10, scope: !75)
!378 = !DILocation(line: 0, scope: !151)
!379 = !DILocation(line: 144, column: 52, scope: !380)
!380 = distinct !DILexicalBlock(scope: !151, file: !76, line: 144, column: 52)
!381 = !DILocation(line: 144, column: 52, scope: !151)
!382 = !DILocation(line: 145, column: 10, scope: !75)
!383 = !DILocation(line: 0, scope: !153)
!384 = !DILocation(line: 145, column: 52, scope: !385)
!385 = distinct !DILexicalBlock(scope: !153, file: !76, line: 145, column: 52)
!386 = !DILocation(line: 145, column: 52, scope: !153)
!387 = !DILocation(line: 146, column: 10, scope: !75)
!388 = !DILocation(line: 0, scope: !155)
!389 = !DILocation(line: 146, column: 57, scope: !390)
!390 = distinct !DILexicalBlock(scope: !155, file: !76, line: 146, column: 57)
!391 = !DILocation(line: 146, column: 57, scope: !155)
!392 = !DILocation(line: 153, column: 3, scope: !393)
!393 = distinct !DILexicalBlock(scope: !394, file: !76, line: 153, column: 3)
!394 = distinct !DILexicalBlock(scope: !395, file: !76, line: 153, column: 3)
!395 = distinct !DILexicalBlock(scope: !75, file: !76, line: 153, column: 3)
!396 = !DILocation(line: 153, column: 3, scope: !394)
!397 = !DILocation(line: 153, column: 3, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !76, line: 153, column: 3)
!399 = distinct !DILexicalBlock(scope: !393, file: !76, line: 153, column: 3)
!400 = !DILocation(line: 153, column: 3, scope: !399)
!401 = !DILocation(line: 153, column: 3, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !76, line: 153, column: 3)
!403 = distinct !DILexicalBlock(scope: !398, file: !76, line: 153, column: 3)
!404 = !DILocation(line: 153, column: 3, scope: !403)
!405 = !DILocation(line: 153, column: 3, scope: !406)
!406 = distinct !DILexicalBlock(scope: !402, file: !76, line: 153, column: 3)
!407 = !DILocation(line: 153, column: 3, scope: !408)
!408 = distinct !DILexicalBlock(scope: !398, file: !76, line: 153, column: 3)
!409 = !DILocation(line: 153, column: 3, scope: !410)
!410 = distinct !DILexicalBlock(scope: !408, file: !76, line: 153, column: 3)
!411 = !DILocation(line: 153, column: 3, scope: !412)
!412 = distinct !DILexicalBlock(scope: !413, file: !76, line: 153, column: 3)
!413 = distinct !DILexicalBlock(scope: !410, file: !76, line: 153, column: 3)
!414 = !DILocation(line: 153, column: 3, scope: !413)
!415 = !DILocation(line: 153, column: 3, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !76, line: 153, column: 3)
!417 = !DILocation(line: 154, column: 1, scope: !75)
!418 = !DISubprogram(name: "PCRegister", scope: !419, file: !419, line: 70, type: !420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !734)
!419 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpc.h", directory: "/home/users/ndemeye/xSDK")
!420 = !DISubroutineType(types: !421)
!421 = !{!26, !61, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!26, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !427, line: 37, size: 6720, elements: !428)
!427 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!428 = !{!429, !630, !698, !703, !704, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !727, !728, !729, !730, !731, !733}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !426, file: !427, line: 38, baseType: !430, size: 4480)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !431, line: 122, baseType: !432)
!431 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !431, line: 73, size: 4480, elements: !433)
!433 = !{!434, !436, !483, !484, !486, !489, !490, !491, !492, !500, !501, !503, !507, !511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !524, !525, !526, !528, !529, !531, !533, !534, !535, !536, !537, !540, !542, !543, !544, !545, !546, !549, !551, !552, !553, !563, !565, !566, !570, !571, !620, !625, !627, !628, !629}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !432, file: !431, line: 74, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !432, file: !431, line: 75, baseType: !437, size: 448, offset: 64)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 448, elements: !481)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !431, line: 53, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 45, size: 448, elements: !440)
!440 = !{!441, !448, !456, !461, !465, !469, !476}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !439, file: !431, line: 46, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!79, !445, !447}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !439, file: !431, line: 47, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!79, !445, !452}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !453, line: 16, baseType: !454)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !453, line: 16, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !439, file: !431, line: 48, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!79, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !439, file: !431, line: 49, baseType: !462, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!79, !445, !61, !445}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !439, file: !431, line: 50, baseType: !466, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!79, !445, !61, !460}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !439, file: !431, line: 51, baseType: !470, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!79, !445, !61, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !439, file: !431, line: 52, baseType: !477, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!79, !445, !61, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!481 = !{!482}
!482 = !DISubrange(count: 1)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !432, file: !431, line: 76, baseType: !64, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !431, line: 77, baseType: !485, size: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !432, file: !431, line: 78, baseType: !487, size: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !488)
!488 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !432, file: !431, line: 78, baseType: !487, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !432, file: !431, line: 78, baseType: !487, size: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !432, file: !431, line: 78, baseType: !487, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !431, line: 79, baseType: !493, size: 64, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !496, line: 27, baseType: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !498, line: 43, baseType: !499)
!498 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!499 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !432, file: !431, line: 80, baseType: !485, size: 32, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !432, file: !431, line: 81, baseType: !502, size: 32, offset: 992)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !432, file: !431, line: 82, baseType: !504, size: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !432, file: !431, line: 83, baseType: !508, size: 64, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !432, file: !431, line: 84, baseType: !512, size: 64, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !432, file: !431, line: 85, baseType: !512, size: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !432, file: !431, line: 86, baseType: !512, size: 64, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !432, file: !431, line: 87, baseType: !512, size: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !432, file: !431, line: 88, baseType: !445, size: 64, offset: 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !432, file: !431, line: 89, baseType: !493, size: 64, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !431, line: 90, baseType: !512, size: 64, offset: 1536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !432, file: !431, line: 91, baseType: !512, size: 64, offset: 1600)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !432, file: !431, line: 92, baseType: !485, size: 32, offset: 1664)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !432, file: !431, line: 93, baseType: !68, size: 64, offset: 1728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !432, file: !431, line: 94, baseType: !523, size: 64, offset: 1792)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !494)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !432, file: !431, line: 95, baseType: !485, size: 32, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !432, file: !431, line: 95, baseType: !485, size: 32, offset: 1888)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !432, file: !431, line: 96, baseType: !527, size: 64, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !432, file: !431, line: 96, baseType: !527, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !432, file: !431, line: 97, baseType: !530, size: 64, offset: 2048)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !432, file: !431, line: 97, baseType: !532, size: 64, offset: 2112)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !432, file: !431, line: 98, baseType: !485, size: 32, offset: 2176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !432, file: !431, line: 98, baseType: !485, size: 32, offset: 2208)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !432, file: !431, line: 99, baseType: !527, size: 64, offset: 2240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !432, file: !431, line: 99, baseType: !527, size: 64, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !432, file: !431, line: 100, baseType: !538, size: 64, offset: 2368)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !488)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !432, file: !431, line: 100, baseType: !541, size: 64, offset: 2432)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !432, file: !431, line: 101, baseType: !485, size: 32, offset: 2496)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !432, file: !431, line: 101, baseType: !485, size: 32, offset: 2528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !432, file: !431, line: 102, baseType: !527, size: 64, offset: 2560)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !432, file: !431, line: 102, baseType: !527, size: 64, offset: 2624)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !432, file: !431, line: 103, baseType: !547, size: 64, offset: 2688)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !539)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !432, file: !431, line: 103, baseType: !550, size: 64, offset: 2752)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !432, file: !431, line: 104, baseType: !480, size: 64, offset: 2816)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !432, file: !431, line: 105, baseType: !485, size: 32, offset: 2880)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !432, file: !431, line: 106, baseType: !554, size: 128, offset: 2944)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 128, elements: !561)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !431, line: 64, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 61, size: 128, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !557, file: !431, line: 62, baseType: !473, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !557, file: !431, line: 63, baseType: !68, size: 64, offset: 64)
!561 = !{!562}
!562 = !DISubrange(count: 2)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !432, file: !431, line: 107, baseType: !564, size: 64, offset: 3072)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 64, elements: !561)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !432, file: !431, line: 108, baseType: !68, size: 64, offset: 3136)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !432, file: !431, line: 109, baseType: !567, size: 64, offset: 3200)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!79, !68}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !432, file: !431, line: 111, baseType: !485, size: 32, offset: 3264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !432, file: !431, line: 112, baseType: !572, size: 320, offset: 3328)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !618)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!79, !576, !445, !68}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !579)
!579 = !{!580, !581, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !578, file: !10, line: 100, baseType: !485, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !10, line: 101, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !593, !594, !595, !599, !601, !603, !604, !605}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !584, file: !10, line: 84, baseType: !512, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !584, file: !10, line: 85, baseType: !512, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !584, file: !10, line: 86, baseType: !68, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !584, file: !10, line: 87, baseType: !504, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !584, file: !10, line: 88, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !584, file: !10, line: 89, baseType: !63, size: 8, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !584, file: !10, line: 90, baseType: !512, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !584, file: !10, line: 91, baseType: !596, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !597, line: 46, baseType: !598)
!597 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!598 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !584, file: !10, line: 92, baseType: !600, size: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !10, line: 93, baseType: !602, size: 32, offset: 544)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !10, line: 94, baseType: !582, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !584, file: !10, line: 95, baseType: !512, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !584, file: !10, line: 96, baseType: !68, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !578, file: !10, line: 102, baseType: !512, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !578, file: !10, line: 102, baseType: !512, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !578, file: !10, line: 103, baseType: !512, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !578, file: !10, line: 104, baseType: !64, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !578, file: !10, line: 105, baseType: !600, size: 32, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !578, file: !10, line: 105, baseType: !600, size: 32, offset: 416)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !578, file: !10, line: 105, baseType: !600, size: 32, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !578, file: !10, line: 106, baseType: !445, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !578, file: !10, line: 107, baseType: !615, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!618 = !{!619}
!619 = !DISubrange(count: 5)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !432, file: !431, line: 113, baseType: !621, size: 320, offset: 3648)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 320, elements: !618)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!79, !445, !68}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !432, file: !431, line: 114, baseType: !626, size: 320, offset: 3968)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 320, elements: !618)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !432, file: !431, line: 115, baseType: !600, size: 32, offset: 4288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !432, file: !431, line: 120, baseType: !615, size: 64, offset: 4352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !432, file: !431, line: 121, baseType: !600, size: 32, offset: 4416)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !426, file: !427, line: 38, baseType: !631, size: 1152, offset: 4480)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 1152, elements: !481)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !427, line: 13, size: 1152, elements: !633)
!633 = !{!634, !639, !647, !654, !660, !665, !666, !670, !674, !682, !683, !688, !689, !690, !691, !692, !696, !697}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !632, file: !427, line: 14, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!79, !638}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !425)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !632, file: !427, line: 15, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!79, !638, !643, !643}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !644, line: 21, baseType: !645)
!644 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !644, line: 21, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !632, file: !427, line: 16, baseType: !648, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!79, !638, !651, !651}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !632, file: !427, line: 17, baseType: !655, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!79, !638, !643, !643, !643, !539, !539, !539, !485, !600, !530, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !632, file: !427, line: 18, baseType: !661, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!79, !638, !664, !643, !643, !643}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !632, file: !427, line: 19, baseType: !640, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !632, file: !427, line: 20, baseType: !667, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!79, !638, !485, !643, !643, !643}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !632, file: !427, line: 21, baseType: !671, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!79, !576, !638}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !632, file: !427, line: 22, baseType: !675, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!79, !638, !678, !643, !643}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !679, line: 22, baseType: !680)
!679 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !679, line: 22, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !632, file: !427, line: 23, baseType: !675, size: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !632, file: !427, line: 24, baseType: !684, size: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!79, !638, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !632, file: !427, line: 25, baseType: !640, size: 64, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !632, file: !427, line: 26, baseType: !640, size: 64, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !632, file: !427, line: 27, baseType: !635, size: 64, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !632, file: !427, line: 28, baseType: !635, size: 64, offset: 896)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !632, file: !427, line: 29, baseType: !693, size: 64, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!79, !638, !452}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !632, file: !427, line: 30, baseType: !635, size: 64, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !632, file: !427, line: 31, baseType: !693, size: 64, offset: 1088)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !426, file: !427, line: 39, baseType: !699, size: 64, offset: 5632)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !700, line: 14, baseType: !701)
!700 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !700, line: 14, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !426, file: !427, line: 40, baseType: !485, size: 32, offset: 5696)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !426, file: !427, line: 41, baseType: !523, size: 64, offset: 5760)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !426, file: !427, line: 41, baseType: !523, size: 64, offset: 5824)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !426, file: !427, line: 42, baseType: !600, size: 32, offset: 5888)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !427, line: 43, baseType: !708, size: 32, offset: 5920)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !426, file: !427, line: 45, baseType: !485, size: 32, offset: 5952)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !426, file: !427, line: 46, baseType: !600, size: 32, offset: 5984)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !426, file: !427, line: 47, baseType: !651, size: 64, offset: 6016)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !426, file: !427, line: 47, baseType: !651, size: 64, offset: 6080)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !426, file: !427, line: 48, baseType: !643, size: 64, offset: 6144)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !426, file: !427, line: 48, baseType: !643, size: 64, offset: 6208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !426, file: !427, line: 49, baseType: !600, size: 32, offset: 6272)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !426, file: !427, line: 50, baseType: !600, size: 32, offset: 6304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !426, file: !427, line: 51, baseType: !718, size: 64, offset: 6336)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!79, !638, !485, !721, !721, !687, !68}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !724, line: 11, baseType: !725)
!724 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !724, line: 11, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !426, file: !427, line: 52, baseType: !68, size: 64, offset: 6400)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !427, line: 53, baseType: !68, size: 64, offset: 6464)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !426, file: !427, line: 54, baseType: !485, size: 32, offset: 6528)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !426, file: !427, line: 55, baseType: !68, size: 64, offset: 6592)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !426, file: !427, line: 56, baseType: !732, size: 32, offset: 6656)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !426, file: !427, line: 57, baseType: !732, size: 32, offset: 6688)
!734 = !{}
!735 = !DISubprogram(name: "PetscError", scope: !55, file: !55, line: 668, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !734)
!736 = !DISubroutineType(types: !737)
!737 = !{!79, !66, !26, !61, !61, !26, !54, !61, null}
