; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexreorder.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexreorder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 99, baseType: !99, size: 32, elements: !100)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplex.h", directory: "/home/users/ndemeye/xSDK")
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_INVALID", value: -1)
!102 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_NONE", value: 0)
!103 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_PARTIAL", value: 1)
!104 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_MIXED", value: 2)
!105 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_FULL", value: 3)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 30, baseType: !5, size: 32, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplextypes.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116}
!109 = !DIEnumerator(name: "DM_REFINER_REGULAR", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "DM_REFINER_TO_BOX", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "DM_REFINER_TO_SIMPLEX", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "DM_REFINER_ALFELD2D", value: 3, isUnsigned: true)
!113 = !DIEnumerator(name: "DM_REFINER_ALFELD3D", value: 4, isUnsigned: true)
!114 = !DIEnumerator(name: "DM_REFINER_POWELL_SABIN", value: 5, isUnsigned: true)
!115 = !DIEnumerator(name: "DM_REFINER_BOUNDARYLAYER", value: 6, isUnsigned: true)
!116 = !DIEnumerator(name: "DM_REFINER_SBR", value: 7, isUnsigned: true)
!117 = !{!118, !122, !123, !292, !158, !326, !208}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !119, line: 330, baseType: !120)
!119 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !119, line: 330, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !126, line: 73, size: 4480, elements: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!127 = !{!128, !130, !179, !180, !182, !185, !186, !187, !188, !196, !197, !199, !203, !207, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !224, !225, !227, !229, !230, !231, !232, !233, !236, !238, !239, !240, !241, !242, !245, !247, !248, !249, !259, !261, !262, !266, !267, !316, !321, !323, !324, !325}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !125, file: !126, line: 74, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !99)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !125, file: !126, line: 75, baseType: !131, size: 448, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 448, elements: !177)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !126, line: 53, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 45, size: 448, elements: !134)
!134 = !{!135, !141, !149, !154, !161, !165, !172}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !133, file: !126, line: 46, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !123, !140}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !99)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !133, file: !126, line: 47, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!139, !123, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !146, line: 16, baseType: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !146, line: 16, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !133, file: !126, line: 48, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!139, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !133, file: !126, line: 49, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!139, !123, !158, !123}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !133, file: !126, line: 50, baseType: !162, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!139, !123, !158, !153}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !133, file: !126, line: 51, baseType: !166, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!139, !123, !158, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !133, file: !126, line: 52, baseType: !173, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!139, !123, !158, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !125, file: !126, line: 76, baseType: !118, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !126, line: 77, baseType: !181, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !99)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !184)
!184 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !126, line: 79, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !192, line: 27, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !194, line: 43, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!195 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !125, file: !126, line: 80, baseType: !181, size: 32, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !125, file: !126, line: 81, baseType: !198, size: 32, offset: 992)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !99)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !125, file: !126, line: 82, baseType: !200, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !125, file: !126, line: 83, baseType: !204, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !125, file: !126, line: 84, baseType: !208, size: 64, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !125, file: !126, line: 85, baseType: !208, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !125, file: !126, line: 86, baseType: !208, size: 64, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !125, file: !126, line: 87, baseType: !208, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !125, file: !126, line: 88, baseType: !123, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !125, file: !126, line: 89, baseType: !189, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !126, line: 90, baseType: !208, size: 64, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !125, file: !126, line: 91, baseType: !208, size: 64, offset: 1600)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !125, file: !126, line: 92, baseType: !181, size: 32, offset: 1664)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !125, file: !126, line: 93, baseType: !122, size: 64, offset: 1728)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !126, line: 94, baseType: !219, size: 64, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !190)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !125, file: !126, line: 95, baseType: !181, size: 32, offset: 1856)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !125, file: !126, line: 95, baseType: !181, size: 32, offset: 1888)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !125, file: !126, line: 96, baseType: !223, size: 64, offset: 1920)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !125, file: !126, line: 96, baseType: !223, size: 64, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !125, file: !126, line: 97, baseType: !226, size: 64, offset: 2048)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !125, file: !126, line: 97, baseType: !228, size: 64, offset: 2112)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !125, file: !126, line: 98, baseType: !181, size: 32, offset: 2176)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !125, file: !126, line: 98, baseType: !181, size: 32, offset: 2208)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !125, file: !126, line: 99, baseType: !223, size: 64, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !125, file: !126, line: 99, baseType: !223, size: 64, offset: 2304)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !125, file: !126, line: 100, baseType: !234, size: 64, offset: 2368)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !125, file: !126, line: 100, baseType: !237, size: 64, offset: 2432)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !125, file: !126, line: 101, baseType: !181, size: 32, offset: 2496)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !125, file: !126, line: 101, baseType: !181, size: 32, offset: 2528)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !125, file: !126, line: 102, baseType: !223, size: 64, offset: 2560)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !125, file: !126, line: 102, baseType: !223, size: 64, offset: 2624)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !125, file: !126, line: 103, baseType: !243, size: 64, offset: 2688)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !235)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !125, file: !126, line: 103, baseType: !246, size: 64, offset: 2752)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !125, file: !126, line: 104, baseType: !176, size: 64, offset: 2816)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !125, file: !126, line: 105, baseType: !181, size: 32, offset: 2880)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !125, file: !126, line: 106, baseType: !250, size: 128, offset: 2944)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, elements: !257)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !126, line: 64, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 61, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !253, file: !126, line: 62, baseType: !169, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !253, file: !126, line: 63, baseType: !122, size: 64, offset: 64)
!257 = !{!258}
!258 = !DISubrange(count: 2)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !125, file: !126, line: 107, baseType: !260, size: 64, offset: 3072)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !257)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !125, file: !126, line: 108, baseType: !122, size: 64, offset: 3136)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !125, file: !126, line: 109, baseType: !263, size: 64, offset: 3200)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!139, !122}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !125, file: !126, line: 111, baseType: !181, size: 32, offset: 3264)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !125, file: !126, line: 112, baseType: !268, size: 320, offset: 3328)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 320, elements: !314)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!139, !272, !123, !122}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !275)
!275 = !{!276, !277, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !274, file: !10, line: 100, baseType: !181, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !10, line: 101, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !289, !290, !291, !295, !297, !299, !300, !301}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !280, file: !10, line: 84, baseType: !208, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !280, file: !10, line: 85, baseType: !208, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !10, line: 86, baseType: !122, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !280, file: !10, line: 87, baseType: !200, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !280, file: !10, line: 88, baseType: !287, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !280, file: !10, line: 89, baseType: !160, size: 8, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !280, file: !10, line: 90, baseType: !208, size: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !280, file: !10, line: 91, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !293, line: 46, baseType: !294)
!293 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!294 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !280, file: !10, line: 92, baseType: !296, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !10, line: 93, baseType: !298, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !10, line: 94, baseType: !278, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !280, file: !10, line: 95, baseType: !208, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !280, file: !10, line: 96, baseType: !122, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !274, file: !10, line: 102, baseType: !208, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !274, file: !10, line: 102, baseType: !208, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !274, file: !10, line: 103, baseType: !208, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !274, file: !10, line: 104, baseType: !118, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !274, file: !10, line: 106, baseType: !123, size: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !274, file: !10, line: 107, baseType: !311, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!314 = !{!315}
!315 = !DISubrange(count: 5)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !125, file: !126, line: 113, baseType: !317, size: 320, offset: 3648)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 320, elements: !314)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!139, !123, !122}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !125, file: !126, line: 114, baseType: !322, size: 320, offset: 3968)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 320, elements: !314)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !125, file: !126, line: 115, baseType: !296, size: 32, offset: 4288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !125, file: !126, line: 120, baseType: !311, size: 64, offset: 4352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !125, file: !126, line: 121, baseType: !296, size: 32, offset: 4416)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Plex", file: !328, line: 213, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmpleximpl.h", directory: "/home/users/ndemeye/xSDK")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 124, size: 3712, elements: !330)
!330 = !{!331, !332, !438, !439, !440, !441, !442, !443, !444, !445, !446, !452, !453, !455, !456, !457, !459, !460, !461, !462, !467, !468, !469, !474, !475, !476, !477, !478, !479, !480, !481, !482, !1120, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1134, !1135, !1136, !1140, !1141, !1142, !1143, !1144, !1148, !1149, !1150, !1168, !1169, !1170, !1171, !1172, !1173}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !329, file: !328, line: 125, baseType: !181, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "coneSection", scope: !329, file: !328, line: 127, baseType: !333, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !334, line: 18, baseType: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !337, line: 29, size: 5760, elements: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!338 = !{!339, !341, !343, !344, !345, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !361, !362, !364, !365, !367, !368, !397, !398, !399}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !336, file: !337, line: 30, baseType: !340, size: 4480)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !126, line: 122, baseType: !125)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !336, file: !337, line: 30, baseType: !342, size: 32, offset: 4480)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !177)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !336, file: !337, line: 31, baseType: !181, size: 32, offset: 4512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !336, file: !337, line: 31, baseType: !181, size: 32, offset: 4544)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !336, file: !337, line: 32, baseType: !346, size: 64, offset: 4608)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !347, line: 11, baseType: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !347, line: 11, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !336, file: !337, line: 33, baseType: !296, size: 32, offset: 4672)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !336, file: !337, line: 34, baseType: !296, size: 32, offset: 4704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !336, file: !337, line: 35, baseType: !226, size: 64, offset: 4736)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !336, file: !337, line: 36, baseType: !226, size: 64, offset: 4800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !336, file: !337, line: 37, baseType: !181, size: 32, offset: 4864)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !336, file: !337, line: 38, baseType: !333, size: 64, offset: 4928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !336, file: !337, line: 39, baseType: !226, size: 64, offset: 4992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !336, file: !337, line: 40, baseType: !296, size: 32, offset: 5056)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !336, file: !337, line: 42, baseType: !181, size: 32, offset: 5088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !336, file: !337, line: 43, baseType: !360, size: 64, offset: 5120)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !336, file: !337, line: 44, baseType: !226, size: 64, offset: 5184)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !336, file: !337, line: 45, baseType: !363, size: 64, offset: 5248)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !336, file: !337, line: 46, baseType: !296, size: 32, offset: 5312)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !336, file: !337, line: 47, baseType: !366, size: 64, offset: 5376)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !336, file: !337, line: 49, baseType: !123, size: 64, offset: 5440)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !336, file: !337, line: 50, baseType: !369, size: 64, offset: 5504)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !337, line: 27, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !337, line: 27, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !337, line: 27, size: 320, elements: !373)
!373 = !{!374, !378, !379, !380, !381, !383, !390}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !372, file: !337, line: 27, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !376, line: 166, baseType: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !376, line: 139, baseType: !5)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !372, file: !337, line: 27, baseType: !375, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !372, file: !337, line: 27, baseType: !375, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !372, file: !337, line: 27, baseType: !375, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !337, line: 27, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !372, file: !337, line: 27, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !337, line: 10, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !337, line: 8, size: 64, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !386, file: !337, line: 9, baseType: !181, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !386, file: !337, line: 9, baseType: !181, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !372, file: !337, line: 27, baseType: !391, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !337, line: 14, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 12, size: 128, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !393, file: !337, line: 13, baseType: !226, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !393, file: !337, line: 13, baseType: !226, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !336, file: !337, line: 51, baseType: !333, size: 64, offset: 5568)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !336, file: !337, line: 52, baseType: !346, size: 64, offset: 5632)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !336, file: !337, line: 53, baseType: !400, size: 64, offset: 5696)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !334, line: 33, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !337, line: 72, size: 4864, elements: !403)
!403 = !{!404, !405, !427, !428, !437}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !402, file: !337, line: 73, baseType: !340, size: 4480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !402, file: !337, line: 73, baseType: !406, size: 192, offset: 4480)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 192, elements: !177)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !337, line: 56, size: 192, elements: !408)
!408 = !{!409, !419, !423}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !407, file: !337, line: 57, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!139, !400, !333, !181, !413, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !407, file: !337, line: 58, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!139, !400}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !407, file: !337, line: 59, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!139, !400, !145}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !337, line: 74, baseType: !122, size: 64, offset: 4672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !402, file: !337, line: 75, baseType: !429, size: 64, offset: 4736)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !337, line: 62, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !337, line: 64, size: 256, elements: !432)
!432 = !{!433, !434, !435, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !337, line: 66, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !431, file: !337, line: 67, baseType: !415, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !431, file: !337, line: 68, baseType: !416, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !431, file: !337, line: 69, baseType: !181, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !402, file: !337, line: 76, baseType: !429, size: 64, offset: 4800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "maxConeSize", scope: !329, file: !328, line: 128, baseType: !181, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cones", scope: !329, file: !328, line: 129, baseType: !226, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "coneOrientations", scope: !329, file: !328, line: 130, baseType: !226, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "supportSection", scope: !329, file: !328, line: 131, baseType: !333, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "maxSupportSize", scope: !329, file: !328, line: 132, baseType: !181, size: 32, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "supports", scope: !329, file: !328, line: 133, baseType: !226, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "refinementUniform", scope: !329, file: !328, line: 134, baseType: !296, size: 32, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "refinementLimit", scope: !329, file: !328, line: 135, baseType: !235, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "refinementFunc", scope: !329, file: !328, line: 136, baseType: !447, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!139, !450, !234}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !329, file: !328, line: 137, baseType: !181, size: 32, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "interpolated", scope: !329, file: !328, line: 138, baseType: !454, size: 32, offset: 736)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexInterpolatedFlag", file: !98, line: 105, baseType: !97)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "interpolatedCollective", scope: !329, file: !328, line: 139, baseType: !454, size: 32, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "facesTmp", scope: !329, file: !328, line: 141, baseType: !226, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cellRefiner", scope: !329, file: !328, line: 144, baseType: !458, size: 32, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexCellRefinerType", file: !107, line: 30, baseType: !106)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "regularRefinement", scope: !329, file: !328, line: 145, baseType: !296, size: 32, offset: 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tetgenOpts", scope: !329, file: !328, line: 148, baseType: !208, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "triangleOpts", scope: !329, file: !328, line: 149, baseType: !208, size: 64, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "partitioner", scope: !329, file: !328, line: 150, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !464, line: 13, baseType: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !464, line: 13, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "partitionBalance", scope: !329, file: !328, line: 151, baseType: !296, size: 32, offset: 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "remeshBd", scope: !329, file: !328, line: 152, baseType: !296, size: 32, offset: 1184)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "subpointMap", scope: !329, file: !328, line: 155, baseType: !470, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !471, line: 12, baseType: !472)
!471 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !471, line: 12, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "subpointIS", scope: !329, file: !328, line: 156, baseType: !346, size: 64, offset: 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "subpointState", scope: !329, file: !328, line: 157, baseType: !219, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "depthState", scope: !329, file: !328, line: 160, baseType: !219, size: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeState", scope: !329, file: !328, line: 161, baseType: !219, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "globalVertexNumbers", scope: !329, file: !328, line: 162, baseType: !346, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "globalCellNumbers", scope: !329, file: !328, line: 163, baseType: !346, size: 64, offset: 1600)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "anchorSection", scope: !329, file: !328, line: 166, baseType: !333, size: 64, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "anchorIS", scope: !329, file: !328, line: 167, baseType: !346, size: 64, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "createanchors", scope: !329, file: !328, line: 168, baseType: !483, size: 64, offset: 1792)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!139, !486}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !489)
!489 = !{!490, !491, !709, !713, !714, !715, !716, !726, !727, !735, !736, !744, !745, !746, !747, !751, !752, !756, !758, !760, !761, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !789, !801, !813, !825, !834, !835, !854, !855, !856, !857, !858, !859, !861, !862, !863, !883, !884, !885, !886, !887, !888, !892, !893, !897, !898, !899, !900, !901, !902, !903, !904, !905, !908, !920, !921, !922, !931, !1019, !1020, !1108, !1109, !1110, !1111, !1113, !1115, !1116, !1117, !1118, !1119}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !488, file: !47, line: 203, baseType: !340, size: 4480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !488, file: !47, line: 203, baseType: !492, size: 3456, offset: 4480)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 3456, elements: !177)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !494)
!494 = !{!495, !499, !500, !505, !509, !510, !511, !512, !521, !522, !523, !529, !530, !538, !547, !556, !560, !564, !565, !570, !571, !575, !576, !580, !581, !585, !589, !594, !595, !596, !597, !598, !599, !600, !604, !608, !612, !617, !621, !632, !636, !641, !648, !652, !653, !659, !668, !672, !680, !684, !692, !696, !704, !705}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !493, file: !47, line: 31, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!139, !486, !145}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !493, file: !47, line: 32, baseType: !496, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !493, file: !47, line: 33, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!139, !486, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !493, file: !47, line: 34, baseType: !506, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!139, !272, !486}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !493, file: !47, line: 35, baseType: !483, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !493, file: !47, line: 36, baseType: !483, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !493, file: !47, line: 37, baseType: !483, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !493, file: !47, line: 38, baseType: !513, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!139, !486, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !518, line: 21, baseType: !519)
!518 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !518, line: 21, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !493, file: !47, line: 39, baseType: !513, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !493, file: !47, line: 40, baseType: !483, size: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !493, file: !47, line: 41, baseType: !524, size: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!139, !486, !226, !366, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !493, file: !47, line: 42, baseType: !501, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !493, file: !47, line: 43, baseType: !531, size: 64, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!139, !486, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !493, file: !47, line: 45, baseType: !539, size: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!139, !486, !542, !543}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !347, line: 51, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !347, line: 51, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !493, file: !47, line: 46, baseType: !548, size: 64, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!139, !486, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !553, line: 16, baseType: !554)
!553 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !553, line: 16, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !493, file: !47, line: 47, baseType: !557, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!139, !486, !486, !551, !516}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !493, file: !47, line: 48, baseType: !561, size: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!139, !486, !486, !551}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !493, file: !47, line: 49, baseType: !561, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !493, file: !47, line: 50, baseType: !566, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!139, !486, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !493, file: !47, line: 51, baseType: !561, size: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !493, file: !47, line: 53, baseType: !572, size: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!139, !486, !118, !504}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !493, file: !47, line: 54, baseType: !572, size: 64, offset: 1344)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !493, file: !47, line: 55, baseType: !577, size: 64, offset: 1408)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!139, !486, !181, !504}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !493, file: !47, line: 56, baseType: !577, size: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !493, file: !47, line: 57, baseType: !582, size: 64, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!139, !486, !470, !504}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !493, file: !47, line: 58, baseType: !586, size: 64, offset: 1600)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!139, !486, !517, !470, !504}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !493, file: !47, line: 60, baseType: !590, size: 64, offset: 1664)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!139, !486, !517, !593, !517}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !493, file: !47, line: 61, baseType: !590, size: 64, offset: 1728)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !493, file: !47, line: 62, baseType: !590, size: 64, offset: 1792)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !493, file: !47, line: 63, baseType: !590, size: 64, offset: 1856)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !493, file: !47, line: 64, baseType: !590, size: 64, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !493, file: !47, line: 65, baseType: !590, size: 64, offset: 1984)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !493, file: !47, line: 67, baseType: !483, size: 64, offset: 2048)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !493, file: !47, line: 69, baseType: !601, size: 64, offset: 2112)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!139, !486, !517, !517}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !493, file: !47, line: 71, baseType: !605, size: 64, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!139, !486, !181, !413, !528, !504}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !493, file: !47, line: 72, baseType: !609, size: 64, offset: 2240)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!139, !504, !181, !527, !504}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !493, file: !47, line: 73, baseType: !613, size: 64, offset: 2304)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!139, !486, !226, !366, !527, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !493, file: !47, line: 74, baseType: !618, size: 64, offset: 2368)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!139, !486, !226, !366, !527, !527, !616}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !493, file: !47, line: 75, baseType: !622, size: 64, offset: 2432)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!139, !486, !181, !504, !625, !625, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !628, line: 59, baseType: !629)
!628 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !628, line: 15, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !628, line: 15, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !493, file: !47, line: 77, baseType: !633, size: 64, offset: 2496)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!139, !486, !181, !226, !226}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !493, file: !47, line: 78, baseType: !637, size: 64, offset: 2560)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!139, !486, !517, !640, !629}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !493, file: !47, line: 79, baseType: !642, size: 64, offset: 2624)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!139, !486, !226, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !493, file: !47, line: 80, baseType: !649, size: 64, offset: 2688)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!139, !486, !234, !234}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !493, file: !47, line: 81, baseType: !649, size: 64, offset: 2752)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !493, file: !47, line: 82, baseType: !654, size: 64, offset: 2816)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!139, !486, !517, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !493, file: !47, line: 84, baseType: !660, size: 64, offset: 2880)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!139, !486, !235, !663, !667, !593, !517}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!139, !181, !235, !450, !181, !243, !122}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !493, file: !47, line: 85, baseType: !669, size: 64, offset: 2944)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!139, !486, !235, !470, !181, !413, !181, !413, !663, !667, !593, !517}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !493, file: !47, line: 86, baseType: !673, size: 64, offset: 3008)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!139, !486, !235, !517, !676, !593, !517}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !181, !181, !181, !413, !413, !417, !417, !417, !413, !413, !417, !417, !417, !235, !450, !181, !417, !243}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !493, file: !47, line: 87, baseType: !681, size: 64, offset: 3072)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!139, !486, !235, !470, !181, !413, !181, !413, !517, !676, !593, !517}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !493, file: !47, line: 88, baseType: !685, size: 64, offset: 3136)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!139, !486, !235, !470, !181, !413, !181, !413, !517, !688, !593, !517}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !181, !181, !181, !413, !413, !417, !417, !417, !413, !413, !417, !417, !417, !235, !450, !450, !181, !417, !243}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !493, file: !47, line: 89, baseType: !693, size: 64, offset: 3200)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!139, !486, !235, !663, !667, !517, !234}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !493, file: !47, line: 90, baseType: !697, size: 64, offset: 3264)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!139, !486, !235, !700, !667, !517, !450, !234}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!139, !181, !235, !450, !450, !181, !243, !122}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !493, file: !47, line: 91, baseType: !693, size: 64, offset: 3328)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !493, file: !47, line: 93, baseType: !706, size: 64, offset: 3392)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!139, !486, !486, !569, !569}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !488, file: !47, line: 204, baseType: !710, size: 6400, offset: 7936)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 6400, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 100)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !488, file: !47, line: 204, baseType: !710, size: 6400, offset: 14336)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !488, file: !47, line: 205, baseType: !710, size: 6400, offset: 20736)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !488, file: !47, line: 205, baseType: !710, size: 6400, offset: 27136)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !488, file: !47, line: 206, baseType: !717, size: 64, offset: 33536)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !720)
!720 = !{!721, !722, !723, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !719, file: !47, line: 143, baseType: !517, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !47, line: 144, baseType: !208, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !719, file: !47, line: 145, baseType: !724, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !719, file: !47, line: 146, baseType: !717, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !488, file: !47, line: 207, baseType: !717, size: 64, offset: 33600)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !488, file: !47, line: 208, baseType: !728, size: 64, offset: 33664)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !730, file: !47, line: 151, baseType: !292, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !730, file: !47, line: 152, baseType: !122, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !730, file: !47, line: 153, baseType: !728, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !488, file: !47, line: 208, baseType: !728, size: 64, offset: 33728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !488, file: !47, line: 209, baseType: !737, size: 64, offset: 33792)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !739, file: !47, line: 159, baseType: !470, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !739, file: !47, line: 160, baseType: !296, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !739, file: !47, line: 161, baseType: !738, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !488, file: !47, line: 210, baseType: !470, size: 64, offset: 33856)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !488, file: !47, line: 211, baseType: !470, size: 64, offset: 33920)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !488, file: !47, line: 212, baseType: !122, size: 64, offset: 33984)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !488, file: !47, line: 213, baseType: !748, size: 64, offset: 34048)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!139, !667}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !488, file: !47, line: 214, baseType: !542, size: 32, offset: 34112)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !488, file: !47, line: 215, baseType: !753, size: 64, offset: 34176)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !553, line: 1378, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !553, line: 1378, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !488, file: !47, line: 216, baseType: !757, size: 64, offset: 34240)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !518, line: 83, baseType: !158)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !488, file: !47, line: 217, baseType: !759, size: 64, offset: 34304)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !553, line: 25, baseType: !158)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !488, file: !47, line: 218, baseType: !181, size: 32, offset: 34368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !488, file: !47, line: 219, baseType: !762, size: 64, offset: 34432)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !347, line: 30, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !347, line: 30, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !488, file: !47, line: 220, baseType: !296, size: 32, offset: 34496)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !488, file: !47, line: 221, baseType: !296, size: 32, offset: 34528)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !488, file: !47, line: 222, baseType: !181, size: 32, offset: 34560)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !488, file: !47, line: 222, baseType: !181, size: 32, offset: 34592)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !488, file: !47, line: 223, baseType: !296, size: 32, offset: 34624)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !488, file: !47, line: 224, baseType: !296, size: 32, offset: 34656)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !47, line: 225, baseType: !122, size: 64, offset: 34688)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !488, file: !47, line: 227, baseType: !486, size: 64, offset: 34752)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !488, file: !47, line: 228, baseType: !486, size: 64, offset: 34816)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !488, file: !47, line: 229, baseType: !775, size: 64, offset: 34880)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !778)
!778 = !{!779, !783, !787, !788}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !777, file: !47, line: 102, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!139, !486, !486, !122}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !777, file: !47, line: 103, baseType: !784, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!139, !486, !552, !517, !552, !486, !122}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !777, file: !47, line: 104, baseType: !122, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !47, line: 105, baseType: !775, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !488, file: !47, line: 230, baseType: !790, size: 64, offset: 34944)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !793)
!793 = !{!794, !795, !799, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !792, file: !47, line: 110, baseType: !780, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !792, file: !47, line: 111, baseType: !796, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!139, !486, !552, !486, !122}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !792, file: !47, line: 112, baseType: !122, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !47, line: 113, baseType: !790, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !488, file: !47, line: 231, baseType: !802, size: 64, offset: 35008)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !805)
!805 = !{!806, !807, !811, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !804, file: !47, line: 118, baseType: !780, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !804, file: !47, line: 119, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!139, !486, !627, !627, !486, !122}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !804, file: !47, line: 120, baseType: !122, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !47, line: 121, baseType: !802, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !488, file: !47, line: 232, baseType: !814, size: 64, offset: 35072)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !817)
!817 = !{!818, !822, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !816, file: !47, line: 126, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!139, !486, !517, !593, !517, !122}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !816, file: !47, line: 127, baseType: !819, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !816, file: !47, line: 128, baseType: !122, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !816, file: !47, line: 129, baseType: !814, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !488, file: !47, line: 233, baseType: !826, size: 64, offset: 35136)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !828, file: !47, line: 134, baseType: !819, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !828, file: !47, line: 135, baseType: !819, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !828, file: !47, line: 136, baseType: !122, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !47, line: 137, baseType: !826, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !488, file: !47, line: 235, baseType: !181, size: 32, offset: 35200)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !488, file: !47, line: 237, baseType: !836, size: 64, offset: 35264)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !853}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !839, file: !47, line: 27, baseType: !375, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !839, file: !47, line: 27, baseType: !375, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !839, file: !47, line: 27, baseType: !375, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !839, file: !47, line: 27, baseType: !375, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !839, file: !47, line: 27, baseType: !382, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !839, file: !47, line: 27, baseType: !847, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !849, file: !47, line: 19, baseType: !470, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !849, file: !47, line: 20, baseType: !181, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !839, file: !47, line: 27, baseType: !516, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !488, file: !47, line: 239, baseType: !629, size: 64, offset: 35328)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !488, file: !47, line: 240, baseType: !629, size: 64, offset: 35392)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !488, file: !47, line: 241, baseType: !629, size: 64, offset: 35456)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !488, file: !47, line: 242, baseType: !629, size: 64, offset: 35520)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !488, file: !47, line: 243, baseType: !296, size: 32, offset: 35584)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !488, file: !47, line: 245, baseType: !860, size: 64, offset: 35616)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !257)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !488, file: !47, line: 246, baseType: !333, size: 64, offset: 35712)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !488, file: !47, line: 247, baseType: !333, size: 64, offset: 35776)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !488, file: !47, line: 248, baseType: !864, size: 64, offset: 35840)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !347, line: 60, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !866, file: !25, line: 241, baseType: !118, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !866, file: !25, line: 242, baseType: !198, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !866, file: !25, line: 243, baseType: !181, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !866, file: !25, line: 243, baseType: !181, size: 32, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !866, file: !25, line: 244, baseType: !181, size: 32, offset: 160)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !866, file: !25, line: 244, baseType: !181, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !866, file: !25, line: 245, baseType: !226, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !866, file: !25, line: 246, baseType: !296, size: 32, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !866, file: !25, line: 247, baseType: !181, size: 32, offset: 352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !866, file: !25, line: 251, baseType: !181, size: 32, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !866, file: !25, line: 252, baseType: !762, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !866, file: !25, line: 253, baseType: !296, size: 32, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !866, file: !25, line: 254, baseType: !181, size: 32, offset: 544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !866, file: !25, line: 254, baseType: !181, size: 32, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !866, file: !25, line: 255, baseType: !181, size: 32, offset: 608)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !488, file: !47, line: 250, baseType: !333, size: 64, offset: 35904)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !488, file: !47, line: 251, baseType: !552, size: 64, offset: 35968)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !488, file: !47, line: 253, baseType: !486, size: 64, offset: 36032)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !488, file: !47, line: 254, baseType: !517, size: 64, offset: 36096)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !488, file: !47, line: 255, baseType: !122, size: 64, offset: 36160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !488, file: !47, line: 256, baseType: !889, size: 64, offset: 36224)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!139, !486, !122}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !488, file: !47, line: 257, baseType: !889, size: 64, offset: 36288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !488, file: !47, line: 258, baseType: !894, size: 64, offset: 36352)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!139, !486, !450, !296, !416, !122}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !488, file: !47, line: 260, baseType: !181, size: 32, offset: 36416)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !488, file: !47, line: 261, baseType: !486, size: 64, offset: 36480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !488, file: !47, line: 262, baseType: !517, size: 64, offset: 36544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !488, file: !47, line: 263, baseType: !517, size: 64, offset: 36608)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !488, file: !47, line: 264, baseType: !296, size: 32, offset: 36672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !488, file: !47, line: 265, baseType: !535, size: 64, offset: 36736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !488, file: !47, line: 266, baseType: !234, size: 64, offset: 36800)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !488, file: !47, line: 266, baseType: !234, size: 64, offset: 36864)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !488, file: !47, line: 267, baseType: !906, size: 64, offset: 36928)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !488, file: !47, line: 269, baseType: !909, size: 640, offset: 36992)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 640, elements: !918)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!139, !486, !181, !181, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !553, line: 1723, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !553, line: 1723, flags: DIFlagFwdDecl)
!918 = !{!919}
!919 = !DISubrange(count: 10)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !488, file: !47, line: 270, baseType: !909, size: 640, offset: 37632)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !488, file: !47, line: 272, baseType: !181, size: 32, offset: 38272)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !488, file: !47, line: 273, baseType: !923, size: 64, offset: 38336)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !926)
!926 = !{!927, !928, !929, !930}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !925, file: !47, line: 174, baseType: !123, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !925, file: !47, line: 175, baseType: !470, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !925, file: !47, line: 176, baseType: !860, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !925, file: !47, line: 177, baseType: !296, size: 32, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !488, file: !47, line: 274, baseType: !932, size: 64, offset: 38400)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !935)
!935 = !{!936, !1017, !1018}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !934, file: !47, line: 168, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !938, line: 11, baseType: !939)
!938 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !938, line: 13, size: 832, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !1008, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !938, line: 14, baseType: !158, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !940, file: !938, line: 15, baseType: !470, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !940, file: !938, line: 16, baseType: !158, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !940, file: !938, line: 17, baseType: !181, size: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !940, file: !938, line: 18, baseType: !226, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !940, file: !938, line: 19, baseType: !948, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !949, line: 22, baseType: !950)
!949 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !938, line: 81, size: 4992, elements: !952)
!952 = !{!953, !954, !968, !969, !970, !979}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !951, file: !938, line: 82, baseType: !340, size: 4480)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !951, file: !938, line: 82, baseType: !955, size: 256, offset: 4480)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, elements: !177)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !938, line: 74, size: 256, elements: !957)
!957 = !{!958, !962, !963, !967}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !956, file: !938, line: 75, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!139, !948}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !956, file: !938, line: 76, baseType: !959, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !956, file: !938, line: 77, baseType: !964, size: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!139, !948, !145}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !956, file: !938, line: 78, baseType: !959, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !951, file: !938, line: 83, baseType: !122, size: 64, offset: 4736)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !951, file: !938, line: 85, baseType: !181, size: 32, offset: 4800)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !951, file: !938, line: 86, baseType: !971, size: 64, offset: 4864)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !938, line: 41, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !938, line: 36, size: 256, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !973, file: !938, line: 37, baseType: !292, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !973, file: !938, line: 38, baseType: !292, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !973, file: !938, line: 39, baseType: !292, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !973, file: !938, line: 40, baseType: !208, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !951, file: !938, line: 87, baseType: !980, size: 64, offset: 4928)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !938, line: 54, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !938, line: 54, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !938, line: 54, size: 320, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !1000}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !984, file: !938, line: 54, baseType: !375, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !984, file: !938, line: 54, baseType: !375, size: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !984, file: !938, line: 54, baseType: !375, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !984, file: !938, line: 54, baseType: !375, size: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !938, line: 54, baseType: !382, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !984, file: !938, line: 54, baseType: !992, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !949, line: 41, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !949, line: 35, size: 192, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !994, file: !949, line: 37, baseType: !470, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !994, file: !949, line: 38, baseType: !181, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !994, file: !949, line: 39, baseType: !181, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !994, file: !949, line: 40, baseType: !181, size: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !984, file: !938, line: 54, baseType: !1001, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !938, line: 34, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !938, line: 30, size: 96, elements: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1003, file: !938, line: 31, baseType: !181, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1003, file: !938, line: 32, baseType: !181, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1003, file: !938, line: 33, baseType: !181, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !940, file: !938, line: 20, baseType: !1009, size: 32, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !940, file: !938, line: 21, baseType: !181, size: 32, offset: 416)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !940, file: !938, line: 22, baseType: !181, size: 32, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !940, file: !938, line: 23, baseType: !226, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !940, file: !938, line: 24, baseType: !169, size: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !940, file: !938, line: 25, baseType: !169, size: 64, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !940, file: !938, line: 26, baseType: !122, size: 64, offset: 704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !938, line: 27, baseType: !937, size: 64, offset: 768)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !934, file: !47, line: 169, baseType: !470, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !47, line: 170, baseType: !932, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !488, file: !47, line: 275, baseType: !181, size: 32, offset: 38464)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !488, file: !47, line: 276, baseType: !1021, size: 64, offset: 38528)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !1024)
!1024 = !{!1025, !1106, !1107}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1023, file: !47, line: 181, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !949, line: 13, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !938, line: 98, size: 7232, elements: !1029)
!1029 = !{!1030, !1031, !1045, !1046, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1062, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1028, file: !938, line: 99, baseType: !340, size: 4480)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1028, file: !938, line: 99, baseType: !1032, size: 256, offset: 4480)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 256, elements: !177)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !938, line: 91, size: 256, elements: !1034)
!1034 = !{!1035, !1039, !1040, !1044}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1033, file: !938, line: 92, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!139, !1026}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1033, file: !938, line: 93, baseType: !1036, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1033, file: !938, line: 94, baseType: !1041, size: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!139, !1026, !145}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1033, file: !938, line: 95, baseType: !1036, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1028, file: !938, line: 100, baseType: !122, size: 64, offset: 4736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1028, file: !938, line: 101, baseType: !1047, size: 64, offset: 4800)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1028, file: !938, line: 102, baseType: !296, size: 32, offset: 4864)
