; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/smatlab.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/smatlab.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscStartMatlab = private unnamed_addr constant [17 x i8] c"PetscStartMatlab\00", align 1
@.str = private unnamed_addr constant [78 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/smatlab.c\00", align 1
@.str.1 = private unnamed_addr constant [125 x i8] c"echo \22delete ${HOMEDIRECTORY}/matlab/startup.m ; path(path,'${WORKINGDIRECTORY}'); %s  \22 > ${HOMEDIRECTORY}/matlab/startup.m\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/smatlab.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !{!11, !15, !16}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !12, line: 330, baseType: !13)
!12 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !12, line: 330, flags: DIFlagFwdDecl)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !{i32 7, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 1, !"wchar_size", i32 4}
!22 = !{i32 7, !"PIC Level", i32 2}
!23 = !{i32 7, !"uwtable", i32 1}
!24 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!25 = distinct !DISubprogram(name: "PetscStartMatlab", scope: !26, file: !26, line: 28, type: !27, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !93)
!26 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/smatlab.c", directory: "/home/users/ndemeye/xSDK")
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !11, !16, !16, !32}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !30, line: 14, baseType: !31)
!30 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !35, line: 7, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 245, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!38 = !{!39, !40, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !60, !61, !62, !63, !67, !69, !71, !75, !78, !80, !81, !82, !83, !84, !88, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 246, baseType: !31, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 251, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 252, baseType: !41, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 253, baseType: !41, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 254, baseType: !41, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 255, baseType: !41, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 256, baseType: !41, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 257, baseType: !41, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 258, baseType: !41, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 260, baseType: !41, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 261, baseType: !41, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 262, baseType: !41, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 264, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 160, size: 192, elements: !55)
!55 = !{!56, !57, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !54, file: !37, line: 161, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !54, file: !37, line: 162, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !54, file: !37, line: 166, baseType: !31, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 266, baseType: !58, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 268, baseType: !31, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 272, baseType: !31, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 274, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 140, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 278, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 279, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 280, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 284, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 154, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 293, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 141, baseType: !66)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !36, file: !37, line: 301, baseType: !15, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !36, file: !37, line: 302, baseType: !15, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !36, file: !37, line: 303, baseType: !15, size: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !36, file: !37, line: 304, baseType: !15, size: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 306, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 307, baseType: !31, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 309, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !104, !108, !110}
!94 = !DILocalVariable(name: "comm", arg: 1, scope: !25, file: !26, line: 28, type: !11)
!95 = !DILocalVariable(name: "machine", arg: 2, scope: !25, file: !26, line: 28, type: !16)
!96 = !DILocalVariable(name: "script", arg: 3, scope: !25, file: !26, line: 28, type: !16)
!97 = !DILocalVariable(name: "fp", arg: 4, scope: !25, file: !26, line: 28, type: !32)
!98 = !DILocalVariable(name: "ierr", scope: !25, file: !26, line: 30, type: !29)
!99 = !DILocalVariable(name: "fd", scope: !25, file: !26, line: 31, type: !33)
!100 = !DILocalVariable(name: "command", scope: !25, file: !26, line: 32, type: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 4096, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 512)
!104 = !DILocalVariable(name: "ierr__", scope: !105, file: !26, line: 54, type: !29)
!105 = distinct !DILexicalBlock(scope: !106, file: !26, line: 54, column: 53)
!106 = distinct !DILexicalBlock(scope: !107, file: !26, line: 49, column: 15)
!107 = distinct !DILexicalBlock(scope: !25, file: !26, line: 49, column: 7)
!108 = !DILocalVariable(name: "ierr__", scope: !109, file: !26, line: 55, type: !29)
!109 = distinct !DILexicalBlock(scope: !106, file: !26, line: 55, column: 33)
!110 = !DILocalVariable(name: "ierr__", scope: !111, file: !26, line: 59, type: !29)
!111 = distinct !DILexicalBlock(scope: !25, file: !26, line: 59, column: 90)
!112 = !DILocation(line: 0, scope: !25)
!113 = !DILocation(line: 31, column: 3, scope: !25)
!114 = !DILocation(line: 32, column: 3, scope: !25)
!115 = !DILocation(line: 32, column: 18, scope: !25)
!116 = !DILocation(line: 38, column: 3, scope: !117)
!117 = distinct !DILexicalBlock(scope: !118, file: !26, line: 38, column: 3)
!118 = distinct !DILexicalBlock(scope: !119, file: !26, line: 38, column: 3)
!119 = distinct !DILexicalBlock(scope: !25, file: !26, line: 38, column: 3)
!120 = !{!121, !121, i64 0}
!121 = !{!"any pointer", !122, i64 0}
!122 = !{!"omnipotent char", !123, i64 0}
!123 = !{!"Simple C/C++ TBAA"}
!124 = !DILocation(line: 38, column: 3, scope: !118)
!125 = !DILocation(line: 38, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !26, line: 38, column: 3)
!127 = distinct !DILexicalBlock(scope: !117, file: !26, line: 38, column: 3)
!128 = !{!129, !130, i64 1536}
!129 = !{!"", !122, i64 0, !122, i64 512, !122, i64 1024, !122, i64 1280, !130, i64 1536, !130, i64 1540, !122, i64 1544}
!130 = !{!"int", !122, i64 0}
!131 = !DILocation(line: 38, column: 3, scope: !127)
!132 = !DILocation(line: 38, column: 3, scope: !133)
!133 = distinct !DILexicalBlock(scope: !126, file: !26, line: 38, column: 3)
!134 = !{!130, !130, i64 0}
!135 = !{!129, !130, i64 1540}
!136 = !DILocation(line: 49, column: 7, scope: !107)
!137 = !DILocation(line: 49, column: 7, scope: !25)
!138 = !DILocation(line: 52, column: 5, scope: !106)
!139 = !DILocation(line: 54, column: 12, scope: !106)
!140 = !DILocation(line: 0, scope: !105)
!141 = !DILocation(line: 54, column: 53, scope: !142)
!142 = distinct !DILexicalBlock(scope: !105, file: !26, line: 54, column: 53)
!143 = !DILocation(line: 54, column: 53, scope: !105)
!144 = !{!"branch_weights", i32 2000, i32 1}
!145 = !DILocation(line: 55, column: 29, scope: !106)
!146 = !DILocation(line: 55, column: 12, scope: !106)
!147 = !DILocation(line: 0, scope: !109)
!148 = !DILocation(line: 55, column: 33, scope: !149)
!149 = distinct !DILexicalBlock(scope: !109, file: !26, line: 55, column: 33)
!150 = !DILocation(line: 55, column: 33, scope: !109)
!151 = !DILocation(line: 59, column: 10, scope: !25)
!152 = !DILocation(line: 0, scope: !111)
!153 = !DILocation(line: 59, column: 90, scope: !154)
