; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmarker.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmarker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 204, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 141, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 663, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!52 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!70 = !{!71, !75, !76, !112}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !72, line: 330, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !72, line: 330, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !79, line: 73, size: 4480, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !84, !133, !134, !136, !139, !140, !141, !142, !150, !151, !153, !157, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !178, !179, !181, !183, !184, !185, !186, !187, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !213, !215, !216, !220, !221, !270, !275, !277, !278, !279}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !78, file: !79, line: 74, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !83)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !78, file: !79, line: 75, baseType: !85, size: 448, offset: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 448, elements: !131)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !79, line: 53, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 45, size: 448, elements: !88)
!88 = !{!89, !95, !103, !108, !115, !119, !126}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !87, file: !79, line: 46, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !76, !94}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !83)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !87, file: !79, line: 47, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!93, !76, !99}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !100, line: 16, baseType: !101)
!100 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !100, line: 16, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !87, file: !79, line: 48, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!93, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !87, file: !79, line: 49, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!93, !76, !112, !76}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !87, file: !79, line: 50, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!93, !76, !112, !107}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !87, file: !79, line: 51, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!93, !76, !112, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !87, file: !79, line: 52, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!93, !76, !112, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !78, file: !79, line: 76, baseType: !71, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 77, baseType: !135, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !83)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !138)
!138 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !79, line: 79, baseType: !143, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !146, line: 27, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 43, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !78, file: !79, line: 80, baseType: !135, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !78, file: !79, line: 81, baseType: !152, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !83)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !78, file: !79, line: 82, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !78, file: !79, line: 83, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !78, file: !79, line: 84, baseType: !162, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !78, file: !79, line: 85, baseType: !162, size: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !78, file: !79, line: 86, baseType: !162, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !78, file: !79, line: 87, baseType: !162, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !79, line: 88, baseType: !76, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !78, file: !79, line: 89, baseType: !143, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !79, line: 90, baseType: !162, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !79, line: 91, baseType: !162, size: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !78, file: !79, line: 92, baseType: !135, size: 32, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !78, file: !79, line: 93, baseType: !75, size: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !79, line: 94, baseType: !173, size: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !144)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !78, file: !79, line: 95, baseType: !135, size: 32, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !78, file: !79, line: 95, baseType: !135, size: 32, offset: 1888)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !78, file: !79, line: 96, baseType: !177, size: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !78, file: !79, line: 96, baseType: !177, size: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !78, file: !79, line: 97, baseType: !180, size: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !78, file: !79, line: 97, baseType: !182, size: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !78, file: !79, line: 98, baseType: !135, size: 32, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !78, file: !79, line: 98, baseType: !135, size: 32, offset: 2208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !78, file: !79, line: 99, baseType: !177, size: 64, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !78, file: !79, line: 99, baseType: !177, size: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !78, file: !79, line: 100, baseType: !188, size: 64, offset: 2368)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !78, file: !79, line: 100, baseType: !191, size: 64, offset: 2432)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !78, file: !79, line: 101, baseType: !135, size: 32, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !78, file: !79, line: 101, baseType: !135, size: 32, offset: 2528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !78, file: !79, line: 102, baseType: !177, size: 64, offset: 2560)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !78, file: !79, line: 102, baseType: !177, size: 64, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !78, file: !79, line: 103, baseType: !197, size: 64, offset: 2688)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !78, file: !79, line: 103, baseType: !200, size: 64, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !78, file: !79, line: 104, baseType: !130, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !78, file: !79, line: 105, baseType: !135, size: 32, offset: 2880)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !78, file: !79, line: 106, baseType: !204, size: 128, offset: 2944)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !211)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !79, line: 64, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 61, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !207, file: !79, line: 62, baseType: !123, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !207, file: !79, line: 63, baseType: !75, size: 64, offset: 64)
!211 = !{!212}
!212 = !DISubrange(count: 2)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !78, file: !79, line: 107, baseType: !214, size: 64, offset: 3072)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !78, file: !79, line: 108, baseType: !75, size: 64, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !78, file: !79, line: 109, baseType: !217, size: 64, offset: 3200)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!93, !75}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !78, file: !79, line: 111, baseType: !135, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !78, file: !79, line: 112, baseType: !222, size: 320, offset: 3328)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !268)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!93, !226, !76, !75}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !229)
!229 = !{!230, !231, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !228, file: !12, line: 100, baseType: !135, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !12, line: 101, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !243, !244, !245, !249, !251, !253, !254, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !234, file: !12, line: 84, baseType: !162, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !234, file: !12, line: 85, baseType: !162, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !12, line: 86, baseType: !75, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !234, file: !12, line: 87, baseType: !154, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !234, file: !12, line: 88, baseType: !241, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !234, file: !12, line: 89, baseType: !114, size: 8, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !234, file: !12, line: 90, baseType: !162, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !234, file: !12, line: 91, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !234, file: !12, line: 92, baseType: !250, size: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !12, line: 93, baseType: !252, size: 32, offset: 544)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !12, line: 94, baseType: !232, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !234, file: !12, line: 95, baseType: !162, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !234, file: !12, line: 96, baseType: !75, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !228, file: !12, line: 102, baseType: !162, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !228, file: !12, line: 102, baseType: !162, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !228, file: !12, line: 103, baseType: !162, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !228, file: !12, line: 104, baseType: !71, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !228, file: !12, line: 106, baseType: !76, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !228, file: !12, line: 107, baseType: !265, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!268 = !{!269}
!269 = !DISubrange(count: 5)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !78, file: !79, line: 113, baseType: !271, size: 320, offset: 3648)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !268)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!93, !76, !75}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !78, file: !79, line: 114, baseType: !276, size: 320, offset: 3968)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 320, elements: !268)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !78, file: !79, line: 115, baseType: !250, size: 32, offset: 4288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !78, file: !79, line: 120, baseType: !265, size: 64, offset: 4352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !78, file: !79, line: 121, baseType: !250, size: 32, offset: 4416)
!280 = !{!0}
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmarker.c", directory: "/home/users/ndemeye/xSDK")
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 448, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 7)
!285 = !{i32 7, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{i32 1, !"wchar_size", i32 4}
!288 = !{i32 7, !"PIC Level", i32 2}
!289 = !{i32 7, !"uwtable", i32 1}
!290 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!291 = distinct !DISubprogram(name: "PetscDrawMarker", scope: !281, file: !281, line: 23, type: !292, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!292 = !DISubroutineType(types: !293)
!293 = !{!93, !294, !189, !189, !83}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !295, line: 25, baseType: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !298, line: 53, size: 11072, elements: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!299 = !{!300, !302, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !428, !429, !430, !431, !432, !433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !297, file: !298, line: 54, baseType: !301, size: 4480)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !79, line: 122, baseType: !78)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !297, file: !298, line: 54, baseType: !303, size: 2304, offset: 4480)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 2304, elements: !131)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !298, line: 14, size: 2304, elements: !305)
!305 = !{!306, !310, !311, !315, !319, !323, !325, !326, !330, !331, !335, !339, !343, !344, !348, !352, !353, !359, !360, !361, !362, !367, !371, !372, !376, !377, !381, !382, !383, !384, !396, !397, !398, !403, !407, !411}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !304, file: !298, line: 15, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!93, !294}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !304, file: !298, line: 16, baseType: !307, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !304, file: !298, line: 17, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!93, !294, !189, !189, !189, !189, !83}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !304, file: !298, line: 18, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!93, !294, !189}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !304, file: !298, line: 19, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!93, !294, !188}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !304, file: !298, line: 20, baseType: !324, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !304, file: !298, line: 21, baseType: !316, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !304, file: !298, line: 22, baseType: !327, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!93, !294, !189, !189, !83, !112}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !304, file: !298, line: 23, baseType: !327, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !304, file: !298, line: 24, baseType: !332, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!93, !294, !189, !189}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !304, file: !298, line: 25, baseType: !336, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!93, !294, !188, !188}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !304, file: !298, line: 26, baseType: !340, size: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!93, !294, !189, !189, !189, !189}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !304, file: !298, line: 27, baseType: !307, size: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !304, file: !298, line: 28, baseType: !345, size: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!93, !294, !189, !189, !189, !189, !83, !83, !83, !83}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !304, file: !298, line: 29, baseType: !349, size: 64, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!93, !294, !189, !189, !189, !189, !189, !189, !83, !83, !83}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !304, file: !298, line: 30, baseType: !312, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !304, file: !298, line: 31, baseType: !354, size: 64, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!93, !294, !357, !188, !188, !188, !188}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !27, line: 207, baseType: !26)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !304, file: !298, line: 32, baseType: !307, size: 64, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !304, file: !298, line: 33, baseType: !307, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !304, file: !298, line: 34, baseType: !307, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !304, file: !298, line: 35, baseType: !363, size: 64, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!93, !294, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !304, file: !298, line: 36, baseType: !368, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!93, !294, !112}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !304, file: !298, line: 37, baseType: !307, size: 64, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !304, file: !298, line: 38, baseType: !373, size: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!93, !294, !83, !83}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !304, file: !298, line: 39, baseType: !307, size: 64, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !304, file: !298, line: 40, baseType: !378, size: 64, offset: 1600)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!93, !294, !99}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !304, file: !298, line: 41, baseType: !363, size: 64, offset: 1664)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !304, file: !298, line: 42, baseType: !363, size: 64, offset: 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !304, file: !298, line: 43, baseType: !307, size: 64, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !304, file: !298, line: 44, baseType: !385, size: 64, offset: 1856)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!93, !294, !388, !393, !393, !394}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 24, elements: !391)
!390 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !{!392}
!392 = !DISubrange(count: 3)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !304, file: !298, line: 45, baseType: !340, size: 64, offset: 1920)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !304, file: !298, line: 46, baseType: !312, size: 64, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !304, file: !298, line: 47, baseType: !399, size: 64, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!93, !294, !189, !189, !402, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !304, file: !298, line: 48, baseType: !404, size: 64, offset: 2112)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!93, !294, !83, !83, !188, !188}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !304, file: !298, line: 49, baseType: !408, size: 64, offset: 2176)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!93, !294, !83, !83, !83}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !304, file: !298, line: 50, baseType: !412, size: 64, offset: 2240)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!93, !294, !189, !189, !83, !83, !112, !188, !188}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !297, file: !298, line: 55, baseType: !189, size: 64, offset: 6784)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !297, file: !298, line: 56, baseType: !189, size: 64, offset: 6848)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !297, file: !298, line: 56, baseType: !189, size: 64, offset: 6912)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !297, file: !298, line: 56, baseType: !189, size: 64, offset: 6976)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !297, file: !298, line: 56, baseType: !189, size: 64, offset: 7040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !297, file: !298, line: 57, baseType: !189, size: 64, offset: 7104)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !297, file: !298, line: 57, baseType: !189, size: 64, offset: 7168)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !297, file: !298, line: 57, baseType: !189, size: 64, offset: 7232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !297, file: !298, line: 57, baseType: !189, size: 64, offset: 7296)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !297, file: !298, line: 58, baseType: !425, size: 1280, offset: 7360)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1280, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 20)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !297, file: !298, line: 58, baseType: !425, size: 1280, offset: 8640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !297, file: !298, line: 59, baseType: !189, size: 64, offset: 9920)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !297, file: !298, line: 59, baseType: !189, size: 64, offset: 9984)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !297, file: !298, line: 59, baseType: !189, size: 64, offset: 10048)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !297, file: !298, line: 59, baseType: !189, size: 64, offset: 10112)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !297, file: !298, line: 60, baseType: !135, size: 32, offset: 10176)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !297, file: !298, line: 61, baseType: !435, size: 32, offset: 10208)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !27, line: 141, baseType: !38)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !297, file: !298, line: 62, baseType: !162, size: 64, offset: 10240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !297, file: !298, line: 63, baseType: !162, size: 64, offset: 10304)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !297, file: !298, line: 64, baseType: !294, size: 64, offset: 10368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !297, file: !298, line: 65, baseType: !83, size: 32, offset: 10432)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !297, file: !298, line: 65, baseType: !83, size: 32, offset: 10464)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !297, file: !298, line: 65, baseType: !83, size: 32, offset: 10496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !297, file: !298, line: 65, baseType: !83, size: 32, offset: 10528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !297, file: !298, line: 66, baseType: !162, size: 64, offset: 10560)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !297, file: !298, line: 67, baseType: !162, size: 64, offset: 10624)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !297, file: !298, line: 68, baseType: !162, size: 64, offset: 10688)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !297, file: !298, line: 69, baseType: !135, size: 32, offset: 10752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !297, file: !298, line: 70, baseType: !250, size: 32, offset: 10784)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !297, file: !298, line: 71, baseType: !135, size: 32, offset: 10816)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !297, file: !298, line: 72, baseType: !162, size: 64, offset: 10880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !297, file: !298, line: 73, baseType: !250, size: 32, offset: 10944)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !297, file: !298, line: 74, baseType: !250, size: 32, offset: 10976)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !298, line: 75, baseType: !75, size: 64, offset: 11008)
!453 = !{!454, !455, !456, !457, !458, !459, !464, !465, !466, !468, !473, !475, !479, !484, !485, !486, !488, !493, !495, !499, !504, !505, !506, !508, !513, !515, !517, !519, !523}
!454 = !DILocalVariable(name: "draw", arg: 1, scope: !291, file: !281, line: 23, type: !294)
!455 = !DILocalVariable(name: "xl", arg: 2, scope: !291, file: !281, line: 23, type: !189)
!456 = !DILocalVariable(name: "yl", arg: 3, scope: !291, file: !281, line: 23, type: !189)
!457 = !DILocalVariable(name: "cl", arg: 4, scope: !291, file: !281, line: 23, type: !83)
!458 = !DILocalVariable(name: "ierr", scope: !291, file: !281, line: 25, type: !93)
!459 = !DILocalVariable(name: "i", scope: !460, file: !281, line: 31, type: !83)
!460 = distinct !DILexicalBlock(scope: !461, file: !281, line: 30, column: 64)
!461 = distinct !DILexicalBlock(scope: !462, file: !281, line: 30, column: 9)
!462 = distinct !DILexicalBlock(scope: !463, file: !281, line: 29, column: 52)
!463 = distinct !DILexicalBlock(scope: !291, file: !281, line: 29, column: 7)
!464 = !DILocalVariable(name: "j", scope: !460, file: !281, line: 31, type: !83)
!465 = !DILocalVariable(name: "k", scope: !460, file: !281, line: 31, type: !83)
!466 = !DILocalVariable(name: "ierr__", scope: !467, file: !281, line: 32, type: !93)
!467 = distinct !DILexicalBlock(scope: !460, file: !281, line: 32, column: 64)
!468 = !DILocalVariable(name: "ierr__", scope: !469, file: !281, line: 34, type: !93)
!469 = distinct !DILexicalBlock(scope: !470, file: !281, line: 34, column: 58)
!470 = distinct !DILexicalBlock(scope: !471, file: !281, line: 33, column: 29)
!471 = distinct !DILexicalBlock(scope: !472, file: !281, line: 33, column: 7)
!472 = distinct !DILexicalBlock(scope: !460, file: !281, line: 33, column: 7)
!473 = !DILocalVariable(name: "ierr__", scope: !474, file: !281, line: 35, type: !93)
!474 = distinct !DILexicalBlock(scope: !470, file: !281, line: 35, column: 58)
!475 = !DILocalVariable(name: "ierr__", scope: !476, file: !281, line: 38, type: !93)
!476 = distinct !DILexicalBlock(scope: !477, file: !281, line: 38, column: 55)
!477 = distinct !DILexicalBlock(scope: !478, file: !281, line: 37, column: 35)
!478 = distinct !DILexicalBlock(scope: !461, file: !281, line: 37, column: 16)
!479 = !DILocalVariable(name: "i", scope: !480, file: !281, line: 42, type: !83)
!480 = distinct !DILexicalBlock(scope: !481, file: !281, line: 41, column: 64)
!481 = distinct !DILexicalBlock(scope: !482, file: !281, line: 41, column: 9)
!482 = distinct !DILexicalBlock(scope: !483, file: !281, line: 40, column: 58)
!483 = distinct !DILexicalBlock(scope: !463, file: !281, line: 40, column: 14)
!484 = !DILocalVariable(name: "j", scope: !480, file: !281, line: 42, type: !83)
!485 = !DILocalVariable(name: "k", scope: !480, file: !281, line: 42, type: !83)
!486 = !DILocalVariable(name: "ierr__", scope: !487, file: !281, line: 43, type: !93)
!487 = distinct !DILexicalBlock(scope: !480, file: !281, line: 43, column: 64)
!488 = !DILocalVariable(name: "ierr__", scope: !489, file: !281, line: 45, type: !93)
!489 = distinct !DILexicalBlock(scope: !490, file: !281, line: 45, column: 56)
!490 = distinct !DILexicalBlock(scope: !491, file: !281, line: 44, column: 29)
!491 = distinct !DILexicalBlock(scope: !492, file: !281, line: 44, column: 7)
!492 = distinct !DILexicalBlock(scope: !480, file: !281, line: 44, column: 7)
!493 = !DILocalVariable(name: "ierr__", scope: !494, file: !281, line: 46, type: !93)
!494 = distinct !DILexicalBlock(scope: !490, file: !281, line: 46, column: 56)
!495 = !DILocalVariable(name: "ierr__", scope: !496, file: !281, line: 49, type: !93)
!496 = distinct !DILexicalBlock(scope: !497, file: !281, line: 49, column: 55)
!497 = distinct !DILexicalBlock(scope: !498, file: !281, line: 48, column: 35)
!498 = distinct !DILexicalBlock(scope: !481, file: !281, line: 48, column: 16)
