; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/transpose/transm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/transpose/transm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !352, !433, !373, !349, !1306, !1308, !1309, !508}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Transpose", file: !323, line: 6, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/transpose/transm.c", directory: "/home/users/ndemeye/xSDK")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 4, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !324, file: !323, line: 5, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !330, line: 436, size: 23424, elements: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!331 = !{!332, !542, !1049, !1069, !1070, !1071, !1073, !1074, !1075, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1202, !1203, !1219, !1220, !1221, !1222, !1223, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1258, !1278, !1279, !1281, !1282, !1283, !1284, !1285, !1286, !1304, !1305}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !329, file: !330, line: 437, baseType: !333, size: 4480)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !334, line: 122, baseType: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !334, line: 73, size: 4480, elements: !336)
!336 = !{!337, !339, !394, !395, !397, !400, !401, !402, !403, !411, !412, !414, !418, !422, !424, !425, !426, !427, !428, !429, !430, !431, !432, !434, !436, !437, !438, !440, !441, !443, !445, !446, !447, !448, !449, !452, !454, !455, !456, !457, !458, !461, !463, !464, !465, !475, !477, !478, !482, !483, !532, !537, !539, !540, !541}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !335, file: !334, line: 74, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !335, file: !334, line: 75, baseType: !340, size: 448, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 448, elements: !392)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !334, line: 53, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 45, size: 448, elements: !343)
!343 = !{!344, !356, !364, !369, !376, !380, !387}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !342, file: !334, line: 46, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !349, !351}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !353, line: 330, baseType: !354)
!353 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !353, line: 330, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !334, line: 47, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!348, !349, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !361, line: 16, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !361, line: 16, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !334, line: 48, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!348, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !342, file: !334, line: 49, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!348, !349, !373, !349}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!375 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !342, file: !334, line: 50, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!348, !349, !373, !368}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !342, file: !334, line: 51, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!348, !349, !373, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !342, file: !334, line: 52, baseType: !388, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!348, !349, !373, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!392 = !{!393}
!393 = !DISubrange(count: 1)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !335, file: !334, line: 76, baseType: !352, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !334, line: 77, baseType: !396, size: 32, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !335, file: !334, line: 78, baseType: !398, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !399)
!399 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !335, file: !334, line: 78, baseType: !398, size: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !335, file: !334, line: 78, baseType: !398, size: 64, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !335, file: !334, line: 78, baseType: !398, size: 64, offset: 832)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !334, line: 79, baseType: !404, size: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !407, line: 27, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !409, line: 43, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!410 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !335, file: !334, line: 80, baseType: !396, size: 32, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !335, file: !334, line: 81, baseType: !413, size: 32, offset: 992)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !335, file: !334, line: 82, baseType: !415, size: 64, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !335, file: !334, line: 83, baseType: !419, size: 64, offset: 1088)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !335, file: !334, line: 84, baseType: !423, size: 64, offset: 1152)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !335, file: !334, line: 85, baseType: !423, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !335, file: !334, line: 86, baseType: !423, size: 64, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !335, file: !334, line: 87, baseType: !423, size: 64, offset: 1344)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !335, file: !334, line: 88, baseType: !349, size: 64, offset: 1408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !335, file: !334, line: 89, baseType: !404, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !334, line: 90, baseType: !423, size: 64, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !335, file: !334, line: 91, baseType: !423, size: 64, offset: 1600)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !335, file: !334, line: 92, baseType: !396, size: 32, offset: 1664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !335, file: !334, line: 93, baseType: !433, size: 64, offset: 1728)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !334, line: 94, baseType: !435, size: 64, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !405)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !335, file: !334, line: 95, baseType: !396, size: 32, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !335, file: !334, line: 95, baseType: !396, size: 32, offset: 1888)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !335, file: !334, line: 96, baseType: !439, size: 64, offset: 1920)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !335, file: !334, line: 96, baseType: !439, size: 64, offset: 1984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !335, file: !334, line: 97, baseType: !442, size: 64, offset: 2048)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !335, file: !334, line: 97, baseType: !444, size: 64, offset: 2112)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !335, file: !334, line: 98, baseType: !396, size: 32, offset: 2176)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !335, file: !334, line: 98, baseType: !396, size: 32, offset: 2208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !335, file: !334, line: 99, baseType: !439, size: 64, offset: 2240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !335, file: !334, line: 99, baseType: !439, size: 64, offset: 2304)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !335, file: !334, line: 100, baseType: !450, size: 64, offset: 2368)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !399)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !335, file: !334, line: 100, baseType: !453, size: 64, offset: 2432)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !335, file: !334, line: 101, baseType: !396, size: 32, offset: 2496)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !335, file: !334, line: 101, baseType: !396, size: 32, offset: 2528)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !335, file: !334, line: 102, baseType: !439, size: 64, offset: 2560)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !335, file: !334, line: 102, baseType: !439, size: 64, offset: 2624)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !335, file: !334, line: 103, baseType: !459, size: 64, offset: 2688)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !451)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !335, file: !334, line: 103, baseType: !462, size: 64, offset: 2752)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !335, file: !334, line: 104, baseType: !391, size: 64, offset: 2816)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !335, file: !334, line: 105, baseType: !396, size: 32, offset: 2880)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !335, file: !334, line: 106, baseType: !466, size: 128, offset: 2944)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 128, elements: !473)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !334, line: 64, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 61, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !469, file: !334, line: 62, baseType: !384, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !469, file: !334, line: 63, baseType: !433, size: 64, offset: 64)
!473 = !{!474}
!474 = !DISubrange(count: 2)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !335, file: !334, line: 107, baseType: !476, size: 64, offset: 3072)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 64, elements: !473)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !335, file: !334, line: 108, baseType: !433, size: 64, offset: 3136)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !335, file: !334, line: 109, baseType: !479, size: 64, offset: 3200)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!348, !433}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !335, file: !334, line: 111, baseType: !396, size: 32, offset: 3264)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !335, file: !334, line: 112, baseType: !484, size: 320, offset: 3328)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 320, elements: !530)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!348, !488, !349, !433}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !491)
!491 = !{!492, !493, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !490, file: !10, line: 100, baseType: !396, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !10, line: 101, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !505, !506, !507, !511, !513, !515, !516, !517}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !496, file: !10, line: 84, baseType: !423, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !496, file: !10, line: 85, baseType: !423, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !10, line: 86, baseType: !433, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !496, file: !10, line: 87, baseType: !415, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !496, file: !10, line: 88, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !496, file: !10, line: 89, baseType: !375, size: 8, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !496, file: !10, line: 90, baseType: !423, size: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !496, file: !10, line: 91, baseType: !508, size: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !509, line: 46, baseType: !510)
!509 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!510 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !496, file: !10, line: 92, baseType: !512, size: 32, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !10, line: 93, baseType: !514, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !10, line: 94, baseType: !494, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !496, file: !10, line: 95, baseType: !423, size: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !496, file: !10, line: 96, baseType: !433, size: 64, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !490, file: !10, line: 102, baseType: !423, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !490, file: !10, line: 102, baseType: !423, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !490, file: !10, line: 103, baseType: !423, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !490, file: !10, line: 104, baseType: !352, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !490, file: !10, line: 105, baseType: !512, size: 32, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !490, file: !10, line: 105, baseType: !512, size: 32, offset: 416)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !490, file: !10, line: 105, baseType: !512, size: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !490, file: !10, line: 106, baseType: !349, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !490, file: !10, line: 107, baseType: !527, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!530 = !{!531}
!531 = !DISubrange(count: 5)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !335, file: !334, line: 113, baseType: !533, size: 320, offset: 3648)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !530)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!348, !349, !433}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !335, file: !334, line: 114, baseType: !538, size: 320, offset: 3968)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 320, elements: !530)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !335, file: !334, line: 115, baseType: !512, size: 32, offset: 4288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !335, file: !334, line: 120, baseType: !527, size: 64, offset: 4352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !335, file: !334, line: 121, baseType: !512, size: 32, offset: 4416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !329, file: !330, line: 437, baseType: !543, size: 9472, offset: 4480)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 9472, elements: !392)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !330, line: 32, size: 9472, elements: !545)
!545 = !{!546, !555, !559, !560, !567, !571, !572, !573, !574, !575, !576, !577, !601, !605, !610, !616, !635, !640, !644, !645, !650, !655, !656, !661, !665, !669, !673, !677, !681, !682, !683, !684, !685, !689, !690, !695, !696, !697, !698, !699, !704, !711, !716, !720, !724, !728, !732, !733, !737, !738, !745, !750, !751, !752, !753, !815, !823, !824, !828, !829, !833, !834, !838, !843, !844, !848, !852, !859, !860, !861, !862, !863, !864, !869, !870, !874, !878, !882, !883, !884, !888, !898, !899, !903, !904, !908, !909, !913, !914, !919, !920, !924, !928, !929, !930, !931, !932, !933, !934, !938, !939, !940, !941, !942, !943, !947, !948, !949, !950, !951, !952, !953, !954, !958, !962, !963, !964, !968, !969, !970, !971, !972, !973, !974, !978, !979, !980, !985, !989, !990, !994, !995, !996, !997, !1023, !1027, !1028, !1029, !1030, !1031, !1035, !1036, !1037, !1038, !1039, !1043, !1047, !1048}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !544, file: !330, line: 34, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!348, !327, !396, !550, !396, !550, !552, !554}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !544, file: !330, line: 35, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!348, !327, !396, !442, !444, !462}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !544, file: !330, line: 36, baseType: !556, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !544, file: !330, line: 37, baseType: !561, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!348, !327, !564, !564}
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !544, file: !330, line: 38, baseType: !568, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!348, !327, !564, !564, !564}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !544, file: !330, line: 40, baseType: !561, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !544, file: !330, line: 41, baseType: !568, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !544, file: !330, line: 42, baseType: !561, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !544, file: !330, line: 43, baseType: !568, size: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !544, file: !330, line: 44, baseType: !561, size: 64, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !544, file: !330, line: 46, baseType: !568, size: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !544, file: !330, line: 47, baseType: !578, size: 64, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!348, !327, !581, !581, !585}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !582, line: 11, baseType: !583)
!582 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !582, line: 11, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !588, file: !36, line: 1227, baseType: !451, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !588, file: !36, line: 1228, baseType: !451, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !588, file: !36, line: 1229, baseType: !451, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !588, file: !36, line: 1230, baseType: !451, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !588, file: !36, line: 1231, baseType: !451, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !588, file: !36, line: 1232, baseType: !451, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !588, file: !36, line: 1233, baseType: !451, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !588, file: !36, line: 1234, baseType: !451, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !588, file: !36, line: 1236, baseType: !451, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !588, file: !36, line: 1237, baseType: !451, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !588, file: !36, line: 1238, baseType: !451, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !544, file: !330, line: 48, baseType: !602, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!348, !327, !581, !585}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !544, file: !330, line: 49, baseType: !606, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!348, !327, !564, !451, !609, !451, !396, !396, !564}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !544, file: !330, line: 50, baseType: !611, size: 64, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!348, !327, !614, !615}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !544, file: !330, line: 52, baseType: !617, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!348, !327, !620, !621}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !623, file: !36, line: 593, baseType: !398, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !623, file: !36, line: 594, baseType: !398, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !623, file: !36, line: 594, baseType: !398, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !623, file: !36, line: 594, baseType: !398, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !623, file: !36, line: 595, baseType: !398, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !623, file: !36, line: 596, baseType: !398, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !623, file: !36, line: 597, baseType: !398, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !623, file: !36, line: 598, baseType: !398, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !623, file: !36, line: 598, baseType: !398, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !623, file: !36, line: 599, baseType: !398, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !544, file: !330, line: 53, baseType: !636, size: 64, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!348, !327, !327, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !544, file: !330, line: 54, baseType: !641, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!348, !327, !564}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !544, file: !330, line: 55, baseType: !561, size: 64, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !544, file: !330, line: 56, baseType: !646, size: 64, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!348, !327, !649, !450}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !544, file: !330, line: 58, baseType: !651, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!348, !327, !654}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !544, file: !330, line: 59, baseType: !651, size: 64, offset: 1344)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !544, file: !330, line: 60, baseType: !657, size: 64, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!348, !327, !660, !512}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !544, file: !330, line: 61, baseType: !662, size: 64, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!348, !327}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !544, file: !330, line: 63, baseType: !666, size: 64, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!348, !327, !396, !550, !460, !564, !564}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !544, file: !330, line: 64, baseType: !670, size: 64, offset: 1600)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!348, !327, !327, !581, !581, !585}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !544, file: !330, line: 65, baseType: !674, size: 64, offset: 1664)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!348, !327, !327, !585}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !544, file: !330, line: 66, baseType: !678, size: 64, offset: 1728)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!348, !327, !327, !581, !585}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !544, file: !330, line: 67, baseType: !674, size: 64, offset: 1792)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !544, file: !330, line: 69, baseType: !662, size: 64, offset: 1856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !544, file: !330, line: 70, baseType: !670, size: 64, offset: 1920)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !544, file: !330, line: 71, baseType: !678, size: 64, offset: 1984)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !544, file: !330, line: 72, baseType: !686, size: 64, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!348, !327, !615}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !544, file: !330, line: 73, baseType: !662, size: 64, offset: 2112)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !544, file: !330, line: 75, baseType: !691, size: 64, offset: 2176)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!348, !327, !694, !615}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !544, file: !330, line: 76, baseType: !561, size: 64, offset: 2240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !544, file: !330, line: 77, baseType: !561, size: 64, offset: 2304)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !544, file: !330, line: 78, baseType: !578, size: 64, offset: 2368)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !544, file: !330, line: 79, baseType: !602, size: 64, offset: 2432)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !544, file: !330, line: 81, baseType: !700, size: 64, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!348, !327, !460, !327, !703}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !544, file: !330, line: 82, baseType: !705, size: 64, offset: 2560)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!348, !327, !396, !708, !708, !614, !710}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !544, file: !330, line: 83, baseType: !712, size: 64, offset: 2624)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!348, !327, !396, !715, !396}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !544, file: !330, line: 84, baseType: !717, size: 64, offset: 2688)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!348, !327, !396, !550, !396, !550, !459}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !544, file: !330, line: 85, baseType: !721, size: 64, offset: 2752)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!348, !327, !327, !703}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !544, file: !330, line: 87, baseType: !725, size: 64, offset: 2816)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!348, !327, !564, !442}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !544, file: !330, line: 88, baseType: !729, size: 64, offset: 2880)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!348, !327, !460}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !544, file: !330, line: 89, baseType: !729, size: 64, offset: 2944)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !544, file: !330, line: 90, baseType: !734, size: 64, offset: 3008)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!348, !327, !564, !554}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !544, file: !330, line: 91, baseType: !666, size: 64, offset: 3072)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !544, file: !330, line: 93, baseType: !739, size: 64, offset: 3136)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!348, !327, !742}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !544, file: !330, line: 94, baseType: !746, size: 64, offset: 3200)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!348, !327, !396, !512, !512, !442, !749, !749, !639}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !544, file: !330, line: 95, baseType: !746, size: 64, offset: 3264)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !544, file: !330, line: 96, baseType: !746, size: 64, offset: 3328)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !544, file: !330, line: 97, baseType: !746, size: 64, offset: 3392)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !544, file: !330, line: 99, baseType: !754, size: 64, offset: 3456)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!348, !327, !757, !760}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !582, line: 51, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !582, line: 51, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !330, line: 609, size: 6208, elements: !763)
!763 = !{!764, !765, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !784, !791, !792, !793, !794, !795, !796, !797, !798, !802, !803, !804, !805, !806, !808, !809, !810, !811, !812, !813, !814}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !762, file: !330, line: 610, baseType: !333, size: 4480)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !762, file: !330, line: 610, baseType: !766, size: 32, offset: 4480)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !392)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !762, file: !330, line: 611, baseType: !396, size: 32, offset: 4512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !762, file: !330, line: 611, baseType: !396, size: 32, offset: 4544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !762, file: !330, line: 611, baseType: !396, size: 32, offset: 4576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !762, file: !330, line: 612, baseType: !396, size: 32, offset: 4608)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !762, file: !330, line: 613, baseType: !396, size: 32, offset: 4640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !762, file: !330, line: 614, baseType: !442, size: 64, offset: 4672)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !762, file: !330, line: 615, baseType: !444, size: 64, offset: 4736)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !762, file: !330, line: 616, baseType: !715, size: 64, offset: 4800)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !762, file: !330, line: 617, baseType: !442, size: 64, offset: 4864)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !762, file: !330, line: 618, baseType: !777, size: 64, offset: 4928)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !330, line: 602, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 598, size: 128, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !779, file: !330, line: 599, baseType: !396, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !779, file: !330, line: 600, baseType: !396, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !779, file: !330, line: 601, baseType: !459, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !762, file: !330, line: 619, baseType: !785, size: 64, offset: 4992)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !330, line: 607, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 604, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !787, file: !330, line: 605, baseType: !396, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !787, file: !330, line: 606, baseType: !459, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !762, file: !330, line: 620, baseType: !459, size: 64, offset: 5056)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !762, file: !330, line: 621, baseType: !451, size: 64, offset: 5120)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !762, file: !330, line: 622, baseType: !451, size: 64, offset: 5184)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !762, file: !330, line: 623, baseType: !564, size: 64, offset: 5248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !762, file: !330, line: 623, baseType: !564, size: 64, offset: 5312)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !762, file: !330, line: 623, baseType: !564, size: 64, offset: 5376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !762, file: !330, line: 624, baseType: !512, size: 32, offset: 5440)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !762, file: !330, line: 625, baseType: !799, size: 64, offset: 5504)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!348}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !762, file: !330, line: 626, baseType: !433, size: 64, offset: 5568)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !762, file: !330, line: 627, baseType: !564, size: 64, offset: 5632)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !762, file: !330, line: 628, baseType: !396, size: 32, offset: 5696)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !762, file: !330, line: 629, baseType: !373, size: 64, offset: 5760)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !762, file: !330, line: 630, baseType: !807, size: 32, offset: 5824)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !762, file: !330, line: 631, baseType: !396, size: 32, offset: 5856)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !762, file: !330, line: 631, baseType: !396, size: 32, offset: 5888)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !762, file: !330, line: 632, baseType: !512, size: 32, offset: 5920)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !762, file: !330, line: 633, baseType: !512, size: 32, offset: 5952)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !762, file: !330, line: 634, baseType: !384, size: 64, offset: 6016)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !762, file: !330, line: 634, baseType: !433, size: 64, offset: 6080)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !762, file: !330, line: 635, baseType: !404, size: 64, offset: 6144)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !544, file: !330, line: 100, baseType: !816, size: 64, offset: 3520)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!348, !327, !396, !396, !819, !822}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !821)
!821 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !544, file: !330, line: 101, baseType: !662, size: 64, offset: 3584)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !544, file: !330, line: 102, baseType: !825, size: 64, offset: 3648)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!348, !327, !581, !581, !615}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !544, file: !330, line: 103, baseType: !547, size: 64, offset: 3712)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !544, file: !330, line: 105, baseType: !830, size: 64, offset: 3776)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!348, !327, !581, !581, !614, !615}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !544, file: !330, line: 106, baseType: !662, size: 64, offset: 3840)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !544, file: !330, line: 107, baseType: !835, size: 64, offset: 3904)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!348, !327, !360}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !544, file: !330, line: 108, baseType: !839, size: 64, offset: 3968)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!348, !327, !842, !614, !615}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !373)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !544, file: !330, line: 109, baseType: !799, size: 64, offset: 4032)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !544, file: !330, line: 111, baseType: !845, size: 64, offset: 4096)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!348, !327, !327, !327, !451, !327}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !544, file: !330, line: 112, baseType: !849, size: 64, offset: 4160)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!348, !327, !327, !327, !327}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !544, file: !330, line: 113, baseType: !853, size: 64, offset: 4224)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!348, !327, !856, !856}
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !582, line: 30, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !582, line: 30, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !544, file: !330, line: 114, baseType: !547, size: 64, offset: 4288)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !544, file: !330, line: 115, baseType: !666, size: 64, offset: 4352)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !544, file: !330, line: 117, baseType: !725, size: 64, offset: 4416)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !544, file: !330, line: 118, baseType: !725, size: 64, offset: 4480)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !544, file: !330, line: 119, baseType: !839, size: 64, offset: 4544)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !544, file: !330, line: 120, baseType: !865, size: 64, offset: 4608)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!348, !327, !868, !639}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !544, file: !330, line: 121, baseType: !799, size: 64, offset: 4672)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !544, file: !330, line: 123, baseType: !871, size: 64, offset: 4736)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!348, !327, !396, !433}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !544, file: !330, line: 124, baseType: !875, size: 64, offset: 4800)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!348, !327, !760, !564, !433}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !544, file: !330, line: 125, baseType: !879, size: 64, offset: 4864)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!348, !488, !327}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !544, file: !330, line: 126, baseType: !561, size: 64, offset: 4928)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !544, file: !330, line: 127, baseType: !561, size: 64, offset: 4992)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !544, file: !330, line: 129, baseType: !885, size: 64, offset: 5056)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!348, !327, !715}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !544, file: !330, line: 130, baseType: !889, size: 64, offset: 5120)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!348, !327, !892, !892}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !894, file: !60, line: 653, baseType: !396, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !894, file: !60, line: 653, baseType: !564, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !544, file: !330, line: 131, baseType: !889, size: 64, offset: 5184)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !544, file: !330, line: 132, baseType: !900, size: 64, offset: 5248)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!348, !327, !442, !442, !442}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !544, file: !330, line: 133, baseType: !835, size: 64, offset: 5312)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !544, file: !330, line: 135, baseType: !905, size: 64, offset: 5376)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!348, !327, !451, !639}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !544, file: !330, line: 136, baseType: !905, size: 64, offset: 5440)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !544, file: !330, line: 137, baseType: !910, size: 64, offset: 5504)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!348, !327, !639}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !544, file: !330, line: 138, baseType: !547, size: 64, offset: 5568)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !544, file: !330, line: 139, baseType: !915, size: 64, offset: 5632)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!348, !327, !918, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !544, file: !330, line: 141, baseType: !799, size: 64, offset: 5696)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !544, file: !330, line: 142, baseType: !921, size: 64, offset: 5760)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!348, !327, !327, !451, !327}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !544, file: !330, line: 143, baseType: !925, size: 64, offset: 5824)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!348, !327, !327, !327}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !544, file: !330, line: 144, baseType: !799, size: 64, offset: 5888)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !544, file: !330, line: 145, baseType: !921, size: 64, offset: 5952)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !544, file: !330, line: 147, baseType: !925, size: 64, offset: 6016)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !544, file: !330, line: 148, baseType: !799, size: 64, offset: 6080)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !544, file: !330, line: 149, baseType: !921, size: 64, offset: 6144)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !544, file: !330, line: 150, baseType: !925, size: 64, offset: 6208)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !544, file: !330, line: 151, baseType: !935, size: 64, offset: 6272)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!348, !327, !512}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !544, file: !330, line: 153, baseType: !662, size: 64, offset: 6336)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !544, file: !330, line: 154, baseType: !662, size: 64, offset: 6400)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !544, file: !330, line: 155, baseType: !662, size: 64, offset: 6464)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !544, file: !330, line: 156, baseType: !662, size: 64, offset: 6528)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !544, file: !330, line: 157, baseType: !835, size: 64, offset: 6592)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !544, file: !330, line: 159, baseType: !944, size: 64, offset: 6656)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!348, !327, !396, !552}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !544, file: !330, line: 160, baseType: !662, size: 64, offset: 6720)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !544, file: !330, line: 161, baseType: !662, size: 64, offset: 6784)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !544, file: !330, line: 162, baseType: !662, size: 64, offset: 6848)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !544, file: !330, line: 163, baseType: !662, size: 64, offset: 6912)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !544, file: !330, line: 165, baseType: !925, size: 64, offset: 6976)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !544, file: !330, line: 166, baseType: !925, size: 64, offset: 7040)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !544, file: !330, line: 167, baseType: !725, size: 64, offset: 7104)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !544, file: !330, line: 168, baseType: !955, size: 64, offset: 7168)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!348, !327, !564, !396}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !544, file: !330, line: 169, baseType: !959, size: 64, offset: 7232)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!348, !327, !639, !442}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !544, file: !330, line: 171, baseType: !686, size: 64, offset: 7296)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !544, file: !330, line: 172, baseType: !662, size: 64, offset: 7360)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !544, file: !330, line: 173, baseType: !965, size: 64, offset: 7424)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!348, !327, !442, !749}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !544, file: !330, line: 174, baseType: !825, size: 64, offset: 7488)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !544, file: !330, line: 175, baseType: !825, size: 64, offset: 7552)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !544, file: !330, line: 177, baseType: !561, size: 64, offset: 7616)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !544, file: !330, line: 178, baseType: !611, size: 64, offset: 7680)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !544, file: !330, line: 179, baseType: !561, size: 64, offset: 7744)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !544, file: !330, line: 180, baseType: !568, size: 64, offset: 7808)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !544, file: !330, line: 181, baseType: !975, size: 64, offset: 7872)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!348, !327, !352, !614, !615}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !544, file: !330, line: 183, baseType: !885, size: 64, offset: 7936)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !544, file: !330, line: 184, baseType: !646, size: 64, offset: 8000)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !544, file: !330, line: 185, baseType: !981, size: 64, offset: 8064)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!348, !327, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !544, file: !330, line: 186, baseType: !986, size: 64, offset: 8128)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!348, !327, !396, !550, !459}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !544, file: !330, line: 187, baseType: !705, size: 64, offset: 8192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !544, file: !330, line: 189, baseType: !991, size: 64, offset: 8256)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!348, !327, !396, !396, !442, !552}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !544, file: !330, line: 190, baseType: !799, size: 64, offset: 8320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !544, file: !330, line: 191, baseType: !921, size: 64, offset: 8384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !544, file: !330, line: 192, baseType: !925, size: 64, offset: 8448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !544, file: !330, line: 193, baseType: !998, size: 64, offset: 8512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!348, !327, !757, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !330, line: 660, size: 5312, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1003, file: !330, line: 661, baseType: !333, size: 4480)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1003, file: !330, line: 661, baseType: !766, size: 32, offset: 4480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1003, file: !330, line: 662, baseType: !396, size: 32, offset: 4512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1003, file: !330, line: 662, baseType: !396, size: 32, offset: 4544)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1003, file: !330, line: 662, baseType: !396, size: 32, offset: 4576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1003, file: !330, line: 663, baseType: !396, size: 32, offset: 4608)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1003, file: !330, line: 664, baseType: !396, size: 32, offset: 4640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1003, file: !330, line: 665, baseType: !442, size: 64, offset: 4672)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1003, file: !330, line: 666, baseType: !442, size: 64, offset: 4736)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1003, file: !330, line: 667, baseType: !396, size: 32, offset: 4800)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1003, file: !330, line: 668, baseType: !807, size: 32, offset: 4832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1003, file: !330, line: 670, baseType: !442, size: 64, offset: 4864)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1003, file: !330, line: 670, baseType: !442, size: 64, offset: 4928)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1003, file: !330, line: 671, baseType: !442, size: 64, offset: 4992)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1003, file: !330, line: 672, baseType: !442, size: 64, offset: 5056)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1003, file: !330, line: 673, baseType: !442, size: 64, offset: 5120)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1003, file: !330, line: 674, baseType: !396, size: 32, offset: 5184)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1003, file: !330, line: 675, baseType: !442, size: 64, offset: 5248)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !544, file: !330, line: 195, baseType: !1024, size: 64, offset: 8576)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!348, !1001, !327, !327}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !544, file: !330, line: 196, baseType: !1024, size: 64, offset: 8640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !544, file: !330, line: 197, baseType: !799, size: 64, offset: 8704)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !544, file: !330, line: 198, baseType: !921, size: 64, offset: 8768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !544, file: !330, line: 199, baseType: !925, size: 64, offset: 8832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !544, file: !330, line: 201, baseType: !1032, size: 64, offset: 8896)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!348, !327, !396, !396}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !544, file: !330, line: 202, baseType: !700, size: 64, offset: 8960)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !544, file: !330, line: 203, baseType: !568, size: 64, offset: 9024)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !544, file: !330, line: 204, baseType: !754, size: 64, offset: 9088)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !544, file: !330, line: 205, baseType: !885, size: 64, offset: 9152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !544, file: !330, line: 206, baseType: !1040, size: 64, offset: 9216)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!348, !352, !327, !396, !614, !615}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !544, file: !330, line: 208, baseType: !1044, size: 64, offset: 9280)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!348, !396, !710}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !544, file: !330, line: 209, baseType: !925, size: 64, offset: 9344)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !544, file: !330, line: 210, baseType: !717, size: 64, offset: 9408)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !329, file: !330, line: 438, baseType: !1050, size: 64, offset: 13952)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !582, line: 60, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1052, file: !114, line: 241, baseType: !352, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1052, file: !114, line: 242, baseType: !413, size: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1052, file: !114, line: 243, baseType: !396, size: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1052, file: !114, line: 243, baseType: !396, size: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1052, file: !114, line: 244, baseType: !396, size: 32, offset: 160)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1052, file: !114, line: 244, baseType: !396, size: 32, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1052, file: !114, line: 245, baseType: !442, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1052, file: !114, line: 246, baseType: !512, size: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1052, file: !114, line: 247, baseType: !396, size: 32, offset: 352)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1052, file: !114, line: 251, baseType: !396, size: 32, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1052, file: !114, line: 252, baseType: !856, size: 64, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1052, file: !114, line: 253, baseType: !512, size: 32, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1052, file: !114, line: 254, baseType: !396, size: 32, offset: 544)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1052, file: !114, line: 254, baseType: !396, size: 32, offset: 576)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1052, file: !114, line: 255, baseType: !396, size: 32, offset: 608)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !329, file: !330, line: 438, baseType: !1050, size: 64, offset: 14016)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !329, file: !330, line: 439, baseType: !433, size: 64, offset: 14080)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !329, file: !330, line: 440, baseType: !1072, size: 32, offset: 14144)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !329, file: !330, line: 441, baseType: !512, size: 32, offset: 14176)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !329, file: !330, line: 442, baseType: !512, size: 32, offset: 14208)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !329, file: !330, line: 443, baseType: !1076, size: 448, offset: 14272)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 448, elements: !1078)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !373)
!1078 = !{!1079}
!1079 = !DISubrange(count: 7)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !329, file: !330, line: 444, baseType: !512, size: 32, offset: 14720)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !329, file: !330, line: 445, baseType: !512, size: 32, offset: 14752)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !329, file: !330, line: 446, baseType: !396, size: 32, offset: 14784)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !329, file: !330, line: 447, baseType: !435, size: 64, offset: 14848)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !329, file: !330, line: 448, baseType: !435, size: 64, offset: 14912)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !329, file: !330, line: 449, baseType: !622, size: 640, offset: 14976)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !329, file: !330, line: 450, baseType: !554, size: 32, offset: 15616)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !329, file: !330, line: 451, baseType: !1088, size: 2880, offset: 15680)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !330, line: 318, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !330, line: 319, size: 2880, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1110, !1111, !1116, !1121, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1136, !1137, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1169, !1170, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1194, !1195, !1199, !1200}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1089, file: !330, line: 320, baseType: !396, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1089, file: !330, line: 321, baseType: !396, size: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1089, file: !330, line: 322, baseType: !396, size: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1089, file: !330, line: 323, baseType: !396, size: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1089, file: !330, line: 324, baseType: !396, size: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1089, file: !330, line: 325, baseType: !396, size: 32, offset: 160)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1089, file: !330, line: 326, baseType: !1098, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !330, line: 293, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !330, line: 295, size: 448, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1100, file: !330, line: 296, baseType: !1098, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1100, file: !330, line: 297, baseType: !459, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1100, file: !330, line: 297, baseType: !459, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1100, file: !330, line: 298, baseType: !442, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1100, file: !330, line: 298, baseType: !442, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1100, file: !330, line: 299, baseType: !396, size: 32, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1100, file: !330, line: 300, baseType: !396, size: 32, offset: 352)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1100, file: !330, line: 301, baseType: !396, size: 32, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1089, file: !330, line: 326, baseType: !1098, size: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1089, file: !330, line: 328, baseType: !1112, size: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!348, !327, !1115, !442}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1089, file: !330, line: 329, baseType: !1117, size: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!348, !1115, !1120, !444, !444, !462, !442}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1089, file: !330, line: 330, baseType: !1122, size: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!348, !1115}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1089, file: !330, line: 331, baseType: !1122, size: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1089, file: !330, line: 334, baseType: !352, size: 64, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !330, line: 335, baseType: !413, size: 32, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1089, file: !330, line: 335, baseType: !413, size: 32, offset: 672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1089, file: !330, line: 336, baseType: !413, size: 32, offset: 704)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1089, file: !330, line: 336, baseType: !413, size: 32, offset: 736)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1089, file: !330, line: 337, baseType: !1132, size: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !353, line: 339, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !353, line: 339, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1089, file: !330, line: 338, baseType: !1132, size: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1089, file: !330, line: 339, baseType: !1138, size: 64, offset: 896)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !353, line: 341, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !353, line: 351, size: 192, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1140, file: !353, line: 354, baseType: !72, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1140, file: !353, line: 355, baseType: !72, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1140, file: !353, line: 356, baseType: !72, size: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1140, file: !353, line: 361, baseType: !72, size: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1140, file: !353, line: 362, baseType: !508, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1089, file: !330, line: 340, baseType: !396, size: 32, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1089, file: !330, line: 340, baseType: !396, size: 32, offset: 992)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1089, file: !330, line: 341, baseType: !459, size: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1089, file: !330, line: 342, baseType: !442, size: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1089, file: !330, line: 343, baseType: !462, size: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1089, file: !330, line: 344, baseType: !444, size: 64, offset: 1216)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1089, file: !330, line: 345, baseType: !396, size: 32, offset: 1280)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1089, file: !330, line: 346, baseType: !1120, size: 64, offset: 1344)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1089, file: !330, line: 347, baseType: !512, size: 32, offset: 1408)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1089, file: !330, line: 348, baseType: !396, size: 32, offset: 1440)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1089, file: !330, line: 351, baseType: !512, size: 32, offset: 1472)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1089, file: !330, line: 352, baseType: !512, size: 32, offset: 1504)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1089, file: !330, line: 353, baseType: !413, size: 32, offset: 1536)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1089, file: !330, line: 354, baseType: !413, size: 32, offset: 1568)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1089, file: !330, line: 355, baseType: !1120, size: 64, offset: 1600)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1089, file: !330, line: 356, baseType: !1120, size: 64, offset: 1664)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1089, file: !330, line: 357, baseType: !1164, size: 64, offset: 1728)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !330, line: 310, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 308, size: 32, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1166, file: !330, line: 309, baseType: !396, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1089, file: !330, line: 357, baseType: !1164, size: 64, offset: 1792)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1089, file: !330, line: 358, baseType: !1171, size: 64, offset: 1856)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !330, line: 316, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 312, size: 128, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1173, file: !330, line: 313, baseType: !433, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1173, file: !330, line: 314, baseType: !396, size: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1173, file: !330, line: 315, baseType: !375, size: 8, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1089, file: !330, line: 359, baseType: !1171, size: 64, offset: 1920)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1089, file: !330, line: 360, baseType: !1171, size: 64, offset: 1984)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1089, file: !330, line: 361, baseType: !396, size: 32, offset: 2048)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1089, file: !330, line: 362, baseType: !413, size: 32, offset: 2080)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1089, file: !330, line: 363, baseType: !396, size: 32, offset: 2112)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1089, file: !330, line: 364, baseType: !1120, size: 64, offset: 2176)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1089, file: !330, line: 365, baseType: !1138, size: 64, offset: 2240)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1089, file: !330, line: 366, baseType: !413, size: 32, offset: 2304)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1089, file: !330, line: 367, baseType: !413, size: 32, offset: 2336)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1089, file: !330, line: 368, baseType: !1132, size: 64, offset: 2368)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1089, file: !330, line: 369, baseType: !1132, size: 64, offset: 2432)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1089, file: !330, line: 370, baseType: !1190, size: 64, offset: 2496)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1089, file: !330, line: 371, baseType: !1190, size: 64, offset: 2560)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1089, file: !330, line: 372, baseType: !1190, size: 64, offset: 2624)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1089, file: !330, line: 373, baseType: !1196, size: 64, offset: 2688)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !353, line: 331, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !353, line: 331, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1089, file: !330, line: 374, baseType: !508, size: 64, offset: 2752)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1089, file: !330, line: 375, baseType: !1201, size: 64, offset: 2816)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !329, file: !330, line: 451, baseType: !1088, size: 2880, offset: 18560)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !329, file: !330, line: 452, baseType: !1204, size: 64, offset: 21440)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1205)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !330, line: 681, size: 4864, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1212, !1213, !1214, !1218}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1206, file: !330, line: 682, baseType: !333, size: 4480)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1206, file: !330, line: 682, baseType: !766, size: 32, offset: 4480)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1206, file: !330, line: 683, baseType: !512, size: 32, offset: 4512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1206, file: !330, line: 684, baseType: !396, size: 32, offset: 4544)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1206, file: !330, line: 685, baseType: !918, size: 64, offset: 4608)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1206, file: !330, line: 686, baseType: !459, size: 64, offset: 4672)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1206, file: !330, line: 687, baseType: !1215, size: 64, offset: 4736)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!348, !1204, !564, !433}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1206, file: !330, line: 688, baseType: !433, size: 64, offset: 4800)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !329, file: !330, line: 453, baseType: !1204, size: 64, offset: 21504)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !329, file: !330, line: 454, baseType: !1204, size: 64, offset: 21568)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !329, file: !330, line: 455, baseType: !396, size: 32, offset: 21632)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !329, file: !330, line: 456, baseType: !512, size: 32, offset: 21664)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !329, file: !330, line: 457, baseType: !1224, size: 320, offset: 21696)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !330, line: 399, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 394, size: 320, elements: !1226)
!1226 = !{!1227, !1228, !1232, !1233}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1225, file: !330, line: 395, baseType: !396, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1225, file: !330, line: 396, baseType: !1229, size: 128, offset: 32)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 128, elements: !1230)
!1230 = !{!1231}
!1231 = !DISubrange(count: 4)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1225, file: !330, line: 397, baseType: !1229, size: 128, offset: 160)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1225, file: !330, line: 398, baseType: !512, size: 32, offset: 288)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !329, file: !330, line: 458, baseType: !512, size: 32, offset: 22016)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !329, file: !330, line: 458, baseType: !512, size: 32, offset: 22048)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !329, file: !330, line: 458, baseType: !512, size: 32, offset: 22080)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !329, file: !330, line: 458, baseType: !512, size: 32, offset: 22112)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !329, file: !330, line: 459, baseType: !512, size: 32, offset: 22144)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !329, file: !330, line: 459, baseType: !512, size: 32, offset: 22176)
