; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/composite/mcomposite.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/composite/mcomposite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!279 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1203, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 187, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 344, baseType: !7, size: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIEnumerator(name: "MAT_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 341, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIEnumerator(name: "MAT_COMPOSITE_MERGE_RIGHT", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_COMPOSITE_MERGE_LEFT", value: 1, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 663, baseType: !7, size: 32, elements: !306)
!305 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!306 = !{!307, !308, !309}
!307 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321}
!317 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!321 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!327 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!345 = !{!346, !384, !465, !405, !381, !540, !1368, !1369, !1370, !445, !1228, !1373, !455, !74, !483, !1371, !7, !1376}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Composite", file: !348, line: 33, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/composite/mcomposite.c", directory: "/home/users/ndemeye/xSDK")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 13, size: 1344, elements: !350)
!350 = !{!351, !353, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !348, line: 14, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatCompositeType", file: !38, line: 344, baseType: !296)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !349, file: !348, line: 15, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompositeLink", file: !348, line: 6, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Mat_CompositeLink", file: !348, line: 7, size: 256, elements: !357)
!357 = !{!358, !1338, !1339, !1340}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !356, file: !348, line: 8, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !362, line: 436, size: 23424, elements: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!363 = !{!364, !574, !1081, !1101, !1102, !1103, !1105, !1106, !1107, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1234, !1235, !1251, !1252, !1253, !1254, !1255, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1290, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1336, !1337}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !361, file: !362, line: 437, baseType: !365, size: 4480)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !366, line: 122, baseType: !367)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !366, line: 73, size: 4480, elements: !368)
!368 = !{!369, !371, !426, !427, !429, !432, !433, !434, !435, !443, !444, !446, !450, !454, !456, !457, !458, !459, !460, !461, !462, !463, !464, !466, !468, !469, !470, !472, !473, !475, !477, !478, !479, !480, !481, !484, !486, !487, !488, !489, !490, !493, !495, !496, !497, !507, !509, !510, !514, !515, !564, !569, !571, !572, !573}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !367, file: !366, line: 74, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !367, file: !366, line: 75, baseType: !372, size: 448, offset: 64)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 448, elements: !424)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !366, line: 53, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 45, size: 448, elements: !375)
!375 = !{!376, !388, !396, !401, !408, !412, !419}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !374, file: !366, line: 46, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !381, !383}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !385, line: 330, baseType: !386)
!385 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !385, line: 330, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !374, file: !366, line: 47, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!380, !381, !392}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !393, line: 16, baseType: !394)
!393 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !393, line: 16, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !374, file: !366, line: 48, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!380, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !374, file: !366, line: 49, baseType: !402, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!380, !381, !405, !381}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !374, file: !366, line: 50, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!380, !381, !405, !400}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !374, file: !366, line: 51, baseType: !413, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!380, !381, !405, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !374, file: !366, line: 52, baseType: !420, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!380, !381, !405, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !367, file: !366, line: 76, baseType: !384, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !366, line: 77, baseType: !428, size: 32, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !367, file: !366, line: 78, baseType: !430, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !431)
!431 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !367, file: !366, line: 78, baseType: !430, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !367, file: !366, line: 78, baseType: !430, size: 64, offset: 768)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !367, file: !366, line: 78, baseType: !430, size: 64, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !367, file: !366, line: 79, baseType: !436, size: 64, offset: 896)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !439, line: 27, baseType: !440)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !441, line: 43, baseType: !442)
!441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!442 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !367, file: !366, line: 80, baseType: !428, size: 32, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !367, file: !366, line: 81, baseType: !445, size: 32, offset: 992)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !367, file: !366, line: 82, baseType: !447, size: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !367, file: !366, line: 83, baseType: !451, size: 64, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !367, file: !366, line: 84, baseType: !455, size: 64, offset: 1152)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !367, file: !366, line: 85, baseType: !455, size: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !367, file: !366, line: 86, baseType: !455, size: 64, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !367, file: !366, line: 87, baseType: !455, size: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !367, file: !366, line: 88, baseType: !381, size: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !367, file: !366, line: 89, baseType: !436, size: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !366, line: 90, baseType: !455, size: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !367, file: !366, line: 91, baseType: !455, size: 64, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !367, file: !366, line: 92, baseType: !428, size: 32, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !367, file: !366, line: 93, baseType: !465, size: 64, offset: 1728)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !366, line: 94, baseType: !467, size: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !437)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !367, file: !366, line: 95, baseType: !428, size: 32, offset: 1856)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !367, file: !366, line: 95, baseType: !428, size: 32, offset: 1888)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !367, file: !366, line: 96, baseType: !471, size: 64, offset: 1920)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !367, file: !366, line: 96, baseType: !471, size: 64, offset: 1984)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !367, file: !366, line: 97, baseType: !474, size: 64, offset: 2048)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !367, file: !366, line: 97, baseType: !476, size: 64, offset: 2112)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !367, file: !366, line: 98, baseType: !428, size: 32, offset: 2176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !367, file: !366, line: 98, baseType: !428, size: 32, offset: 2208)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !367, file: !366, line: 99, baseType: !471, size: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !367, file: !366, line: 99, baseType: !471, size: 64, offset: 2304)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !367, file: !366, line: 100, baseType: !482, size: 64, offset: 2368)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !431)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !367, file: !366, line: 100, baseType: !485, size: 64, offset: 2432)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !367, file: !366, line: 101, baseType: !428, size: 32, offset: 2496)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !367, file: !366, line: 101, baseType: !428, size: 32, offset: 2528)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !367, file: !366, line: 102, baseType: !471, size: 64, offset: 2560)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !367, file: !366, line: 102, baseType: !471, size: 64, offset: 2624)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !367, file: !366, line: 103, baseType: !491, size: 64, offset: 2688)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !483)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !367, file: !366, line: 103, baseType: !494, size: 64, offset: 2752)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !367, file: !366, line: 104, baseType: !423, size: 64, offset: 2816)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !367, file: !366, line: 105, baseType: !428, size: 32, offset: 2880)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !367, file: !366, line: 106, baseType: !498, size: 128, offset: 2944)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !505)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !366, line: 64, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 61, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !501, file: !366, line: 62, baseType: !416, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !501, file: !366, line: 63, baseType: !465, size: 64, offset: 64)
!505 = !{!506}
!506 = !DISubrange(count: 2)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !367, file: !366, line: 107, baseType: !508, size: 64, offset: 3072)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 64, elements: !505)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !367, file: !366, line: 108, baseType: !465, size: 64, offset: 3136)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !367, file: !366, line: 109, baseType: !511, size: 64, offset: 3200)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!380, !465}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !367, file: !366, line: 111, baseType: !428, size: 32, offset: 3264)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !367, file: !366, line: 112, baseType: !516, size: 320, offset: 3328)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 320, elements: !562)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!380, !520, !381, !465}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !523)
!523 = !{!524, !525, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !522, file: !12, line: 100, baseType: !428, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !12, line: 101, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !537, !538, !539, !543, !545, !547, !548, !549}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !528, file: !12, line: 84, baseType: !455, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !528, file: !12, line: 85, baseType: !455, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !12, line: 86, baseType: !465, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !528, file: !12, line: 87, baseType: !447, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !528, file: !12, line: 88, baseType: !535, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !528, file: !12, line: 89, baseType: !407, size: 8, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !528, file: !12, line: 90, baseType: !455, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !528, file: !12, line: 91, baseType: !540, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !541, line: 46, baseType: !542)
!541 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!542 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !528, file: !12, line: 92, baseType: !544, size: 32, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !12, line: 93, baseType: !546, size: 32, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !12, line: 94, baseType: !526, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !528, file: !12, line: 95, baseType: !455, size: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !528, file: !12, line: 96, baseType: !465, size: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !522, file: !12, line: 102, baseType: !455, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !522, file: !12, line: 102, baseType: !455, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !522, file: !12, line: 103, baseType: !455, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !522, file: !12, line: 104, baseType: !384, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !522, file: !12, line: 105, baseType: !544, size: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !522, file: !12, line: 105, baseType: !544, size: 32, offset: 416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !522, file: !12, line: 105, baseType: !544, size: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !522, file: !12, line: 106, baseType: !381, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !522, file: !12, line: 107, baseType: !559, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!562 = !{!563}
!563 = !DISubrange(count: 5)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !367, file: !366, line: 113, baseType: !565, size: 320, offset: 3648)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 320, elements: !562)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!380, !381, !465}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !367, file: !366, line: 114, baseType: !570, size: 320, offset: 3968)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 320, elements: !562)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !367, file: !366, line: 115, baseType: !544, size: 32, offset: 4288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !367, file: !366, line: 120, baseType: !559, size: 64, offset: 4352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !367, file: !366, line: 121, baseType: !544, size: 32, offset: 4416)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !361, file: !362, line: 437, baseType: !575, size: 9472, offset: 4480)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 9472, elements: !424)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !362, line: 32, size: 9472, elements: !577)
!577 = !{!578, !587, !591, !592, !599, !603, !604, !605, !606, !607, !608, !609, !633, !637, !642, !648, !667, !672, !676, !677, !682, !687, !688, !693, !697, !701, !705, !709, !713, !714, !715, !716, !717, !721, !722, !727, !728, !729, !730, !731, !736, !743, !748, !752, !756, !760, !764, !765, !769, !770, !777, !782, !783, !784, !785, !847, !855, !856, !860, !861, !865, !866, !870, !875, !876, !880, !884, !891, !892, !893, !894, !895, !896, !901, !902, !906, !910, !914, !915, !916, !920, !930, !931, !935, !936, !940, !941, !945, !946, !951, !952, !956, !960, !961, !962, !963, !964, !965, !966, !970, !971, !972, !973, !974, !975, !979, !980, !981, !982, !983, !984, !985, !986, !990, !994, !995, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1017, !1021, !1022, !1026, !1027, !1028, !1029, !1055, !1059, !1060, !1061, !1062, !1063, !1067, !1068, !1069, !1070, !1071, !1075, !1079, !1080}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !576, file: !362, line: 34, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!380, !359, !428, !582, !428, !582, !584, !586}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !576, file: !362, line: 35, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!380, !359, !428, !474, !476, !494}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !576, file: !362, line: 36, baseType: !588, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !576, file: !362, line: 37, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!380, !359, !596, !596}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !576, file: !362, line: 38, baseType: !600, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!380, !359, !596, !596, !596}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !576, file: !362, line: 40, baseType: !593, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !576, file: !362, line: 41, baseType: !600, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !576, file: !362, line: 42, baseType: !593, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !576, file: !362, line: 43, baseType: !600, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !576, file: !362, line: 44, baseType: !593, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !576, file: !362, line: 46, baseType: !600, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !576, file: !362, line: 47, baseType: !610, size: 64, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!380, !359, !613, !613, !617}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !614, line: 11, baseType: !615)
!614 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !614, line: 11, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !620, file: !38, line: 1227, baseType: !483, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !620, file: !38, line: 1228, baseType: !483, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !620, file: !38, line: 1229, baseType: !483, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !620, file: !38, line: 1230, baseType: !483, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !620, file: !38, line: 1231, baseType: !483, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !620, file: !38, line: 1232, baseType: !483, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !620, file: !38, line: 1233, baseType: !483, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !620, file: !38, line: 1234, baseType: !483, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !620, file: !38, line: 1236, baseType: !483, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !620, file: !38, line: 1237, baseType: !483, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !620, file: !38, line: 1238, baseType: !483, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !576, file: !362, line: 48, baseType: !634, size: 64, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!380, !359, !613, !617}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !576, file: !362, line: 49, baseType: !638, size: 64, offset: 832)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!380, !359, !596, !483, !641, !483, !428, !428, !596}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !576, file: !362, line: 50, baseType: !643, size: 64, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!380, !359, !646, !647}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !576, file: !362, line: 52, baseType: !649, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!380, !359, !652, !653}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !655, file: !38, line: 593, baseType: !430, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !655, file: !38, line: 594, baseType: !430, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !655, file: !38, line: 594, baseType: !430, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !655, file: !38, line: 594, baseType: !430, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !655, file: !38, line: 595, baseType: !430, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !655, file: !38, line: 596, baseType: !430, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !655, file: !38, line: 597, baseType: !430, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !655, file: !38, line: 598, baseType: !430, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !655, file: !38, line: 598, baseType: !430, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !655, file: !38, line: 599, baseType: !430, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !576, file: !362, line: 53, baseType: !668, size: 64, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!380, !359, !359, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !576, file: !362, line: 54, baseType: !673, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!380, !359, !596}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !576, file: !362, line: 55, baseType: !593, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !576, file: !362, line: 56, baseType: !678, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!380, !359, !681, !482}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !576, file: !362, line: 58, baseType: !683, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!380, !359, !686}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !576, file: !362, line: 59, baseType: !683, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !576, file: !362, line: 60, baseType: !689, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!380, !359, !692, !544}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !576, file: !362, line: 61, baseType: !694, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!380, !359}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !576, file: !362, line: 63, baseType: !698, size: 64, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!380, !359, !428, !582, !492, !596, !596}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !576, file: !362, line: 64, baseType: !702, size: 64, offset: 1600)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!380, !359, !359, !613, !613, !617}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !576, file: !362, line: 65, baseType: !706, size: 64, offset: 1664)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!380, !359, !359, !617}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !576, file: !362, line: 66, baseType: !710, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!380, !359, !359, !613, !617}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !576, file: !362, line: 67, baseType: !706, size: 64, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !576, file: !362, line: 69, baseType: !694, size: 64, offset: 1856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !576, file: !362, line: 70, baseType: !702, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !576, file: !362, line: 71, baseType: !710, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !576, file: !362, line: 72, baseType: !718, size: 64, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!380, !359, !647}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !576, file: !362, line: 73, baseType: !694, size: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !576, file: !362, line: 75, baseType: !723, size: 64, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!380, !359, !726, !647}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !576, file: !362, line: 76, baseType: !593, size: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !576, file: !362, line: 77, baseType: !593, size: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !576, file: !362, line: 78, baseType: !610, size: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !576, file: !362, line: 79, baseType: !634, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !576, file: !362, line: 81, baseType: !732, size: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!380, !359, !492, !359, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !576, file: !362, line: 82, baseType: !737, size: 64, offset: 2560)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!380, !359, !428, !740, !740, !646, !742}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !576, file: !362, line: 83, baseType: !744, size: 64, offset: 2624)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!380, !359, !428, !747, !428}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !576, file: !362, line: 84, baseType: !749, size: 64, offset: 2688)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!380, !359, !428, !582, !428, !582, !491}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !576, file: !362, line: 85, baseType: !753, size: 64, offset: 2752)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!380, !359, !359, !735}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !576, file: !362, line: 87, baseType: !757, size: 64, offset: 2816)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!380, !359, !596, !474}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !576, file: !362, line: 88, baseType: !761, size: 64, offset: 2880)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!380, !359, !492}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !576, file: !362, line: 89, baseType: !761, size: 64, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !576, file: !362, line: 90, baseType: !766, size: 64, offset: 3008)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!380, !359, !596, !586}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !576, file: !362, line: 91, baseType: !698, size: 64, offset: 3072)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !576, file: !362, line: 93, baseType: !771, size: 64, offset: 3136)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!380, !359, !774}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !576, file: !362, line: 94, baseType: !778, size: 64, offset: 3200)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!380, !359, !428, !544, !544, !474, !781, !781, !671}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !576, file: !362, line: 95, baseType: !778, size: 64, offset: 3264)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !576, file: !362, line: 96, baseType: !778, size: 64, offset: 3328)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !576, file: !362, line: 97, baseType: !778, size: 64, offset: 3392)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !576, file: !362, line: 99, baseType: !786, size: 64, offset: 3456)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!380, !359, !789, !792}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !614, line: 51, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !614, line: 51, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !362, line: 609, size: 6208, elements: !795)
!795 = !{!796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !816, !823, !824, !825, !826, !827, !828, !829, !830, !834, !835, !836, !837, !838, !840, !841, !842, !843, !844, !845, !846}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !794, file: !362, line: 610, baseType: !365, size: 4480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !794, file: !362, line: 610, baseType: !798, size: 32, offset: 4480)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !424)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !794, file: !362, line: 611, baseType: !428, size: 32, offset: 4512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !794, file: !362, line: 611, baseType: !428, size: 32, offset: 4544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !794, file: !362, line: 611, baseType: !428, size: 32, offset: 4576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !794, file: !362, line: 612, baseType: !428, size: 32, offset: 4608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !794, file: !362, line: 613, baseType: !428, size: 32, offset: 4640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !794, file: !362, line: 614, baseType: !474, size: 64, offset: 4672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !794, file: !362, line: 615, baseType: !476, size: 64, offset: 4736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !794, file: !362, line: 616, baseType: !747, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !794, file: !362, line: 617, baseType: !474, size: 64, offset: 4864)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !794, file: !362, line: 618, baseType: !809, size: 64, offset: 4928)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !362, line: 602, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 598, size: 128, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !811, file: !362, line: 599, baseType: !428, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !811, file: !362, line: 600, baseType: !428, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !811, file: !362, line: 601, baseType: !491, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !794, file: !362, line: 619, baseType: !817, size: 64, offset: 4992)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !362, line: 607, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 604, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !819, file: !362, line: 605, baseType: !428, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !819, file: !362, line: 606, baseType: !491, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !794, file: !362, line: 620, baseType: !491, size: 64, offset: 5056)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !794, file: !362, line: 621, baseType: !483, size: 64, offset: 5120)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !794, file: !362, line: 622, baseType: !483, size: 64, offset: 5184)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !794, file: !362, line: 623, baseType: !596, size: 64, offset: 5248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !794, file: !362, line: 623, baseType: !596, size: 64, offset: 5312)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !794, file: !362, line: 623, baseType: !596, size: 64, offset: 5376)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !794, file: !362, line: 624, baseType: !544, size: 32, offset: 5440)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !794, file: !362, line: 625, baseType: !831, size: 64, offset: 5504)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!380}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !794, file: !362, line: 626, baseType: !465, size: 64, offset: 5568)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !794, file: !362, line: 627, baseType: !596, size: 64, offset: 5632)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !794, file: !362, line: 628, baseType: !428, size: 32, offset: 5696)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !794, file: !362, line: 629, baseType: !405, size: 64, offset: 5760)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !794, file: !362, line: 630, baseType: !839, size: 32, offset: 5824)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !794, file: !362, line: 631, baseType: !428, size: 32, offset: 5856)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !794, file: !362, line: 631, baseType: !428, size: 32, offset: 5888)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !794, file: !362, line: 632, baseType: !544, size: 32, offset: 5920)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !794, file: !362, line: 633, baseType: !544, size: 32, offset: 5952)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !794, file: !362, line: 634, baseType: !416, size: 64, offset: 6016)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !794, file: !362, line: 634, baseType: !465, size: 64, offset: 6080)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !794, file: !362, line: 635, baseType: !436, size: 64, offset: 6144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !576, file: !362, line: 100, baseType: !848, size: 64, offset: 3520)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!380, !359, !428, !428, !851, !854}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !853)
!853 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !576, file: !362, line: 101, baseType: !694, size: 64, offset: 3584)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !576, file: !362, line: 102, baseType: !857, size: 64, offset: 3648)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!380, !359, !613, !613, !647}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !576, file: !362, line: 103, baseType: !579, size: 64, offset: 3712)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !576, file: !362, line: 105, baseType: !862, size: 64, offset: 3776)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!380, !359, !613, !613, !646, !647}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !576, file: !362, line: 106, baseType: !694, size: 64, offset: 3840)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !576, file: !362, line: 107, baseType: !867, size: 64, offset: 3904)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!380, !359, !392}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !576, file: !362, line: 108, baseType: !871, size: 64, offset: 3968)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!380, !359, !874, !646, !647}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !405)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !576, file: !362, line: 109, baseType: !831, size: 64, offset: 4032)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !576, file: !362, line: 111, baseType: !877, size: 64, offset: 4096)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!380, !359, !359, !359, !483, !359}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !576, file: !362, line: 112, baseType: !881, size: 64, offset: 4160)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!380, !359, !359, !359, !359}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !576, file: !362, line: 113, baseType: !885, size: 64, offset: 4224)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!380, !359, !888, !888}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !614, line: 30, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !614, line: 30, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !576, file: !362, line: 114, baseType: !579, size: 64, offset: 4288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !576, file: !362, line: 115, baseType: !698, size: 64, offset: 4352)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !576, file: !362, line: 117, baseType: !757, size: 64, offset: 4416)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !576, file: !362, line: 118, baseType: !757, size: 64, offset: 4480)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !576, file: !362, line: 119, baseType: !871, size: 64, offset: 4544)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !576, file: !362, line: 120, baseType: !897, size: 64, offset: 4608)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!380, !359, !900, !671}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !576, file: !362, line: 121, baseType: !831, size: 64, offset: 4672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !576, file: !362, line: 123, baseType: !903, size: 64, offset: 4736)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!380, !359, !428, !465}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !576, file: !362, line: 124, baseType: !907, size: 64, offset: 4800)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!380, !359, !792, !596, !465}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !576, file: !362, line: 125, baseType: !911, size: 64, offset: 4864)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!380, !520, !359}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !576, file: !362, line: 126, baseType: !593, size: 64, offset: 4928)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !576, file: !362, line: 127, baseType: !593, size: 64, offset: 4992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !576, file: !362, line: 129, baseType: !917, size: 64, offset: 5056)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!380, !359, !747}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !576, file: !362, line: 130, baseType: !921, size: 64, offset: 5120)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!380, !359, !924, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !926, file: !62, line: 653, baseType: !428, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !926, file: !62, line: 653, baseType: !596, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !576, file: !362, line: 131, baseType: !921, size: 64, offset: 5184)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !576, file: !362, line: 132, baseType: !932, size: 64, offset: 5248)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!380, !359, !474, !474, !474}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !576, file: !362, line: 133, baseType: !867, size: 64, offset: 5312)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !576, file: !362, line: 135, baseType: !937, size: 64, offset: 5376)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!380, !359, !483, !671}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !576, file: !362, line: 136, baseType: !937, size: 64, offset: 5440)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !576, file: !362, line: 137, baseType: !942, size: 64, offset: 5504)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!380, !359, !671}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !576, file: !362, line: 138, baseType: !579, size: 64, offset: 5568)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !576, file: !362, line: 139, baseType: !947, size: 64, offset: 5632)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!380, !359, !950, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !576, file: !362, line: 141, baseType: !831, size: 64, offset: 5696)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !576, file: !362, line: 142, baseType: !953, size: 64, offset: 5760)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!380, !359, !359, !483, !359}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !576, file: !362, line: 143, baseType: !957, size: 64, offset: 5824)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!380, !359, !359, !359}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !576, file: !362, line: 144, baseType: !831, size: 64, offset: 5888)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !576, file: !362, line: 145, baseType: !953, size: 64, offset: 5952)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !576, file: !362, line: 147, baseType: !957, size: 64, offset: 6016)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !576, file: !362, line: 148, baseType: !831, size: 64, offset: 6080)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !576, file: !362, line: 149, baseType: !953, size: 64, offset: 6144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !576, file: !362, line: 150, baseType: !957, size: 64, offset: 6208)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !576, file: !362, line: 151, baseType: !967, size: 64, offset: 6272)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!380, !359, !544}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !576, file: !362, line: 153, baseType: !694, size: 64, offset: 6336)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !576, file: !362, line: 154, baseType: !694, size: 64, offset: 6400)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !576, file: !362, line: 155, baseType: !694, size: 64, offset: 6464)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !576, file: !362, line: 156, baseType: !694, size: 64, offset: 6528)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !576, file: !362, line: 157, baseType: !867, size: 64, offset: 6592)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !576, file: !362, line: 159, baseType: !976, size: 64, offset: 6656)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!380, !359, !428, !584}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !576, file: !362, line: 160, baseType: !694, size: 64, offset: 6720)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !576, file: !362, line: 161, baseType: !694, size: 64, offset: 6784)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !576, file: !362, line: 162, baseType: !694, size: 64, offset: 6848)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !576, file: !362, line: 163, baseType: !694, size: 64, offset: 6912)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !576, file: !362, line: 165, baseType: !957, size: 64, offset: 6976)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !576, file: !362, line: 166, baseType: !957, size: 64, offset: 7040)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !576, file: !362, line: 167, baseType: !757, size: 64, offset: 7104)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !576, file: !362, line: 168, baseType: !987, size: 64, offset: 7168)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!380, !359, !596, !428}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !576, file: !362, line: 169, baseType: !991, size: 64, offset: 7232)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!380, !359, !671, !474}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !576, file: !362, line: 171, baseType: !718, size: 64, offset: 7296)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !576, file: !362, line: 172, baseType: !694, size: 64, offset: 7360)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !576, file: !362, line: 173, baseType: !997, size: 64, offset: 7424)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!380, !359, !474, !781}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !576, file: !362, line: 174, baseType: !857, size: 64, offset: 7488)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !576, file: !362, line: 175, baseType: !857, size: 64, offset: 7552)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !576, file: !362, line: 177, baseType: !593, size: 64, offset: 7616)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !576, file: !362, line: 178, baseType: !643, size: 64, offset: 7680)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !576, file: !362, line: 179, baseType: !593, size: 64, offset: 7744)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !576, file: !362, line: 180, baseType: !600, size: 64, offset: 7808)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !576, file: !362, line: 181, baseType: !1007, size: 64, offset: 7872)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!380, !359, !384, !646, !647}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !576, file: !362, line: 183, baseType: !917, size: 64, offset: 7936)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !576, file: !362, line: 184, baseType: !678, size: 64, offset: 8000)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !576, file: !362, line: 185, baseType: !1013, size: 64, offset: 8064)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!380, !359, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !576, file: !362, line: 186, baseType: !1018, size: 64, offset: 8128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!380, !359, !428, !582, !491}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !576, file: !362, line: 187, baseType: !737, size: 64, offset: 8192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !576, file: !362, line: 189, baseType: !1023, size: 64, offset: 8256)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!380, !359, !428, !428, !474, !584}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !576, file: !362, line: 190, baseType: !831, size: 64, offset: 8320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !576, file: !362, line: 191, baseType: !953, size: 64, offset: 8384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !576, file: !362, line: 192, baseType: !957, size: 64, offset: 8448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !576, file: !362, line: 193, baseType: !1030, size: 64, offset: 8512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!380, !359, !789, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !362, line: 660, size: 5312, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1035, file: !362, line: 661, baseType: !365, size: 4480)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1035, file: !362, line: 661, baseType: !798, size: 32, offset: 4480)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1035, file: !362, line: 662, baseType: !428, size: 32, offset: 4512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1035, file: !362, line: 662, baseType: !428, size: 32, offset: 4544)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1035, file: !362, line: 662, baseType: !428, size: 32, offset: 4576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1035, file: !362, line: 663, baseType: !428, size: 32, offset: 4608)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1035, file: !362, line: 664, baseType: !428, size: 32, offset: 4640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1035, file: !362, line: 665, baseType: !474, size: 64, offset: 4672)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1035, file: !362, line: 666, baseType: !474, size: 64, offset: 4736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1035, file: !362, line: 667, baseType: !428, size: 32, offset: 4800)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1035, file: !362, line: 668, baseType: !839, size: 32, offset: 4832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1035, file: !362, line: 670, baseType: !474, size: 64, offset: 4864)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1035, file: !362, line: 670, baseType: !474, size: 64, offset: 4928)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1035, file: !362, line: 671, baseType: !474, size: 64, offset: 4992)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1035, file: !362, line: 672, baseType: !474, size: 64, offset: 5056)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1035, file: !362, line: 673, baseType: !474, size: 64, offset: 5120)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1035, file: !362, line: 674, baseType: !428, size: 32, offset: 5184)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1035, file: !362, line: 675, baseType: !474, size: 64, offset: 5248)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !576, file: !362, line: 195, baseType: !1056, size: 64, offset: 8576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!380, !1033, !359, !359}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !576, file: !362, line: 196, baseType: !1056, size: 64, offset: 8640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !576, file: !362, line: 197, baseType: !831, size: 64, offset: 8704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !576, file: !362, line: 198, baseType: !953, size: 64, offset: 8768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !576, file: !362, line: 199, baseType: !957, size: 64, offset: 8832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !576, file: !362, line: 201, baseType: !1064, size: 64, offset: 8896)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!380, !359, !428, !428}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !576, file: !362, line: 202, baseType: !732, size: 64, offset: 8960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !576, file: !362, line: 203, baseType: !600, size: 64, offset: 9024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !576, file: !362, line: 204, baseType: !786, size: 64, offset: 9088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !576, file: !362, line: 205, baseType: !917, size: 64, offset: 9152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !576, file: !362, line: 206, baseType: !1072, size: 64, offset: 9216)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!380, !384, !359, !428, !646, !647}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !576, file: !362, line: 208, baseType: !1076, size: 64, offset: 9280)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!380, !428, !742}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !576, file: !362, line: 209, baseType: !957, size: 64, offset: 9344)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !576, file: !362, line: 210, baseType: !749, size: 64, offset: 9408)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !361, file: !362, line: 438, baseType: !1082, size: 64, offset: 13952)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !614, line: 60, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1084, file: !116, line: 241, baseType: !384, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !116, line: 242, baseType: !445, size: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1084, file: !116, line: 243, baseType: !428, size: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1084, file: !116, line: 243, baseType: !428, size: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1084, file: !116, line: 244, baseType: !428, size: 32, offset: 160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1084, file: !116, line: 244, baseType: !428, size: 32, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1084, file: !116, line: 245, baseType: !474, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1084, file: !116, line: 246, baseType: !544, size: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1084, file: !116, line: 247, baseType: !428, size: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1084, file: !116, line: 251, baseType: !428, size: 32, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1084, file: !116, line: 252, baseType: !888, size: 64, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1084, file: !116, line: 253, baseType: !544, size: 32, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1084, file: !116, line: 254, baseType: !428, size: 32, offset: 544)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1084, file: !116, line: 254, baseType: !428, size: 32, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1084, file: !116, line: 255, baseType: !428, size: 32, offset: 608)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !361, file: !362, line: 438, baseType: !1082, size: 64, offset: 14016)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !362, line: 439, baseType: !465, size: 64, offset: 14080)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !361, file: !362, line: 440, baseType: !1104, size: 32, offset: 14144)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !361, file: !362, line: 441, baseType: !544, size: 32, offset: 14176)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !361, file: !362, line: 442, baseType: !544, size: 32, offset: 14208)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !361, file: !362, line: 443, baseType: !1108, size: 448, offset: 14272)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 448, elements: !1110)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !405)
!1110 = !{!1111}
!1111 = !DISubrange(count: 7)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !361, file: !362, line: 444, baseType: !544, size: 32, offset: 14720)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !361, file: !362, line: 445, baseType: !544, size: 32, offset: 14752)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !361, file: !362, line: 446, baseType: !428, size: 32, offset: 14784)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !361, file: !362, line: 447, baseType: !467, size: 64, offset: 14848)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !361, file: !362, line: 448, baseType: !467, size: 64, offset: 14912)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !361, file: !362, line: 449, baseType: !654, size: 640, offset: 14976)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !361, file: !362, line: 450, baseType: !586, size: 32, offset: 15616)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !361, file: !362, line: 451, baseType: !1120, size: 2880, offset: 15680)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !362, line: 318, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !362, line: 319, size: 2880, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1142, !1143, !1148, !1153, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1168, !1169, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1201, !1202, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1227, !1231, !1232}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1121, file: !362, line: 320, baseType: !428, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1121, file: !362, line: 321, baseType: !428, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1121, file: !362, line: 322, baseType: !428, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1121, file: !362, line: 323, baseType: !428, size: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1121, file: !362, line: 324, baseType: !428, size: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1121, file: !362, line: 325, baseType: !428, size: 32, offset: 160)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1121, file: !362, line: 326, baseType: !1130, size: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !362, line: 293, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !362, line: 295, size: 448, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1132, file: !362, line: 296, baseType: !1130, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1132, file: !362, line: 297, baseType: !491, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1132, file: !362, line: 297, baseType: !491, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1132, file: !362, line: 298, baseType: !474, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1132, file: !362, line: 298, baseType: !474, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1132, file: !362, line: 299, baseType: !428, size: 32, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1132, file: !362, line: 300, baseType: !428, size: 32, offset: 352)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1132, file: !362, line: 301, baseType: !428, size: 32, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1121, file: !362, line: 326, baseType: !1130, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1121, file: !362, line: 328, baseType: !1144, size: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!380, !359, !1147, !474}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1121, file: !362, line: 329, baseType: !1149, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!380, !1147, !1152, !476, !476, !494, !474}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1121, file: !362, line: 330, baseType: !1154, size: 64, offset: 448)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!380, !1147}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1121, file: !362, line: 331, baseType: !1154, size: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1121, file: !362, line: 334, baseType: !384, size: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1121, file: !362, line: 335, baseType: !445, size: 32, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1121, file: !362, line: 335, baseType: !445, size: 32, offset: 672)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1121, file: !362, line: 336, baseType: !445, size: 32, offset: 704)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1121, file: !362, line: 336, baseType: !445, size: 32, offset: 736)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1121, file: !362, line: 337, baseType: !1164, size: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !385, line: 339, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !385, line: 339, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1121, file: !362, line: 338, baseType: !1164, size: 64, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1121, file: !362, line: 339, baseType: !1170, size: 64, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !385, line: 341, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !385, line: 351, size: 192, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1172, file: !385, line: 354, baseType: !74, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1172, file: !385, line: 355, baseType: !74, size: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1172, file: !385, line: 356, baseType: !74, size: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1172, file: !385, line: 361, baseType: !74, size: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1172, file: !385, line: 362, baseType: !540, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1121, file: !362, line: 340, baseType: !428, size: 32, offset: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1121, file: !362, line: 340, baseType: !428, size: 32, offset: 992)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1121, file: !362, line: 341, baseType: !491, size: 64, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1121, file: !362, line: 342, baseType: !474, size: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1121, file: !362, line: 343, baseType: !494, size: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1121, file: !362, line: 344, baseType: !476, size: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1121, file: !362, line: 345, baseType: !428, size: 32, offset: 1280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1121, file: !362, line: 346, baseType: !1152, size: 64, offset: 1344)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1121, file: !362, line: 347, baseType: !544, size: 32, offset: 1408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1121, file: !362, line: 348, baseType: !428, size: 32, offset: 1440)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1121, file: !362, line: 351, baseType: !544, size: 32, offset: 1472)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1121, file: !362, line: 352, baseType: !544, size: 32, offset: 1504)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1121, file: !362, line: 353, baseType: !445, size: 32, offset: 1536)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1121, file: !362, line: 354, baseType: !445, size: 32, offset: 1568)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1121, file: !362, line: 355, baseType: !1152, size: 64, offset: 1600)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1121, file: !362, line: 356, baseType: !1152, size: 64, offset: 1664)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1121, file: !362, line: 357, baseType: !1196, size: 64, offset: 1728)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !362, line: 310, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 308, size: 32, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1198, file: !362, line: 309, baseType: !428, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1121, file: !362, line: 357, baseType: !1196, size: 64, offset: 1792)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1121, file: !362, line: 358, baseType: !1203, size: 64, offset: 1856)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !362, line: 316, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 312, size: 128, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1205, file: !362, line: 313, baseType: !465, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1205, file: !362, line: 314, baseType: !428, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1205, file: !362, line: 315, baseType: !407, size: 8, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1121, file: !362, line: 359, baseType: !1203, size: 64, offset: 1920)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1121, file: !362, line: 360, baseType: !1203, size: 64, offset: 1984)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1121, file: !362, line: 361, baseType: !428, size: 32, offset: 2048)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1121, file: !362, line: 362, baseType: !445, size: 32, offset: 2080)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1121, file: !362, line: 363, baseType: !428, size: 32, offset: 2112)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1121, file: !362, line: 364, baseType: !1152, size: 64, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1121, file: !362, line: 365, baseType: !1170, size: 64, offset: 2240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1121, file: !362, line: 366, baseType: !445, size: 32, offset: 2304)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1121, file: !362, line: 367, baseType: !445, size: 32, offset: 2336)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1121, file: !362, line: 368, baseType: !1164, size: 64, offset: 2368)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1121, file: !362, line: 369, baseType: !1164, size: 64, offset: 2432)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1121, file: !362, line: 370, baseType: !1222, size: 64, offset: 2496)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1121, file: !362, line: 371, baseType: !1222, size: 64, offset: 2560)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1121, file: !362, line: 372, baseType: !1222, size: 64, offset: 2624)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1121, file: !362, line: 373, baseType: !1228, size: 64, offset: 2688)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !385, line: 331, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !385, line: 331, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1121, file: !362, line: 374, baseType: !540, size: 64, offset: 2752)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1121, file: !362, line: 375, baseType: !1233, size: 64, offset: 2816)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !361, file: !362, line: 451, baseType: !1120, size: 2880, offset: 18560)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !361, file: !362, line: 452, baseType: !1236, size: 64, offset: 21440)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1237)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !362, line: 681, size: 4864, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1238, file: !362, line: 682, baseType: !365, size: 4480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1238, file: !362, line: 682, baseType: !798, size: 32, offset: 4480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1238, file: !362, line: 683, baseType: !544, size: 32, offset: 4512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1238, file: !362, line: 684, baseType: !428, size: 32, offset: 4544)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1238, file: !362, line: 685, baseType: !950, size: 64, offset: 4608)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1238, file: !362, line: 686, baseType: !491, size: 64, offset: 4672)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1238, file: !362, line: 687, baseType: !1247, size: 64, offset: 4736)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!380, !1236, !596, !465}
