; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/interface/ftn-custom/ztsf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/interface/ftn-custom/ztsf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_TS = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 55, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 663, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 119, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!41 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!83 = !{!84, !85, !292, !294, !295, !135, !103, !297, !301, !308, !322, !325, !258, !304, !328, !124}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !27, line: 73, size: 4480, elements: !88)
!88 = !{!89, !92, !145, !146, !148, !151, !152, !153, !154, !162, !163, !165, !169, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !187, !188, !190, !191, !193, !195, !196, !197, !198, !199, !202, !204, !205, !206, !207, !208, !211, !213, !214, !215, !225, !227, !228, !232, !233, !282, !287, !289, !290, !291}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !87, file: !27, line: 74, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !91)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !87, file: !27, line: 75, baseType: !93, size: 448, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 448, elements: !143)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !27, line: 53, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 45, size: 448, elements: !96)
!96 = !{!97, !107, !115, !120, !127, !131, !138}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !95, file: !27, line: 46, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !85, !102}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !91)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !104, line: 330, baseType: !105)
!104 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !104, line: 330, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !95, file: !27, line: 47, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!101, !85, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !112, line: 16, baseType: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !112, line: 16, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !95, file: !27, line: 48, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!101, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !95, file: !27, line: 49, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!101, !85, !124, !85}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !95, file: !27, line: 50, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!101, !85, !124, !119}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !95, file: !27, line: 51, baseType: !132, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!101, !85, !124, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !95, file: !27, line: 52, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!101, !85, !124, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !87, file: !27, line: 76, baseType: !103, size: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !27, line: 77, baseType: !147, size: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !91)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !87, file: !27, line: 78, baseType: !149, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !150)
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !27, line: 78, baseType: !149, size: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !87, file: !27, line: 78, baseType: !149, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !87, file: !27, line: 78, baseType: !149, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !27, line: 79, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !158, line: 27, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !160, line: 43, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!161 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !87, file: !27, line: 80, baseType: !147, size: 32, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !27, line: 81, baseType: !164, size: 32, offset: 992)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !91)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !87, file: !27, line: 82, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !87, file: !27, line: 83, baseType: !170, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !27, line: 84, baseType: !174, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !87, file: !27, line: 85, baseType: !174, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !87, file: !27, line: 86, baseType: !174, size: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !87, file: !27, line: 87, baseType: !174, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !27, line: 88, baseType: !85, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !87, file: !27, line: 89, baseType: !155, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !27, line: 90, baseType: !174, size: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !27, line: 91, baseType: !174, size: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !87, file: !27, line: 92, baseType: !147, size: 32, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !87, file: !27, line: 93, baseType: !84, size: 64, offset: 1728)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !27, line: 94, baseType: !185, size: 64, offset: 1792)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !156)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !87, file: !27, line: 95, baseType: !147, size: 32, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !87, file: !27, line: 95, baseType: !147, size: 32, offset: 1888)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !87, file: !27, line: 96, baseType: !189, size: 64, offset: 1920)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !87, file: !27, line: 96, baseType: !189, size: 64, offset: 1984)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !87, file: !27, line: 97, baseType: !192, size: 64, offset: 2048)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !87, file: !27, line: 97, baseType: !194, size: 64, offset: 2112)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !87, file: !27, line: 98, baseType: !147, size: 32, offset: 2176)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !87, file: !27, line: 98, baseType: !147, size: 32, offset: 2208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !87, file: !27, line: 99, baseType: !189, size: 64, offset: 2240)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !87, file: !27, line: 99, baseType: !189, size: 64, offset: 2304)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !87, file: !27, line: 100, baseType: !200, size: 64, offset: 2368)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !150)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !87, file: !27, line: 100, baseType: !203, size: 64, offset: 2432)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !87, file: !27, line: 101, baseType: !147, size: 32, offset: 2496)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !87, file: !27, line: 101, baseType: !147, size: 32, offset: 2528)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !87, file: !27, line: 102, baseType: !189, size: 64, offset: 2560)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !87, file: !27, line: 102, baseType: !189, size: 64, offset: 2624)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !87, file: !27, line: 103, baseType: !209, size: 64, offset: 2688)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !201)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !87, file: !27, line: 103, baseType: !212, size: 64, offset: 2752)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !87, file: !27, line: 104, baseType: !142, size: 64, offset: 2816)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !87, file: !27, line: 105, baseType: !147, size: 32, offset: 2880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !87, file: !27, line: 106, baseType: !216, size: 128, offset: 2944)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 128, elements: !223)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !27, line: 64, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 61, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !219, file: !27, line: 62, baseType: !135, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !219, file: !27, line: 63, baseType: !84, size: 64, offset: 64)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !87, file: !27, line: 107, baseType: !226, size: 64, offset: 3072)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !223)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !87, file: !27, line: 108, baseType: !84, size: 64, offset: 3136)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !87, file: !27, line: 109, baseType: !229, size: 64, offset: 3200)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!101, !84}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !87, file: !27, line: 111, baseType: !147, size: 32, offset: 3264)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !87, file: !27, line: 112, baseType: !234, size: 320, offset: 3328)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 320, elements: !280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!101, !238, !85, !84}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !241)
!241 = !{!242, !243, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !240, file: !12, line: 100, baseType: !147, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !12, line: 101, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !255, !256, !257, !261, !263, !265, !266, !267}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !246, file: !12, line: 84, baseType: !174, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !246, file: !12, line: 85, baseType: !174, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !12, line: 86, baseType: !84, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !246, file: !12, line: 87, baseType: !166, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !246, file: !12, line: 88, baseType: !253, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !246, file: !12, line: 89, baseType: !126, size: 8, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !246, file: !12, line: 90, baseType: !174, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !246, file: !12, line: 91, baseType: !258, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !259, line: 46, baseType: !260)
!259 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!260 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !12, line: 92, baseType: !262, size: 32, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !12, line: 93, baseType: !264, size: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !12, line: 94, baseType: !244, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !246, file: !12, line: 95, baseType: !174, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !246, file: !12, line: 96, baseType: !84, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !240, file: !12, line: 102, baseType: !174, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !240, file: !12, line: 102, baseType: !174, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !240, file: !12, line: 103, baseType: !174, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !240, file: !12, line: 104, baseType: !103, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !240, file: !12, line: 106, baseType: !85, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !240, file: !12, line: 107, baseType: !277, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!280 = !{!281}
!281 = !DISubrange(count: 5)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !87, file: !27, line: 113, baseType: !283, size: 320, offset: 3648)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 320, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!101, !85, !84}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !87, file: !27, line: 114, baseType: !288, size: 320, offset: 3968)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 320, elements: !280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !87, file: !27, line: 115, baseType: !262, size: 32, offset: 4288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !27, line: 120, baseType: !277, size: 64, offset: 4352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !87, file: !27, line: 121, baseType: !262, size: 32, offset: 4416)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !293, line: 1451, baseType: !135)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !296, line: 100, baseType: !260)
!296 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !298, line: 21, baseType: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !298, line: 21, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!101, !304, !147, !201, !297, !84}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !305, line: 17, baseType: !306)
!305 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscts.h", directory: "/home/users/ndemeye/xSDK")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !305, line: 17, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !39, line: 178, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 178, size: 256, elements: !312)
!312 = !{!313, !314, !316, !321}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !311, file: !39, line: 178, baseType: !111, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !311, file: !39, line: 178, baseType: !315, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !39, line: 162, baseType: !38)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !311, file: !39, line: 178, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !318, line: 43, baseType: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !318, line: 43, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !39, line: 178, baseType: !84, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!101, !294}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !327, line: 135, baseType: !295)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!329 = !{!0}
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/interface/ftn-custom/ztsf.c", directory: "/home/users/ndemeye/xSDK")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 54, size: 288, elements: !332)
!332 = !{!333, !335, !336, !337, !338, !339, !340, !341, !342}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !331, file: !330, line: 55, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !27, line: 56, baseType: !91)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !331, file: !330, line: 56, baseType: !334, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfunction", scope: !331, file: !330, line: 57, baseType: !334, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !331, file: !330, line: 58, baseType: !334, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ifunction", scope: !331, file: !330, line: 59, baseType: !334, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !331, file: !330, line: 60, baseType: !334, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !331, file: !330, line: 61, baseType: !334, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mondestroy", scope: !331, file: !330, line: 62, baseType: !334, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !331, file: !330, line: 63, baseType: !334, size: 32, offset: 256)
!343 = !{i32 7, !"Dwarf Version", i32 4}
!344 = !{i32 2, !"Debug Info Version", i32 3}
!345 = !{i32 1, !"wchar_size", i32 4}
!346 = !{i32 7, !"PIC Level", i32 2}
!347 = !{i32 7, !"uwtable", i32 1}
!348 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!349 = distinct !DISubprogram(name: "tsmonitorlgsettransform_", scope: !330, file: !330, line: 140, type: !350, scopeLine: 141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !361)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !352, !353, !358, !84, !357}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !84, !356, !356, !357}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!101, !84, !357}
!361 = !{!362, !363, !364, !365, !366}
!362 = !DILocalVariable(name: "ts", arg: 1, scope: !349, file: !330, line: 140, type: !352)
!363 = !DILocalVariable(name: "f", arg: 2, scope: !349, file: !330, line: 140, type: !353)
!364 = !DILocalVariable(name: "d", arg: 3, scope: !349, file: !330, line: 140, type: !358)
!365 = !DILocalVariable(name: "ctx", arg: 4, scope: !349, file: !330, line: 140, type: !84)
!366 = !DILocalVariable(name: "ierr", arg: 5, scope: !349, file: !330, line: 140, type: !357)
!367 = !DILocation(line: 0, scope: !349)
!368 = !DILocation(line: 142, column: 35, scope: !349)
!369 = !{!370, !370, i64 0}
!370 = !{!"any pointer", !371, i64 0}
!371 = !{!"omnipotent char", !372, i64 0}
!372 = !{!"Simple C/C++ TBAA"}
!373 = !DILocation(line: 142, column: 11, scope: !349)
!374 = !DILocation(line: 142, column: 9, scope: !349)
!375 = !{!376, !376, i64 0}
!376 = !{!"int", !371, i64 0}
!377 = !DILocation(line: 142, column: 68, scope: !378)
!378 = distinct !DILexicalBlock(scope: !349, file: !330, line: 142, column: 68)
!379 = !DILocation(line: 142, column: 68, scope: !349)
!380 = !DILocation(line: 143, column: 54, scope: !349)
!381 = !DILocation(line: 143, column: 102, scope: !349)
!382 = !DILocation(line: 143, column: 11, scope: !349)
!383 = !DILocation(line: 143, column: 9, scope: !349)
!384 = !DILocation(line: 144, column: 1, scope: !349)
!385 = !DISubprogram(name: "TSMonitorLGSetTransform", scope: !305, file: !305, line: 619, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !395)
!386 = !DISubroutineType(types: !387)
!387 = !{!91, !306, !388, !392, !84}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!91, !84, !299, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!91, !84}
!395 = !{}
!396 = distinct !DISubprogram(name: "ourtransform", scope: !330, file: !330, line: 135, type: !397, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!101, !84, !297, !356}
!399 = !{!400, !401, !402, !403, !405, !406, !407, !409}
!400 = !DILocalVariable(name: "ctx", arg: 1, scope: !396, file: !330, line: 135, type: !84)
!401 = !DILocalVariable(name: "x", arg: 2, scope: !396, file: !330, line: 135, type: !297)
!402 = !DILocalVariable(name: "xout", arg: 3, scope: !396, file: !330, line: 135, type: !356)
