; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/interface/sfregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/interface/sfregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!162 = distinct !DILexicalBlock(scope: !94, file: !75, line: 35, column: 62)
!163 = !DILocation(line: 35, column: 62, scope: !94)
!164 = !{!"branch_weights", i32 2000, i32 1}
!165 = !DILocation(line: 37, column: 10, scope: !86)
!166 = !DILocation(line: 0, scope: !96)
!167 = !DILocation(line: 37, column: 63, scope: !168)
!168 = distinct !DILexicalBlock(scope: !96, file: !75, line: 37, column: 63)
!169 = !DILocation(line: 37, column: 63, scope: !96)
!170 = !DILocation(line: 39, column: 10, scope: !86)
!171 = !DILocation(line: 0, scope: !98)
!172 = !DILocation(line: 39, column: 70, scope: !173)
!173 = distinct !DILexicalBlock(scope: !98, file: !75, line: 39, column: 70)
!174 = !DILocation(line: 39, column: 70, scope: !98)
!175 = !DILocation(line: 40, column: 10, scope: !86)
!176 = !DILocation(line: 0, scope: !100)
!177 = !DILocation(line: 40, column: 69, scope: !178)
!178 = distinct !DILexicalBlock(scope: !100, file: !75, line: 40, column: 69)
!179 = !DILocation(line: 40, column: 69, scope: !100)
!180 = !DILocation(line: 41, column: 10, scope: !86)
!181 = !DILocation(line: 0, scope: !102)
!182 = !DILocation(line: 41, column: 67, scope: !183)
!183 = distinct !DILexicalBlock(scope: !102, file: !75, line: 41, column: 67)
!184 = !DILocation(line: 41, column: 67, scope: !102)
!185 = !DILocation(line: 42, column: 10, scope: !86)
!186 = !DILocation(line: 0, scope: !104)
!187 = !DILocation(line: 42, column: 66, scope: !188)
!188 = distinct !DILexicalBlock(scope: !104, file: !75, line: 42, column: 66)
!189 = !DILocation(line: 42, column: 66, scope: !104)
!190 = !DILocation(line: 43, column: 10, scope: !86)
!191 = !DILocation(line: 0, scope: !106)
!192 = !DILocation(line: 43, column: 68, scope: !193)
!193 = distinct !DILexicalBlock(scope: !106, file: !75, line: 43, column: 68)
!194 = !DILocation(line: 43, column: 68, scope: !106)
!195 = !DILocation(line: 45, column: 10, scope: !86)
!196 = !DILocation(line: 0, scope: !108)
!197 = !DILocation(line: 45, column: 68, scope: !198)
!198 = distinct !DILexicalBlock(scope: !108, file: !75, line: 45, column: 68)
!199 = !DILocation(line: 45, column: 68, scope: !108)
!200 = !DILocation(line: 47, column: 3, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !75, line: 47, column: 3)
!202 = distinct !DILexicalBlock(scope: !203, file: !75, line: 47, column: 3)
!203 = distinct !DILexicalBlock(scope: !86, file: !75, line: 47, column: 3)
!204 = !DILocation(line: 47, column: 3, scope: !202)
!205 = !DILocation(line: 47, column: 3, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !75, line: 47, column: 3)
!207 = distinct !DILexicalBlock(scope: !201, file: !75, line: 47, column: 3)
!208 = !DILocation(line: 47, column: 3, scope: !207)
!209 = !DILocation(line: 47, column: 3, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !75, line: 47, column: 3)
!211 = distinct !DILexicalBlock(scope: !206, file: !75, line: 47, column: 3)
!212 = !DILocation(line: 47, column: 3, scope: !211)
!213 = !DILocation(line: 47, column: 3, scope: !214)
!214 = distinct !DILexicalBlock(scope: !210, file: !75, line: 47, column: 3)
!215 = !DILocation(line: 47, column: 3, scope: !216)
!216 = distinct !DILexicalBlock(scope: !206, file: !75, line: 47, column: 3)
!217 = !DILocation(line: 47, column: 3, scope: !218)
!218 = distinct !DILexicalBlock(scope: !216, file: !75, line: 47, column: 3)
!219 = !DILocation(line: 47, column: 3, scope: !220)
!220 = distinct !DILexicalBlock(scope: !221, file: !75, line: 47, column: 3)
!221 = distinct !DILexicalBlock(scope: !218, file: !75, line: 47, column: 3)
!222 = !DILocation(line: 47, column: 3, scope: !221)
!223 = !DILocation(line: 47, column: 3, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !75, line: 47, column: 3)
!225 = !DILocation(line: 48, column: 1, scope: !86)
!226 = distinct !DISubprogram(name: "PetscSFRegister", scope: !75, file: !75, line: 76, type: !227, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !619)
!227 = !DISubroutineType(types: !228)
!228 = !{!89, !59, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!89, !232}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !233, line: 15, baseType: !234)
!233 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !46, line: 66, size: 8640, elements: !236)
!236 = !{!237, !431, !527, !542, !543, !544, !545, !546, !547, !548, !550, !551, !552, !553, !555, !556, !557, !559, !560, !562, !563, !568, !569, !570, !571, !572, !573, !574, !575, !576, !580, !581, !582, !583, !584, !586, !587, !612, !613, !614, !615, !616, !618}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !235, file: !46, line: 67, baseType: !238, size: 4480)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !239, line: 122, baseType: !240)
!239 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !239, line: 73, size: 4480, elements: !241)
!241 = !{!242, !244, !288, !289, !291, !294, !295, !296, !297, !305, !306, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !326, !327, !328, !330, !331, !333, !335, !336, !337, !338, !339, !342, !344, !345, !346, !347, !348, !351, !353, !354, !355, !365, !367, !368, !372, !373, !421, !426, !428, !429, !430}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !240, file: !239, line: 74, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !90)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !240, file: !239, line: 75, baseType: !245, size: 448, offset: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 448, elements: !286)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !239, line: 53, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 45, size: 448, elements: !248)
!248 = !{!249, !256, !264, !269, !273, !277, !281}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !247, file: !239, line: 46, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!89, !253, !255}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !247, file: !239, line: 47, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!89, !253, !260}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !261, line: 16, baseType: !262)
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !261, line: 16, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !247, file: !239, line: 48, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!89, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !247, file: !239, line: 49, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!89, !253, !59, !253}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !247, file: !239, line: 50, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!89, !253, !59, !268}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !247, file: !239, line: 51, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!89, !253, !59, !69}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !247, file: !239, line: 52, baseType: !282, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!89, !253, !59, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!286 = !{!287}
!287 = !DISubrange(count: 1)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !240, file: !239, line: 76, baseType: !62, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !239, line: 77, baseType: !290, size: 32, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !90)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !240, file: !239, line: 78, baseType: !292, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !293)
!293 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !240, file: !239, line: 78, baseType: !292, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !240, file: !239, line: 78, baseType: !292, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !240, file: !239, line: 78, baseType: !292, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !240, file: !239, line: 79, baseType: !298, size: 64, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !301, line: 27, baseType: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !303, line: 43, baseType: !304)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!304 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !240, file: !239, line: 80, baseType: !290, size: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !240, file: !239, line: 81, baseType: !307, size: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !90)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !240, file: !239, line: 82, baseType: !76, size: 64, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !240, file: !239, line: 83, baseType: !310, size: 64, offset: 1088)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !240, file: !239, line: 84, baseType: !314, size: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !240, file: !239, line: 85, baseType: !314, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !240, file: !239, line: 86, baseType: !314, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !240, file: !239, line: 87, baseType: !314, size: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !240, file: !239, line: 88, baseType: !253, size: 64, offset: 1408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !240, file: !239, line: 89, baseType: !298, size: 64, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !239, line: 90, baseType: !314, size: 64, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !240, file: !239, line: 91, baseType: !314, size: 64, offset: 1600)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !240, file: !239, line: 92, baseType: !290, size: 32, offset: 1664)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !240, file: !239, line: 93, baseType: !66, size: 64, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !239, line: 94, baseType: !325, size: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !299)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !240, file: !239, line: 95, baseType: !290, size: 32, offset: 1856)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !240, file: !239, line: 95, baseType: !290, size: 32, offset: 1888)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !240, file: !239, line: 96, baseType: !329, size: 64, offset: 1920)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !240, file: !239, line: 96, baseType: !329, size: 64, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !240, file: !239, line: 97, baseType: !332, size: 64, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !240, file: !239, line: 97, baseType: !334, size: 64, offset: 2112)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !240, file: !239, line: 98, baseType: !290, size: 32, offset: 2176)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !240, file: !239, line: 98, baseType: !290, size: 32, offset: 2208)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !240, file: !239, line: 99, baseType: !329, size: 64, offset: 2240)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !240, file: !239, line: 99, baseType: !329, size: 64, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !240, file: !239, line: 100, baseType: !340, size: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !293)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !240, file: !239, line: 100, baseType: !343, size: 64, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !240, file: !239, line: 101, baseType: !290, size: 32, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !240, file: !239, line: 101, baseType: !290, size: 32, offset: 2528)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !240, file: !239, line: 102, baseType: !329, size: 64, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !240, file: !239, line: 102, baseType: !329, size: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !240, file: !239, line: 103, baseType: !349, size: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !341)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !240, file: !239, line: 103, baseType: !352, size: 64, offset: 2752)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !240, file: !239, line: 104, baseType: !285, size: 64, offset: 2816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !240, file: !239, line: 105, baseType: !290, size: 32, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !240, file: !239, line: 106, baseType: !356, size: 128, offset: 2944)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 128, elements: !363)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !239, line: 64, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 61, size: 128, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !359, file: !239, line: 62, baseType: !69, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !359, file: !239, line: 63, baseType: !66, size: 64, offset: 64)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !240, file: !239, line: 107, baseType: !366, size: 64, offset: 3072)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 64, elements: !363)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !240, file: !239, line: 108, baseType: !66, size: 64, offset: 3136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !240, file: !239, line: 109, baseType: !369, size: 64, offset: 3200)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!89, !66}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !240, file: !239, line: 111, baseType: !290, size: 32, offset: 3264)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !240, file: !239, line: 112, baseType: !374, size: 320, offset: 3328)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 320, elements: !419)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!89, !378, !253, !66}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !381)
!381 = !{!382, !383, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !380, file: !12, line: 100, baseType: !290, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !12, line: 101, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !395, !396, !397, !401, !402, !404, !405, !406}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !386, file: !12, line: 84, baseType: !314, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !386, file: !12, line: 85, baseType: !314, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !12, line: 86, baseType: !66, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !386, file: !12, line: 87, baseType: !76, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !386, file: !12, line: 88, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !386, file: !12, line: 89, baseType: !61, size: 8, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !386, file: !12, line: 90, baseType: !314, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !386, file: !12, line: 91, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !399, line: 46, baseType: !400)
!399 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!400 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !386, file: !12, line: 92, baseType: !79, size: 32, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !386, file: !12, line: 93, baseType: !403, size: 32, offset: 544)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !386, file: !12, line: 94, baseType: !384, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !386, file: !12, line: 95, baseType: !314, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !386, file: !12, line: 96, baseType: !66, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !380, file: !12, line: 102, baseType: !314, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !380, file: !12, line: 102, baseType: !314, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !380, file: !12, line: 103, baseType: !314, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !380, file: !12, line: 104, baseType: !62, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !380, file: !12, line: 105, baseType: !79, size: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !380, file: !12, line: 105, baseType: !79, size: 32, offset: 416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !380, file: !12, line: 105, baseType: !79, size: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !380, file: !12, line: 106, baseType: !253, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !380, file: !12, line: 107, baseType: !416, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!419 = !{!420}
!420 = !DISubrange(count: 5)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !240, file: !239, line: 113, baseType: !422, size: 320, offset: 3648)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 320, elements: !419)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!89, !253, !66}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !240, file: !239, line: 114, baseType: !427, size: 320, offset: 3968)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 320, elements: !419)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !240, file: !239, line: 115, baseType: !79, size: 32, offset: 4288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !240, file: !239, line: 120, baseType: !416, size: 64, offset: 4352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !240, file: !239, line: 121, baseType: !79, size: 32, offset: 4416)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !235, file: !46, line: 67, baseType: !432, size: 1344, offset: 4480)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 1344, elements: !286)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !46, line: 39, size: 1344, elements: !434)
!434 = !{!435, !436, !437, !438, !442, !446, !451, !464, !468, !469, !470, !474, !478, !482, !492, !496, !501, !513, !517, !518, !523}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !433, file: !46, line: 40, baseType: !229, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !433, file: !46, line: 41, baseType: !229, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !433, file: !46, line: 42, baseType: !229, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !433, file: !46, line: 43, baseType: !439, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!89, !378, !232}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !433, file: !46, line: 44, baseType: !443, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!89, !232, !260}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !433, file: !46, line: 45, baseType: !447, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!89, !232, !450, !232}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !27, line: 77, baseType: !26)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !433, file: !46, line: 46, baseType: !452, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!89, !232, !455, !458, !459, !458, !66, !461}
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !63, line: 331, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !63, line: 331, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !63, line: 338, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !63, line: 338, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !433, file: !46, line: 47, baseType: !465, size: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!89, !232, !455, !459, !66, !461}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !433, file: !46, line: 48, baseType: !452, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !433, file: !46, line: 49, baseType: !465, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !433, file: !46, line: 50, baseType: !471, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!89, !232, !455, !458, !66, !458, !459, !66, !461}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !433, file: !46, line: 51, baseType: !475, size: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!89, !232, !455, !66, !459, !66, !461}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !433, file: !46, line: 52, baseType: !479, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!89, !232, !455, !458, !459, !458, !66}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !433, file: !46, line: 53, baseType: !483, size: 64, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!89, !232, !332, !486, !489, !489, !489}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !433, file: !46, line: 54, baseType: !493, size: 64, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!89, !232, !332, !486, !489, !489}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !433, file: !46, line: 55, baseType: !497, size: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!89, !232, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !433, file: !46, line: 56, baseType: !502, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!89, !232, !332, !332, !489, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !233, line: 49, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 46, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !509, file: !233, line: 47, baseType: !290, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !509, file: !233, line: 48, baseType: !290, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !433, file: !46, line: 57, baseType: !514, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!89, !232, !290, !490, !500}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !433, file: !46, line: 58, baseType: !514, size: 64, offset: 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !433, file: !46, line: 60, baseType: !519, size: 64, offset: 1216)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!89, !458, !398, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !433, file: !46, line: 61, baseType: !524, size: 64, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!89, !458, !66}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !235, file: !46, line: 78, baseType: !528, size: 512, offset: 5824)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !46, line: 68, size: 512, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !537, !538, !539, !540, !541}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !528, file: !46, line: 69, baseType: !290, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !528, file: !46, line: 69, baseType: !290, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !528, file: !46, line: 70, baseType: !79, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !528, file: !46, line: 71, baseType: !79, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !528, file: !46, line: 72, baseType: !535, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !528, file: !46, line: 73, baseType: !349, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !528, file: !46, line: 74, baseType: !232, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !528, file: !46, line: 75, baseType: !290, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !528, file: !46, line: 76, baseType: !455, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !528, file: !46, line: 77, baseType: !79, size: 32, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !235, file: !46, line: 81, baseType: !290, size: 32, offset: 6336)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !235, file: !46, line: 82, baseType: !290, size: 32, offset: 6368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !235, file: !46, line: 83, baseType: !332, size: 64, offset: 6400)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !235, file: !46, line: 84, baseType: !332, size: 64, offset: 6464)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !235, file: !46, line: 85, baseType: !290, size: 32, offset: 6528)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !235, file: !46, line: 85, baseType: !290, size: 32, offset: 6560)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !235, file: !46, line: 86, baseType: !549, size: 64, offset: 6592)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !235, file: !46, line: 87, baseType: !549, size: 64, offset: 6656)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !235, file: !46, line: 88, baseType: !290, size: 32, offset: 6720)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !235, file: !46, line: 89, baseType: !290, size: 32, offset: 6752)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !235, file: !46, line: 90, baseType: !554, size: 64, offset: 6784)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !235, file: !46, line: 91, baseType: !332, size: 64, offset: 6848)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !235, file: !46, line: 92, baseType: !332, size: 64, offset: 6912)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !235, file: !46, line: 93, baseType: !558, size: 128, offset: 6976)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 128, elements: !363)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !235, file: !46, line: 96, baseType: !366, size: 64, offset: 7104)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !235, file: !46, line: 97, baseType: !561, size: 64, offset: 7168)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !363)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !235, file: !46, line: 98, baseType: !366, size: 64, offset: 7232)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !235, file: !46, line: 99, baseType: !564, size: 128, offset: 7296)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !363)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !46, line: 64, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !46, line: 64, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !235, file: !46, line: 100, baseType: !564, size: 128, offset: 7424)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !235, file: !46, line: 101, baseType: !561, size: 64, offset: 7552)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !235, file: !46, line: 103, baseType: !290, size: 32, offset: 7616)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !235, file: !46, line: 104, baseType: !332, size: 64, offset: 7680)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !235, file: !46, line: 105, baseType: !79, size: 32, offset: 7744)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !235, file: !46, line: 106, baseType: !332, size: 64, offset: 7808)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !235, file: !46, line: 107, baseType: !332, size: 64, offset: 7872)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !235, file: !46, line: 108, baseType: !79, size: 32, offset: 7936)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !235, file: !46, line: 109, baseType: !577, size: 64, offset: 8000)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !63, line: 336, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !63, line: 336, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !235, file: !46, line: 110, baseType: !577, size: 64, offset: 8064)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !235, file: !46, line: 111, baseType: !232, size: 64, offset: 8128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !235, file: !46, line: 112, baseType: !79, size: 32, offset: 8192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !235, file: !46, line: 113, baseType: !79, size: 32, offset: 8224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !235, file: !46, line: 114, baseType: !585, size: 32, offset: 8256)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !27, line: 35, baseType: !39)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !235, file: !46, line: 115, baseType: !79, size: 32, offset: 8288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !235, file: !46, line: 116, baseType: !588, size: 64, offset: 8320)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !589, line: 60, baseType: !590)
!589 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !592, line: 240, size: 640, elements: !593)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !608, !609, !610, !611}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !591, file: !592, line: 241, baseType: !62, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !591, file: !592, line: 242, baseType: !307, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !591, file: !592, line: 243, baseType: !290, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !591, file: !592, line: 243, baseType: !290, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !591, file: !592, line: 244, baseType: !290, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !591, file: !592, line: 244, baseType: !290, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !591, file: !592, line: 245, baseType: !332, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !591, file: !592, line: 246, baseType: !79, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !591, file: !592, line: 247, baseType: !290, size: 32, offset: 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !591, file: !592, line: 251, baseType: !290, size: 32, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !591, file: !592, line: 252, baseType: !605, size: 64, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !589, line: 30, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !589, line: 30, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !591, file: !592, line: 253, baseType: !79, size: 32, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !591, file: !592, line: 254, baseType: !290, size: 32, offset: 544)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !591, file: !592, line: 254, baseType: !290, size: 32, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !591, file: !592, line: 255, baseType: !290, size: 32, offset: 608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !235, file: !46, line: 117, baseType: !79, size: 32, offset: 8384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !235, file: !46, line: 118, baseType: !79, size: 32, offset: 8416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !235, file: !46, line: 119, baseType: !79, size: 32, offset: 8448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !235, file: !46, line: 120, baseType: !290, size: 32, offset: 8480)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !235, file: !46, line: 121, baseType: !617, size: 32, offset: 8512)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !46, line: 37, baseType: !45)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !46, line: 122, baseType: !66, size: 64, offset: 8576)
!619 = !{!620, !621, !622, !623, !625}
!620 = !DILocalVariable(name: "name", arg: 1, scope: !226, file: !75, line: 76, type: !59)
!621 = !DILocalVariable(name: "create", arg: 2, scope: !226, file: !75, line: 76, type: !229)
!622 = !DILocalVariable(name: "ierr", scope: !226, file: !75, line: 78, type: !89)
!623 = !DILocalVariable(name: "ierr__", scope: !624, file: !75, line: 81, type: !89)
!624 = distinct !DILexicalBlock(scope: !226, file: !75, line: 81, column: 37)
!625 = !DILocalVariable(name: "ierr__", scope: !626, file: !75, line: 82, type: !89)
!626 = distinct !DILexicalBlock(scope: !226, file: !75, line: 82, column: 57)
!627 = !DILocation(line: 0, scope: !226)
!628 = !DILocation(line: 80, column: 3, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !75, line: 80, column: 3)
!630 = distinct !DILexicalBlock(scope: !631, file: !75, line: 80, column: 3)
!631 = distinct !DILexicalBlock(scope: !226, file: !75, line: 80, column: 3)
!632 = !DILocation(line: 80, column: 3, scope: !630)
!633 = !DILocation(line: 80, column: 3, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !75, line: 80, column: 3)
!635 = distinct !DILexicalBlock(scope: !629, file: !75, line: 80, column: 3)
!636 = !DILocation(line: 80, column: 3, scope: !635)
!637 = !DILocation(line: 80, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !634, file: !75, line: 80, column: 3)
!639 = !DILocation(line: 81, column: 10, scope: !226)
!640 = !DILocation(line: 0, scope: !624)
!641 = !DILocation(line: 81, column: 37, scope: !642)
!642 = distinct !DILexicalBlock(scope: !624, file: !75, line: 81, column: 37)
!643 = !DILocation(line: 81, column: 37, scope: !624)
!644 = !DILocation(line: 82, column: 10, scope: !226)
!645 = !DILocation(line: 0, scope: !626)
!646 = !DILocation(line: 82, column: 57, scope: !647)
!647 = distinct !DILexicalBlock(scope: !626, file: !75, line: 82, column: 57)
!648 = !DILocation(line: 82, column: 57, scope: !626)
!649 = !DILocation(line: 83, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !75, line: 83, column: 3)
!651 = distinct !DILexicalBlock(scope: !652, file: !75, line: 83, column: 3)
!652 = distinct !DILexicalBlock(scope: !226, file: !75, line: 83, column: 3)
!653 = !DILocation(line: 83, column: 3, scope: !651)
!654 = !DILocation(line: 83, column: 3, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !75, line: 83, column: 3)
!656 = distinct !DILexicalBlock(scope: !650, file: !75, line: 83, column: 3)
!657 = !DILocation(line: 83, column: 3, scope: !656)
!658 = !DILocation(line: 83, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !75, line: 83, column: 3)
!660 = distinct !DILexicalBlock(scope: !655, file: !75, line: 83, column: 3)
!661 = !DILocation(line: 83, column: 3, scope: !660)
!662 = !DILocation(line: 83, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !75, line: 83, column: 3)
!664 = !DILocation(line: 83, column: 3, scope: !665)
!665 = distinct !DILexicalBlock(scope: !655, file: !75, line: 83, column: 3)
!666 = !DILocation(line: 83, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !665, file: !75, line: 83, column: 3)
!668 = !DILocation(line: 83, column: 3, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !75, line: 83, column: 3)
!670 = distinct !DILexicalBlock(scope: !667, file: !75, line: 83, column: 3)
!671 = !DILocation(line: 83, column: 3, scope: !670)
!672 = !DILocation(line: 83, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !669, file: !75, line: 83, column: 3)
!674 = !DILocation(line: 84, column: 1, scope: !226)
!675 = !DISubprogram(name: "PetscError", scope: !53, file: !53, line: 668, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !678)
!676 = !DISubroutineType(types: !677)
