; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/composite/composite.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/composite/composite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 180, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DIEnumerator(name: "PC_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "PC_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PC_COMPOSITE_SYMMETRIC_MULTIPLICATIVE", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "PC_COMPOSITE_SPECIAL", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "PC_COMPOSITE_SCHUR", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "PC_COMPOSITE_GKB", value: 5, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !89)
!89 = !{!90}
!90 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!91 = !{!92, !96, !97, !172, !300, !303, !182, !26, !306, !132, !209, !266, !307, !5, !309, !437, !438}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !93, line: 330, baseType: !94)
!93 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !93, line: 330, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !100, line: 73, size: 4480, elements: !101)
!100 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!101 = !{!102, !104, !153, !154, !156, !159, !160, !161, !162, !170, !171, !173, !177, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !194, !195, !196, !198, !199, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !215, !216, !219, !221, !222, !223, !233, !235, !236, !240, !241, !290, !295, !297, !298, !299}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !99, file: !100, line: 74, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !99, file: !100, line: 75, baseType: !105, size: 448, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 448, elements: !151)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !100, line: 53, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 45, size: 448, elements: !108)
!108 = !{!109, !115, !123, !128, !135, !139, !146}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !107, file: !100, line: 46, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !97, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !107, file: !100, line: 47, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!113, !97, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !120, line: 16, baseType: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !120, line: 16, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !107, file: !100, line: 48, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!113, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !107, file: !100, line: 49, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!113, !97, !132, !97}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !107, file: !100, line: 50, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!113, !97, !132, !127}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !107, file: !100, line: 51, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!113, !97, !132, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !107, file: !100, line: 52, baseType: !147, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!113, !97, !132, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !99, file: !100, line: 76, baseType: !92, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !100, line: 77, baseType: !155, size: 32, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !99, file: !100, line: 78, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !158)
!158 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !99, file: !100, line: 78, baseType: !157, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !99, file: !100, line: 78, baseType: !157, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !99, file: !100, line: 78, baseType: !157, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !100, line: 79, baseType: !163, size: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !166, line: 27, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !168, line: 43, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!169 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !99, file: !100, line: 80, baseType: !155, size: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !100, line: 81, baseType: !172, size: 32, offset: 992)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !99, file: !100, line: 82, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !99, file: !100, line: 83, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !99, file: !100, line: 84, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !99, file: !100, line: 85, baseType: !182, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !99, file: !100, line: 86, baseType: !182, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !99, file: !100, line: 87, baseType: !182, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !100, line: 88, baseType: !97, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !99, file: !100, line: 89, baseType: !163, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !100, line: 90, baseType: !182, size: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !99, file: !100, line: 91, baseType: !182, size: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !99, file: !100, line: 92, baseType: !155, size: 32, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !99, file: !100, line: 93, baseType: !96, size: 64, offset: 1728)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !100, line: 94, baseType: !193, size: 64, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !164)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !99, file: !100, line: 95, baseType: !155, size: 32, offset: 1856)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !99, file: !100, line: 95, baseType: !155, size: 32, offset: 1888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !99, file: !100, line: 96, baseType: !197, size: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !99, file: !100, line: 96, baseType: !197, size: 64, offset: 1984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !99, file: !100, line: 97, baseType: !200, size: 64, offset: 2048)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !99, file: !100, line: 97, baseType: !202, size: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !99, file: !100, line: 98, baseType: !155, size: 32, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !99, file: !100, line: 98, baseType: !155, size: 32, offset: 2208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !99, file: !100, line: 99, baseType: !197, size: 64, offset: 2240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !99, file: !100, line: 99, baseType: !197, size: 64, offset: 2304)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !99, file: !100, line: 100, baseType: !208, size: 64, offset: 2368)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !158)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !99, file: !100, line: 100, baseType: !211, size: 64, offset: 2432)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !99, file: !100, line: 101, baseType: !155, size: 32, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !99, file: !100, line: 101, baseType: !155, size: 32, offset: 2528)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !99, file: !100, line: 102, baseType: !197, size: 64, offset: 2560)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !99, file: !100, line: 102, baseType: !197, size: 64, offset: 2624)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !99, file: !100, line: 103, baseType: !217, size: 64, offset: 2688)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !99, file: !100, line: 103, baseType: !220, size: 64, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !99, file: !100, line: 104, baseType: !150, size: 64, offset: 2816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !99, file: !100, line: 105, baseType: !155, size: 32, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !99, file: !100, line: 106, baseType: !224, size: 128, offset: 2944)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !231)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !100, line: 64, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 61, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !227, file: !100, line: 62, baseType: !143, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !227, file: !100, line: 63, baseType: !96, size: 64, offset: 64)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !99, file: !100, line: 107, baseType: !234, size: 64, offset: 3072)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !231)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !99, file: !100, line: 108, baseType: !96, size: 64, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !99, file: !100, line: 109, baseType: !237, size: 64, offset: 3200)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!113, !96}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !99, file: !100, line: 111, baseType: !155, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !99, file: !100, line: 112, baseType: !242, size: 320, offset: 3328)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !288)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!113, !246, !97, !96}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !249)
!249 = !{!250, !251, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !248, file: !10, line: 100, baseType: !155, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !10, line: 101, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !263, !264, !265, !269, !271, !273, !274, !275}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !254, file: !10, line: 84, baseType: !182, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !254, file: !10, line: 85, baseType: !182, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !10, line: 86, baseType: !96, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !254, file: !10, line: 87, baseType: !174, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !254, file: !10, line: 88, baseType: !261, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !254, file: !10, line: 89, baseType: !134, size: 8, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !254, file: !10, line: 90, baseType: !182, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !254, file: !10, line: 91, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !267, line: 46, baseType: !268)
!267 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!268 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !254, file: !10, line: 92, baseType: !270, size: 32, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !10, line: 93, baseType: !272, size: 32, offset: 544)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !10, line: 94, baseType: !252, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !254, file: !10, line: 95, baseType: !182, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !254, file: !10, line: 96, baseType: !96, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !248, file: !10, line: 102, baseType: !182, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !248, file: !10, line: 102, baseType: !182, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !248, file: !10, line: 103, baseType: !182, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !248, file: !10, line: 104, baseType: !92, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !248, file: !10, line: 105, baseType: !270, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !248, file: !10, line: 105, baseType: !270, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !248, file: !10, line: 105, baseType: !270, size: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !248, file: !10, line: 106, baseType: !97, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !248, file: !10, line: 107, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!288 = !{!289}
!289 = !DISubrange(count: 5)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !99, file: !100, line: 113, baseType: !291, size: 320, offset: 3648)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!113, !97, !96}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !99, file: !100, line: 114, baseType: !296, size: 320, offset: 3968)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 320, elements: !288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !99, file: !100, line: 115, baseType: !270, size: 32, offset: 4288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !99, file: !100, line: 120, baseType: !285, size: 64, offset: 4352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !99, file: !100, line: 121, baseType: !270, size: 32, offset: 4416)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !93, line: 331, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !93, line: 331, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !93, line: 338, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !93, line: 338, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !308, line: 1451, baseType: !143)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Composite", file: !311, line: 21, baseType: !312)
!311 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/composite/composite.c", directory: "/home/users/ndemeye/xSDK")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 15, size: 320, elements: !313)
!313 = !{!314, !432, !434, !435, !436}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !312, file: !311, line: 16, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_CompositeLink", file: !311, line: 8, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PC_CompositeLink", file: !311, line: 9, size: 192, elements: !318)
!318 = !{!319, !430, !431}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !317, file: !311, line: 10, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !323, line: 37, size: 6720, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !327, !394, !399, !400, !401, !402, !403, !405, !406, !407, !408, !409, !410, !411, !412, !413, !423, !424, !425, !426, !427, !429}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !322, file: !323, line: 38, baseType: !326, size: 4480)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !100, line: 122, baseType: !99)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !322, file: !323, line: 38, baseType: !328, size: 1152, offset: 4480)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 1152, elements: !151)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !323, line: 13, size: 1152, elements: !330)
!330 = !{!331, !335, !343, !350, !356, !361, !362, !366, !370, !378, !379, !384, !385, !386, !387, !388, !392, !393}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !329, file: !323, line: 14, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!113, !320}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !329, file: !323, line: 15, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!113, !320, !339, !339}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !340, line: 21, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !340, line: 21, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !329, file: !323, line: 16, baseType: !344, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!113, !320, !347, !347}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !329, file: !323, line: 17, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!113, !320, !339, !339, !339, !209, !209, !209, !155, !270, !200, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !329, file: !323, line: 18, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!113, !320, !360, !339, !339, !339}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !329, file: !323, line: 19, baseType: !336, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !329, file: !323, line: 20, baseType: !363, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!113, !320, !155, !339, !339, !339}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !329, file: !323, line: 21, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!113, !246, !320}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !329, file: !323, line: 22, baseType: !371, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!113, !320, !374, !339, !339}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !375, line: 22, baseType: !376)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !375, line: 22, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !329, file: !323, line: 23, baseType: !371, size: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !329, file: !323, line: 24, baseType: !380, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!113, !320, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !329, file: !323, line: 25, baseType: !336, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !329, file: !323, line: 26, baseType: !336, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !329, file: !323, line: 27, baseType: !332, size: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !323, line: 28, baseType: !332, size: 64, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !323, line: 29, baseType: !389, size: 64, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!113, !320, !119}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !329, file: !323, line: 30, baseType: !332, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !329, file: !323, line: 31, baseType: !389, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !322, file: !323, line: 39, baseType: !395, size: 64, offset: 5632)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !396, line: 14, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !396, line: 14, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !322, file: !323, line: 40, baseType: !155, size: 32, offset: 5696)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !322, file: !323, line: 41, baseType: !193, size: 64, offset: 5760)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !322, file: !323, line: 41, baseType: !193, size: 64, offset: 5824)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !322, file: !323, line: 42, baseType: !270, size: 32, offset: 5888)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !323, line: 43, baseType: !404, size: 32, offset: 5920)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !322, file: !323, line: 45, baseType: !155, size: 32, offset: 5952)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !322, file: !323, line: 46, baseType: !270, size: 32, offset: 5984)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !322, file: !323, line: 47, baseType: !347, size: 64, offset: 6016)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !322, file: !323, line: 47, baseType: !347, size: 64, offset: 6080)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !322, file: !323, line: 48, baseType: !339, size: 64, offset: 6144)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !322, file: !323, line: 48, baseType: !339, size: 64, offset: 6208)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !322, file: !323, line: 49, baseType: !270, size: 32, offset: 6272)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !322, file: !323, line: 50, baseType: !270, size: 32, offset: 6304)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !322, file: !323, line: 51, baseType: !414, size: 64, offset: 6336)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!113, !320, !155, !417, !417, !383, !96}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !420, line: 11, baseType: !421)
!420 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !420, line: 11, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !322, file: !323, line: 52, baseType: !96, size: 64, offset: 6400)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !323, line: 53, baseType: !96, size: 64, offset: 6464)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !322, file: !323, line: 54, baseType: !155, size: 32, offset: 6528)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !322, file: !323, line: 55, baseType: !96, size: 64, offset: 6592)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !322, file: !323, line: 56, baseType: !428, size: 32, offset: 6656)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !322, file: !323, line: 57, baseType: !428, size: 32, offset: 6688)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !311, line: 11, baseType: !315, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !317, file: !311, line: 12, baseType: !315, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !311, line: 17, baseType: !433, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCCompositeType", file: !25, line: 180, baseType: !54)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "work1", scope: !312, file: !311, line: 18, baseType: !339, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "work2", scope: !312, file: !311, line: 19, baseType: !339, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !312, file: !311, line: 20, baseType: !218, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !88)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!439 = !{i32 7, !"Dwarf Version", i32 4}
!440 = !{i32 2, !"Debug Info Version", i32 3}
!441 = !{i32 1, !"wchar_size", i32 4}
!442 = !{i32 7, !"PIC Level", i32 2}
!443 = !{i32 7, !"uwtable", i32 1}
!444 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!445 = distinct !DISubprogram(name: "PCCompositeSetType", scope: !311, file: !311, line: 427, type: !446, scopeLine: 428, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{!113, !320, !433}
!448 = !{!449, !450, !451, !452, !454, !455, !457, !458, !460, !464, !465, !467, !473, !474, !476, !479, !480, !482, !485, !486, !489, !490, !492, !496}
!449 = !DILocalVariable(name: "pc", arg: 1, scope: !445, file: !311, line: 427, type: !320)
!450 = !DILocalVariable(name: "type", arg: 2, scope: !445, file: !311, line: 427, type: !433)
!451 = !DILocalVariable(name: "ierr", scope: !445, file: !311, line: 429, type: !113)
!452 = !DILocalVariable(name: "_7_ierr", scope: !453, file: !311, line: 433, type: !113)
!453 = distinct !DILexicalBlock(scope: !445, file: !311, line: 433, column: 3)
!454 = !DILocalVariable(name: "b0", scope: !453, file: !311, line: 433, type: !172)
!455 = !DILocalVariable(name: "b1", scope: !453, file: !311, line: 433, type: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !231)
!457 = !DILocalVariable(name: "b2", scope: !453, file: !311, line: 433, type: !456)
!458 = !DILocalVariable(name: "_4_ierr", scope: !459, file: !311, line: 433, type: !113)
!459 = distinct !DILexicalBlock(scope: !453, file: !311, line: 433, column: 3)
!460 = !DILocalVariable(name: "a_b1", scope: !459, file: !311, line: 433, type: !461)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 6)
!464 = !DILocalVariable(name: "a_b2", scope: !459, file: !311, line: 433, type: !461)
!465 = !DILocalVariable(name: "_7_errorcode", scope: !466, file: !311, line: 433, type: !113)
!466 = distinct !DILexicalBlock(scope: !459, file: !311, line: 433, column: 3)
!467 = !DILocalVariable(name: "_7_errorstring", scope: !468, file: !311, line: 433, type: !470)
!468 = distinct !DILexicalBlock(scope: !469, file: !311, line: 433, column: 3)
!469 = distinct !DILexicalBlock(scope: !466, file: !311, line: 433, column: 3)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 2048, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 256)
!473 = !DILocalVariable(name: "_7_resultlen", scope: !468, file: !311, line: 433, type: !172)
!474 = !DILocalVariable(name: "_7_errorcode", scope: !475, file: !311, line: 433, type: !113)
!475 = distinct !DILexicalBlock(scope: !459, file: !311, line: 433, column: 3)
!476 = !DILocalVariable(name: "_7_errorstring", scope: !477, file: !311, line: 433, type: !470)
!477 = distinct !DILexicalBlock(scope: !478, file: !311, line: 433, column: 3)
!478 = distinct !DILexicalBlock(scope: !475, file: !311, line: 433, column: 3)
!479 = !DILocalVariable(name: "_7_resultlen", scope: !477, file: !311, line: 433, type: !172)
!480 = !DILocalVariable(name: "_7_errorcode", scope: !481, file: !311, line: 433, type: !113)
!481 = distinct !DILexicalBlock(scope: !453, file: !311, line: 433, column: 3)
!482 = !DILocalVariable(name: "_7_errorstring", scope: !483, file: !311, line: 433, type: !470)
!483 = distinct !DILexicalBlock(scope: !484, file: !311, line: 433, column: 3)
!484 = distinct !DILexicalBlock(scope: !481, file: !311, line: 433, column: 3)
