; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/lmvmutils.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/lmvmutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!284 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1265, baseType: !5, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!295 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1203, baseType: !5, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 187, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 663, baseType: !5, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318}
!316 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!321 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!339 = !{!340, !365, !446, !362, !386}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !342, line: 52, baseType: !343)
!342 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 27, size: 6208, elements: !344)
!344 = !{!345, !555, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1606, !1611, !1612, !1613, !1614}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !343, file: !342, line: 29, baseType: !346, size: 4480)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !347, line: 122, baseType: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !347, line: 73, size: 4480, elements: !349)
!349 = !{!350, !352, !407, !408, !410, !413, !414, !415, !416, !424, !425, !427, !431, !435, !437, !438, !439, !440, !441, !442, !443, !444, !445, !447, !449, !450, !451, !453, !454, !456, !458, !459, !460, !461, !462, !465, !467, !468, !469, !470, !471, !474, !476, !477, !478, !488, !490, !491, !495, !496, !545, !550, !552, !553, !554}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !348, file: !347, line: 74, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !348, file: !347, line: 75, baseType: !353, size: 448, offset: 64)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 448, elements: !405)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !347, line: 53, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 45, size: 448, elements: !356)
!356 = !{!357, !369, !377, !382, !389, !393, !400}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !355, file: !347, line: 46, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !362, !364}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !366, line: 330, baseType: !367)
!366 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !366, line: 330, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !355, file: !347, line: 47, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!361, !362, !373}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !374, line: 16, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !374, line: 16, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !355, file: !347, line: 48, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!361, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !355, file: !347, line: 49, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!361, !362, !386, !362}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !355, file: !347, line: 50, baseType: !390, size: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!361, !362, !386, !381}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !355, file: !347, line: 51, baseType: !394, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!361, !362, !386, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !355, file: !347, line: 52, baseType: !401, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!361, !362, !386, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!405 = !{!406}
!406 = !DISubrange(count: 1)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !348, file: !347, line: 76, baseType: !365, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !347, line: 77, baseType: !409, size: 32, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !348, file: !347, line: 78, baseType: !411, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !412)
!412 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !348, file: !347, line: 78, baseType: !411, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !348, file: !347, line: 78, baseType: !411, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !348, file: !347, line: 78, baseType: !411, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !348, file: !347, line: 79, baseType: !417, size: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !420, line: 27, baseType: !421)
!420 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !422, line: 43, baseType: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!423 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !348, file: !347, line: 80, baseType: !409, size: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !348, file: !347, line: 81, baseType: !426, size: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !348, file: !347, line: 82, baseType: !428, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !348, file: !347, line: 83, baseType: !432, size: 64, offset: 1088)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !348, file: !347, line: 84, baseType: !436, size: 64, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !348, file: !347, line: 85, baseType: !436, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !348, file: !347, line: 86, baseType: !436, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !348, file: !347, line: 87, baseType: !436, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !348, file: !347, line: 88, baseType: !362, size: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !348, file: !347, line: 89, baseType: !417, size: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !347, line: 90, baseType: !436, size: 64, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !348, file: !347, line: 91, baseType: !436, size: 64, offset: 1600)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !348, file: !347, line: 92, baseType: !409, size: 32, offset: 1664)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !348, file: !347, line: 93, baseType: !446, size: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !347, line: 94, baseType: !448, size: 64, offset: 1792)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !418)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !348, file: !347, line: 95, baseType: !409, size: 32, offset: 1856)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !348, file: !347, line: 95, baseType: !409, size: 32, offset: 1888)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !348, file: !347, line: 96, baseType: !452, size: 64, offset: 1920)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !348, file: !347, line: 96, baseType: !452, size: 64, offset: 1984)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !348, file: !347, line: 97, baseType: !455, size: 64, offset: 2048)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !348, file: !347, line: 97, baseType: !457, size: 64, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !348, file: !347, line: 98, baseType: !409, size: 32, offset: 2176)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !348, file: !347, line: 98, baseType: !409, size: 32, offset: 2208)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !348, file: !347, line: 99, baseType: !452, size: 64, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !348, file: !347, line: 99, baseType: !452, size: 64, offset: 2304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !348, file: !347, line: 100, baseType: !463, size: 64, offset: 2368)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !412)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !348, file: !347, line: 100, baseType: !466, size: 64, offset: 2432)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !348, file: !347, line: 101, baseType: !409, size: 32, offset: 2496)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !348, file: !347, line: 101, baseType: !409, size: 32, offset: 2528)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !348, file: !347, line: 102, baseType: !452, size: 64, offset: 2560)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !348, file: !347, line: 102, baseType: !452, size: 64, offset: 2624)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !348, file: !347, line: 103, baseType: !472, size: 64, offset: 2688)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !464)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !348, file: !347, line: 103, baseType: !475, size: 64, offset: 2752)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !348, file: !347, line: 104, baseType: !404, size: 64, offset: 2816)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !348, file: !347, line: 105, baseType: !409, size: 32, offset: 2880)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !348, file: !347, line: 106, baseType: !479, size: 128, offset: 2944)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 128, elements: !486)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !347, line: 64, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 61, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !482, file: !347, line: 62, baseType: !397, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !482, file: !347, line: 63, baseType: !446, size: 64, offset: 64)
!486 = !{!487}
!487 = !DISubrange(count: 2)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !348, file: !347, line: 107, baseType: !489, size: 64, offset: 3072)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !486)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !348, file: !347, line: 108, baseType: !446, size: 64, offset: 3136)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !348, file: !347, line: 109, baseType: !492, size: 64, offset: 3200)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!361, !446}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !348, file: !347, line: 111, baseType: !409, size: 32, offset: 3264)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !348, file: !347, line: 112, baseType: !497, size: 320, offset: 3328)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 320, elements: !543)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!361, !501, !362, !446}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !504)
!504 = !{!505, !506, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !503, file: !10, line: 100, baseType: !409, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !10, line: 101, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !518, !519, !520, !524, !526, !528, !529, !530}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !509, file: !10, line: 84, baseType: !436, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !509, file: !10, line: 85, baseType: !436, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !509, file: !10, line: 86, baseType: !446, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !509, file: !10, line: 87, baseType: !428, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !509, file: !10, line: 88, baseType: !516, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !509, file: !10, line: 89, baseType: !388, size: 8, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !509, file: !10, line: 90, baseType: !436, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !509, file: !10, line: 91, baseType: !521, size: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !522, line: 46, baseType: !523)
!522 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!523 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !509, file: !10, line: 92, baseType: !525, size: 32, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !10, line: 93, baseType: !527, size: 32, offset: 544)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !10, line: 94, baseType: !507, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !509, file: !10, line: 95, baseType: !436, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !509, file: !10, line: 96, baseType: !446, size: 64, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !503, file: !10, line: 102, baseType: !436, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !503, file: !10, line: 102, baseType: !436, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !503, file: !10, line: 103, baseType: !436, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !503, file: !10, line: 104, baseType: !365, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !503, file: !10, line: 105, baseType: !525, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !503, file: !10, line: 105, baseType: !525, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !503, file: !10, line: 105, baseType: !525, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !503, file: !10, line: 106, baseType: !362, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !503, file: !10, line: 107, baseType: !540, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!543 = !{!544}
!544 = !DISubrange(count: 5)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !348, file: !347, line: 113, baseType: !546, size: 320, offset: 3648)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 320, elements: !543)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!361, !362, !446}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !348, file: !347, line: 114, baseType: !551, size: 320, offset: 3968)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 320, elements: !543)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !348, file: !347, line: 115, baseType: !525, size: 32, offset: 4288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !348, file: !347, line: 120, baseType: !540, size: 64, offset: 4352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !348, file: !347, line: 121, baseType: !525, size: 32, offset: 4416)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !343, file: !342, line: 29, baseType: !556, size: 320, offset: 4480)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 320, elements: !405)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !342, line: 19, size: 320, elements: !558)
!558 = !{!559, !1576, !1577, !1578, !1579}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !557, file: !342, line: 20, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!361, !563, !592, !592}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !566, line: 436, size: 23424, elements: !567)
!566 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!567 = !{!568, !569, !1351, !1352, !1353, !1354, !1356, !1357, !1358, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1472, !1473, !1489, !1490, !1491, !1492, !1493, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1528, !1548, !1549, !1551, !1552, !1553, !1554, !1555, !1556, !1574, !1575}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !565, file: !566, line: 437, baseType: !346, size: 4480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !565, file: !566, line: 437, baseType: !570, size: 9472, offset: 4480)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 9472, elements: !405)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !566, line: 32, size: 9472, elements: !572)
!572 = !{!573, !582, !586, !587, !588, !887, !888, !889, !890, !891, !892, !893, !913, !917, !922, !928, !947, !952, !956, !957, !961, !966, !967, !972, !976, !980, !984, !988, !992, !993, !994, !995, !996, !1000, !1001, !1006, !1007, !1008, !1009, !1010, !1015, !1022, !1026, !1030, !1034, !1038, !1042, !1043, !1047, !1048, !1052, !1057, !1058, !1059, !1060, !1122, !1130, !1131, !1135, !1136, !1140, !1141, !1145, !1150, !1151, !1155, !1159, !1163, !1164, !1165, !1166, !1167, !1168, !1173, !1174, !1178, !1182, !1186, !1187, !1188, !1192, !1202, !1203, !1207, !1208, !1212, !1213, !1217, !1218, !1222, !1223, !1227, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1261, !1265, !1266, !1267, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1287, !1291, !1292, !1296, !1297, !1298, !1299, !1325, !1329, !1330, !1331, !1332, !1333, !1337, !1338, !1339, !1340, !1341, !1345, !1349, !1350}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !571, file: !566, line: 34, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!361, !563, !409, !577, !409, !577, !579, !581}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !571, file: !566, line: 35, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!361, !563, !409, !455, !457, !475}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !571, file: !566, line: 36, baseType: !583, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !571, file: !566, line: 37, baseType: !560, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !571, file: !566, line: 38, baseType: !589, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!361, !563, !592, !592, !592}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !595, line: 142, size: 12800, elements: !596)
!595 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!596 = !{!597, !598, !813, !833, !834, !835, !881, !882, !883, !884, !886}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !594, file: !595, line: 143, baseType: !346, size: 4480)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !594, file: !595, line: 143, baseType: !599, size: 5248, offset: 4480)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 5248, elements: !405)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !595, line: 23, size: 5248, elements: !601)
!601 = !{!602, !607, !612, !616, !620, !626, !631, !632, !633, !637, !641, !642, !643, !647, !651, !655, !656, !660, !664, !668, !669, !673, !677, !678, !682, !686, !687, !688, !692, !693, !700, !705, !706, !707, !711, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !732, !733, !734, !738, !742, !743, !744, !745, !749, !750, !751, !752, !753, !754, !755, !759, !760, !764, !771, !772, !777, !778, !782, !783, !784, !785, !786, !787, !788, !789, !793, !794, !795, !801, !805, !806, !807}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !600, file: !595, line: 24, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!361, !592, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !600, file: !595, line: 25, baseType: !608, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!361, !592, !409, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !600, file: !595, line: 26, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!361, !409, !606}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !600, file: !595, line: 27, baseType: !617, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!361, !592, !592, !472}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !600, file: !595, line: 28, baseType: !621, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!361, !592, !409, !624, !472}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !600, file: !595, line: 29, baseType: !627, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!361, !592, !630, !463}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !600, file: !595, line: 30, baseType: !617, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !600, file: !595, line: 31, baseType: !621, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !600, file: !595, line: 32, baseType: !634, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!361, !592, !473}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !600, file: !595, line: 33, baseType: !638, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!361, !592, !592}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !600, file: !595, line: 34, baseType: !634, size: 64, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !600, file: !595, line: 35, baseType: !638, size: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !600, file: !595, line: 36, baseType: !644, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!361, !592, !473, !592}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !600, file: !595, line: 37, baseType: !648, size: 64, offset: 832)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!361, !592, !473, !473, !592}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !600, file: !595, line: 38, baseType: !652, size: 64, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!361, !592, !409, !579, !606}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !600, file: !595, line: 39, baseType: !644, size: 64, offset: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !600, file: !595, line: 40, baseType: !657, size: 64, offset: 1024)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!361, !592, !473, !592, !592}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !600, file: !595, line: 41, baseType: !661, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!361, !592, !473, !473, !473, !592, !592}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !600, file: !595, line: 42, baseType: !665, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!361, !592, !592, !592}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !600, file: !595, line: 43, baseType: !665, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !600, file: !595, line: 44, baseType: !670, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!361, !592, !409, !577, !579, !581}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !600, file: !595, line: 45, baseType: !674, size: 64, offset: 1344)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!361, !592}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !600, file: !595, line: 46, baseType: !674, size: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !600, file: !595, line: 47, baseType: !679, size: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!361, !592, !475}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !600, file: !595, line: 48, baseType: !683, size: 64, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!361, !592, !455}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !600, file: !595, line: 49, baseType: !683, size: 64, offset: 1600)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !600, file: !595, line: 50, baseType: !679, size: 64, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !600, file: !595, line: 51, baseType: !689, size: 64, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!361, !592, !455, !463}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !600, file: !595, line: 52, baseType: !689, size: 64, offset: 1792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !600, file: !595, line: 53, baseType: !694, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!361, !592, !697}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !600, file: !595, line: 54, baseType: !701, size: 64, offset: 1920)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!361, !592, !704, !525}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !600, file: !595, line: 55, baseType: !670, size: 64, offset: 1984)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !600, file: !595, line: 56, baseType: !674, size: 64, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !600, file: !595, line: 57, baseType: !708, size: 64, offset: 2112)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!361, !592, !373}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !600, file: !595, line: 58, baseType: !712, size: 64, offset: 2176)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!361, !592, !579}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !600, file: !595, line: 59, baseType: !712, size: 64, offset: 2240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !600, file: !595, line: 60, baseType: !617, size: 64, offset: 2304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !600, file: !595, line: 61, baseType: !617, size: 64, offset: 2368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !600, file: !595, line: 62, baseType: !627, size: 64, offset: 2432)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !600, file: !595, line: 63, baseType: !621, size: 64, offset: 2496)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !600, file: !595, line: 64, baseType: !621, size: 64, offset: 2560)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !600, file: !595, line: 65, baseType: !708, size: 64, offset: 2624)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !600, file: !595, line: 66, baseType: !674, size: 64, offset: 2688)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !600, file: !595, line: 67, baseType: !674, size: 64, offset: 2752)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !600, file: !595, line: 68, baseType: !725, size: 64, offset: 2816)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!361, !592, !728}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !729, line: 30, baseType: !730)
!729 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !729, line: 30, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !600, file: !595, line: 69, baseType: !670, size: 64, offset: 2880)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !600, file: !595, line: 70, baseType: !674, size: 64, offset: 2944)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !600, file: !595, line: 71, baseType: !735, size: 64, offset: 3008)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!361, !501, !592}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !600, file: !595, line: 72, baseType: !739, size: 64, offset: 3072)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!361, !592, !592, !463}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !600, file: !595, line: 73, baseType: !665, size: 64, offset: 3136)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !600, file: !595, line: 74, baseType: !665, size: 64, offset: 3200)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !600, file: !595, line: 75, baseType: !665, size: 64, offset: 3264)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !600, file: !595, line: 76, baseType: !746, size: 64, offset: 3328)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!361, !592, !409, !577, !472}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !600, file: !595, line: 77, baseType: !674, size: 64, offset: 3392)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !600, file: !595, line: 78, baseType: !674, size: 64, offset: 3456)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !600, file: !595, line: 79, baseType: !674, size: 64, offset: 3520)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !600, file: !595, line: 80, baseType: !674, size: 64, offset: 3584)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !600, file: !595, line: 81, baseType: !634, size: 64, offset: 3648)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !600, file: !595, line: 82, baseType: !674, size: 64, offset: 3712)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !600, file: !595, line: 83, baseType: !756, size: 64, offset: 3776)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!361, !592, !409, !592, !581}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !600, file: !595, line: 84, baseType: !756, size: 64, offset: 3840)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !600, file: !595, line: 85, baseType: !761, size: 64, offset: 3904)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!361, !592, !592, !472, !472}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !600, file: !595, line: 86, baseType: !765, size: 64, offset: 3968)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!361, !592, !768, !606}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !729, line: 11, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !729, line: 11, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !600, file: !595, line: 87, baseType: !765, size: 64, offset: 4032)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !600, file: !595, line: 88, baseType: !773, size: 64, offset: 4096)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!361, !592, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !600, file: !595, line: 89, baseType: !773, size: 64, offset: 4160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !600, file: !595, line: 90, baseType: !779, size: 64, offset: 4224)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!361, !592, !409, !577, !577, !592, !581}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !600, file: !595, line: 91, baseType: !779, size: 64, offset: 4288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !600, file: !595, line: 92, baseType: !708, size: 64, offset: 4352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !600, file: !595, line: 93, baseType: !708, size: 64, offset: 4416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !600, file: !595, line: 94, baseType: !638, size: 64, offset: 4480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !600, file: !595, line: 95, baseType: !638, size: 64, offset: 4544)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !600, file: !595, line: 96, baseType: !638, size: 64, offset: 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !600, file: !595, line: 97, baseType: !638, size: 64, offset: 4672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !600, file: !595, line: 98, baseType: !790, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!361, !592, !525}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !600, file: !595, line: 99, baseType: !679, size: 64, offset: 4800)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !600, file: !595, line: 100, baseType: !679, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !600, file: !595, line: 101, baseType: !796, size: 64, offset: 4928)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!361, !592, !475, !799}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !600, file: !595, line: 102, baseType: !802, size: 64, offset: 4992)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!361, !592, !776, !799}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !600, file: !595, line: 103, baseType: !679, size: 64, offset: 5056)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !600, file: !595, line: 104, baseType: !773, size: 64, offset: 5120)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !600, file: !595, line: 105, baseType: !808, size: 64, offset: 5184)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!361, !409, !624, !606, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !594, file: !595, line: 144, baseType: !814, size: 64, offset: 9728)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !729, line: 60, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !816, file: !133, line: 241, baseType: !365, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !133, line: 242, baseType: !426, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !816, file: !133, line: 243, baseType: !409, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !816, file: !133, line: 243, baseType: !409, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !816, file: !133, line: 244, baseType: !409, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !816, file: !133, line: 244, baseType: !409, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !816, file: !133, line: 245, baseType: !455, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !816, file: !133, line: 246, baseType: !525, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !816, file: !133, line: 247, baseType: !409, size: 32, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !816, file: !133, line: 251, baseType: !409, size: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !816, file: !133, line: 252, baseType: !728, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !816, file: !133, line: 253, baseType: !525, size: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !816, file: !133, line: 254, baseType: !409, size: 32, offset: 544)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !816, file: !133, line: 254, baseType: !409, size: 32, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !816, file: !133, line: 255, baseType: !409, size: 32, offset: 608)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !595, line: 145, baseType: !446, size: 64, offset: 9792)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !594, file: !595, line: 146, baseType: !525, size: 32, offset: 9856)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !594, file: !595, line: 147, baseType: !836, size: 1344, offset: 9920)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !595, line: 140, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 114, size: 1344, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !857, !858, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !837, file: !595, line: 115, baseType: !409, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !837, file: !595, line: 116, baseType: !409, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !837, file: !595, line: 117, baseType: !409, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !837, file: !595, line: 118, baseType: !409, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !837, file: !595, line: 119, baseType: !409, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !837, file: !595, line: 120, baseType: !409, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !837, file: !595, line: 121, baseType: !455, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !837, file: !595, line: 122, baseType: !472, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !837, file: !595, line: 124, baseType: !365, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !595, line: 125, baseType: !426, size: 32, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !837, file: !595, line: 125, baseType: !426, size: 32, offset: 416)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !837, file: !595, line: 126, baseType: !426, size: 32, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !837, file: !595, line: 126, baseType: !426, size: 32, offset: 480)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !837, file: !595, line: 127, baseType: !853, size: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !366, line: 339, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !366, line: 339, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !837, file: !595, line: 128, baseType: !853, size: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !837, file: !595, line: 129, baseType: !859, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !366, line: 341, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !366, line: 351, size: 192, elements: !862)
!862 = !{!863, !864, !865, !866, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !861, file: !366, line: 354, baseType: !91, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !861, file: !366, line: 355, baseType: !91, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !861, file: !366, line: 356, baseType: !91, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !861, file: !366, line: 361, baseType: !91, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !861, file: !366, line: 362, baseType: !521, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !837, file: !595, line: 130, baseType: !409, size: 32, offset: 704)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !837, file: !595, line: 130, baseType: !409, size: 32, offset: 736)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !837, file: !595, line: 131, baseType: !472, size: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !837, file: !595, line: 131, baseType: !472, size: 64, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !837, file: !595, line: 132, baseType: !455, size: 64, offset: 896)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !837, file: !595, line: 132, baseType: !455, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !837, file: !595, line: 133, baseType: !409, size: 32, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !837, file: !595, line: 134, baseType: !455, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !837, file: !595, line: 135, baseType: !409, size: 32, offset: 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !837, file: !595, line: 136, baseType: !525, size: 32, offset: 1184)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !837, file: !595, line: 137, baseType: !525, size: 32, offset: 1216)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !837, file: !595, line: 138, baseType: !581, size: 32, offset: 1248)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !837, file: !595, line: 139, baseType: !455, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !594, file: !595, line: 147, baseType: !836, size: 1344, offset: 11264)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !594, file: !595, line: 148, baseType: !525, size: 32, offset: 12608)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !594, file: !595, line: 149, baseType: !409, size: 32, offset: 12640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !594, file: !595, line: 150, baseType: !885, size: 32, offset: 12672)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !594, file: !595, line: 157, baseType: !436, size: 64, offset: 12736)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !571, file: !566, line: 40, baseType: !560, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !571, file: !566, line: 41, baseType: !589, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !571, file: !566, line: 42, baseType: !560, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !571, file: !566, line: 43, baseType: !589, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !571, file: !566, line: 44, baseType: !560, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !571, file: !566, line: 46, baseType: !589, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !571, file: !566, line: 47, baseType: !894, size: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!361, !563, !768, !768, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !900, file: !63, line: 1227, baseType: !464, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !900, file: !63, line: 1228, baseType: !464, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !900, file: !63, line: 1229, baseType: !464, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !900, file: !63, line: 1230, baseType: !464, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !900, file: !63, line: 1231, baseType: !464, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !900, file: !63, line: 1232, baseType: !464, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !900, file: !63, line: 1233, baseType: !464, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !900, file: !63, line: 1234, baseType: !464, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !900, file: !63, line: 1236, baseType: !464, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !900, file: !63, line: 1237, baseType: !464, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !900, file: !63, line: 1238, baseType: !464, size: 64, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !571, file: !566, line: 48, baseType: !914, size: 64, offset: 768)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!361, !563, !768, !897}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !571, file: !566, line: 49, baseType: !918, size: 64, offset: 832)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!361, !563, !592, !464, !921, !464, !409, !409, !592}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !571, file: !566, line: 50, baseType: !923, size: 64, offset: 896)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!361, !563, !926, !927}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !571, file: !566, line: 52, baseType: !929, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!361, !563, !932, !933}
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !935, file: !63, line: 593, baseType: !411, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !935, file: !63, line: 594, baseType: !411, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !935, file: !63, line: 594, baseType: !411, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !935, file: !63, line: 594, baseType: !411, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !935, file: !63, line: 595, baseType: !411, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !935, file: !63, line: 596, baseType: !411, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !935, file: !63, line: 597, baseType: !411, size: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !935, file: !63, line: 598, baseType: !411, size: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !935, file: !63, line: 598, baseType: !411, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !935, file: !63, line: 599, baseType: !411, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !571, file: !566, line: 53, baseType: !948, size: 64, offset: 1024)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!361, !563, !563, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !571, file: !566, line: 54, baseType: !953, size: 64, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!361, !563, !592}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !571, file: !566, line: 55, baseType: !560, size: 64, offset: 1152)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !571, file: !566, line: 56, baseType: !958, size: 64, offset: 1216)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!361, !563, !630, !463}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !571, file: !566, line: 58, baseType: !962, size: 64, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!361, !563, !965}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !571, file: !566, line: 59, baseType: !962, size: 64, offset: 1344)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !571, file: !566, line: 60, baseType: !968, size: 64, offset: 1408)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!361, !563, !971, !525}
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !571, file: !566, line: 61, baseType: !973, size: 64, offset: 1472)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!361, !563}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !571, file: !566, line: 63, baseType: !977, size: 64, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!361, !563, !409, !577, !473, !592, !592}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !571, file: !566, line: 64, baseType: !981, size: 64, offset: 1600)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!361, !563, !563, !768, !768, !897}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !571, file: !566, line: 65, baseType: !985, size: 64, offset: 1664)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!361, !563, !563, !897}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !571, file: !566, line: 66, baseType: !989, size: 64, offset: 1728)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!361, !563, !563, !768, !897}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !571, file: !566, line: 67, baseType: !985, size: 64, offset: 1792)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !571, file: !566, line: 69, baseType: !973, size: 64, offset: 1856)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !571, file: !566, line: 70, baseType: !981, size: 64, offset: 1920)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !571, file: !566, line: 71, baseType: !989, size: 64, offset: 1984)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !571, file: !566, line: 72, baseType: !997, size: 64, offset: 2048)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!361, !563, !927}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !571, file: !566, line: 73, baseType: !973, size: 64, offset: 2112)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !571, file: !566, line: 75, baseType: !1002, size: 64, offset: 2176)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!361, !563, !1005, !927}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !571, file: !566, line: 76, baseType: !560, size: 64, offset: 2240)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !571, file: !566, line: 77, baseType: !560, size: 64, offset: 2304)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !571, file: !566, line: 78, baseType: !894, size: 64, offset: 2368)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !571, file: !566, line: 79, baseType: !914, size: 64, offset: 2432)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !571, file: !566, line: 81, baseType: !1011, size: 64, offset: 2496)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!361, !563, !473, !563, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !571, file: !566, line: 82, baseType: !1016, size: 64, offset: 2560)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!361, !563, !409, !1019, !1019, !926, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !571, file: !566, line: 83, baseType: !1023, size: 64, offset: 2624)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!361, !563, !409, !812, !409}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !571, file: !566, line: 84, baseType: !1027, size: 64, offset: 2688)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!361, !563, !409, !577, !409, !577, !472}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !571, file: !566, line: 85, baseType: !1031, size: 64, offset: 2752)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!361, !563, !563, !1014}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !571, file: !566, line: 87, baseType: !1035, size: 64, offset: 2816)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!361, !563, !592, !455}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !571, file: !566, line: 88, baseType: !1039, size: 64, offset: 2880)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!361, !563, !473}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !571, file: !566, line: 89, baseType: !1039, size: 64, offset: 2944)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !571, file: !566, line: 90, baseType: !1044, size: 64, offset: 3008)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!361, !563, !592, !581}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !571, file: !566, line: 91, baseType: !977, size: 64, offset: 3072)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !571, file: !566, line: 93, baseType: !1049, size: 64, offset: 3136)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!361, !563, !697}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !571, file: !566, line: 94, baseType: !1053, size: 64, offset: 3200)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!361, !563, !409, !525, !525, !455, !1056, !1056, !951}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !571, file: !566, line: 95, baseType: !1053, size: 64, offset: 3264)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !571, file: !566, line: 96, baseType: !1053, size: 64, offset: 3328)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !571, file: !566, line: 97, baseType: !1053, size: 64, offset: 3392)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !571, file: !566, line: 99, baseType: !1061, size: 64, offset: 3456)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!361, !563, !1064, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !729, line: 51, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !729, line: 51, flags: DIFlagFwdDecl)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !566, line: 609, size: 6208, elements: !1070)
!1070 = !{!1071, !1072, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1091, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1109, !1110, !1111, !1112, !1113, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1069, file: !566, line: 610, baseType: !346, size: 4480)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1069, file: !566, line: 610, baseType: !1073, size: 32, offset: 4480)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !405)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1069, file: !566, line: 611, baseType: !409, size: 32, offset: 4512)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1069, file: !566, line: 611, baseType: !409, size: 32, offset: 4544)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1069, file: !566, line: 611, baseType: !409, size: 32, offset: 4576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1069, file: !566, line: 612, baseType: !409, size: 32, offset: 4608)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1069, file: !566, line: 613, baseType: !409, size: 32, offset: 4640)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1069, file: !566, line: 614, baseType: !455, size: 64, offset: 4672)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1069, file: !566, line: 615, baseType: !457, size: 64, offset: 4736)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1069, file: !566, line: 616, baseType: !812, size: 64, offset: 4800)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1069, file: !566, line: 617, baseType: !455, size: 64, offset: 4864)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1069, file: !566, line: 618, baseType: !1084, size: 64, offset: 4928)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !566, line: 602, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !566, line: 598, size: 128, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1086, file: !566, line: 599, baseType: !409, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1086, file: !566, line: 600, baseType: !409, size: 32, offset: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1086, file: !566, line: 601, baseType: !472, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1069, file: !566, line: 619, baseType: !1092, size: 64, offset: 4992)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !566, line: 607, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !566, line: 604, size: 128, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1094, file: !566, line: 605, baseType: !409, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1094, file: !566, line: 606, baseType: !472, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1069, file: !566, line: 620, baseType: !472, size: 64, offset: 5056)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1069, file: !566, line: 621, baseType: !464, size: 64, offset: 5120)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1069, file: !566, line: 622, baseType: !464, size: 64, offset: 5184)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1069, file: !566, line: 623, baseType: !592, size: 64, offset: 5248)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1069, file: !566, line: 623, baseType: !592, size: 64, offset: 5312)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1069, file: !566, line: 623, baseType: !592, size: 64, offset: 5376)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1069, file: !566, line: 624, baseType: !525, size: 32, offset: 5440)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1069, file: !566, line: 625, baseType: !1106, size: 64, offset: 5504)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!361}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1069, file: !566, line: 626, baseType: !446, size: 64, offset: 5568)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1069, file: !566, line: 627, baseType: !592, size: 64, offset: 5632)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1069, file: !566, line: 628, baseType: !409, size: 32, offset: 5696)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1069, file: !566, line: 629, baseType: !386, size: 64, offset: 5760)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1069, file: !566, line: 630, baseType: !1114, size: 32, offset: 5824)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1069, file: !566, line: 631, baseType: !409, size: 32, offset: 5856)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1069, file: !566, line: 631, baseType: !409, size: 32, offset: 5888)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1069, file: !566, line: 632, baseType: !525, size: 32, offset: 5920)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1069, file: !566, line: 633, baseType: !525, size: 32, offset: 5952)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1069, file: !566, line: 634, baseType: !397, size: 64, offset: 6016)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1069, file: !566, line: 634, baseType: !446, size: 64, offset: 6080)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1069, file: !566, line: 635, baseType: !417, size: 64, offset: 6144)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !571, file: !566, line: 100, baseType: !1123, size: 64, offset: 3520)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!361, !563, !409, !409, !1126, !1129}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1128)
!1128 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !571, file: !566, line: 101, baseType: !973, size: 64, offset: 3584)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !571, file: !566, line: 102, baseType: !1132, size: 64, offset: 3648)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!361, !563, !768, !768, !927}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !571, file: !566, line: 103, baseType: !574, size: 64, offset: 3712)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !571, file: !566, line: 105, baseType: !1137, size: 64, offset: 3776)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!361, !563, !768, !768, !926, !927}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !571, file: !566, line: 106, baseType: !973, size: 64, offset: 3840)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !571, file: !566, line: 107, baseType: !1142, size: 64, offset: 3904)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!361, !563, !373}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !571, file: !566, line: 108, baseType: !1146, size: 64, offset: 3968)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!361, !563, !1149, !926, !927}
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !386)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !571, file: !566, line: 109, baseType: !1106, size: 64, offset: 4032)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !571, file: !566, line: 111, baseType: !1152, size: 64, offset: 4096)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!361, !563, !563, !563, !464, !563}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !571, file: !566, line: 112, baseType: !1156, size: 64, offset: 4160)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!361, !563, !563, !563, !563}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !571, file: !566, line: 113, baseType: !1160, size: 64, offset: 4224)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!361, !563, !728, !728}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !571, file: !566, line: 114, baseType: !574, size: 64, offset: 4288)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !571, file: !566, line: 115, baseType: !977, size: 64, offset: 4352)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !571, file: !566, line: 117, baseType: !1035, size: 64, offset: 4416)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !571, file: !566, line: 118, baseType: !1035, size: 64, offset: 4480)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !571, file: !566, line: 119, baseType: !1146, size: 64, offset: 4544)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !571, file: !566, line: 120, baseType: !1169, size: 64, offset: 4608)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!361, !563, !1172, !951}
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !571, file: !566, line: 121, baseType: !1106, size: 64, offset: 4672)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !571, file: !566, line: 123, baseType: !1175, size: 64, offset: 4736)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!361, !563, !409, !446}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !571, file: !566, line: 124, baseType: !1179, size: 64, offset: 4800)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!361, !563, !1067, !592, !446}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !571, file: !566, line: 125, baseType: !1183, size: 64, offset: 4864)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!361, !501, !563}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !571, file: !566, line: 126, baseType: !560, size: 64, offset: 4928)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !571, file: !566, line: 127, baseType: !560, size: 64, offset: 4992)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !571, file: !566, line: 129, baseType: !1189, size: 64, offset: 5056)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!361, !563, !812}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !571, file: !566, line: 130, baseType: !1193, size: 64, offset: 5120)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!361, !563, !1196, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1198, file: !36, line: 653, baseType: !409, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1198, file: !36, line: 653, baseType: !592, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !571, file: !566, line: 131, baseType: !1193, size: 64, offset: 5184)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !571, file: !566, line: 132, baseType: !1204, size: 64, offset: 5248)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!361, !563, !455, !455, !455}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !571, file: !566, line: 133, baseType: !1142, size: 64, offset: 5312)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !571, file: !566, line: 135, baseType: !1209, size: 64, offset: 5376)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!361, !563, !464, !951}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !571, file: !566, line: 136, baseType: !1209, size: 64, offset: 5440)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !571, file: !566, line: 137, baseType: !1214, size: 64, offset: 5504)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!361, !563, !951}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !571, file: !566, line: 138, baseType: !574, size: 64, offset: 5568)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !571, file: !566, line: 139, baseType: !1219, size: 64, offset: 5632)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!361, !563, !606, !606}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !571, file: !566, line: 141, baseType: !1106, size: 64, offset: 5696)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !571, file: !566, line: 142, baseType: !1224, size: 64, offset: 5760)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!361, !563, !563, !464, !563}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !571, file: !566, line: 143, baseType: !1228, size: 64, offset: 5824)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!361, !563, !563, !563}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !571, file: !566, line: 144, baseType: !1106, size: 64, offset: 5888)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !571, file: !566, line: 145, baseType: !1224, size: 64, offset: 5952)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !571, file: !566, line: 147, baseType: !1228, size: 64, offset: 6016)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !571, file: !566, line: 148, baseType: !1106, size: 64, offset: 6080)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !571, file: !566, line: 149, baseType: !1224, size: 64, offset: 6144)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !571, file: !566, line: 150, baseType: !1228, size: 64, offset: 6208)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !571, file: !566, line: 151, baseType: !1238, size: 64, offset: 6272)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!361, !563, !525}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !571, file: !566, line: 153, baseType: !973, size: 64, offset: 6336)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !571, file: !566, line: 154, baseType: !973, size: 64, offset: 6400)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !571, file: !566, line: 155, baseType: !973, size: 64, offset: 6464)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !571, file: !566, line: 156, baseType: !973, size: 64, offset: 6528)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !571, file: !566, line: 157, baseType: !1142, size: 64, offset: 6592)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !571, file: !566, line: 159, baseType: !1247, size: 64, offset: 6656)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!361, !563, !409, !579}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !571, file: !566, line: 160, baseType: !973, size: 64, offset: 6720)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !571, file: !566, line: 161, baseType: !973, size: 64, offset: 6784)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !571, file: !566, line: 162, baseType: !973, size: 64, offset: 6848)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !571, file: !566, line: 163, baseType: !973, size: 64, offset: 6912)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !571, file: !566, line: 165, baseType: !1228, size: 64, offset: 6976)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !571, file: !566, line: 166, baseType: !1228, size: 64, offset: 7040)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !571, file: !566, line: 167, baseType: !1035, size: 64, offset: 7104)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !571, file: !566, line: 168, baseType: !1258, size: 64, offset: 7168)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!361, !563, !592, !409}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !571, file: !566, line: 169, baseType: !1262, size: 64, offset: 7232)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!361, !563, !951, !455}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !571, file: !566, line: 171, baseType: !997, size: 64, offset: 7296)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !571, file: !566, line: 172, baseType: !973, size: 64, offset: 7360)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !571, file: !566, line: 173, baseType: !1268, size: 64, offset: 7424)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!361, !563, !455, !1056}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !571, file: !566, line: 174, baseType: !1132, size: 64, offset: 7488)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !571, file: !566, line: 175, baseType: !1132, size: 64, offset: 7552)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !571, file: !566, line: 177, baseType: !560, size: 64, offset: 7616)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !571, file: !566, line: 178, baseType: !923, size: 64, offset: 7680)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !571, file: !566, line: 179, baseType: !560, size: 64, offset: 7744)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !571, file: !566, line: 180, baseType: !589, size: 64, offset: 7808)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !571, file: !566, line: 181, baseType: !1278, size: 64, offset: 7872)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!361, !563, !365, !926, !927}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !571, file: !566, line: 183, baseType: !1189, size: 64, offset: 7936)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !571, file: !566, line: 184, baseType: !958, size: 64, offset: 8000)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !571, file: !566, line: 185, baseType: !1284, size: 64, offset: 8064)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!361, !563, !776}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !571, file: !566, line: 186, baseType: !1288, size: 64, offset: 8128)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!361, !563, !409, !577, !472}
