; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/qcg/qcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/qcg/qcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!122 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 155, baseType: !5, size: 32, elements: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!142 = !{!143, !144, !145, !146, !147}
!143 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!144 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!145 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!146 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!147 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156}
!150 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!151 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!152 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!153 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!154 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!155 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!156 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!157 = !{!158, !162, !163, !366, !198, !369, !221, !377, !380, !248, !26, !383, !224, !367, !332}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !159, line: 330, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !159, line: 330, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !166, line: 73, size: 4480, elements: !167)
!166 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!167 = !{!168, !170, !219, !220, !222, !225, !226, !227, !228, !236, !237, !239, !243, !247, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262, !264, !265, !267, !269, !270, !271, !272, !273, !276, !278, !279, !280, !281, !282, !285, !287, !288, !289, !299, !301, !302, !306, !307, !356, !361, !363, !364, !365}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !165, file: !166, line: 74, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !165, file: !166, line: 75, baseType: !171, size: 448, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 448, elements: !217)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !166, line: 53, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 45, size: 448, elements: !174)
!174 = !{!175, !181, !189, !194, !201, !205, !212}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !173, file: !166, line: 46, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !163, !180}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !173, file: !166, line: 47, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!179, !163, !185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !186, line: 16, baseType: !187)
!186 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !186, line: 16, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !173, file: !166, line: 48, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!179, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !173, file: !166, line: 49, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!179, !163, !198, !163}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !173, file: !166, line: 50, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!179, !163, !198, !193}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !173, file: !166, line: 51, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!179, !163, !198, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !173, file: !166, line: 52, baseType: !213, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!179, !163, !198, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!217 = !{!218}
!218 = !DISubrange(count: 1)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !165, file: !166, line: 76, baseType: !158, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !166, line: 77, baseType: !221, size: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !165, file: !166, line: 78, baseType: !223, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !224)
!224 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !165, file: !166, line: 78, baseType: !223, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !165, file: !166, line: 78, baseType: !223, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !165, file: !166, line: 78, baseType: !223, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !166, line: 79, baseType: !229, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !232, line: 27, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !234, line: 43, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!235 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !165, file: !166, line: 80, baseType: !221, size: 32, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !165, file: !166, line: 81, baseType: !238, size: 32, offset: 992)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !165, file: !166, line: 82, baseType: !240, size: 64, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !165, file: !166, line: 83, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !165, file: !166, line: 84, baseType: !248, size: 64, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !165, file: !166, line: 85, baseType: !248, size: 64, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !165, file: !166, line: 86, baseType: !248, size: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !165, file: !166, line: 87, baseType: !248, size: 64, offset: 1344)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !166, line: 88, baseType: !163, size: 64, offset: 1408)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !165, file: !166, line: 89, baseType: !229, size: 64, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !166, line: 90, baseType: !248, size: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !165, file: !166, line: 91, baseType: !248, size: 64, offset: 1600)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !165, file: !166, line: 92, baseType: !221, size: 32, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !165, file: !166, line: 93, baseType: !162, size: 64, offset: 1728)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !165, file: !166, line: 94, baseType: !259, size: 64, offset: 1792)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !230)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !165, file: !166, line: 95, baseType: !221, size: 32, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !165, file: !166, line: 95, baseType: !221, size: 32, offset: 1888)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !165, file: !166, line: 96, baseType: !263, size: 64, offset: 1920)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !165, file: !166, line: 96, baseType: !263, size: 64, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !165, file: !166, line: 97, baseType: !266, size: 64, offset: 2048)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !165, file: !166, line: 97, baseType: !268, size: 64, offset: 2112)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !165, file: !166, line: 98, baseType: !221, size: 32, offset: 2176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !165, file: !166, line: 98, baseType: !221, size: 32, offset: 2208)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !165, file: !166, line: 99, baseType: !263, size: 64, offset: 2240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !165, file: !166, line: 99, baseType: !263, size: 64, offset: 2304)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !165, file: !166, line: 100, baseType: !274, size: 64, offset: 2368)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !165, file: !166, line: 100, baseType: !277, size: 64, offset: 2432)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !165, file: !166, line: 101, baseType: !221, size: 32, offset: 2496)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !165, file: !166, line: 101, baseType: !221, size: 32, offset: 2528)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !165, file: !166, line: 102, baseType: !263, size: 64, offset: 2560)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !165, file: !166, line: 102, baseType: !263, size: 64, offset: 2624)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !165, file: !166, line: 103, baseType: !283, size: 64, offset: 2688)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !275)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !165, file: !166, line: 103, baseType: !286, size: 64, offset: 2752)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !165, file: !166, line: 104, baseType: !216, size: 64, offset: 2816)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !165, file: !166, line: 105, baseType: !221, size: 32, offset: 2880)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !165, file: !166, line: 106, baseType: !290, size: 128, offset: 2944)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !297)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !166, line: 64, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 61, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !293, file: !166, line: 62, baseType: !209, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !293, file: !166, line: 63, baseType: !162, size: 64, offset: 64)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !165, file: !166, line: 107, baseType: !300, size: 64, offset: 3072)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 64, elements: !297)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !165, file: !166, line: 108, baseType: !162, size: 64, offset: 3136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !165, file: !166, line: 109, baseType: !303, size: 64, offset: 3200)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!179, !162}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !165, file: !166, line: 111, baseType: !221, size: 32, offset: 3264)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !165, file: !166, line: 112, baseType: !308, size: 320, offset: 3328)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 320, elements: !354)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!179, !312, !163, !162}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !315)
!315 = !{!316, !317, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !314, file: !10, line: 100, baseType: !221, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !10, line: 101, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !329, !330, !331, !335, !337, !339, !340, !341}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !320, file: !10, line: 84, baseType: !248, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !320, file: !10, line: 85, baseType: !248, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !10, line: 86, baseType: !162, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !320, file: !10, line: 87, baseType: !240, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !320, file: !10, line: 88, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !320, file: !10, line: 89, baseType: !200, size: 8, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !320, file: !10, line: 90, baseType: !248, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !320, file: !10, line: 91, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !333, line: 46, baseType: !334)
!333 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!334 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !10, line: 92, baseType: !336, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !10, line: 93, baseType: !338, size: 32, offset: 544)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !10, line: 94, baseType: !318, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !320, file: !10, line: 95, baseType: !248, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !320, file: !10, line: 96, baseType: !162, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !314, file: !10, line: 102, baseType: !248, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !314, file: !10, line: 102, baseType: !248, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !314, file: !10, line: 103, baseType: !248, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !314, file: !10, line: 104, baseType: !158, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !314, file: !10, line: 106, baseType: !163, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !314, file: !10, line: 107, baseType: !351, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!354 = !{!355}
!355 = !DISubrange(count: 5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !165, file: !166, line: 113, baseType: !357, size: 320, offset: 3648)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !354)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!179, !163, !162}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !165, file: !166, line: 114, baseType: !362, size: 320, offset: 3968)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 320, elements: !354)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !165, file: !166, line: 115, baseType: !336, size: 32, offset: 4288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !165, file: !166, line: 120, baseType: !351, size: 64, offset: 4352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !165, file: !166, line: 121, baseType: !336, size: 32, offset: 4416)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !368, line: 1451, baseType: !209)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_QCG", file: !371, line: 14, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/qcg/qcgimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 10, size: 192, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "quadratic", scope: !372, file: !371, line: 11, baseType: !275, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ltsnrm", scope: !372, file: !371, line: 12, baseType: !275, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !372, file: !371, line: 13, baseType: !275, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !159, line: 331, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !159, line: 331, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !159, line: 338, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !159, line: 338, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !148)
!384 = !{i32 7, !"Dwarf Version", i32 4}
!385 = !{i32 2, !"Debug Info Version", i32 3}
!386 = !{i32 1, !"wchar_size", i32 4}
!387 = !{i32 7, !"PIC Level", i32 2}
!388 = !{i32 7, !"uwtable", i32 1}
!389 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!390 = distinct !DISubprogram(name: "KSPQCGSetTrustRegionRadius", scope: !391, file: !391, line: 21, type: !392, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !638)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/qcg/qcg.c", directory: "/home/users/ndemeye/xSDK")
!392 = !DISubroutineType(types: !393)
!393 = !{!179, !394, !275}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !397)
!397 = !{!398, !400, !453, !458, !459, !460, !461, !491, !492, !493, !494, !495, !497, !502, !503, !504, !505, !506, !507, !508, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !531, !537, !538, !539, !540, !545, !546, !547, !548, !553, !554, !555, !556, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !608, !609, !610, !611, !612, !619, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !635, !636, !637}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !396, file: !102, line: 76, baseType: !399, size: 4480)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !166, line: 122, baseType: !165)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !396, file: !102, line: 76, baseType: !401, size: 896, offset: 4480)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 896, elements: !217)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !403)
!403 = !{!404, !412, !416, !420, !428, !429, !433, !434, !438, !442, !446, !447, !451, !452}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !402, file: !102, line: 19, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!179, !394, !408, !411}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !141, line: 21, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !141, line: 21, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !402, file: !102, line: 22, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!179, !394, !408, !408, !411}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !402, file: !102, line: 25, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!179, !394}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !402, file: !102, line: 26, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!179, !394, !424, !424}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !425, line: 16, baseType: !426)
!425 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !425, line: 16, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !402, file: !102, line: 27, baseType: !417, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !402, file: !102, line: 28, baseType: !430, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!179, !312, !394}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !402, file: !102, line: 29, baseType: !417, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !402, file: !102, line: 30, baseType: !435, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!179, !394, !274, !274}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !402, file: !102, line: 31, baseType: !439, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!179, !394, !221, !274, !274, !266}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !402, file: !102, line: 32, baseType: !443, size: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!179, !394, !336, !336, !266, !411, !274, !274}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !402, file: !102, line: 33, baseType: !417, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !402, file: !102, line: 34, baseType: !448, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!179, !394, !185}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !402, file: !102, line: 35, baseType: !417, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !402, file: !102, line: 36, baseType: !448, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !396, file: !102, line: 77, baseType: !454, size: 64, offset: 5376)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !455, line: 14, baseType: !456)
!455 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !455, line: 14, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !396, file: !102, line: 78, baseType: !336, size: 32, offset: 5440)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !396, file: !102, line: 79, baseType: !336, size: 32, offset: 5472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !396, file: !102, line: 81, baseType: !221, size: 32, offset: 5504)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !396, file: !102, line: 82, baseType: !462, size: 64, offset: 5568)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !465)
!465 = !{!466, !467, !487, !488, !489, !490}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !464, file: !102, line: 55, baseType: !399, size: 4480)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !464, file: !102, line: 55, baseType: !468, size: 448, offset: 4480)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 448, elements: !217)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !470)
!470 = !{!471, !475, !476, !480, !481, !482, !486}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !469, file: !102, line: 42, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!179, !462, !408, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !469, file: !102, line: 43, baseType: !472, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !469, file: !102, line: 44, baseType: !477, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!179, !462}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !469, file: !102, line: 45, baseType: !477, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !469, file: !102, line: 46, baseType: !477, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !469, file: !102, line: 47, baseType: !483, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!179, !462, !185}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !469, file: !102, line: 48, baseType: !477, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !464, file: !102, line: 56, baseType: !394, size: 64, offset: 4928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !464, file: !102, line: 57, baseType: !424, size: 64, offset: 4992)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !464, file: !102, line: 58, baseType: !259, size: 64, offset: 5056)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !102, line: 59, baseType: !162, size: 64, offset: 5120)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !396, file: !102, line: 83, baseType: !336, size: 32, offset: 5632)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !396, file: !102, line: 84, baseType: !336, size: 32, offset: 5664)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !396, file: !102, line: 85, baseType: !336, size: 32, offset: 5696)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !396, file: !102, line: 86, baseType: !336, size: 32, offset: 5728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !396, file: !102, line: 87, baseType: !496, size: 32, offset: 5760)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !396, file: !102, line: 88, baseType: !498, size: 384, offset: 5792)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 384, elements: !499)
!499 = !{!500, !501}
!500 = !DISubrange(count: 4)
!501 = !DISubrange(count: 3)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !396, file: !102, line: 89, baseType: !275, size: 64, offset: 6208)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !396, file: !102, line: 90, baseType: !275, size: 64, offset: 6272)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !396, file: !102, line: 91, baseType: !275, size: 64, offset: 6336)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !396, file: !102, line: 92, baseType: !275, size: 64, offset: 6400)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !396, file: !102, line: 93, baseType: !275, size: 64, offset: 6464)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !396, file: !102, line: 94, baseType: !275, size: 64, offset: 6528)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !396, file: !102, line: 95, baseType: !509, size: 32, offset: 6592)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !396, file: !102, line: 96, baseType: !336, size: 32, offset: 6624)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !396, file: !102, line: 98, baseType: !408, size: 64, offset: 6656)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !396, file: !102, line: 98, baseType: !408, size: 64, offset: 6720)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !396, file: !102, line: 102, baseType: !274, size: 64, offset: 6784)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !396, file: !102, line: 103, baseType: !274, size: 64, offset: 6848)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !396, file: !102, line: 104, baseType: !221, size: 32, offset: 6912)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !396, file: !102, line: 105, baseType: !221, size: 32, offset: 6944)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !396, file: !102, line: 106, baseType: !336, size: 32, offset: 6976)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !396, file: !102, line: 107, baseType: !274, size: 64, offset: 7040)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !396, file: !102, line: 108, baseType: !274, size: 64, offset: 7104)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !396, file: !102, line: 109, baseType: !221, size: 32, offset: 7168)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !396, file: !102, line: 110, baseType: !221, size: 32, offset: 7200)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !396, file: !102, line: 111, baseType: !336, size: 32, offset: 7232)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !396, file: !102, line: 113, baseType: !221, size: 32, offset: 7264)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !396, file: !102, line: 114, baseType: !336, size: 32, offset: 7296)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !396, file: !102, line: 117, baseType: !221, size: 32, offset: 7328)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !396, file: !102, line: 120, baseType: !527, size: 320, offset: 7360)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !354)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!179, !394, !221, !275, !162}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !396, file: !102, line: 121, baseType: !532, size: 320, offset: 7680)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !354)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!179, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !396, file: !102, line: 122, baseType: !362, size: 320, offset: 8000)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !396, file: !102, line: 123, baseType: !221, size: 32, offset: 8320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !396, file: !102, line: 124, baseType: !336, size: 32, offset: 8352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !396, file: !102, line: 126, baseType: !541, size: 320, offset: 8384)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !354)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!179, !394, !162}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !396, file: !102, line: 127, baseType: !532, size: 320, offset: 8704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !396, file: !102, line: 128, baseType: !362, size: 320, offset: 9024)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !396, file: !102, line: 129, baseType: !221, size: 32, offset: 9344)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !396, file: !102, line: 131, baseType: !549, size: 64, offset: 9408)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!179, !394, !221, !275, !552, !162}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !396, file: !102, line: 132, baseType: !303, size: 64, offset: 9472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !396, file: !102, line: 133, baseType: !162, size: 64, offset: 9536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !396, file: !102, line: 135, baseType: !162, size: 64, offset: 9600)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !396, file: !102, line: 137, baseType: !557, size: 64, offset: 9664)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !102, line: 139, baseType: !162, size: 64, offset: 9728)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9792)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9824)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9888)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9952)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 9984)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10016)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10048)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10080)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10176)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !396, file: !102, line: 142, baseType: !336, size: 32, offset: 10208)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10624)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10688)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10752)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10816)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10880)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 10944)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 11008)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !396, file: !102, line: 143, baseType: !185, size: 64, offset: 11072)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11136)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11168)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11200)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11232)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11264)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11296)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11328)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11360)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11392)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11424)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11456)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11488)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11520)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !396, file: !102, line: 144, baseType: !590, size: 32, offset: 11552)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !396, file: !102, line: 147, baseType: !221, size: 32, offset: 11584)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !396, file: !102, line: 148, baseType: !411, size: 64, offset: 11648)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !396, file: !102, line: 150, baseType: !607, size: 32, offset: 11712)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !396, file: !102, line: 151, baseType: !336, size: 32, offset: 11744)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !396, file: !102, line: 153, baseType: !221, size: 32, offset: 11776)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !396, file: !102, line: 154, baseType: !221, size: 32, offset: 11808)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !396, file: !102, line: 156, baseType: !336, size: 32, offset: 11840)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !396, file: !102, line: 161, baseType: !613, size: 192, offset: 11904)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !396, file: !102, line: 157, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !613, file: !102, line: 158, baseType: !424, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !613, file: !102, line: 158, baseType: !424, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !613, file: !102, line: 159, baseType: !336, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !613, file: !102, line: 160, baseType: !336, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !396, file: !102, line: 163, baseType: !620, size: 32, offset: 12096)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !396, file: !102, line: 165, baseType: !496, size: 32, offset: 12128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !396, file: !102, line: 166, baseType: !620, size: 32, offset: 12160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !396, file: !102, line: 171, baseType: !336, size: 32, offset: 12192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !396, file: !102, line: 172, baseType: !336, size: 32, offset: 12224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !396, file: !102, line: 173, baseType: !336, size: 32, offset: 12256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !396, file: !102, line: 174, baseType: !408, size: 64, offset: 12288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !396, file: !102, line: 175, baseType: !408, size: 64, offset: 12352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !396, file: !102, line: 177, baseType: !221, size: 32, offset: 12416)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !396, file: !102, line: 178, baseType: !336, size: 32, offset: 12448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !396, file: !102, line: 180, baseType: !185, size: 64, offset: 12480)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !396, file: !102, line: 182, baseType: !632, size: 64, offset: 12544)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!179, !394, !408, !408, !162}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !396, file: !102, line: 183, baseType: !632, size: 64, offset: 12608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !396, file: !102, line: 184, baseType: !162, size: 64, offset: 12672)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !396, file: !102, line: 184, baseType: !162, size: 64, offset: 12736)
!638 = !{!639, !640, !641, !642, !645, !646, !648, !652}
!639 = !DILocalVariable(name: "ksp", arg: 1, scope: !390, file: !391, line: 21, type: !394)
!640 = !DILocalVariable(name: "delta", arg: 2, scope: !390, file: !391, line: 21, type: !275)
!641 = !DILocalVariable(name: "ierr", scope: !390, file: !391, line: 23, type: !179)
!642 = !DILocalVariable(name: "_7_f", scope: !643, file: !391, line: 28, type: !644)
!643 = distinct !DILexicalBlock(scope: !390, file: !391, line: 28, column: 10)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!645 = !DILocalVariable(name: "_7_ierr", scope: !643, file: !391, line: 28, type: !179)
!646 = !DILocalVariable(name: "ierr__", scope: !647, file: !391, line: 28, type: !179)
!647 = distinct !DILexicalBlock(scope: !643, file: !391, line: 28, column: 10)
!648 = !DILocalVariable(name: "ierr__", scope: !649, file: !391, line: 28, type: !179)
!649 = distinct !DILexicalBlock(scope: !650, file: !391, line: 28, column: 10)
!650 = distinct !DILexicalBlock(scope: !651, file: !391, line: 28, column: 10)
!651 = distinct !DILexicalBlock(scope: !643, file: !391, line: 28, column: 10)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !391, line: 28, type: !179)
!653 = distinct !DILexicalBlock(scope: !390, file: !391, line: 28, column: 89)
!654 = !DILocation(line: 0, scope: !390)
!655 = !DILocation(line: 25, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !391, line: 25, column: 3)
!657 = distinct !DILexicalBlock(scope: !658, file: !391, line: 25, column: 3)
!658 = distinct !DILexicalBlock(scope: !390, file: !391, line: 25, column: 3)
!659 = !{!660, !660, i64 0}
!660 = !{!"any pointer", !661, i64 0}
!661 = !{!"omnipotent char", !662, i64 0}
!662 = !{!"Simple C/C++ TBAA"}
!663 = !DILocation(line: 25, column: 3, scope: !657)
!664 = !DILocation(line: 25, column: 3, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !391, line: 25, column: 3)
!666 = distinct !DILexicalBlock(scope: !656, file: !391, line: 25, column: 3)
!667 = !{!668, !669, i64 1536}
!668 = !{!"", !661, i64 0, !661, i64 512, !661, i64 1024, !661, i64 1280, !669, i64 1536, !669, i64 1540, !661, i64 1544}
!669 = !{!"int", !661, i64 0}
!670 = !DILocation(line: 25, column: 3, scope: !666)
!671 = !DILocation(line: 25, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !665, file: !391, line: 25, column: 3)
!673 = !{!669, !669, i64 0}
!674 = !{!668, !669, i64 1540}
!675 = !DILocation(line: 26, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !391, line: 26, column: 3)
!677 = distinct !DILexicalBlock(scope: !390, file: !391, line: 26, column: 3)
!678 = !DILocation(line: 26, column: 3, scope: !677)
!679 = !DILocation(line: 26, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !391, line: 26, column: 3)
!681 = !DILocation(line: 26, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !677, file: !391, line: 26, column: 3)
!683 = !{!684, !669, i64 0}
!684 = !{!"_p_PetscObject", !669, i64 0, !661, i64 8, !660, i64 64, !669, i64 72, !685, i64 80, !685, i64 88, !685, i64 96, !685, i64 104, !686, i64 112, !669, i64 120, !669, i64 124, !660, i64 128, !660, i64 136, !660, i64 144, !660, i64 152, !660, i64 160, !660, i64 168, !660, i64 176, !686, i64 184, !660, i64 192, !660, i64 200, !669, i64 208, !660, i64 216, !686, i64 224, !669, i64 232, !669, i64 236, !660, i64 240, !660, i64 248, !660, i64 256, !660, i64 264, !669, i64 272, !669, i64 276, !660, i64 280, !660, i64 288, !660, i64 296, !660, i64 304, !669, i64 312, !669, i64 316, !660, i64 320, !660, i64 328, !660, i64 336, !660, i64 344, !660, i64 352, !669, i64 360, !661, i64 368, !661, i64 384, !660, i64 392, !660, i64 400, !669, i64 408, !661, i64 416, !661, i64 456, !661, i64 496, !661, i64 536, !660, i64 544, !661, i64 552}
