; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/impls/hem/hem.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/impls/hem/hem.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._PetscCoarsenData = type { %struct._PetscCDArrNd, %struct._PetscCDIntNd*, i32, i32, %struct._PetscCDIntNd*, %struct._PetscCDIntNd**, i32, %struct._p_Mat* }
%struct._PetscCDArrNd = type { %struct._PetscCDArrNd*, %struct._PetscCDIntNd* }
%struct._PetscCDIntNd = type { %struct._PetscCDIntNd*, i32 }
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!309 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!310 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!311 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!312 = !{!313, !316, !320, !321, !324, !325, !334, !72, !335, !336, !530, !1345, !452, !407, !333, !1133, !434, !1197, !1445, !1448, !392, !5}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !314, line: 46, baseType: !315)
!314 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!315 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !317, line: 330, baseType: !318)
!317 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !317, line: 330, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCDIntNd", file: !327, line: 35, baseType: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmatcoarsen.h", directory: "/home/users/ndemeye/xSDK")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscCDIntNd", file: !327, line: 32, size: 128, elements: !329)
!329 = !{!330, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !327, line: 33, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !328, file: !327, line: 34, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !339, line: 73, size: 4480, elements: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!340 = !{!341, !343, !389, !390, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !428, !429, !430, !432, !433, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !449, !450, !453, !455, !456, !457, !467, !469, !470, !474, !475, !520, !525, !527, !528, !529}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !338, file: !339, line: 74, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !338, file: !339, line: 75, baseType: !344, size: 448, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 448, elements: !387)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !339, line: 53, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 45, size: 448, elements: !347)
!347 = !{!348, !354, !362, !367, !371, !375, !382}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !346, file: !339, line: 46, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !336, !353}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !339, line: 47, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!352, !336, !358}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !359, line: 16, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !359, line: 16, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !339, line: 48, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!352, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !346, file: !339, line: 49, baseType: !368, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!352, !336, !321, !336}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !346, file: !339, line: 50, baseType: !372, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!352, !336, !321, !366}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !346, file: !339, line: 51, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!352, !336, !321, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !346, file: !339, line: 52, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!352, !336, !321, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!387 = !{!388}
!388 = !DISubrange(count: 1)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !338, file: !339, line: 76, baseType: !316, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !339, line: 77, baseType: !333, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !338, file: !339, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !338, file: !339, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !338, file: !339, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !338, file: !339, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !339, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !338, file: !339, line: 80, baseType: !333, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !338, file: !339, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !338, file: !339, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !338, file: !339, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !338, file: !339, line: 84, baseType: !334, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !338, file: !339, line: 85, baseType: !334, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !338, file: !339, line: 86, baseType: !334, size: 64, offset: 1280)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !338, file: !339, line: 87, baseType: !334, size: 64, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !339, line: 88, baseType: !336, size: 64, offset: 1408)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !338, file: !339, line: 89, baseType: !398, size: 64, offset: 1472)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !339, line: 90, baseType: !334, size: 64, offset: 1536)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !338, file: !339, line: 91, baseType: !334, size: 64, offset: 1600)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !338, file: !339, line: 92, baseType: !333, size: 32, offset: 1664)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !338, file: !339, line: 93, baseType: !320, size: 64, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !339, line: 94, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !399)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !338, file: !339, line: 95, baseType: !333, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !338, file: !339, line: 95, baseType: !333, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !338, file: !339, line: 96, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !338, file: !339, line: 96, baseType: !431, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !338, file: !339, line: 97, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !338, file: !339, line: 97, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !338, file: !339, line: 98, baseType: !333, size: 32, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !338, file: !339, line: 98, baseType: !333, size: 32, offset: 2208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !338, file: !339, line: 99, baseType: !431, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !338, file: !339, line: 99, baseType: !431, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !338, file: !339, line: 100, baseType: !442, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !338, file: !339, line: 100, baseType: !445, size: 64, offset: 2432)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !338, file: !339, line: 101, baseType: !333, size: 32, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !338, file: !339, line: 101, baseType: !333, size: 32, offset: 2528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !338, file: !339, line: 102, baseType: !431, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !338, file: !339, line: 102, baseType: !431, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !338, file: !339, line: 103, baseType: !451, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !443)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !338, file: !339, line: 103, baseType: !454, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !338, file: !339, line: 104, baseType: !386, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !338, file: !339, line: 105, baseType: !333, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !338, file: !339, line: 106, baseType: !458, size: 128, offset: 2944)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !465)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !339, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 61, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !339, line: 62, baseType: !379, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !461, file: !339, line: 63, baseType: !320, size: 64, offset: 64)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !338, file: !339, line: 107, baseType: !468, size: 64, offset: 3072)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !465)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !338, file: !339, line: 108, baseType: !320, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !338, file: !339, line: 109, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!352, !320}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !338, file: !339, line: 111, baseType: !333, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !338, file: !339, line: 112, baseType: !476, size: 320, offset: 3328)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !518)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!352, !480, !336, !320}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !483)
!483 = !{!484, !485, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !10, line: 100, baseType: !333, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 101, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !497, !498, !499, !500, !501, !503, !504, !505}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !488, file: !10, line: 84, baseType: !334, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !488, file: !10, line: 85, baseType: !334, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !10, line: 86, baseType: !320, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !488, file: !10, line: 87, baseType: !409, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !488, file: !10, line: 88, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !488, file: !10, line: 89, baseType: !323, size: 8, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !488, file: !10, line: 90, baseType: !334, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !488, file: !10, line: 91, baseType: !313, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !10, line: 92, baseType: !335, size: 32, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !10, line: 93, baseType: !502, size: 32, offset: 544)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 94, baseType: !486, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !488, file: !10, line: 95, baseType: !334, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !488, file: !10, line: 96, baseType: !320, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !482, file: !10, line: 102, baseType: !334, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !482, file: !10, line: 102, baseType: !334, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !482, file: !10, line: 103, baseType: !334, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !482, file: !10, line: 104, baseType: !316, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !482, file: !10, line: 105, baseType: !335, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !482, file: !10, line: 105, baseType: !335, size: 32, offset: 416)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !482, file: !10, line: 105, baseType: !335, size: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !482, file: !10, line: 106, baseType: !336, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !482, file: !10, line: 107, baseType: !515, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!518 = !{!519}
!519 = !DISubrange(count: 5)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !338, file: !339, line: 113, baseType: !521, size: 320, offset: 3648)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!352, !336, !320}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !338, file: !339, line: 114, baseType: !526, size: 320, offset: 3968)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 320, elements: !518)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !338, file: !339, line: 115, baseType: !335, size: 32, offset: 4288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !338, file: !339, line: 120, baseType: !515, size: 64, offset: 4352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !338, file: !339, line: 121, baseType: !335, size: 32, offset: 4416)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !532, line: 70, baseType: !533)
!532 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 34, size: 1344, elements: !534)
!534 = !{!535, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1330, !1331, !1332, !1333, !1339, !1340, !1341, !1342, !1343, !1344}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !533, file: !532, line: 35, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !539, line: 436, size: 23424, elements: !540)
!539 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!540 = !{!541, !543, !1050, !1070, !1071, !1072, !1074, !1075, !1076, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1203, !1204, !1220, !1221, !1222, !1223, !1224, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1259, !1279, !1280, !1282, !1283, !1284, !1285, !1286, !1287, !1305, !1306}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !538, file: !539, line: 437, baseType: !542, size: 4480)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !339, line: 122, baseType: !338)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !538, file: !539, line: 437, baseType: !544, size: 9472, offset: 4480)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 9472, elements: !387)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !539, line: 32, size: 9472, elements: !546)
!546 = !{!547, !556, !560, !561, !568, !572, !573, !574, !575, !576, !577, !578, !602, !606, !611, !617, !636, !641, !645, !646, !651, !656, !657, !662, !666, !670, !674, !678, !682, !683, !684, !685, !686, !690, !691, !696, !697, !698, !699, !700, !705, !712, !717, !721, !725, !729, !733, !734, !738, !739, !746, !751, !752, !753, !754, !816, !824, !825, !829, !830, !834, !835, !839, !844, !845, !849, !853, !860, !861, !862, !863, !864, !865, !870, !871, !875, !879, !883, !884, !885, !889, !899, !900, !904, !905, !909, !910, !914, !915, !920, !921, !925, !929, !930, !931, !932, !933, !934, !935, !939, !940, !941, !942, !943, !944, !948, !949, !950, !951, !952, !953, !954, !955, !959, !963, !964, !965, !969, !970, !971, !972, !973, !974, !975, !979, !980, !981, !986, !990, !991, !995, !996, !997, !998, !1024, !1028, !1029, !1030, !1031, !1032, !1036, !1037, !1038, !1039, !1040, !1044, !1048, !1049}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !545, file: !539, line: 34, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!352, !536, !333, !551, !333, !551, !553, !555}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !545, file: !539, line: 35, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!352, !536, !333, !434, !436, !454}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !545, file: !539, line: 36, baseType: !557, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !545, file: !539, line: 37, baseType: !562, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!352, !536, !565, !565}
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !545, file: !539, line: 38, baseType: !569, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!352, !536, !565, !565, !565}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !545, file: !539, line: 40, baseType: !562, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !545, file: !539, line: 41, baseType: !569, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !545, file: !539, line: 42, baseType: !562, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !545, file: !539, line: 43, baseType: !569, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !545, file: !539, line: 44, baseType: !562, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !545, file: !539, line: 46, baseType: !569, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !545, file: !539, line: 47, baseType: !579, size: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!352, !536, !582, !582, !586}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !583, line: 11, baseType: !584)
!583 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !583, line: 11, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !589, file: !36, line: 1227, baseType: !443, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !589, file: !36, line: 1228, baseType: !443, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !589, file: !36, line: 1229, baseType: !443, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !589, file: !36, line: 1230, baseType: !443, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !589, file: !36, line: 1231, baseType: !443, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !589, file: !36, line: 1232, baseType: !443, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !589, file: !36, line: 1233, baseType: !443, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !589, file: !36, line: 1234, baseType: !443, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !589, file: !36, line: 1236, baseType: !443, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !589, file: !36, line: 1237, baseType: !443, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !589, file: !36, line: 1238, baseType: !443, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !545, file: !539, line: 48, baseType: !603, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!352, !536, !582, !586}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !545, file: !539, line: 49, baseType: !607, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!352, !536, !565, !443, !610, !443, !333, !333, !565}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !545, file: !539, line: 50, baseType: !612, size: 64, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!352, !536, !615, !616}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !545, file: !539, line: 52, baseType: !618, size: 64, offset: 960)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!352, !536, !621, !622}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !624, file: !36, line: 593, baseType: !392, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !624, file: !36, line: 594, baseType: !392, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !624, file: !36, line: 594, baseType: !392, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !624, file: !36, line: 594, baseType: !392, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !624, file: !36, line: 595, baseType: !392, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !624, file: !36, line: 596, baseType: !392, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !624, file: !36, line: 597, baseType: !392, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !624, file: !36, line: 598, baseType: !392, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !624, file: !36, line: 598, baseType: !392, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !624, file: !36, line: 599, baseType: !392, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !545, file: !539, line: 53, baseType: !637, size: 64, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!352, !536, !536, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !545, file: !539, line: 54, baseType: !642, size: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!352, !536, !565}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !545, file: !539, line: 55, baseType: !562, size: 64, offset: 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !545, file: !539, line: 56, baseType: !647, size: 64, offset: 1216)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!352, !536, !650, !442}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !545, file: !539, line: 58, baseType: !652, size: 64, offset: 1280)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!352, !536, !655}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !545, file: !539, line: 59, baseType: !652, size: 64, offset: 1344)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !545, file: !539, line: 60, baseType: !658, size: 64, offset: 1408)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!352, !536, !661, !335}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !545, file: !539, line: 61, baseType: !663, size: 64, offset: 1472)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!352, !536}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !545, file: !539, line: 63, baseType: !667, size: 64, offset: 1536)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!352, !536, !333, !551, !452, !565, !565}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !545, file: !539, line: 64, baseType: !671, size: 64, offset: 1600)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!352, !536, !536, !582, !582, !586}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !545, file: !539, line: 65, baseType: !675, size: 64, offset: 1664)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!352, !536, !536, !586}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !545, file: !539, line: 66, baseType: !679, size: 64, offset: 1728)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!352, !536, !536, !582, !586}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !545, file: !539, line: 67, baseType: !675, size: 64, offset: 1792)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !545, file: !539, line: 69, baseType: !663, size: 64, offset: 1856)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !545, file: !539, line: 70, baseType: !671, size: 64, offset: 1920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !545, file: !539, line: 71, baseType: !679, size: 64, offset: 1984)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !545, file: !539, line: 72, baseType: !687, size: 64, offset: 2048)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!352, !536, !616}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !545, file: !539, line: 73, baseType: !663, size: 64, offset: 2112)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !545, file: !539, line: 75, baseType: !692, size: 64, offset: 2176)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!352, !536, !695, !616}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !545, file: !539, line: 76, baseType: !562, size: 64, offset: 2240)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !545, file: !539, line: 77, baseType: !562, size: 64, offset: 2304)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !545, file: !539, line: 78, baseType: !579, size: 64, offset: 2368)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !545, file: !539, line: 79, baseType: !603, size: 64, offset: 2432)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !545, file: !539, line: 81, baseType: !701, size: 64, offset: 2496)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!352, !536, !452, !536, !704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !545, file: !539, line: 82, baseType: !706, size: 64, offset: 2560)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!352, !536, !333, !709, !709, !615, !711}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !545, file: !539, line: 83, baseType: !713, size: 64, offset: 2624)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!352, !536, !333, !716, !333}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !545, file: !539, line: 84, baseType: !718, size: 64, offset: 2688)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!352, !536, !333, !551, !333, !551, !451}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !545, file: !539, line: 85, baseType: !722, size: 64, offset: 2752)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!352, !536, !536, !704}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !545, file: !539, line: 87, baseType: !726, size: 64, offset: 2816)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!352, !536, !565, !434}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !545, file: !539, line: 88, baseType: !730, size: 64, offset: 2880)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!352, !536, !452}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !545, file: !539, line: 89, baseType: !730, size: 64, offset: 2944)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !545, file: !539, line: 90, baseType: !735, size: 64, offset: 3008)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!352, !536, !565, !555}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !545, file: !539, line: 91, baseType: !667, size: 64, offset: 3072)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !545, file: !539, line: 93, baseType: !740, size: 64, offset: 3136)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!352, !536, !743}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !545, file: !539, line: 94, baseType: !747, size: 64, offset: 3200)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!352, !536, !333, !335, !335, !434, !750, !750, !640}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !545, file: !539, line: 95, baseType: !747, size: 64, offset: 3264)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !545, file: !539, line: 96, baseType: !747, size: 64, offset: 3328)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !545, file: !539, line: 97, baseType: !747, size: 64, offset: 3392)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !545, file: !539, line: 99, baseType: !755, size: 64, offset: 3456)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!352, !536, !758, !761}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !583, line: 51, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !583, line: 51, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !539, line: 609, size: 6208, elements: !764)
!764 = !{!765, !766, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !785, !792, !793, !794, !795, !796, !797, !798, !799, !803, !804, !805, !806, !807, !809, !810, !811, !812, !813, !814, !815}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !763, file: !539, line: 610, baseType: !542, size: 4480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !763, file: !539, line: 610, baseType: !767, size: 32, offset: 4480)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !387)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !763, file: !539, line: 611, baseType: !333, size: 32, offset: 4512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !763, file: !539, line: 611, baseType: !333, size: 32, offset: 4544)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !763, file: !539, line: 611, baseType: !333, size: 32, offset: 4576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !763, file: !539, line: 612, baseType: !333, size: 32, offset: 4608)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !763, file: !539, line: 613, baseType: !333, size: 32, offset: 4640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !763, file: !539, line: 614, baseType: !434, size: 64, offset: 4672)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !763, file: !539, line: 615, baseType: !436, size: 64, offset: 4736)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !763, file: !539, line: 616, baseType: !716, size: 64, offset: 4800)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !763, file: !539, line: 617, baseType: !434, size: 64, offset: 4864)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !763, file: !539, line: 618, baseType: !778, size: 64, offset: 4928)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !539, line: 602, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 598, size: 128, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !780, file: !539, line: 599, baseType: !333, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !780, file: !539, line: 600, baseType: !333, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !780, file: !539, line: 601, baseType: !451, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !763, file: !539, line: 619, baseType: !786, size: 64, offset: 4992)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !539, line: 607, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 604, size: 128, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !788, file: !539, line: 605, baseType: !333, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !788, file: !539, line: 606, baseType: !451, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !763, file: !539, line: 620, baseType: !451, size: 64, offset: 5056)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !763, file: !539, line: 621, baseType: !443, size: 64, offset: 5120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !763, file: !539, line: 622, baseType: !443, size: 64, offset: 5184)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !763, file: !539, line: 623, baseType: !565, size: 64, offset: 5248)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !763, file: !539, line: 623, baseType: !565, size: 64, offset: 5312)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !763, file: !539, line: 623, baseType: !565, size: 64, offset: 5376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !763, file: !539, line: 624, baseType: !335, size: 32, offset: 5440)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !763, file: !539, line: 625, baseType: !800, size: 64, offset: 5504)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!352}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !763, file: !539, line: 626, baseType: !320, size: 64, offset: 5568)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !763, file: !539, line: 627, baseType: !565, size: 64, offset: 5632)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !763, file: !539, line: 628, baseType: !333, size: 32, offset: 5696)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !763, file: !539, line: 629, baseType: !321, size: 64, offset: 5760)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !763, file: !539, line: 630, baseType: !808, size: 32, offset: 5824)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !763, file: !539, line: 631, baseType: !333, size: 32, offset: 5856)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !763, file: !539, line: 631, baseType: !333, size: 32, offset: 5888)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !763, file: !539, line: 632, baseType: !335, size: 32, offset: 5920)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !763, file: !539, line: 633, baseType: !335, size: 32, offset: 5952)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !763, file: !539, line: 634, baseType: !379, size: 64, offset: 6016)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !763, file: !539, line: 634, baseType: !320, size: 64, offset: 6080)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !763, file: !539, line: 635, baseType: !398, size: 64, offset: 6144)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !545, file: !539, line: 100, baseType: !817, size: 64, offset: 3520)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!352, !536, !333, !333, !820, !823}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !822)
!822 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !545, file: !539, line: 101, baseType: !663, size: 64, offset: 3584)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !545, file: !539, line: 102, baseType: !826, size: 64, offset: 3648)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!352, !536, !582, !582, !616}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !545, file: !539, line: 103, baseType: !548, size: 64, offset: 3712)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !545, file: !539, line: 105, baseType: !831, size: 64, offset: 3776)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!352, !536, !582, !582, !615, !616}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !545, file: !539, line: 106, baseType: !663, size: 64, offset: 3840)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !545, file: !539, line: 107, baseType: !836, size: 64, offset: 3904)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!352, !536, !358}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !545, file: !539, line: 108, baseType: !840, size: 64, offset: 3968)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!352, !536, !843, !615, !616}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !321)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !545, file: !539, line: 109, baseType: !800, size: 64, offset: 4032)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !545, file: !539, line: 111, baseType: !846, size: 64, offset: 4096)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!352, !536, !536, !536, !443, !536}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !545, file: !539, line: 112, baseType: !850, size: 64, offset: 4160)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!352, !536, !536, !536, !536}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !545, file: !539, line: 113, baseType: !854, size: 64, offset: 4224)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!352, !536, !857, !857}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !583, line: 30, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !583, line: 30, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !545, file: !539, line: 114, baseType: !548, size: 64, offset: 4288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !545, file: !539, line: 115, baseType: !667, size: 64, offset: 4352)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !545, file: !539, line: 117, baseType: !726, size: 64, offset: 4416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !545, file: !539, line: 118, baseType: !726, size: 64, offset: 4480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !545, file: !539, line: 119, baseType: !840, size: 64, offset: 4544)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !545, file: !539, line: 120, baseType: !866, size: 64, offset: 4608)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!352, !536, !869, !640}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !545, file: !539, line: 121, baseType: !800, size: 64, offset: 4672)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !545, file: !539, line: 123, baseType: !872, size: 64, offset: 4736)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!352, !536, !333, !320}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !545, file: !539, line: 124, baseType: !876, size: 64, offset: 4800)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!352, !536, !761, !565, !320}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !545, file: !539, line: 125, baseType: !880, size: 64, offset: 4864)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!352, !480, !536}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !545, file: !539, line: 126, baseType: !562, size: 64, offset: 4928)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !545, file: !539, line: 127, baseType: !562, size: 64, offset: 4992)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !545, file: !539, line: 129, baseType: !886, size: 64, offset: 5056)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!352, !536, !716}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !545, file: !539, line: 130, baseType: !890, size: 64, offset: 5120)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!352, !536, !893, !893}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !895, file: !60, line: 653, baseType: !333, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !895, file: !60, line: 653, baseType: !565, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !545, file: !539, line: 131, baseType: !890, size: 64, offset: 5184)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !545, file: !539, line: 132, baseType: !901, size: 64, offset: 5248)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!352, !536, !434, !434, !434}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !545, file: !539, line: 133, baseType: !836, size: 64, offset: 5312)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !545, file: !539, line: 135, baseType: !906, size: 64, offset: 5376)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!352, !536, !443, !640}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !545, file: !539, line: 136, baseType: !906, size: 64, offset: 5440)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !545, file: !539, line: 137, baseType: !911, size: 64, offset: 5504)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!352, !536, !640}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !545, file: !539, line: 138, baseType: !548, size: 64, offset: 5568)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !545, file: !539, line: 139, baseType: !916, size: 64, offset: 5632)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!352, !536, !919, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !545, file: !539, line: 141, baseType: !800, size: 64, offset: 5696)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !545, file: !539, line: 142, baseType: !922, size: 64, offset: 5760)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!352, !536, !536, !443, !536}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !545, file: !539, line: 143, baseType: !926, size: 64, offset: 5824)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!352, !536, !536, !536}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !545, file: !539, line: 144, baseType: !800, size: 64, offset: 5888)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !545, file: !539, line: 145, baseType: !922, size: 64, offset: 5952)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !545, file: !539, line: 147, baseType: !926, size: 64, offset: 6016)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !545, file: !539, line: 148, baseType: !800, size: 64, offset: 6080)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !545, file: !539, line: 149, baseType: !922, size: 64, offset: 6144)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !545, file: !539, line: 150, baseType: !926, size: 64, offset: 6208)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !545, file: !539, line: 151, baseType: !936, size: 64, offset: 6272)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!352, !536, !335}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !545, file: !539, line: 153, baseType: !663, size: 64, offset: 6336)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !545, file: !539, line: 154, baseType: !663, size: 64, offset: 6400)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !545, file: !539, line: 155, baseType: !663, size: 64, offset: 6464)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !545, file: !539, line: 156, baseType: !663, size: 64, offset: 6528)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !545, file: !539, line: 157, baseType: !836, size: 64, offset: 6592)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !545, file: !539, line: 159, baseType: !945, size: 64, offset: 6656)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!352, !536, !333, !553}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !545, file: !539, line: 160, baseType: !663, size: 64, offset: 6720)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !545, file: !539, line: 161, baseType: !663, size: 64, offset: 6784)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !545, file: !539, line: 162, baseType: !663, size: 64, offset: 6848)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !545, file: !539, line: 163, baseType: !663, size: 64, offset: 6912)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !545, file: !539, line: 165, baseType: !926, size: 64, offset: 6976)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !545, file: !539, line: 166, baseType: !926, size: 64, offset: 7040)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !545, file: !539, line: 167, baseType: !726, size: 64, offset: 7104)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !545, file: !539, line: 168, baseType: !956, size: 64, offset: 7168)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!352, !536, !565, !333}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !545, file: !539, line: 169, baseType: !960, size: 64, offset: 7232)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!352, !536, !640, !434}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !545, file: !539, line: 171, baseType: !687, size: 64, offset: 7296)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !545, file: !539, line: 172, baseType: !663, size: 64, offset: 7360)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !545, file: !539, line: 173, baseType: !966, size: 64, offset: 7424)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!352, !536, !434, !750}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !545, file: !539, line: 174, baseType: !826, size: 64, offset: 7488)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !545, file: !539, line: 175, baseType: !826, size: 64, offset: 7552)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !545, file: !539, line: 177, baseType: !562, size: 64, offset: 7616)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !545, file: !539, line: 178, baseType: !612, size: 64, offset: 7680)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !545, file: !539, line: 179, baseType: !562, size: 64, offset: 7744)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !545, file: !539, line: 180, baseType: !569, size: 64, offset: 7808)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !545, file: !539, line: 181, baseType: !976, size: 64, offset: 7872)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!352, !536, !316, !615, !616}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !545, file: !539, line: 183, baseType: !886, size: 64, offset: 7936)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !545, file: !539, line: 184, baseType: !647, size: 64, offset: 8000)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !545, file: !539, line: 185, baseType: !982, size: 64, offset: 8064)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!352, !536, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !545, file: !539, line: 186, baseType: !987, size: 64, offset: 8128)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!352, !536, !333, !551, !451}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !545, file: !539, line: 187, baseType: !706, size: 64, offset: 8192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !545, file: !539, line: 189, baseType: !992, size: 64, offset: 8256)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!352, !536, !333, !333, !434, !553}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !545, file: !539, line: 190, baseType: !800, size: 64, offset: 8320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !545, file: !539, line: 191, baseType: !922, size: 64, offset: 8384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !545, file: !539, line: 192, baseType: !926, size: 64, offset: 8448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !545, file: !539, line: 193, baseType: !999, size: 64, offset: 8512)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!352, !536, !758, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !539, line: 660, size: 5312, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1004, file: !539, line: 661, baseType: !542, size: 4480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1004, file: !539, line: 661, baseType: !767, size: 32, offset: 4480)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1004, file: !539, line: 662, baseType: !333, size: 32, offset: 4512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1004, file: !539, line: 662, baseType: !333, size: 32, offset: 4544)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1004, file: !539, line: 662, baseType: !333, size: 32, offset: 4576)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1004, file: !539, line: 663, baseType: !333, size: 32, offset: 4608)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1004, file: !539, line: 664, baseType: !333, size: 32, offset: 4640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1004, file: !539, line: 665, baseType: !434, size: 64, offset: 4672)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1004, file: !539, line: 666, baseType: !434, size: 64, offset: 4736)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1004, file: !539, line: 667, baseType: !333, size: 32, offset: 4800)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1004, file: !539, line: 668, baseType: !808, size: 32, offset: 4832)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1004, file: !539, line: 670, baseType: !434, size: 64, offset: 4864)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1004, file: !539, line: 670, baseType: !434, size: 64, offset: 4928)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1004, file: !539, line: 671, baseType: !434, size: 64, offset: 4992)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1004, file: !539, line: 672, baseType: !434, size: 64, offset: 5056)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1004, file: !539, line: 673, baseType: !434, size: 64, offset: 5120)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1004, file: !539, line: 674, baseType: !333, size: 32, offset: 5184)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1004, file: !539, line: 675, baseType: !434, size: 64, offset: 5248)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !545, file: !539, line: 195, baseType: !1025, size: 64, offset: 8576)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!352, !1002, !536, !536}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !545, file: !539, line: 196, baseType: !1025, size: 64, offset: 8640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !545, file: !539, line: 197, baseType: !800, size: 64, offset: 8704)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !545, file: !539, line: 198, baseType: !922, size: 64, offset: 8768)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !545, file: !539, line: 199, baseType: !926, size: 64, offset: 8832)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !545, file: !539, line: 201, baseType: !1033, size: 64, offset: 8896)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!352, !536, !333, !333}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !545, file: !539, line: 202, baseType: !701, size: 64, offset: 8960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !545, file: !539, line: 203, baseType: !569, size: 64, offset: 9024)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !545, file: !539, line: 204, baseType: !755, size: 64, offset: 9088)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !545, file: !539, line: 205, baseType: !886, size: 64, offset: 9152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !545, file: !539, line: 206, baseType: !1041, size: 64, offset: 9216)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!352, !316, !536, !333, !615, !616}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !545, file: !539, line: 208, baseType: !1045, size: 64, offset: 9280)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!352, !333, !711}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !545, file: !539, line: 209, baseType: !926, size: 64, offset: 9344)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !545, file: !539, line: 210, baseType: !718, size: 64, offset: 9408)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !538, file: !539, line: 438, baseType: !1051, size: 64, offset: 13952)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !583, line: 60, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1053, file: !114, line: 241, baseType: !316, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1053, file: !114, line: 242, baseType: !407, size: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1053, file: !114, line: 243, baseType: !333, size: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1053, file: !114, line: 243, baseType: !333, size: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1053, file: !114, line: 244, baseType: !333, size: 32, offset: 160)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1053, file: !114, line: 244, baseType: !333, size: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1053, file: !114, line: 245, baseType: !434, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1053, file: !114, line: 246, baseType: !335, size: 32, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1053, file: !114, line: 247, baseType: !333, size: 32, offset: 352)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1053, file: !114, line: 251, baseType: !333, size: 32, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1053, file: !114, line: 252, baseType: !857, size: 64, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1053, file: !114, line: 253, baseType: !335, size: 32, offset: 512)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1053, file: !114, line: 254, baseType: !333, size: 32, offset: 544)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1053, file: !114, line: 254, baseType: !333, size: 32, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1053, file: !114, line: 255, baseType: !333, size: 32, offset: 608)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !538, file: !539, line: 438, baseType: !1051, size: 64, offset: 14016)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !539, line: 439, baseType: !320, size: 64, offset: 14080)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !538, file: !539, line: 440, baseType: !1073, size: 32, offset: 14144)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !538, file: !539, line: 441, baseType: !335, size: 32, offset: 14176)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !538, file: !539, line: 442, baseType: !335, size: 32, offset: 14208)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !538, file: !539, line: 443, baseType: !1077, size: 448, offset: 14272)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 448, elements: !1079)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !321)
!1079 = !{!1080}
!1080 = !DISubrange(count: 7)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !538, file: !539, line: 444, baseType: !335, size: 32, offset: 14720)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !538, file: !539, line: 445, baseType: !335, size: 32, offset: 14752)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !538, file: !539, line: 446, baseType: !333, size: 32, offset: 14784)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !538, file: !539, line: 447, baseType: !427, size: 64, offset: 14848)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !538, file: !539, line: 448, baseType: !427, size: 64, offset: 14912)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !538, file: !539, line: 449, baseType: !623, size: 640, offset: 14976)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !538, file: !539, line: 450, baseType: !555, size: 32, offset: 15616)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !538, file: !539, line: 451, baseType: !1089, size: 2880, offset: 15680)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !539, line: 318, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !539, line: 319, size: 2880, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1111, !1112, !1117, !1122, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1137, !1138, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1170, !1171, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1194, !1195, !1196, !1200, !1201}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1090, file: !539, line: 320, baseType: !333, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1090, file: !539, line: 321, baseType: !333, size: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1090, file: !539, line: 322, baseType: !333, size: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1090, file: !539, line: 323, baseType: !333, size: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1090, file: !539, line: 324, baseType: !333, size: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1090, file: !539, line: 325, baseType: !333, size: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1090, file: !539, line: 326, baseType: !1099, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !539, line: 293, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !539, line: 295, size: 448, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !539, line: 296, baseType: !1099, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1101, file: !539, line: 297, baseType: !451, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1101, file: !539, line: 297, baseType: !451, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1101, file: !539, line: 298, baseType: !434, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1101, file: !539, line: 298, baseType: !434, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1101, file: !539, line: 299, baseType: !333, size: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1101, file: !539, line: 300, baseType: !333, size: 32, offset: 352)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1101, file: !539, line: 301, baseType: !333, size: 32, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1090, file: !539, line: 326, baseType: !1099, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1090, file: !539, line: 328, baseType: !1113, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!352, !536, !1116, !434}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1090, file: !539, line: 329, baseType: !1118, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!352, !1116, !1121, !436, !436, !454, !434}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1090, file: !539, line: 330, baseType: !1123, size: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!352, !1116}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1090, file: !539, line: 331, baseType: !1123, size: 64, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1090, file: !539, line: 334, baseType: !316, size: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !539, line: 335, baseType: !407, size: 32, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1090, file: !539, line: 335, baseType: !407, size: 32, offset: 672)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1090, file: !539, line: 336, baseType: !407, size: 32, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1090, file: !539, line: 336, baseType: !407, size: 32, offset: 736)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1090, file: !539, line: 337, baseType: !1133, size: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !317, line: 339, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !317, line: 339, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1090, file: !539, line: 338, baseType: !1133, size: 64, offset: 832)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1090, file: !539, line: 339, baseType: !1139, size: 64, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !317, line: 341, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !317, line: 351, size: 192, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1141, file: !317, line: 354, baseType: !72, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1141, file: !317, line: 355, baseType: !72, size: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1141, file: !317, line: 356, baseType: !72, size: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1141, file: !317, line: 361, baseType: !72, size: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1141, file: !317, line: 362, baseType: !313, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1090, file: !539, line: 340, baseType: !333, size: 32, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1090, file: !539, line: 340, baseType: !333, size: 32, offset: 992)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1090, file: !539, line: 341, baseType: !451, size: 64, offset: 1024)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1090, file: !539, line: 342, baseType: !434, size: 64, offset: 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1090, file: !539, line: 343, baseType: !454, size: 64, offset: 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1090, file: !539, line: 344, baseType: !436, size: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1090, file: !539, line: 345, baseType: !333, size: 32, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1090, file: !539, line: 346, baseType: !1121, size: 64, offset: 1344)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1090, file: !539, line: 347, baseType: !335, size: 32, offset: 1408)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1090, file: !539, line: 348, baseType: !333, size: 32, offset: 1440)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1090, file: !539, line: 351, baseType: !335, size: 32, offset: 1472)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1090, file: !539, line: 352, baseType: !335, size: 32, offset: 1504)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1090, file: !539, line: 353, baseType: !407, size: 32, offset: 1536)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1090, file: !539, line: 354, baseType: !407, size: 32, offset: 1568)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1090, file: !539, line: 355, baseType: !1121, size: 64, offset: 1600)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1090, file: !539, line: 356, baseType: !1121, size: 64, offset: 1664)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1090, file: !539, line: 357, baseType: !1165, size: 64, offset: 1728)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !539, line: 310, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 308, size: 32, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1167, file: !539, line: 309, baseType: !333, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1090, file: !539, line: 357, baseType: !1165, size: 64, offset: 1792)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1090, file: !539, line: 358, baseType: !1172, size: 64, offset: 1856)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !539, line: 316, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 312, size: 128, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1174, file: !539, line: 313, baseType: !320, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1174, file: !539, line: 314, baseType: !333, size: 32, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1174, file: !539, line: 315, baseType: !323, size: 8, offset: 96)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1090, file: !539, line: 359, baseType: !1172, size: 64, offset: 1920)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1090, file: !539, line: 360, baseType: !1172, size: 64, offset: 1984)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1090, file: !539, line: 361, baseType: !333, size: 32, offset: 2048)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1090, file: !539, line: 362, baseType: !407, size: 32, offset: 2080)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1090, file: !539, line: 363, baseType: !333, size: 32, offset: 2112)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1090, file: !539, line: 364, baseType: !1121, size: 64, offset: 2176)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1090, file: !539, line: 365, baseType: !1139, size: 64, offset: 2240)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1090, file: !539, line: 366, baseType: !407, size: 32, offset: 2304)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1090, file: !539, line: 367, baseType: !407, size: 32, offset: 2336)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1090, file: !539, line: 368, baseType: !1133, size: 64, offset: 2368)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1090, file: !539, line: 369, baseType: !1133, size: 64, offset: 2432)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1090, file: !539, line: 370, baseType: !1191, size: 64, offset: 2496)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1090, file: !539, line: 371, baseType: !1191, size: 64, offset: 2560)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1090, file: !539, line: 372, baseType: !1191, size: 64, offset: 2624)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1090, file: !539, line: 373, baseType: !1197, size: 64, offset: 2688)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !317, line: 331, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !317, line: 331, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1090, file: !539, line: 374, baseType: !313, size: 64, offset: 2752)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1090, file: !539, line: 375, baseType: !1202, size: 64, offset: 2816)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !538, file: !539, line: 451, baseType: !1089, size: 2880, offset: 18560)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !538, file: !539, line: 452, baseType: !1205, size: 64, offset: 21440)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !539, line: 681, size: 4864, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213, !1214, !1215, !1219}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1207, file: !539, line: 682, baseType: !542, size: 4480)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1207, file: !539, line: 682, baseType: !767, size: 32, offset: 4480)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1207, file: !539, line: 683, baseType: !335, size: 32, offset: 4512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1207, file: !539, line: 684, baseType: !333, size: 32, offset: 4544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1207, file: !539, line: 685, baseType: !919, size: 64, offset: 4608)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1207, file: !539, line: 686, baseType: !451, size: 64, offset: 4672)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1207, file: !539, line: 687, baseType: !1216, size: 64, offset: 4736)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!352, !1205, !565, !320}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1207, file: !539, line: 688, baseType: !320, size: 64, offset: 4800)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !538, file: !539, line: 453, baseType: !1205, size: 64, offset: 21504)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !538, file: !539, line: 454, baseType: !1205, size: 64, offset: 21568)
