; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/seq/sbaijfact.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/seq/sbaijfact.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1189, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!326 = !{!327, !407, !486, !428, !557, !335, !370, !404, !371, !476, !458, !430, !1430}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqSBAIJ", file: !329, line: 27, baseType: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sbaij/seq/sbaij.h", directory: "/home/users/ndemeye/xSDK")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 12, size: 3456, elements: !331)
!331 = !{!332, !334, !336, !337, !338, !339, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !359, !360, !361, !362, !363, !364, !365, !372, !374, !379, !380, !381, !382, !1350, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1427, !1429}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !330, file: !329, line: 13, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 416)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 480)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !330, file: !329, line: 13, baseType: !351, size: 192, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !352, line: 407, baseType: !353)
!352 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 402, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !353, file: !352, line: 403, baseType: !333, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !353, file: !352, line: 404, baseType: !335, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !353, file: !352, line: 405, baseType: !340, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !353, file: !352, line: 406, baseType: !340, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !330, file: !329, line: 13, baseType: !340, size: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !330, file: !329, line: 13, baseType: !335, size: 32, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 1120)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !330, file: !329, line: 13, baseType: !366, size: 64, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !368, line: 799, baseType: !369)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !371)
!371 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !330, file: !329, line: 13, baseType: !373, size: 64, offset: 1216)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !330, file: !329, line: 13, baseType: !375, size: 64, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !376, line: 11, baseType: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !376, line: 11, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !330, file: !329, line: 13, baseType: !375, size: 64, offset: 1344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !330, file: !329, line: 13, baseType: !375, size: 64, offset: 1408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !330, file: !329, line: 13, baseType: !333, size: 32, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !329, line: 13, baseType: !383, size: 64, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !352, line: 436, size: 23424, elements: !386)
!386 = !{!387, !590, !1093, !1113, !1114, !1115, !1117, !1118, !1119, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1246, !1247, !1263, !1264, !1265, !1266, !1267, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1302, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1348, !1349}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !385, file: !352, line: 437, baseType: !388, size: 4480)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !389, line: 122, baseType: !390)
!389 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !389, line: 73, size: 4480, elements: !391)
!391 = !{!392, !394, !449, !450, !451, !453, !454, !455, !456, !464, !465, !467, !471, !475, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487, !489, !490, !491, !493, !494, !495, !497, !498, !499, !500, !501, !503, !505, !506, !507, !508, !509, !510, !512, !513, !514, !524, !526, !527, !531, !532, !580, !585, !587, !588, !589}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !390, file: !389, line: 74, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !390, file: !389, line: 75, baseType: !395, size: 448, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 448, elements: !447)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !389, line: 53, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 45, size: 448, elements: !398)
!398 = !{!399, !411, !419, !424, !431, !435, !442}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !397, file: !389, line: 46, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!403, !404, !406}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !408, line: 330, baseType: !409)
!408 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !408, line: 330, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !397, file: !389, line: 47, baseType: !412, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!403, !404, !415}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !416, line: 16, baseType: !417)
!416 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !416, line: 16, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !397, file: !389, line: 48, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!403, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !397, file: !389, line: 49, baseType: !425, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!403, !404, !428, !404}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !397, file: !389, line: 50, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!403, !404, !428, !423}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !397, file: !389, line: 51, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!403, !404, !428, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !397, file: !389, line: 52, baseType: !443, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!403, !404, !428, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!447 = !{!448}
!448 = !DISubrange(count: 1)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !390, file: !389, line: 76, baseType: !407, size: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !389, line: 77, baseType: !335, size: 32, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !390, file: !389, line: 78, baseType: !452, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !371)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !390, file: !389, line: 78, baseType: !452, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !390, file: !389, line: 78, baseType: !452, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !390, file: !389, line: 78, baseType: !452, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !389, line: 79, baseType: !457, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !460, line: 27, baseType: !461)
!460 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !462, line: 43, baseType: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!463 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !390, file: !389, line: 80, baseType: !335, size: 32, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !389, line: 81, baseType: !466, size: 32, offset: 992)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !390, file: !389, line: 82, baseType: !468, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !390, file: !389, line: 83, baseType: !472, size: 64, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !390, file: !389, line: 84, baseType: !476, size: 64, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !390, file: !389, line: 85, baseType: !476, size: 64, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !390, file: !389, line: 86, baseType: !476, size: 64, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !390, file: !389, line: 87, baseType: !476, size: 64, offset: 1344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !390, file: !389, line: 88, baseType: !404, size: 64, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !390, file: !389, line: 89, baseType: !457, size: 64, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !389, line: 90, baseType: !476, size: 64, offset: 1536)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !390, file: !389, line: 91, baseType: !476, size: 64, offset: 1600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !390, file: !389, line: 92, baseType: !335, size: 32, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !390, file: !389, line: 93, baseType: !486, size: 64, offset: 1728)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !390, file: !389, line: 94, baseType: !488, size: 64, offset: 1792)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !458)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !390, file: !389, line: 95, baseType: !335, size: 32, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !390, file: !389, line: 95, baseType: !335, size: 32, offset: 1888)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !390, file: !389, line: 96, baseType: !492, size: 64, offset: 1920)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !390, file: !389, line: 96, baseType: !492, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !390, file: !389, line: 97, baseType: !340, size: 64, offset: 2048)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !390, file: !389, line: 97, baseType: !496, size: 64, offset: 2112)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !390, file: !389, line: 98, baseType: !335, size: 32, offset: 2176)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !390, file: !389, line: 98, baseType: !335, size: 32, offset: 2208)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !390, file: !389, line: 99, baseType: !492, size: 64, offset: 2240)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !390, file: !389, line: 99, baseType: !492, size: 64, offset: 2304)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !390, file: !389, line: 100, baseType: !502, size: 64, offset: 2368)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !390, file: !389, line: 100, baseType: !504, size: 64, offset: 2432)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !390, file: !389, line: 101, baseType: !335, size: 32, offset: 2496)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !390, file: !389, line: 101, baseType: !335, size: 32, offset: 2528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !390, file: !389, line: 102, baseType: !492, size: 64, offset: 2560)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !390, file: !389, line: 102, baseType: !492, size: 64, offset: 2624)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !390, file: !389, line: 103, baseType: !373, size: 64, offset: 2688)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !390, file: !389, line: 103, baseType: !511, size: 64, offset: 2752)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !390, file: !389, line: 104, baseType: !446, size: 64, offset: 2816)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !390, file: !389, line: 105, baseType: !335, size: 32, offset: 2880)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !390, file: !389, line: 106, baseType: !515, size: 128, offset: 2944)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 128, elements: !522)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !389, line: 64, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 61, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !518, file: !389, line: 62, baseType: !439, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !518, file: !389, line: 63, baseType: !486, size: 64, offset: 64)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !390, file: !389, line: 107, baseType: !525, size: 64, offset: 3072)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !390, file: !389, line: 108, baseType: !486, size: 64, offset: 3136)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !390, file: !389, line: 109, baseType: !528, size: 64, offset: 3200)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!403, !486}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !390, file: !389, line: 111, baseType: !335, size: 32, offset: 3264)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !390, file: !389, line: 112, baseType: !533, size: 320, offset: 3328)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !578)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!403, !537, !404, !486}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !540)
!540 = !{!541, !542, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !539, file: !10, line: 100, baseType: !335, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !10, line: 101, baseType: !543, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !554, !555, !556, !560, !561, !563, !564, !565}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !545, file: !10, line: 84, baseType: !476, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !545, file: !10, line: 85, baseType: !476, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !10, line: 86, baseType: !486, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !545, file: !10, line: 87, baseType: !468, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !545, file: !10, line: 88, baseType: !552, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !545, file: !10, line: 89, baseType: !430, size: 8, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !545, file: !10, line: 90, baseType: !476, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !545, file: !10, line: 91, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !558, line: 46, baseType: !559)
!558 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!559 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !545, file: !10, line: 92, baseType: !333, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !10, line: 93, baseType: !562, size: 32, offset: 544)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !10, line: 94, baseType: !543, size: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !545, file: !10, line: 95, baseType: !476, size: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !545, file: !10, line: 96, baseType: !486, size: 64, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !539, file: !10, line: 102, baseType: !476, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !539, file: !10, line: 102, baseType: !476, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !539, file: !10, line: 103, baseType: !476, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !539, file: !10, line: 104, baseType: !407, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !539, file: !10, line: 105, baseType: !333, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !539, file: !10, line: 105, baseType: !333, size: 32, offset: 416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !539, file: !10, line: 105, baseType: !333, size: 32, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !539, file: !10, line: 106, baseType: !404, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !539, file: !10, line: 107, baseType: !575, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!578 = !{!579}
!579 = !DISubrange(count: 5)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !390, file: !389, line: 113, baseType: !581, size: 320, offset: 3648)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 320, elements: !578)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!403, !404, !486}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !390, file: !389, line: 114, baseType: !586, size: 320, offset: 3968)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !578)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !390, file: !389, line: 115, baseType: !333, size: 32, offset: 4288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !390, file: !389, line: 120, baseType: !575, size: 64, offset: 4352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !390, file: !389, line: 121, baseType: !333, size: 32, offset: 4416)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !385, file: !352, line: 437, baseType: !591, size: 9472, offset: 4480)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 9472, elements: !447)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !352, line: 32, size: 9472, elements: !593)
!593 = !{!594, !603, !607, !608, !615, !619, !620, !621, !622, !623, !624, !625, !645, !649, !654, !660, !679, !684, !688, !689, !694, !699, !700, !705, !709, !713, !717, !721, !725, !726, !727, !728, !729, !733, !734, !739, !740, !741, !742, !743, !748, !755, !760, !764, !768, !772, !776, !777, !781, !782, !789, !794, !795, !796, !797, !859, !867, !868, !872, !873, !877, !878, !882, !887, !888, !892, !896, !903, !904, !905, !906, !907, !908, !913, !914, !918, !922, !926, !927, !928, !932, !942, !943, !947, !948, !952, !953, !957, !958, !963, !964, !968, !972, !973, !974, !975, !976, !977, !978, !982, !983, !984, !985, !986, !987, !991, !992, !993, !994, !995, !996, !997, !998, !1002, !1006, !1007, !1008, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1029, !1033, !1034, !1038, !1039, !1040, !1041, !1067, !1071, !1072, !1073, !1074, !1075, !1079, !1080, !1081, !1082, !1083, !1087, !1091, !1092}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !592, file: !352, line: 34, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!403, !383, !335, !598, !335, !598, !600, !602}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !592, file: !352, line: 35, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!403, !383, !335, !340, !496, !511}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !592, file: !352, line: 36, baseType: !604, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !592, file: !352, line: 37, baseType: !609, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!403, !383, !612, !612}
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !592, file: !352, line: 38, baseType: !616, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!403, !383, !612, !612, !612}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !592, file: !352, line: 40, baseType: !609, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !592, file: !352, line: 41, baseType: !616, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !592, file: !352, line: 42, baseType: !609, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !592, file: !352, line: 43, baseType: !616, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !592, file: !352, line: 44, baseType: !609, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !592, file: !352, line: 46, baseType: !616, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !592, file: !352, line: 47, baseType: !626, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!403, !383, !375, !375, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !632, file: !36, line: 1227, baseType: !370, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !632, file: !36, line: 1228, baseType: !370, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !632, file: !36, line: 1229, baseType: !370, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !632, file: !36, line: 1230, baseType: !370, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !632, file: !36, line: 1231, baseType: !370, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !632, file: !36, line: 1232, baseType: !370, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !632, file: !36, line: 1233, baseType: !370, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !632, file: !36, line: 1234, baseType: !370, size: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !632, file: !36, line: 1236, baseType: !370, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !632, file: !36, line: 1237, baseType: !370, size: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !632, file: !36, line: 1238, baseType: !370, size: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !592, file: !352, line: 48, baseType: !646, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!403, !383, !375, !629}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !592, file: !352, line: 49, baseType: !650, size: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!403, !383, !612, !370, !653, !370, !335, !335, !612}
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !592, file: !352, line: 50, baseType: !655, size: 64, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!403, !383, !658, !659}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !592, file: !352, line: 52, baseType: !661, size: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!403, !383, !664, !665}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !667, file: !36, line: 593, baseType: !452, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !667, file: !36, line: 594, baseType: !452, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !667, file: !36, line: 594, baseType: !452, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !667, file: !36, line: 594, baseType: !452, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !667, file: !36, line: 595, baseType: !452, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !667, file: !36, line: 596, baseType: !452, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !667, file: !36, line: 597, baseType: !452, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !667, file: !36, line: 598, baseType: !452, size: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !667, file: !36, line: 598, baseType: !452, size: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !667, file: !36, line: 599, baseType: !452, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !592, file: !352, line: 53, baseType: !680, size: 64, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!403, !383, !383, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !592, file: !352, line: 54, baseType: !685, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!403, !383, !612}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !592, file: !352, line: 55, baseType: !609, size: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !592, file: !352, line: 56, baseType: !690, size: 64, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!403, !383, !693, !502}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !592, file: !352, line: 58, baseType: !695, size: 64, offset: 1280)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!403, !383, !698}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !592, file: !352, line: 59, baseType: !695, size: 64, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !592, file: !352, line: 60, baseType: !701, size: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!403, !383, !704, !333}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !592, file: !352, line: 61, baseType: !706, size: 64, offset: 1472)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!403, !383}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !592, file: !352, line: 63, baseType: !710, size: 64, offset: 1536)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!403, !383, !335, !598, !369, !612, !612}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !592, file: !352, line: 64, baseType: !714, size: 64, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!403, !383, !383, !375, !375, !629}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !592, file: !352, line: 65, baseType: !718, size: 64, offset: 1664)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!403, !383, !383, !629}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !592, file: !352, line: 66, baseType: !722, size: 64, offset: 1728)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!403, !383, !383, !375, !629}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !592, file: !352, line: 67, baseType: !718, size: 64, offset: 1792)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !592, file: !352, line: 69, baseType: !706, size: 64, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !592, file: !352, line: 70, baseType: !714, size: 64, offset: 1920)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !592, file: !352, line: 71, baseType: !722, size: 64, offset: 1984)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !592, file: !352, line: 72, baseType: !730, size: 64, offset: 2048)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!403, !383, !659}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !592, file: !352, line: 73, baseType: !706, size: 64, offset: 2112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !592, file: !352, line: 75, baseType: !735, size: 64, offset: 2176)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!403, !383, !738, !659}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !592, file: !352, line: 76, baseType: !609, size: 64, offset: 2240)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !592, file: !352, line: 77, baseType: !609, size: 64, offset: 2304)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !592, file: !352, line: 78, baseType: !626, size: 64, offset: 2368)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !592, file: !352, line: 79, baseType: !646, size: 64, offset: 2432)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !592, file: !352, line: 81, baseType: !744, size: 64, offset: 2496)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!403, !383, !369, !383, !747}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !592, file: !352, line: 82, baseType: !749, size: 64, offset: 2560)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!403, !383, !335, !752, !752, !658, !754}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !592, file: !352, line: 83, baseType: !756, size: 64, offset: 2624)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!403, !383, !335, !759, !335}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !592, file: !352, line: 84, baseType: !761, size: 64, offset: 2688)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!403, !383, !335, !598, !335, !598, !373}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !592, file: !352, line: 85, baseType: !765, size: 64, offset: 2752)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!403, !383, !383, !747}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !592, file: !352, line: 87, baseType: !769, size: 64, offset: 2816)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!403, !383, !612, !340}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !592, file: !352, line: 88, baseType: !773, size: 64, offset: 2880)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!403, !383, !369}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !592, file: !352, line: 89, baseType: !773, size: 64, offset: 2944)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !592, file: !352, line: 90, baseType: !778, size: 64, offset: 3008)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!403, !383, !612, !602}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !592, file: !352, line: 91, baseType: !710, size: 64, offset: 3072)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !592, file: !352, line: 93, baseType: !783, size: 64, offset: 3136)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!403, !383, !786}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !592, file: !352, line: 94, baseType: !790, size: 64, offset: 3200)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!403, !383, !335, !333, !333, !340, !793, !793, !683}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !592, file: !352, line: 95, baseType: !790, size: 64, offset: 3264)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !592, file: !352, line: 96, baseType: !790, size: 64, offset: 3328)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !592, file: !352, line: 97, baseType: !790, size: 64, offset: 3392)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !592, file: !352, line: 99, baseType: !798, size: 64, offset: 3456)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!403, !383, !801, !804}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !376, line: 51, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !376, line: 51, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !352, line: 609, size: 6208, elements: !807)
!807 = !{!808, !809, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !828, !835, !836, !837, !838, !839, !840, !841, !842, !846, !847, !848, !849, !850, !852, !853, !854, !855, !856, !857, !858}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !806, file: !352, line: 610, baseType: !388, size: 4480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !806, file: !352, line: 610, baseType: !810, size: 32, offset: 4480)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !447)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !806, file: !352, line: 611, baseType: !335, size: 32, offset: 4512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !806, file: !352, line: 611, baseType: !335, size: 32, offset: 4544)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !806, file: !352, line: 611, baseType: !335, size: 32, offset: 4576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !806, file: !352, line: 612, baseType: !335, size: 32, offset: 4608)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !806, file: !352, line: 613, baseType: !335, size: 32, offset: 4640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !806, file: !352, line: 614, baseType: !340, size: 64, offset: 4672)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !806, file: !352, line: 615, baseType: !496, size: 64, offset: 4736)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !806, file: !352, line: 616, baseType: !759, size: 64, offset: 4800)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !806, file: !352, line: 617, baseType: !340, size: 64, offset: 4864)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !806, file: !352, line: 618, baseType: !821, size: 64, offset: 4928)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !352, line: 602, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 598, size: 128, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !823, file: !352, line: 599, baseType: !335, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !823, file: !352, line: 600, baseType: !335, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !823, file: !352, line: 601, baseType: !373, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !806, file: !352, line: 619, baseType: !829, size: 64, offset: 4992)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !352, line: 607, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 604, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !831, file: !352, line: 605, baseType: !335, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !831, file: !352, line: 606, baseType: !373, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !806, file: !352, line: 620, baseType: !373, size: 64, offset: 5056)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !806, file: !352, line: 621, baseType: !370, size: 64, offset: 5120)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !806, file: !352, line: 622, baseType: !370, size: 64, offset: 5184)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !806, file: !352, line: 623, baseType: !612, size: 64, offset: 5248)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !806, file: !352, line: 623, baseType: !612, size: 64, offset: 5312)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !806, file: !352, line: 623, baseType: !612, size: 64, offset: 5376)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !806, file: !352, line: 624, baseType: !333, size: 32, offset: 5440)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !806, file: !352, line: 625, baseType: !843, size: 64, offset: 5504)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!403}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !806, file: !352, line: 626, baseType: !486, size: 64, offset: 5568)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !806, file: !352, line: 627, baseType: !612, size: 64, offset: 5632)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !806, file: !352, line: 628, baseType: !335, size: 32, offset: 5696)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !806, file: !352, line: 629, baseType: !428, size: 64, offset: 5760)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !806, file: !352, line: 630, baseType: !851, size: 32, offset: 5824)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !806, file: !352, line: 631, baseType: !335, size: 32, offset: 5856)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !806, file: !352, line: 631, baseType: !335, size: 32, offset: 5888)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !806, file: !352, line: 632, baseType: !333, size: 32, offset: 5920)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !806, file: !352, line: 633, baseType: !333, size: 32, offset: 5952)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !806, file: !352, line: 634, baseType: !439, size: 64, offset: 6016)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !806, file: !352, line: 634, baseType: !486, size: 64, offset: 6080)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !806, file: !352, line: 635, baseType: !457, size: 64, offset: 6144)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !592, file: !352, line: 100, baseType: !860, size: 64, offset: 3520)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!403, !383, !335, !335, !863, !866}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !865)
!865 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !592, file: !352, line: 101, baseType: !706, size: 64, offset: 3584)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !592, file: !352, line: 102, baseType: !869, size: 64, offset: 3648)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!403, !383, !375, !375, !659}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !592, file: !352, line: 103, baseType: !595, size: 64, offset: 3712)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !592, file: !352, line: 105, baseType: !874, size: 64, offset: 3776)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!403, !383, !375, !375, !658, !659}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !592, file: !352, line: 106, baseType: !706, size: 64, offset: 3840)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !592, file: !352, line: 107, baseType: !879, size: 64, offset: 3904)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!403, !383, !415}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !592, file: !352, line: 108, baseType: !883, size: 64, offset: 3968)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!403, !383, !886, !658, !659}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !428)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !592, file: !352, line: 109, baseType: !843, size: 64, offset: 4032)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !592, file: !352, line: 111, baseType: !889, size: 64, offset: 4096)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!403, !383, !383, !383, !370, !383}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !592, file: !352, line: 112, baseType: !893, size: 64, offset: 4160)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!403, !383, !383, !383, !383}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !592, file: !352, line: 113, baseType: !897, size: 64, offset: 4224)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!403, !383, !900, !900}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !376, line: 30, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !376, line: 30, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !592, file: !352, line: 114, baseType: !595, size: 64, offset: 4288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !592, file: !352, line: 115, baseType: !710, size: 64, offset: 4352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !592, file: !352, line: 117, baseType: !769, size: 64, offset: 4416)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !592, file: !352, line: 118, baseType: !769, size: 64, offset: 4480)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !592, file: !352, line: 119, baseType: !883, size: 64, offset: 4544)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !592, file: !352, line: 120, baseType: !909, size: 64, offset: 4608)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!403, !383, !912, !683}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !592, file: !352, line: 121, baseType: !843, size: 64, offset: 4672)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !592, file: !352, line: 123, baseType: !915, size: 64, offset: 4736)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!403, !383, !335, !486}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !592, file: !352, line: 124, baseType: !919, size: 64, offset: 4800)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!403, !383, !804, !612, !486}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !592, file: !352, line: 125, baseType: !923, size: 64, offset: 4864)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!403, !537, !383}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !592, file: !352, line: 126, baseType: !609, size: 64, offset: 4928)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !592, file: !352, line: 127, baseType: !609, size: 64, offset: 4992)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !592, file: !352, line: 129, baseType: !929, size: 64, offset: 5056)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!403, !383, !759}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !592, file: !352, line: 130, baseType: !933, size: 64, offset: 5120)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!403, !383, !936, !936}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !938, file: !60, line: 653, baseType: !335, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !938, file: !60, line: 653, baseType: !612, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !592, file: !352, line: 131, baseType: !933, size: 64, offset: 5184)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !592, file: !352, line: 132, baseType: !944, size: 64, offset: 5248)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!403, !383, !340, !340, !340}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !592, file: !352, line: 133, baseType: !879, size: 64, offset: 5312)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !592, file: !352, line: 135, baseType: !949, size: 64, offset: 5376)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!403, !383, !370, !683}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !592, file: !352, line: 136, baseType: !949, size: 64, offset: 5440)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !592, file: !352, line: 137, baseType: !954, size: 64, offset: 5504)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!403, !383, !683}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !592, file: !352, line: 138, baseType: !595, size: 64, offset: 5568)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !592, file: !352, line: 139, baseType: !959, size: 64, offset: 5632)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!403, !383, !962, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !592, file: !352, line: 141, baseType: !843, size: 64, offset: 5696)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !592, file: !352, line: 142, baseType: !965, size: 64, offset: 5760)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!403, !383, !383, !370, !383}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !592, file: !352, line: 143, baseType: !969, size: 64, offset: 5824)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!403, !383, !383, !383}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !592, file: !352, line: 144, baseType: !843, size: 64, offset: 5888)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !592, file: !352, line: 145, baseType: !965, size: 64, offset: 5952)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !592, file: !352, line: 147, baseType: !969, size: 64, offset: 6016)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !592, file: !352, line: 148, baseType: !843, size: 64, offset: 6080)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !592, file: !352, line: 149, baseType: !965, size: 64, offset: 6144)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !592, file: !352, line: 150, baseType: !969, size: 64, offset: 6208)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !592, file: !352, line: 151, baseType: !979, size: 64, offset: 6272)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!403, !383, !333}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !592, file: !352, line: 153, baseType: !706, size: 64, offset: 6336)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !592, file: !352, line: 154, baseType: !706, size: 64, offset: 6400)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !592, file: !352, line: 155, baseType: !706, size: 64, offset: 6464)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !592, file: !352, line: 156, baseType: !706, size: 64, offset: 6528)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !592, file: !352, line: 157, baseType: !879, size: 64, offset: 6592)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !592, file: !352, line: 159, baseType: !988, size: 64, offset: 6656)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!403, !383, !335, !600}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !592, file: !352, line: 160, baseType: !706, size: 64, offset: 6720)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !592, file: !352, line: 161, baseType: !706, size: 64, offset: 6784)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !592, file: !352, line: 162, baseType: !706, size: 64, offset: 6848)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !592, file: !352, line: 163, baseType: !706, size: 64, offset: 6912)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !592, file: !352, line: 165, baseType: !969, size: 64, offset: 6976)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !592, file: !352, line: 166, baseType: !969, size: 64, offset: 7040)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !592, file: !352, line: 167, baseType: !769, size: 64, offset: 7104)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !592, file: !352, line: 168, baseType: !999, size: 64, offset: 7168)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!403, !383, !612, !335}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !592, file: !352, line: 169, baseType: !1003, size: 64, offset: 7232)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!403, !383, !683, !340}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !592, file: !352, line: 171, baseType: !730, size: 64, offset: 7296)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !592, file: !352, line: 172, baseType: !706, size: 64, offset: 7360)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !592, file: !352, line: 173, baseType: !1009, size: 64, offset: 7424)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!403, !383, !340, !793}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !592, file: !352, line: 174, baseType: !869, size: 64, offset: 7488)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !592, file: !352, line: 175, baseType: !869, size: 64, offset: 7552)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !592, file: !352, line: 177, baseType: !609, size: 64, offset: 7616)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !592, file: !352, line: 178, baseType: !655, size: 64, offset: 7680)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !592, file: !352, line: 179, baseType: !609, size: 64, offset: 7744)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !592, file: !352, line: 180, baseType: !616, size: 64, offset: 7808)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !592, file: !352, line: 181, baseType: !1019, size: 64, offset: 7872)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!403, !383, !407, !658, !659}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !592, file: !352, line: 183, baseType: !929, size: 64, offset: 7936)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !592, file: !352, line: 184, baseType: !690, size: 64, offset: 8000)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !592, file: !352, line: 185, baseType: !1025, size: 64, offset: 8064)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!403, !383, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !592, file: !352, line: 186, baseType: !1030, size: 64, offset: 8128)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!403, !383, !335, !598, !373}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !592, file: !352, line: 187, baseType: !749, size: 64, offset: 8192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !592, file: !352, line: 189, baseType: !1035, size: 64, offset: 8256)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!403, !383, !335, !335, !340, !600}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !592, file: !352, line: 190, baseType: !843, size: 64, offset: 8320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !592, file: !352, line: 191, baseType: !965, size: 64, offset: 8384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !592, file: !352, line: 192, baseType: !969, size: 64, offset: 8448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !592, file: !352, line: 193, baseType: !1042, size: 64, offset: 8512)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!403, !383, !801, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !352, line: 660, size: 5312, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1047, file: !352, line: 661, baseType: !388, size: 4480)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1047, file: !352, line: 661, baseType: !810, size: 32, offset: 4480)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1047, file: !352, line: 662, baseType: !335, size: 32, offset: 4512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1047, file: !352, line: 662, baseType: !335, size: 32, offset: 4544)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1047, file: !352, line: 662, baseType: !335, size: 32, offset: 4576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1047, file: !352, line: 663, baseType: !335, size: 32, offset: 4608)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1047, file: !352, line: 664, baseType: !335, size: 32, offset: 4640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1047, file: !352, line: 665, baseType: !340, size: 64, offset: 4672)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1047, file: !352, line: 666, baseType: !340, size: 64, offset: 4736)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1047, file: !352, line: 667, baseType: !335, size: 32, offset: 4800)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1047, file: !352, line: 668, baseType: !851, size: 32, offset: 4832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1047, file: !352, line: 670, baseType: !340, size: 64, offset: 4864)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1047, file: !352, line: 670, baseType: !340, size: 64, offset: 4928)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1047, file: !352, line: 671, baseType: !340, size: 64, offset: 4992)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1047, file: !352, line: 672, baseType: !340, size: 64, offset: 5056)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1047, file: !352, line: 673, baseType: !340, size: 64, offset: 5120)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1047, file: !352, line: 674, baseType: !335, size: 32, offset: 5184)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1047, file: !352, line: 675, baseType: !340, size: 64, offset: 5248)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !592, file: !352, line: 195, baseType: !1068, size: 64, offset: 8576)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!403, !1045, !383, !383}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !592, file: !352, line: 196, baseType: !1068, size: 64, offset: 8640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !592, file: !352, line: 197, baseType: !843, size: 64, offset: 8704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !592, file: !352, line: 198, baseType: !965, size: 64, offset: 8768)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !592, file: !352, line: 199, baseType: !969, size: 64, offset: 8832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !592, file: !352, line: 201, baseType: !1076, size: 64, offset: 8896)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!403, !383, !335, !335}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !592, file: !352, line: 202, baseType: !744, size: 64, offset: 8960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !592, file: !352, line: 203, baseType: !616, size: 64, offset: 9024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !592, file: !352, line: 204, baseType: !798, size: 64, offset: 9088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !592, file: !352, line: 205, baseType: !929, size: 64, offset: 9152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !592, file: !352, line: 206, baseType: !1084, size: 64, offset: 9216)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!403, !407, !383, !335, !658, !659}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !592, file: !352, line: 208, baseType: !1088, size: 64, offset: 9280)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!403, !335, !754}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !592, file: !352, line: 209, baseType: !969, size: 64, offset: 9344)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !592, file: !352, line: 210, baseType: !761, size: 64, offset: 9408)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !385, file: !352, line: 438, baseType: !1094, size: 64, offset: 13952)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !376, line: 60, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1096, file: !114, line: 241, baseType: !407, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1096, file: !114, line: 242, baseType: !466, size: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1096, file: !114, line: 243, baseType: !335, size: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1096, file: !114, line: 243, baseType: !335, size: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1096, file: !114, line: 244, baseType: !335, size: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1096, file: !114, line: 244, baseType: !335, size: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1096, file: !114, line: 245, baseType: !340, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1096, file: !114, line: 246, baseType: !333, size: 32, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1096, file: !114, line: 247, baseType: !335, size: 32, offset: 352)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1096, file: !114, line: 251, baseType: !335, size: 32, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1096, file: !114, line: 252, baseType: !900, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1096, file: !114, line: 253, baseType: !333, size: 32, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1096, file: !114, line: 254, baseType: !335, size: 32, offset: 544)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1096, file: !114, line: 254, baseType: !335, size: 32, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1096, file: !114, line: 255, baseType: !335, size: 32, offset: 608)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !385, file: !352, line: 438, baseType: !1094, size: 64, offset: 14016)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !352, line: 439, baseType: !486, size: 64, offset: 14080)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !385, file: !352, line: 440, baseType: !1116, size: 32, offset: 14144)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !385, file: !352, line: 441, baseType: !333, size: 32, offset: 14176)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !385, file: !352, line: 442, baseType: !333, size: 32, offset: 14208)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !385, file: !352, line: 443, baseType: !1120, size: 448, offset: 14272)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 448, elements: !1122)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !428)
!1122 = !{!1123}
!1123 = !DISubrange(count: 7)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !385, file: !352, line: 444, baseType: !333, size: 32, offset: 14720)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !385, file: !352, line: 445, baseType: !333, size: 32, offset: 14752)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !385, file: !352, line: 446, baseType: !335, size: 32, offset: 14784)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !385, file: !352, line: 447, baseType: !488, size: 64, offset: 14848)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !385, file: !352, line: 448, baseType: !488, size: 64, offset: 14912)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !385, file: !352, line: 449, baseType: !666, size: 640, offset: 14976)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !385, file: !352, line: 450, baseType: !602, size: 32, offset: 15616)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !385, file: !352, line: 451, baseType: !1132, size: 2880, offset: 15680)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !352, line: 318, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !352, line: 319, size: 2880, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140, !1141, !1154, !1155, !1160, !1165, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1180, !1181, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1213, !1214, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1239, !1243, !1244}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1133, file: !352, line: 320, baseType: !335, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1133, file: !352, line: 321, baseType: !335, size: 32, offset: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1133, file: !352, line: 322, baseType: !335, size: 32, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1133, file: !352, line: 323, baseType: !335, size: 32, offset: 96)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1133, file: !352, line: 324, baseType: !335, size: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1133, file: !352, line: 325, baseType: !335, size: 32, offset: 160)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1133, file: !352, line: 326, baseType: !1142, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !352, line: 293, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !352, line: 295, size: 448, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !352, line: 296, baseType: !1142, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1144, file: !352, line: 297, baseType: !373, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1144, file: !352, line: 297, baseType: !373, size: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1144, file: !352, line: 298, baseType: !340, size: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1144, file: !352, line: 298, baseType: !340, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1144, file: !352, line: 299, baseType: !335, size: 32, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1144, file: !352, line: 300, baseType: !335, size: 32, offset: 352)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1144, file: !352, line: 301, baseType: !335, size: 32, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1133, file: !352, line: 326, baseType: !1142, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1133, file: !352, line: 328, baseType: !1156, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!403, !383, !1159, !340}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1133, file: !352, line: 329, baseType: !1161, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!403, !1159, !1164, !496, !496, !511, !340}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1133, file: !352, line: 330, baseType: !1166, size: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!403, !1159}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1133, file: !352, line: 331, baseType: !1166, size: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1133, file: !352, line: 334, baseType: !407, size: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !352, line: 335, baseType: !466, size: 32, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1133, file: !352, line: 335, baseType: !466, size: 32, offset: 672)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1133, file: !352, line: 336, baseType: !466, size: 32, offset: 704)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1133, file: !352, line: 336, baseType: !466, size: 32, offset: 736)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1133, file: !352, line: 337, baseType: !1176, size: 64, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !408, line: 339, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !408, line: 339, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1133, file: !352, line: 338, baseType: !1176, size: 64, offset: 832)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1133, file: !352, line: 339, baseType: !1182, size: 64, offset: 896)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !408, line: 341, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !408, line: 351, size: 192, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1184, file: !408, line: 354, baseType: !72, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1184, file: !408, line: 355, baseType: !72, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1184, file: !408, line: 356, baseType: !72, size: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1184, file: !408, line: 361, baseType: !72, size: 32, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1184, file: !408, line: 362, baseType: !557, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1133, file: !352, line: 340, baseType: !335, size: 32, offset: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1133, file: !352, line: 340, baseType: !335, size: 32, offset: 992)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1133, file: !352, line: 341, baseType: !373, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1133, file: !352, line: 342, baseType: !340, size: 64, offset: 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1133, file: !352, line: 343, baseType: !511, size: 64, offset: 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1133, file: !352, line: 344, baseType: !496, size: 64, offset: 1216)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1133, file: !352, line: 345, baseType: !335, size: 32, offset: 1280)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1133, file: !352, line: 346, baseType: !1164, size: 64, offset: 1344)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1133, file: !352, line: 347, baseType: !333, size: 32, offset: 1408)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1133, file: !352, line: 348, baseType: !335, size: 32, offset: 1440)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1133, file: !352, line: 351, baseType: !333, size: 32, offset: 1472)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1133, file: !352, line: 352, baseType: !333, size: 32, offset: 1504)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1133, file: !352, line: 353, baseType: !466, size: 32, offset: 1536)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1133, file: !352, line: 354, baseType: !466, size: 32, offset: 1568)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1133, file: !352, line: 355, baseType: !1164, size: 64, offset: 1600)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1133, file: !352, line: 356, baseType: !1164, size: 64, offset: 1664)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1133, file: !352, line: 357, baseType: !1208, size: 64, offset: 1728)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !352, line: 310, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 308, size: 32, elements: !1211)
!1211 = !{!1212}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1210, file: !352, line: 309, baseType: !335, size: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1133, file: !352, line: 357, baseType: !1208, size: 64, offset: 1792)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1133, file: !352, line: 358, baseType: !1215, size: 64, offset: 1856)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !352, line: 316, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 312, size: 128, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1217, file: !352, line: 313, baseType: !486, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1217, file: !352, line: 314, baseType: !335, size: 32, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1217, file: !352, line: 315, baseType: !430, size: 8, offset: 96)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1133, file: !352, line: 359, baseType: !1215, size: 64, offset: 1920)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1133, file: !352, line: 360, baseType: !1215, size: 64, offset: 1984)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1133, file: !352, line: 361, baseType: !335, size: 32, offset: 2048)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1133, file: !352, line: 362, baseType: !466, size: 32, offset: 2080)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1133, file: !352, line: 363, baseType: !335, size: 32, offset: 2112)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1133, file: !352, line: 364, baseType: !1164, size: 64, offset: 2176)
