; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscViewer = type opaque
%struct.PetscViewerAndFormat = type { %struct._p_PetscViewer*, i32, %struct._p_PetscDrawLG*, i8* }
%struct._p_PetscDrawLG = type opaque

!333 = !DILocation(line: 67, column: 10, scope: !164)
!334 = !DILocation(line: 0, scope: !199)
!335 = !DILocation(line: 67, column: 62, scope: !336)
!336 = distinct !DILexicalBlock(scope: !199, file: !137, line: 67, column: 62)
!337 = !DILocation(line: 67, column: 62, scope: !199)
!338 = !DILocation(line: 68, column: 10, scope: !164)
!339 = !DILocation(line: 0, scope: !201)
!340 = !DILocation(line: 68, column: 66, scope: !341)
!341 = distinct !DILexicalBlock(scope: !201, file: !137, line: 68, column: 66)
!342 = !DILocation(line: 68, column: 66, scope: !201)
!343 = !DILocation(line: 69, column: 10, scope: !164)
!344 = !DILocation(line: 0, scope: !203)
!345 = !DILocation(line: 69, column: 63, scope: !346)
!346 = distinct !DILexicalBlock(scope: !203, file: !137, line: 69, column: 63)
!347 = !DILocation(line: 69, column: 63, scope: !203)
!348 = !DILocation(line: 70, column: 10, scope: !164)
!349 = !DILocation(line: 0, scope: !205)
!350 = !DILocation(line: 70, column: 67, scope: !351)
!351 = distinct !DILexicalBlock(scope: !205, file: !137, line: 70, column: 67)
!352 = !DILocation(line: 70, column: 67, scope: !205)
!353 = !DILocation(line: 71, column: 10, scope: !164)
!354 = !DILocation(line: 0, scope: !207)
!355 = !DILocation(line: 71, column: 63, scope: !356)
!356 = distinct !DILexicalBlock(scope: !207, file: !137, line: 71, column: 63)
!357 = !DILocation(line: 71, column: 63, scope: !207)
!358 = !DILocation(line: 73, column: 10, scope: !164)
!359 = !DILocation(line: 0, scope: !209)
!360 = !DILocation(line: 73, column: 143, scope: !361)
!361 = distinct !DILexicalBlock(scope: !209, file: !137, line: 73, column: 143)
!362 = !DILocation(line: 73, column: 143, scope: !209)
!363 = !DILocation(line: 74, column: 10, scope: !164)
!364 = !DILocation(line: 0, scope: !211)
!365 = !DILocation(line: 74, column: 173, scope: !366)
!366 = distinct !DILexicalBlock(scope: !211, file: !137, line: 74, column: 173)
!367 = !DILocation(line: 74, column: 173, scope: !211)
!368 = !DILocation(line: 75, column: 3, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !137, line: 75, column: 3)
!370 = distinct !DILexicalBlock(scope: !371, file: !137, line: 75, column: 3)
!371 = distinct !DILexicalBlock(scope: !164, file: !137, line: 75, column: 3)
!372 = !DILocation(line: 75, column: 3, scope: !370)
!373 = !DILocation(line: 75, column: 3, scope: !374)
!374 = distinct !DILexicalBlock(scope: !375, file: !137, line: 75, column: 3)
!375 = distinct !DILexicalBlock(scope: !369, file: !137, line: 75, column: 3)
!376 = !DILocation(line: 75, column: 3, scope: !375)
!377 = !DILocation(line: 75, column: 3, scope: !378)
!378 = distinct !DILexicalBlock(scope: !379, file: !137, line: 75, column: 3)
!379 = distinct !DILexicalBlock(scope: !374, file: !137, line: 75, column: 3)
!380 = !DILocation(line: 75, column: 3, scope: !379)
!381 = !DILocation(line: 75, column: 3, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !137, line: 75, column: 3)
!383 = !DILocation(line: 75, column: 3, scope: !384)
!384 = distinct !DILexicalBlock(scope: !374, file: !137, line: 75, column: 3)
!385 = !DILocation(line: 75, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !384, file: !137, line: 75, column: 3)
!387 = !DILocation(line: 75, column: 3, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !137, line: 75, column: 3)
!389 = distinct !DILexicalBlock(scope: !386, file: !137, line: 75, column: 3)
!390 = !DILocation(line: 75, column: 3, scope: !389)
!391 = !DILocation(line: 75, column: 3, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !137, line: 75, column: 3)
!393 = !DILocation(line: 76, column: 1, scope: !164)
!394 = !DISubprogram(name: "SNESRegister", scope: !27, file: !27, line: 79, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !787)
!395 = !DISubroutineType(types: !396)
!396 = !{!28, !126, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!28, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !402, line: 38, size: 11648, elements: !403)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!403 = !{!404, !603, !671, !676, !677, !678, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !694, !698, !699, !701, !702, !703, !704, !705, !710, !712, !713, !714, !715, !716, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !752, !754, !755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !401, file: !402, line: 39, baseType: !405, size: 4480)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !406, line: 122, baseType: !407)
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !406, line: 73, size: 4480, elements: !408)
!408 = !{!409, !411, !458, !459, !461, !464, !465, !466, !467, !475, !476, !478, !482, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !503, !504, !506, !508, !509, !510, !511, !512, !515, !517, !518, !519, !520, !521, !524, !526, !527, !528, !538, !540, !541, !545, !546, !593, !598, !600, !601, !602}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !407, file: !406, line: 74, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !407, file: !406, line: 75, baseType: !412, size: 448, offset: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 448, elements: !456)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !406, line: 53, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 45, size: 448, elements: !415)
!415 = !{!416, !423, !431, !436, !440, !444, !451}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !414, file: !406, line: 46, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!167, !420, !422}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !414, file: !406, line: 47, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!167, !420, !427}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !428, line: 16, baseType: !429)
!428 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !428, line: 16, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !414, file: !406, line: 48, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!167, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !414, file: !406, line: 49, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!167, !420, !126, !420}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !414, file: !406, line: 50, baseType: !441, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!167, !420, !126, !435}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !414, file: !406, line: 51, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!167, !420, !126, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !414, file: !406, line: 52, baseType: !452, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!167, !420, !126, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!456 = !{!457}
!457 = !DISubrange(count: 1)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !407, file: !406, line: 76, baseType: !129, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !407, file: !406, line: 77, baseType: !460, size: 32, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !407, file: !406, line: 78, baseType: !462, size: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !463)
!463 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !407, file: !406, line: 78, baseType: !462, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !407, file: !406, line: 78, baseType: !462, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !407, file: !406, line: 78, baseType: !462, size: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !407, file: !406, line: 79, baseType: !468, size: 64, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !471, line: 27, baseType: !472)
!471 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !473, line: 43, baseType: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!474 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !407, file: !406, line: 80, baseType: !460, size: 32, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !407, file: !406, line: 81, baseType: !477, size: 32, offset: 992)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !407, file: !406, line: 82, baseType: !479, size: 64, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !407, file: !406, line: 83, baseType: !483, size: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !407, file: !406, line: 84, baseType: !487, size: 64, offset: 1152)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !407, file: !406, line: 85, baseType: !487, size: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !407, file: !406, line: 86, baseType: !487, size: 64, offset: 1280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !407, file: !406, line: 87, baseType: !487, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !407, file: !406, line: 88, baseType: !420, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !407, file: !406, line: 89, baseType: !468, size: 64, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !406, line: 90, baseType: !487, size: 64, offset: 1536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !407, file: !406, line: 91, baseType: !487, size: 64, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !407, file: !406, line: 92, baseType: !460, size: 32, offset: 1664)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !407, file: !406, line: 93, baseType: !133, size: 64, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !407, file: !406, line: 94, baseType: !498, size: 64, offset: 1792)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !469)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !407, file: !406, line: 95, baseType: !460, size: 32, offset: 1856)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !407, file: !406, line: 95, baseType: !460, size: 32, offset: 1888)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !407, file: !406, line: 96, baseType: !502, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !407, file: !406, line: 96, baseType: !502, size: 64, offset: 1984)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !407, file: !406, line: 97, baseType: !505, size: 64, offset: 2048)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !407, file: !406, line: 97, baseType: !507, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !407, file: !406, line: 98, baseType: !460, size: 32, offset: 2176)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !407, file: !406, line: 98, baseType: !460, size: 32, offset: 2208)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !407, file: !406, line: 99, baseType: !502, size: 64, offset: 2240)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !407, file: !406, line: 99, baseType: !502, size: 64, offset: 2304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !407, file: !406, line: 100, baseType: !513, size: 64, offset: 2368)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !463)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !407, file: !406, line: 100, baseType: !516, size: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !407, file: !406, line: 101, baseType: !460, size: 32, offset: 2496)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !407, file: !406, line: 101, baseType: !460, size: 32, offset: 2528)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !407, file: !406, line: 102, baseType: !502, size: 64, offset: 2560)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !407, file: !406, line: 102, baseType: !502, size: 64, offset: 2624)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !407, file: !406, line: 103, baseType: !522, size: 64, offset: 2688)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !514)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !407, file: !406, line: 103, baseType: !525, size: 64, offset: 2752)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !407, file: !406, line: 104, baseType: !455, size: 64, offset: 2816)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !407, file: !406, line: 105, baseType: !460, size: 32, offset: 2880)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !407, file: !406, line: 106, baseType: !529, size: 128, offset: 2944)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 128, elements: !536)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !406, line: 64, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 61, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !532, file: !406, line: 62, baseType: !448, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !532, file: !406, line: 63, baseType: !133, size: 64, offset: 64)
!536 = !{!537}
!537 = !DISubrange(count: 2)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !407, file: !406, line: 107, baseType: !539, size: 64, offset: 3072)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 64, elements: !536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !407, file: !406, line: 108, baseType: !133, size: 64, offset: 3136)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !407, file: !406, line: 109, baseType: !542, size: 64, offset: 3200)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!167, !133}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !407, file: !406, line: 111, baseType: !460, size: 32, offset: 3264)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !407, file: !406, line: 112, baseType: !547, size: 320, offset: 3328)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 320, elements: !591)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!167, !551, !420, !133}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !554)
!554 = !{!555, !556, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !553, file: !12, line: 100, baseType: !460, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !12, line: 101, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !572, !574, !576, !577, !578}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !559, file: !12, line: 84, baseType: !487, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !559, file: !12, line: 85, baseType: !487, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !12, line: 86, baseType: !133, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !559, file: !12, line: 87, baseType: !479, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !559, file: !12, line: 88, baseType: !138, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !559, file: !12, line: 89, baseType: !128, size: 8, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !559, file: !12, line: 90, baseType: !487, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !559, file: !12, line: 91, baseType: !569, size: 64, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !570, line: 46, baseType: !571)
!570 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!571 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !559, file: !12, line: 92, baseType: !573, size: 32, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !559, file: !12, line: 93, baseType: !575, size: 32, offset: 544)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !12, line: 94, baseType: !557, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !559, file: !12, line: 95, baseType: !487, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !559, file: !12, line: 96, baseType: !133, size: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !553, file: !12, line: 102, baseType: !487, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !553, file: !12, line: 102, baseType: !487, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !553, file: !12, line: 103, baseType: !487, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !553, file: !12, line: 104, baseType: !129, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !553, file: !12, line: 105, baseType: !573, size: 32, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !553, file: !12, line: 105, baseType: !573, size: 32, offset: 416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !553, file: !12, line: 105, baseType: !573, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !553, file: !12, line: 106, baseType: !420, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !553, file: !12, line: 107, baseType: !588, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!591 = !{!592}
!592 = !DISubrange(count: 5)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !407, file: !406, line: 113, baseType: !594, size: 320, offset: 3648)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 320, elements: !591)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!167, !420, !133}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !407, file: !406, line: 114, baseType: !599, size: 320, offset: 3968)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 320, elements: !591)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !407, file: !406, line: 115, baseType: !573, size: 32, offset: 4288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !407, file: !406, line: 120, baseType: !588, size: 64, offset: 4352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !407, file: !406, line: 121, baseType: !573, size: 32, offset: 4416)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !401, file: !402, line: 39, baseType: !604, size: 1088, offset: 4480)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 1088, elements: !456)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !402, line: 12, size: 1088, elements: !606)
!606 = !{!607, !616, !620, !624, !630, !631, !635, !636, !640, !644, !645, !646, !651, !655, !659, !663, !670}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !605, file: !402, line: 13, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!167, !611, !612, !133}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !400)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !613, line: 21, baseType: !614)
!613 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !613, line: 21, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !605, file: !402, line: 14, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!167, !612, !612, !133}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !605, file: !402, line: 15, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!167, !611, !460}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !605, file: !402, line: 16, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!167, !611, !460, !514, !514, !514, !628, !133}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !605, file: !402, line: 17, baseType: !542, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !605, file: !402, line: 18, baseType: !632, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!167, !611}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !605, file: !402, line: 19, baseType: !632, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !605, file: !402, line: 20, baseType: !637, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!167, !611, !427}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !605, file: !402, line: 21, baseType: !641, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!167, !551, !611}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !605, file: !402, line: 22, baseType: !632, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !605, file: !402, line: 23, baseType: !632, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !605, file: !402, line: 24, baseType: !647, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!167, !611, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !605, file: !402, line: 25, baseType: !652, size: 64, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!167, !650}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !605, file: !402, line: 26, baseType: !656, size: 64, offset: 832)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!167, !611, !612, !612}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !605, file: !402, line: 27, baseType: !660, size: 64, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!167, !611, !612, !612, !133}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !605, file: !402, line: 28, baseType: !664, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!167, !611, !612, !667, !667, !133}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !605, file: !402, line: 29, baseType: !637, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !401, file: !402, line: 40, baseType: !672, size: 64, offset: 5568)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !673, line: 14, baseType: !674)
!673 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !673, line: 14, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !401, file: !402, line: 41, baseType: !573, size: 32, offset: 5632)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !401, file: !402, line: 42, baseType: !611, size: 64, offset: 5696)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !401, file: !402, line: 43, baseType: !679, size: 32, offset: 5760)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !401, file: !402, line: 44, baseType: !573, size: 32, offset: 5792)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !401, file: !402, line: 47, baseType: !133, size: 64, offset: 5824)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !401, file: !402, line: 49, baseType: !612, size: 64, offset: 5888)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !401, file: !402, line: 50, baseType: !612, size: 64, offset: 5952)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !401, file: !402, line: 52, baseType: !612, size: 64, offset: 6016)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !401, file: !402, line: 54, baseType: !667, size: 64, offset: 6080)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !401, file: !402, line: 55, baseType: !667, size: 64, offset: 6144)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !401, file: !402, line: 56, baseType: !667, size: 64, offset: 6208)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !401, file: !402, line: 57, baseType: !133, size: 64, offset: 6272)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !401, file: !402, line: 58, baseType: !690, size: 64, offset: 6336)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !691, line: 22, baseType: !692)
!691 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !691, line: 22, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !401, file: !402, line: 59, baseType: !695, size: 64, offset: 6400)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !401, file: !402, line: 60, baseType: !573, size: 32, offset: 6464)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !401, file: !402, line: 61, baseType: !700, size: 32, offset: 6496)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !401, file: !402, line: 63, baseType: !612, size: 64, offset: 6528)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !401, file: !402, line: 65, baseType: !612, size: 64, offset: 6592)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !401, file: !402, line: 66, baseType: !133, size: 64, offset: 6656)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !401, file: !402, line: 68, baseType: !514, size: 64, offset: 6720)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !401, file: !402, line: 74, baseType: !706, size: 320, offset: 6784)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 320, elements: !591)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!167, !611, !460, !514, !133}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !401, file: !402, line: 75, baseType: !711, size: 320, offset: 7104)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 320, elements: !591)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !401, file: !402, line: 76, baseType: !599, size: 320, offset: 7424)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !401, file: !402, line: 77, baseType: !460, size: 32, offset: 7744)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !401, file: !402, line: 78, baseType: !133, size: 64, offset: 7808)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !401, file: !402, line: 79, baseType: !629, size: 32, offset: 7872)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !401, file: !402, line: 80, baseType: !717, size: 320, offset: 7936)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 320, elements: !591)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!167, !611, !133}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !401, file: !402, line: 81, baseType: !711, size: 320, offset: 8256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !401, file: !402, line: 82, baseType: !599, size: 320, offset: 8576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !401, file: !402, line: 83, baseType: !460, size: 32, offset: 8896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !401, file: !402, line: 84, baseType: !573, size: 32, offset: 8928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !401, file: !402, line: 88, baseType: !573, size: 32, offset: 8960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !401, file: !402, line: 89, baseType: !133, size: 64, offset: 9024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !401, file: !402, line: 93, baseType: !460, size: 32, offset: 9088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !401, file: !402, line: 94, baseType: !460, size: 32, offset: 9120)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !401, file: !402, line: 95, baseType: !460, size: 32, offset: 9152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !401, file: !402, line: 96, baseType: !460, size: 32, offset: 9184)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !401, file: !402, line: 97, baseType: !460, size: 32, offset: 9216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !401, file: !402, line: 98, baseType: !514, size: 64, offset: 9280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !401, file: !402, line: 99, baseType: !514, size: 64, offset: 9344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !401, file: !402, line: 100, baseType: !514, size: 64, offset: 9408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !401, file: !402, line: 101, baseType: !514, size: 64, offset: 9472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !401, file: !402, line: 102, baseType: !514, size: 64, offset: 9536)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !401, file: !402, line: 103, baseType: !514, size: 64, offset: 9600)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !401, file: !402, line: 104, baseType: !514, size: 64, offset: 9664)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !401, file: !402, line: 105, baseType: !514, size: 64, offset: 9728)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !401, file: !402, line: 106, baseType: !573, size: 32, offset: 9792)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !401, file: !402, line: 107, baseType: !460, size: 32, offset: 9824)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !401, file: !402, line: 108, baseType: !460, size: 32, offset: 9856)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !401, file: !402, line: 109, baseType: !460, size: 32, offset: 9888)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !401, file: !402, line: 110, baseType: !573, size: 32, offset: 9920)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !401, file: !402, line: 111, baseType: !460, size: 32, offset: 9952)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !401, file: !402, line: 112, baseType: !573, size: 32, offset: 9984)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !401, file: !402, line: 113, baseType: !460, size: 32, offset: 10016)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !401, file: !402, line: 115, baseType: !573, size: 32, offset: 10048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !401, file: !402, line: 117, baseType: !573, size: 32, offset: 10080)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !401, file: !402, line: 119, baseType: !751, size: 32, offset: 10112)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !401, file: !402, line: 120, baseType: !753, size: 32, offset: 10144)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !401, file: !402, line: 124, baseType: !460, size: 32, offset: 10176)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !401, file: !402, line: 125, baseType: !756, size: 64, offset: 10240)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !401, file: !402, line: 129, baseType: !460, size: 32, offset: 10304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !401, file: !402, line: 130, baseType: !513, size: 64, offset: 10368)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !401, file: !402, line: 132, baseType: !505, size: 64, offset: 10432)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !401, file: !402, line: 133, baseType: !460, size: 32, offset: 10496)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !401, file: !402, line: 134, baseType: !460, size: 32, offset: 10528)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !401, file: !402, line: 135, baseType: !573, size: 32, offset: 10560)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !401, file: !402, line: 136, baseType: !573, size: 32, offset: 10592)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !401, file: !402, line: 137, baseType: !573, size: 32, offset: 10624)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !401, file: !402, line: 140, baseType: !460, size: 32, offset: 10656)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !401, file: !402, line: 141, baseType: !460, size: 32, offset: 10688)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !401, file: !402, line: 143, baseType: !460, size: 32, offset: 10720)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !401, file: !402, line: 144, baseType: !460, size: 32, offset: 10752)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !401, file: !402, line: 146, baseType: !573, size: 32, offset: 10784)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !401, file: !402, line: 147, baseType: !573, size: 32, offset: 10816)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !401, file: !402, line: 148, baseType: !573, size: 32, offset: 10848)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !401, file: !402, line: 150, baseType: !573, size: 32, offset: 10880)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !401, file: !402, line: 151, baseType: !133, size: 64, offset: 10944)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !401, file: !402, line: 154, baseType: !514, size: 64, offset: 11008)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !401, file: !402, line: 155, baseType: !514, size: 64, offset: 11072)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !401, file: !402, line: 157, baseType: !756, size: 64, offset: 11136)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !401, file: !402, line: 158, baseType: !460, size: 32, offset: 11200)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !401, file: !402, line: 160, baseType: !573, size: 32, offset: 11232)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !401, file: !402, line: 161, baseType: !573, size: 32, offset: 11264)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !401, file: !402, line: 162, baseType: !460, size: 32, offset: 11296)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !401, file: !402, line: 164, baseType: !514, size: 64, offset: 11328)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !401, file: !402, line: 165, baseType: !612, size: 64, offset: 11392)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !401, file: !402, line: 165, baseType: !612, size: 64, offset: 11456)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !401, file: !402, line: 166, baseType: !460, size: 32, offset: 11520)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !401, file: !402, line: 167, baseType: !573, size: 32, offset: 11552)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !401, file: !402, line: 169, baseType: !573, size: 32, offset: 11584)
!787 = !{}
!788 = !DISubprogram(name: "PetscError", scope: !75, file: !75, line: 668, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !787)
!789 = !DISubroutineType(types: !790)
!790 = !{!167, !131, !28, !126, !126, !28, !74, !126, null}
!791 = !DISubprogram(name: "KSPMonitorRegister", scope: !691, file: !691, line: 114, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !787)
!792 = !DISubroutineType(types: !793)
!793 = !{!28, !126, !126, !80, !794, !809, !813}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!28, !692, !28, !463, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 178, size: 256, elements: !799)
!799 = !{!800, !801, !803, !808}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !798, file: !81, line: 178, baseType: !427, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !798, file: !81, line: 178, baseType: !802, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !81, line: 162, baseType: !80)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !798, file: !81, line: 178, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !805, line: 43, baseType: !806)
!805 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !805, line: 43, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !81, line: 178, baseType: !133, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!28, !429, !80, !133, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!28, !812}
