; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/nest/vecnest.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/nest/vecnest.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 624, baseType: !5, size: 32, elements: !90)
!89 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!95 = !{!96, !99, !100, !103, !304, !307, !270, !305, !186, !110}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !89, line: 330, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !89, line: 330, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !106, line: 73, size: 4480, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !111, !157, !158, !160, !163, !164, !165, !166, !174, !175, !177, !181, !185, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !198, !199, !200, !202, !203, !205, !207, !208, !209, !210, !211, !214, !216, !217, !218, !219, !220, !223, !225, !226, !227, !237, !239, !240, !244, !245, !294, !299, !301, !302, !303}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !105, file: !106, line: 74, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !105, file: !106, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !155)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !106, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 45, size: 448, elements: !115)
!115 = !{!116, !122, !130, !135, !139, !143, !150}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !106, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !103, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !110)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !106, line: 47, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!120, !103, !126}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !127, line: 16, baseType: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !127, line: 16, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !106, line: 48, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!120, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !106, line: 49, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!120, !103, !100, !103}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !106, line: 50, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!120, !103, !100, !134}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !106, line: 51, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!120, !103, !100, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !106, line: 52, baseType: !151, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!120, !103, !100, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !105, file: !106, line: 76, baseType: !96, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !106, line: 77, baseType: !159, size: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !110)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !105, file: !106, line: 78, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !162)
!162 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !105, file: !106, line: 78, baseType: !161, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !105, file: !106, line: 78, baseType: !161, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !105, file: !106, line: 78, baseType: !161, size: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !106, line: 79, baseType: !167, size: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !170, line: 27, baseType: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !172, line: 43, baseType: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!173 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !105, file: !106, line: 80, baseType: !159, size: 32, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !105, file: !106, line: 81, baseType: !176, size: 32, offset: 992)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !110)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !105, file: !106, line: 82, baseType: !178, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !105, file: !106, line: 83, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !105, file: !106, line: 84, baseType: !186, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !105, file: !106, line: 85, baseType: !186, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !105, file: !106, line: 86, baseType: !186, size: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !105, file: !106, line: 87, baseType: !186, size: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !106, line: 88, baseType: !103, size: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !105, file: !106, line: 89, baseType: !167, size: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 90, baseType: !186, size: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !105, file: !106, line: 91, baseType: !186, size: 64, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !105, file: !106, line: 92, baseType: !159, size: 32, offset: 1664)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !105, file: !106, line: 93, baseType: !99, size: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !105, file: !106, line: 94, baseType: !197, size: 64, offset: 1792)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !168)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !105, file: !106, line: 95, baseType: !159, size: 32, offset: 1856)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !105, file: !106, line: 95, baseType: !159, size: 32, offset: 1888)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !105, file: !106, line: 96, baseType: !201, size: 64, offset: 1920)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !105, file: !106, line: 96, baseType: !201, size: 64, offset: 1984)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !105, file: !106, line: 97, baseType: !204, size: 64, offset: 2048)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !105, file: !106, line: 97, baseType: !206, size: 64, offset: 2112)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !105, file: !106, line: 98, baseType: !159, size: 32, offset: 2176)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !105, file: !106, line: 98, baseType: !159, size: 32, offset: 2208)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !105, file: !106, line: 99, baseType: !201, size: 64, offset: 2240)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !105, file: !106, line: 99, baseType: !201, size: 64, offset: 2304)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !105, file: !106, line: 100, baseType: !212, size: 64, offset: 2368)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !162)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !105, file: !106, line: 100, baseType: !215, size: 64, offset: 2432)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !105, file: !106, line: 101, baseType: !159, size: 32, offset: 2496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !105, file: !106, line: 101, baseType: !159, size: 32, offset: 2528)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !105, file: !106, line: 102, baseType: !201, size: 64, offset: 2560)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !105, file: !106, line: 102, baseType: !201, size: 64, offset: 2624)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !105, file: !106, line: 103, baseType: !221, size: 64, offset: 2688)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !213)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !105, file: !106, line: 103, baseType: !224, size: 64, offset: 2752)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !105, file: !106, line: 104, baseType: !154, size: 64, offset: 2816)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !105, file: !106, line: 105, baseType: !159, size: 32, offset: 2880)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !105, file: !106, line: 106, baseType: !228, size: 128, offset: 2944)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, elements: !235)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !106, line: 64, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 61, size: 128, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !231, file: !106, line: 62, baseType: !147, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !231, file: !106, line: 63, baseType: !99, size: 64, offset: 64)
!235 = !{!236}
!236 = !DISubrange(count: 2)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !105, file: !106, line: 107, baseType: !238, size: 64, offset: 3072)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, elements: !235)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !105, file: !106, line: 108, baseType: !99, size: 64, offset: 3136)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !105, file: !106, line: 109, baseType: !241, size: 64, offset: 3200)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!120, !99}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !105, file: !106, line: 111, baseType: !159, size: 32, offset: 3264)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !105, file: !106, line: 112, baseType: !246, size: 320, offset: 3328)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 320, elements: !292)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!120, !250, !103, !99}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !253)
!253 = !{!254, !255, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !252, file: !10, line: 100, baseType: !159, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !10, line: 101, baseType: !256, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !267, !268, !269, !273, !275, !277, !278, !279}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !258, file: !10, line: 84, baseType: !186, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !258, file: !10, line: 85, baseType: !186, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !10, line: 86, baseType: !99, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !258, file: !10, line: 87, baseType: !178, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !258, file: !10, line: 88, baseType: !265, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !258, file: !10, line: 89, baseType: !102, size: 8, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !258, file: !10, line: 90, baseType: !186, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !258, file: !10, line: 91, baseType: !270, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !271, line: 46, baseType: !272)
!271 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!272 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !258, file: !10, line: 92, baseType: !274, size: 32, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !10, line: 93, baseType: !276, size: 32, offset: 544)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !10, line: 94, baseType: !256, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !258, file: !10, line: 95, baseType: !186, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !258, file: !10, line: 96, baseType: !99, size: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !252, file: !10, line: 102, baseType: !186, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !252, file: !10, line: 102, baseType: !186, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !252, file: !10, line: 103, baseType: !186, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !252, file: !10, line: 104, baseType: !96, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !252, file: !10, line: 105, baseType: !274, size: 32, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !252, file: !10, line: 105, baseType: !274, size: 32, offset: 416)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !252, file: !10, line: 105, baseType: !274, size: 32, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !252, file: !10, line: 106, baseType: !103, size: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !10, line: 107, baseType: !289, size: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!292 = !{!293}
!293 = !DISubrange(count: 5)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !105, file: !106, line: 113, baseType: !295, size: 320, offset: 3648)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !292)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!120, !103, !99}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !105, file: !106, line: 114, baseType: !300, size: 320, offset: 3968)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 320, elements: !292)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !105, file: !106, line: 115, baseType: !274, size: 32, offset: 4288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !105, file: !106, line: 120, baseType: !289, size: 64, offset: 4352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !105, file: !106, line: 121, baseType: !274, size: 32, offset: 4416)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !306, line: 1451, baseType: !147)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_Nest", file: !309, line: 12, baseType: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/impls/nest/vecnestimpl.h", directory: "/home/users/ndemeye/xSDK")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 7, size: 256, elements: !311)
!311 = !{!312, !313, !616, !617}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !310, file: !309, line: 8, baseType: !159, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !310, file: !309, line: 9, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !318, line: 142, size: 12800, elements: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = !{!320, !322, !541, !562, !563, !564, !610, !611, !612, !613, !615}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !317, file: !318, line: 143, baseType: !321, size: 4480)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !106, line: 122, baseType: !105)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !317, file: !318, line: 143, baseType: !323, size: 5248, offset: 4480)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 5248, elements: !155)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !318, line: 23, size: 5248, elements: !325)
!325 = !{!326, !330, !335, !339, !343, !349, !354, !355, !356, !360, !364, !365, !366, !370, !374, !380, !381, !385, !389, !393, !394, !401, !405, !406, !410, !414, !415, !416, !420, !421, !428, !433, !434, !435, !439, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !460, !461, !462, !466, !470, !471, !472, !473, !477, !478, !479, !480, !481, !482, !483, !487, !488, !492, !499, !500, !505, !506, !510, !511, !512, !513, !514, !515, !516, !517, !521, !522, !523, !529, !533, !534, !535}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !324, file: !318, line: 24, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!120, !315, !314}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !324, file: !318, line: 25, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!120, !315, !159, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !324, file: !318, line: 26, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!120, !159, !314}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !324, file: !318, line: 27, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!120, !315, !315, !221}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !324, file: !318, line: 28, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!120, !315, !159, !347, !221}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !324, file: !318, line: 29, baseType: !350, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!120, !315, !353, !212}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !324, file: !318, line: 30, baseType: !340, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !324, file: !318, line: 31, baseType: !344, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !324, file: !318, line: 32, baseType: !357, size: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!120, !315, !222}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !324, file: !318, line: 33, baseType: !361, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!120, !315, !315}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !318, line: 34, baseType: !357, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !324, file: !318, line: 35, baseType: !361, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !324, file: !318, line: 36, baseType: !367, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!120, !315, !222, !315}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !324, file: !318, line: 37, baseType: !371, size: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!120, !315, !222, !222, !315}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !324, file: !318, line: 38, baseType: !375, size: 64, offset: 896)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!120, !315, !159, !378, !314}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !324, file: !318, line: 39, baseType: !367, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !324, file: !318, line: 40, baseType: !382, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!120, !315, !222, !315, !315}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !324, file: !318, line: 41, baseType: !386, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!120, !315, !222, !222, !222, !315, !315}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !324, file: !318, line: 42, baseType: !390, size: 64, offset: 1152)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!120, !315, !315, !315}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !324, file: !318, line: 43, baseType: !390, size: 64, offset: 1216)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !324, file: !318, line: 44, baseType: !395, size: 64, offset: 1280)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!120, !315, !159, !398, !378, !400}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !324, file: !318, line: 45, baseType: !402, size: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!120, !315}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !324, file: !318, line: 46, baseType: !402, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !324, file: !318, line: 47, baseType: !407, size: 64, offset: 1472)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!120, !315, !224}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !324, file: !318, line: 48, baseType: !411, size: 64, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!120, !315, !204}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !324, file: !318, line: 49, baseType: !411, size: 64, offset: 1600)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !324, file: !318, line: 50, baseType: !407, size: 64, offset: 1664)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !324, file: !318, line: 51, baseType: !417, size: 64, offset: 1728)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!120, !315, !204, !212}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !324, file: !318, line: 52, baseType: !417, size: 64, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !324, file: !318, line: 53, baseType: !422, size: 64, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!120, !315, !425}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !324, file: !318, line: 54, baseType: !429, size: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!120, !315, !432, !274}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !324, file: !318, line: 55, baseType: !395, size: 64, offset: 1984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !324, file: !318, line: 56, baseType: !402, size: 64, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !324, file: !318, line: 57, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!120, !315, !126}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !324, file: !318, line: 58, baseType: !440, size: 64, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!120, !315, !378}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !324, file: !318, line: 59, baseType: !440, size: 64, offset: 2240)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !324, file: !318, line: 60, baseType: !340, size: 64, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !324, file: !318, line: 61, baseType: !340, size: 64, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !324, file: !318, line: 62, baseType: !350, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !324, file: !318, line: 63, baseType: !344, size: 64, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !324, file: !318, line: 64, baseType: !344, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !324, file: !318, line: 65, baseType: !436, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !324, file: !318, line: 66, baseType: !402, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !324, file: !318, line: 67, baseType: !402, size: 64, offset: 2752)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !324, file: !318, line: 68, baseType: !453, size: 64, offset: 2816)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!120, !315, !456}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !457, line: 30, baseType: !458)
!457 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !457, line: 30, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !324, file: !318, line: 69, baseType: !395, size: 64, offset: 2880)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !324, file: !318, line: 70, baseType: !402, size: 64, offset: 2944)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !324, file: !318, line: 71, baseType: !463, size: 64, offset: 3008)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!120, !250, !315}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !324, file: !318, line: 72, baseType: !467, size: 64, offset: 3072)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!120, !315, !315, !212}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !324, file: !318, line: 73, baseType: !390, size: 64, offset: 3136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !324, file: !318, line: 74, baseType: !390, size: 64, offset: 3200)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !324, file: !318, line: 75, baseType: !390, size: 64, offset: 3264)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !324, file: !318, line: 76, baseType: !474, size: 64, offset: 3328)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!120, !315, !159, !398, !221}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !324, file: !318, line: 77, baseType: !402, size: 64, offset: 3392)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !324, file: !318, line: 78, baseType: !402, size: 64, offset: 3456)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !324, file: !318, line: 79, baseType: !402, size: 64, offset: 3520)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !324, file: !318, line: 80, baseType: !402, size: 64, offset: 3584)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !324, file: !318, line: 81, baseType: !357, size: 64, offset: 3648)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !324, file: !318, line: 82, baseType: !402, size: 64, offset: 3712)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !324, file: !318, line: 83, baseType: !484, size: 64, offset: 3776)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!120, !315, !159, !315, !400}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !324, file: !318, line: 84, baseType: !484, size: 64, offset: 3840)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !324, file: !318, line: 85, baseType: !489, size: 64, offset: 3904)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!120, !315, !315, !221, !221}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !324, file: !318, line: 86, baseType: !493, size: 64, offset: 3968)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!120, !315, !496, !314}
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !457, line: 11, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !457, line: 11, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !324, file: !318, line: 87, baseType: !493, size: 64, offset: 4032)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !324, file: !318, line: 88, baseType: !501, size: 64, offset: 4096)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!120, !315, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !324, file: !318, line: 89, baseType: !501, size: 64, offset: 4160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !324, file: !318, line: 90, baseType: !507, size: 64, offset: 4224)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!120, !315, !159, !398, !398, !315, !400}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !324, file: !318, line: 91, baseType: !507, size: 64, offset: 4288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !324, file: !318, line: 92, baseType: !436, size: 64, offset: 4352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !324, file: !318, line: 93, baseType: !436, size: 64, offset: 4416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !324, file: !318, line: 94, baseType: !361, size: 64, offset: 4480)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !324, file: !318, line: 95, baseType: !361, size: 64, offset: 4544)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !324, file: !318, line: 96, baseType: !361, size: 64, offset: 4608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !324, file: !318, line: 97, baseType: !361, size: 64, offset: 4672)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !324, file: !318, line: 98, baseType: !518, size: 64, offset: 4736)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!120, !315, !274}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !324, file: !318, line: 99, baseType: !407, size: 64, offset: 4800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !324, file: !318, line: 100, baseType: !407, size: 64, offset: 4864)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !324, file: !318, line: 101, baseType: !524, size: 64, offset: 4928)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!120, !315, !224, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !324, file: !318, line: 102, baseType: !530, size: 64, offset: 4992)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!120, !315, !504, !527}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !324, file: !318, line: 103, baseType: !407, size: 64, offset: 5056)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !324, file: !318, line: 104, baseType: !501, size: 64, offset: 5120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !324, file: !318, line: 105, baseType: !536, size: 64, offset: 5184)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!120, !159, !347, !314, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !317, file: !318, line: 144, baseType: !542, size: 64, offset: 9728)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !457, line: 60, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !545, line: 240, size: 640, elements: !546)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !544, file: !545, line: 241, baseType: !96, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !545, line: 242, baseType: !176, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !544, file: !545, line: 243, baseType: !159, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !544, file: !545, line: 243, baseType: !159, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !544, file: !545, line: 244, baseType: !159, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !544, file: !545, line: 244, baseType: !159, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !544, file: !545, line: 245, baseType: !204, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !544, file: !545, line: 246, baseType: !274, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !544, file: !545, line: 247, baseType: !159, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !544, file: !545, line: 251, baseType: !159, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !544, file: !545, line: 252, baseType: !456, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !544, file: !545, line: 253, baseType: !274, size: 32, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !544, file: !545, line: 254, baseType: !159, size: 32, offset: 544)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !544, file: !545, line: 254, baseType: !159, size: 32, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !544, file: !545, line: 255, baseType: !159, size: 32, offset: 608)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !318, line: 145, baseType: !99, size: 64, offset: 9792)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !317, file: !318, line: 146, baseType: !274, size: 32, offset: 9856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !317, file: !318, line: 147, baseType: !565, size: 1344, offset: 9920)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !318, line: 140, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 114, size: 1344, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !586, !587, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !566, file: !318, line: 115, baseType: !159, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !566, file: !318, line: 116, baseType: !159, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !566, file: !318, line: 117, baseType: !159, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !566, file: !318, line: 118, baseType: !159, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !566, file: !318, line: 119, baseType: !159, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !566, file: !318, line: 120, baseType: !159, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !566, file: !318, line: 121, baseType: !204, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !566, file: !318, line: 122, baseType: !221, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !566, file: !318, line: 124, baseType: !96, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !566, file: !318, line: 125, baseType: !176, size: 32, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !566, file: !318, line: 125, baseType: !176, size: 32, offset: 416)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !566, file: !318, line: 126, baseType: !176, size: 32, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !566, file: !318, line: 126, baseType: !176, size: 32, offset: 480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !566, file: !318, line: 127, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !89, line: 339, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !89, line: 339, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !566, file: !318, line: 128, baseType: !582, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !566, file: !318, line: 129, baseType: !588, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !89, line: 341, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !89, line: 351, size: 192, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !590, file: !89, line: 354, baseType: !110, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !590, file: !89, line: 355, baseType: !110, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !590, file: !89, line: 356, baseType: !110, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !590, file: !89, line: 361, baseType: !110, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !590, file: !89, line: 362, baseType: !270, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !566, file: !318, line: 130, baseType: !159, size: 32, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !566, file: !318, line: 130, baseType: !159, size: 32, offset: 736)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !566, file: !318, line: 131, baseType: !221, size: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !566, file: !318, line: 131, baseType: !221, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !566, file: !318, line: 132, baseType: !204, size: 64, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !566, file: !318, line: 132, baseType: !204, size: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !566, file: !318, line: 133, baseType: !159, size: 32, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !566, file: !318, line: 134, baseType: !204, size: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !566, file: !318, line: 135, baseType: !159, size: 32, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !566, file: !318, line: 136, baseType: !274, size: 32, offset: 1184)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !566, file: !318, line: 137, baseType: !274, size: 32, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !566, file: !318, line: 138, baseType: !400, size: 32, offset: 1248)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !566, file: !318, line: 139, baseType: !204, size: 64, offset: 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !317, file: !318, line: 147, baseType: !565, size: 1344, offset: 11264)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !317, file: !318, line: 148, baseType: !274, size: 32, offset: 12608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !317, file: !318, line: 149, baseType: !159, size: 32, offset: 12640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !317, file: !318, line: 150, baseType: !614, size: 32, offset: 12672)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !317, file: !318, line: 157, baseType: !186, size: 64, offset: 12736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !310, file: !309, line: 10, baseType: !540, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "setup_called", scope: !310, file: !309, line: 11, baseType: !274, size: 32, offset: 192)
!618 = !{i32 7, !"Dwarf Version", i32 4}
!619 = !{i32 2, !"Debug Info Version", i32 3}
!620 = !{i32 1, !"wchar_size", i32 4}
!621 = !{i32 7, !"PIC Level", i32 2}
!622 = !{i32 7, !"uwtable", i32 1}
!623 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!624 = distinct !DISubprogram(name: "VecNestGetSubVec_Nest", scope: !625, file: !625, line: 804, type: !626, scopeLine: 805, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !628)
!625 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/nest/vecnest.c", directory: "/home/users/ndemeye/xSDK")
!626 = !DISubroutineType(types: !627)
!627 = !{!120, !315, !159, !314}
!628 = !{!629, !630, !631, !632, !633}
!629 = !DILocalVariable(name: "X", arg: 1, scope: !624, file: !625, line: 804, type: !315)
!630 = !DILocalVariable(name: "idxm", arg: 2, scope: !624, file: !625, line: 804, type: !159)
!631 = !DILocalVariable(name: "sx", arg: 3, scope: !624, file: !625, line: 804, type: !314)
!632 = !DILocalVariable(name: "ierr", scope: !624, file: !625, line: 806, type: !120)
!633 = !DILocalVariable(name: "ierr__", scope: !634, file: !625, line: 809, type: !120)
!634 = distinct !DILexicalBlock(scope: !624, file: !625, line: 809, column: 50)
!635 = !DILocation(line: 0, scope: !624)
!636 = !DILocation(line: 808, column: 3, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !625, line: 808, column: 3)
!638 = distinct !DILexicalBlock(scope: !639, file: !625, line: 808, column: 3)
!639 = distinct !DILexicalBlock(scope: !624, file: !625, line: 808, column: 3)
!640 = !{!641, !641, i64 0}
!641 = !{!"any pointer", !642, i64 0}
!642 = !{!"omnipotent char", !643, i64 0}
!643 = !{!"Simple C/C++ TBAA"}
!644 = !DILocation(line: 808, column: 3, scope: !638)
!645 = !DILocalVariable(name: "x", arg: 1, scope: !646, file: !625, line: 788, type: !315)
!646 = distinct !DISubprogram(name: "VecNestGetSubVecs_Private", scope: !625, file: !625, line: 788, type: !647, scopeLine: 789, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{!120, !315, !159, !398, !314}
!649 = !{!645, !650, !651, !652, !653, !654, !655}
!650 = !DILocalVariable(name: "m", arg: 2, scope: !646, file: !625, line: 788, type: !159)
!651 = !DILocalVariable(name: "idxm", arg: 3, scope: !646, file: !625, line: 788, type: !398)
!652 = !DILocalVariable(name: "vec", arg: 4, scope: !646, file: !625, line: 788, type: !314)
!653 = !DILocalVariable(name: "b", scope: !646, file: !625, line: 790, type: !307)
!654 = !DILocalVariable(name: "i", scope: !646, file: !625, line: 791, type: !159)
!655 = !DILocalVariable(name: "row", scope: !646, file: !625, line: 792, type: !159)
!656 = !DILocation(line: 0, scope: !646, inlinedAt: !657)
!657 = distinct !DILocation(line: 809, column: 10, scope: !624)
!658 = !DILocation(line: 790, column: 31, scope: !646, inlinedAt: !657)
!659 = !{!660, !641, i64 1224}
!660 = !{!"_p_Vec", !661, i64 0, !642, i64 560, !641, i64 1216, !641, i64 1224, !642, i64 1232, !665, i64 1240, !665, i64 1408, !642, i64 1576, !662, i64 1580, !642, i64 1584, !641, i64 1592}
