; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/rich.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/rich.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!123 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!124 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!125 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 155, baseType: !5, size: 32, elements: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!128 = !{!129, !130, !131, !132, !133}
!129 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!133 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142}
!136 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!137 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!138 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!139 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!140 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!141 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!142 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!143 = !{!144, !154, !158, !159, !162, !359, !217, !360, !363, !243, !26, !366, !151, !367, !326}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_Richardson", file: !146, line: 13, baseType: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/rich/richardsonimpl.h", directory: "/home/users/ndemeye/xSDK")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 10, size: 128, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !147, file: !146, line: 11, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !151)
!151 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "selfscale", scope: !147, file: !146, line: 12, baseType: !153, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !155, line: 330, baseType: !156)
!155 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !155, line: 330, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !165, line: 73, size: 4480, elements: !166)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!166 = !{!167, !169, !215, !216, !218, !220, !221, !222, !223, !231, !232, !234, !238, !242, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257, !259, !260, !262, !264, !265, !266, !267, !268, !270, !272, !273, !274, !275, !276, !279, !281, !282, !283, !293, !295, !296, !300, !301, !349, !354, !356, !357, !358}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !164, file: !165, line: 74, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !164, file: !165, line: 75, baseType: !170, size: 448, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, elements: !213)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !165, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 45, size: 448, elements: !173)
!173 = !{!174, !180, !188, !193, !197, !201, !208}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !172, file: !165, line: 46, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !162, !179}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !172, file: !165, line: 47, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!178, !162, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !185, line: 16, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !185, line: 16, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !172, file: !165, line: 48, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!178, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !172, file: !165, line: 49, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!178, !162, !159, !162}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !172, file: !165, line: 50, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!178, !162, !159, !192}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !172, file: !165, line: 51, baseType: !202, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!178, !162, !159, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !172, file: !165, line: 52, baseType: !209, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!178, !162, !159, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!213 = !{!214}
!214 = !DISubrange(count: 1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !164, file: !165, line: 76, baseType: !154, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 77, baseType: !217, size: 32, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !164, file: !165, line: 78, baseType: !219, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !151)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !164, file: !165, line: 78, baseType: !219, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !164, file: !165, line: 78, baseType: !219, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !164, file: !165, line: 78, baseType: !219, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 79, baseType: !224, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !227, line: 27, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !229, line: 43, baseType: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!230 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !164, file: !165, line: 80, baseType: !217, size: 32, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !164, file: !165, line: 81, baseType: !233, size: 32, offset: 992)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !164, file: !165, line: 82, baseType: !235, size: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !164, file: !165, line: 83, baseType: !239, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !164, file: !165, line: 84, baseType: !243, size: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !164, file: !165, line: 85, baseType: !243, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !164, file: !165, line: 86, baseType: !243, size: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !164, file: !165, line: 87, baseType: !243, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 88, baseType: !162, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !164, file: !165, line: 89, baseType: !224, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 90, baseType: !243, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !164, file: !165, line: 91, baseType: !243, size: 64, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !164, file: !165, line: 92, baseType: !217, size: 32, offset: 1664)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !164, file: !165, line: 93, baseType: !158, size: 64, offset: 1728)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 94, baseType: !254, size: 64, offset: 1792)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !225)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !164, file: !165, line: 95, baseType: !217, size: 32, offset: 1856)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !164, file: !165, line: 95, baseType: !217, size: 32, offset: 1888)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !164, file: !165, line: 96, baseType: !258, size: 64, offset: 1920)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !164, file: !165, line: 96, baseType: !258, size: 64, offset: 1984)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !164, file: !165, line: 97, baseType: !261, size: 64, offset: 2048)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !164, file: !165, line: 97, baseType: !263, size: 64, offset: 2112)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !164, file: !165, line: 98, baseType: !217, size: 32, offset: 2176)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !164, file: !165, line: 98, baseType: !217, size: 32, offset: 2208)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !164, file: !165, line: 99, baseType: !258, size: 64, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !164, file: !165, line: 99, baseType: !258, size: 64, offset: 2304)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !164, file: !165, line: 100, baseType: !269, size: 64, offset: 2368)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !164, file: !165, line: 100, baseType: !271, size: 64, offset: 2432)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !164, file: !165, line: 101, baseType: !217, size: 32, offset: 2496)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !164, file: !165, line: 101, baseType: !217, size: 32, offset: 2528)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !164, file: !165, line: 102, baseType: !258, size: 64, offset: 2560)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !164, file: !165, line: 102, baseType: !258, size: 64, offset: 2624)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !164, file: !165, line: 103, baseType: !277, size: 64, offset: 2688)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !150)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !164, file: !165, line: 103, baseType: !280, size: 64, offset: 2752)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !164, file: !165, line: 104, baseType: !212, size: 64, offset: 2816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !164, file: !165, line: 105, baseType: !217, size: 32, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !164, file: !165, line: 106, baseType: !284, size: 128, offset: 2944)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !291)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !165, line: 64, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 61, size: 128, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !287, file: !165, line: 62, baseType: !205, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !287, file: !165, line: 63, baseType: !158, size: 64, offset: 64)
!291 = !{!292}
!292 = !DISubrange(count: 2)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !164, file: !165, line: 107, baseType: !294, size: 64, offset: 3072)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !291)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !164, file: !165, line: 108, baseType: !158, size: 64, offset: 3136)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !164, file: !165, line: 109, baseType: !297, size: 64, offset: 3200)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!178, !158}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !164, file: !165, line: 111, baseType: !217, size: 32, offset: 3264)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !164, file: !165, line: 112, baseType: !302, size: 320, offset: 3328)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 320, elements: !347)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!178, !306, !162, !158}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !309)
!309 = !{!310, !311, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !308, file: !10, line: 100, baseType: !217, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !10, line: 101, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !323, !324, !325, !329, !330, !332, !333, !334}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !314, file: !10, line: 84, baseType: !243, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !314, file: !10, line: 85, baseType: !243, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !10, line: 86, baseType: !158, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !314, file: !10, line: 87, baseType: !235, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !314, file: !10, line: 88, baseType: !321, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !314, file: !10, line: 89, baseType: !161, size: 8, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !314, file: !10, line: 90, baseType: !243, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !314, file: !10, line: 91, baseType: !326, size: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !327, line: 46, baseType: !328)
!327 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!328 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !10, line: 92, baseType: !153, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !314, file: !10, line: 93, baseType: !331, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !10, line: 94, baseType: !312, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !314, file: !10, line: 95, baseType: !243, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !314, file: !10, line: 96, baseType: !158, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !10, line: 102, baseType: !243, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !308, file: !10, line: 102, baseType: !243, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !308, file: !10, line: 103, baseType: !243, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !308, file: !10, line: 104, baseType: !154, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !308, file: !10, line: 105, baseType: !153, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !308, file: !10, line: 105, baseType: !153, size: 32, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !308, file: !10, line: 105, baseType: !153, size: 32, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !308, file: !10, line: 106, baseType: !162, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !10, line: 107, baseType: !344, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!347 = !{!348}
!348 = !DISubrange(count: 5)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !164, file: !165, line: 113, baseType: !350, size: 320, offset: 3648)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!178, !162, !158}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !164, file: !165, line: 114, baseType: !355, size: 320, offset: 3968)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 320, elements: !347)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !164, file: !165, line: 115, baseType: !153, size: 32, offset: 4288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !164, file: !165, line: 120, baseType: !344, size: 64, offset: 4352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !164, file: !165, line: 121, baseType: !153, size: 32, offset: 4416)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !155, line: 331, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !155, line: 331, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !155, line: 338, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !155, line: 338, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !134)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !368, line: 1451, baseType: !205)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!369 = !{i32 7, !"Dwarf Version", i32 4}
!370 = !{i32 2, !"Debug Info Version", i32 3}
!371 = !{i32 1, !"wchar_size", i32 4}
!372 = !{i32 7, !"PIC Level", i32 2}
!373 = !{i32 7, !"uwtable", i32 1}
!374 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!375 = distinct !DISubprogram(name: "KSPSetUp_Richardson", scope: !376, file: !376, line: 7, type: !377, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !620)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/rich/rich.c", directory: "/home/users/ndemeye/xSDK")
!377 = !DISubroutineType(types: !378)
!378 = !{!178, !379}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !382)
!382 = !{!383, !385, !436, !441, !442, !443, !444, !474, !475, !476, !477, !478, !480, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !513, !519, !520, !521, !522, !527, !528, !529, !530, !535, !536, !537, !538, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !590, !591, !592, !593, !594, !601, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !617, !618, !619}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !381, file: !102, line: 76, baseType: !384, size: 4480)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !165, line: 122, baseType: !164)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !381, file: !102, line: 76, baseType: !386, size: 896, offset: 4480)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 896, elements: !213)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !388)
!388 = !{!389, !397, !401, !403, !411, !412, !416, !417, !421, !425, !429, !430, !434, !435}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !387, file: !102, line: 19, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!178, !379, !393, !396}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !127, line: 21, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !127, line: 21, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !387, file: !102, line: 22, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!178, !379, !393, !393, !396}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !387, file: !102, line: 25, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !387, file: !102, line: 26, baseType: !404, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!178, !379, !407, !407}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !408, line: 16, baseType: !409)
!408 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !408, line: 16, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !387, file: !102, line: 27, baseType: !402, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !387, file: !102, line: 28, baseType: !413, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!178, !306, !379}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !387, file: !102, line: 29, baseType: !402, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !387, file: !102, line: 30, baseType: !418, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!178, !379, !269, !269}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !387, file: !102, line: 31, baseType: !422, size: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!178, !379, !217, !269, !269, !261}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !387, file: !102, line: 32, baseType: !426, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!178, !379, !153, !153, !261, !396, !269, !269}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !387, file: !102, line: 33, baseType: !402, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !387, file: !102, line: 34, baseType: !431, size: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!178, !379, !184}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !387, file: !102, line: 35, baseType: !402, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !387, file: !102, line: 36, baseType: !431, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !381, file: !102, line: 77, baseType: !437, size: 64, offset: 5376)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !438, line: 14, baseType: !439)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !438, line: 14, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !381, file: !102, line: 78, baseType: !153, size: 32, offset: 5440)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !381, file: !102, line: 79, baseType: !153, size: 32, offset: 5472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !381, file: !102, line: 81, baseType: !217, size: 32, offset: 5504)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !381, file: !102, line: 82, baseType: !445, size: 64, offset: 5568)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !448)
!448 = !{!449, !450, !470, !471, !472, !473}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !447, file: !102, line: 55, baseType: !384, size: 4480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !447, file: !102, line: 55, baseType: !451, size: 448, offset: 4480)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 448, elements: !213)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !453)
!453 = !{!454, !458, !459, !463, !464, !465, !469}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !452, file: !102, line: 42, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!178, !445, !393, !393}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !452, file: !102, line: 43, baseType: !455, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !452, file: !102, line: 44, baseType: !460, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!178, !445}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !452, file: !102, line: 45, baseType: !460, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !452, file: !102, line: 46, baseType: !460, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !452, file: !102, line: 47, baseType: !466, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!178, !445, !184}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !452, file: !102, line: 48, baseType: !460, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !447, file: !102, line: 56, baseType: !379, size: 64, offset: 4928)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !447, file: !102, line: 57, baseType: !407, size: 64, offset: 4992)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !447, file: !102, line: 58, baseType: !254, size: 64, offset: 5056)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !447, file: !102, line: 59, baseType: !158, size: 64, offset: 5120)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !381, file: !102, line: 83, baseType: !153, size: 32, offset: 5632)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !381, file: !102, line: 84, baseType: !153, size: 32, offset: 5664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !381, file: !102, line: 85, baseType: !153, size: 32, offset: 5696)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !381, file: !102, line: 86, baseType: !153, size: 32, offset: 5728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !381, file: !102, line: 87, baseType: !479, size: 32, offset: 5760)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !381, file: !102, line: 88, baseType: !481, size: 384, offset: 5792)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 384, elements: !482)
!482 = !{!483, !484}
!483 = !DISubrange(count: 4)
!484 = !DISubrange(count: 3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !381, file: !102, line: 89, baseType: !150, size: 64, offset: 6208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !381, file: !102, line: 90, baseType: !150, size: 64, offset: 6272)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !381, file: !102, line: 91, baseType: !150, size: 64, offset: 6336)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !381, file: !102, line: 92, baseType: !150, size: 64, offset: 6400)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !381, file: !102, line: 93, baseType: !150, size: 64, offset: 6464)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !381, file: !102, line: 94, baseType: !150, size: 64, offset: 6528)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !381, file: !102, line: 95, baseType: !359, size: 32, offset: 6592)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !381, file: !102, line: 96, baseType: !153, size: 32, offset: 6624)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !381, file: !102, line: 98, baseType: !393, size: 64, offset: 6656)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !381, file: !102, line: 98, baseType: !393, size: 64, offset: 6720)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !381, file: !102, line: 102, baseType: !269, size: 64, offset: 6784)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !381, file: !102, line: 103, baseType: !269, size: 64, offset: 6848)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !381, file: !102, line: 104, baseType: !217, size: 32, offset: 6912)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !381, file: !102, line: 105, baseType: !217, size: 32, offset: 6944)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !381, file: !102, line: 106, baseType: !153, size: 32, offset: 6976)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !381, file: !102, line: 107, baseType: !269, size: 64, offset: 7040)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !381, file: !102, line: 108, baseType: !269, size: 64, offset: 7104)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !381, file: !102, line: 109, baseType: !217, size: 32, offset: 7168)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !381, file: !102, line: 110, baseType: !217, size: 32, offset: 7200)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !381, file: !102, line: 111, baseType: !153, size: 32, offset: 7232)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !381, file: !102, line: 113, baseType: !217, size: 32, offset: 7264)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !381, file: !102, line: 114, baseType: !153, size: 32, offset: 7296)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !381, file: !102, line: 117, baseType: !217, size: 32, offset: 7328)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !381, file: !102, line: 120, baseType: !509, size: 320, offset: 7360)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 320, elements: !347)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!178, !379, !217, !150, !158}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !381, file: !102, line: 121, baseType: !514, size: 320, offset: 7680)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 320, elements: !347)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!178, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !381, file: !102, line: 122, baseType: !355, size: 320, offset: 8000)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !381, file: !102, line: 123, baseType: !217, size: 32, offset: 8320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !381, file: !102, line: 124, baseType: !153, size: 32, offset: 8352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !381, file: !102, line: 126, baseType: !523, size: 320, offset: 8384)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !347)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!178, !379, !158}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !381, file: !102, line: 127, baseType: !514, size: 320, offset: 8704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !381, file: !102, line: 128, baseType: !355, size: 320, offset: 9024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !381, file: !102, line: 129, baseType: !217, size: 32, offset: 9344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !381, file: !102, line: 131, baseType: !531, size: 64, offset: 9408)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!178, !379, !217, !150, !534, !158}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !381, file: !102, line: 132, baseType: !297, size: 64, offset: 9472)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !381, file: !102, line: 133, baseType: !158, size: 64, offset: 9536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !381, file: !102, line: 135, baseType: !158, size: 64, offset: 9600)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !381, file: !102, line: 137, baseType: !539, size: 64, offset: 9664)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !102, line: 139, baseType: !158, size: 64, offset: 9728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9792)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9824)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9856)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9888)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9920)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9952)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 9984)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10016)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10080)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10144)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10176)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !381, file: !102, line: 142, baseType: !153, size: 32, offset: 10208)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10240)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10304)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10368)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10432)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10496)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10560)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10624)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10688)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10752)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10816)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10880)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 10944)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 11008)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !381, file: !102, line: 143, baseType: !184, size: 64, offset: 11072)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11136)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11168)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11200)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11232)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11264)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11296)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11328)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11360)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11392)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11424)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11456)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11488)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11520)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !381, file: !102, line: 144, baseType: !572, size: 32, offset: 11552)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !381, file: !102, line: 147, baseType: !217, size: 32, offset: 11584)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !381, file: !102, line: 148, baseType: !396, size: 64, offset: 11648)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !381, file: !102, line: 150, baseType: !589, size: 32, offset: 11712)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !381, file: !102, line: 151, baseType: !153, size: 32, offset: 11744)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !381, file: !102, line: 153, baseType: !217, size: 32, offset: 11776)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !381, file: !102, line: 154, baseType: !217, size: 32, offset: 11808)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !381, file: !102, line: 156, baseType: !153, size: 32, offset: 11840)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !381, file: !102, line: 161, baseType: !595, size: 192, offset: 11904)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !102, line: 157, size: 192, elements: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !595, file: !102, line: 158, baseType: !407, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !595, file: !102, line: 158, baseType: !407, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !595, file: !102, line: 159, baseType: !153, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !595, file: !102, line: 160, baseType: !153, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !381, file: !102, line: 163, baseType: !602, size: 32, offset: 12096)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !381, file: !102, line: 165, baseType: !479, size: 32, offset: 12128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !381, file: !102, line: 166, baseType: !602, size: 32, offset: 12160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !381, file: !102, line: 171, baseType: !153, size: 32, offset: 12192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !381, file: !102, line: 172, baseType: !153, size: 32, offset: 12224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !381, file: !102, line: 173, baseType: !153, size: 32, offset: 12256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !381, file: !102, line: 174, baseType: !393, size: 64, offset: 12288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !381, file: !102, line: 175, baseType: !393, size: 64, offset: 12352)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !381, file: !102, line: 177, baseType: !217, size: 32, offset: 12416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !381, file: !102, line: 178, baseType: !153, size: 32, offset: 12448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !381, file: !102, line: 180, baseType: !184, size: 64, offset: 12480)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !381, file: !102, line: 182, baseType: !614, size: 64, offset: 12544)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!178, !379, !393, !393, !158}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !381, file: !102, line: 183, baseType: !614, size: 64, offset: 12608)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !381, file: !102, line: 184, baseType: !158, size: 64, offset: 12672)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !381, file: !102, line: 184, baseType: !158, size: 64, offset: 12736)
!620 = !{!621, !622, !623, !624, !628}
!621 = !DILocalVariable(name: "ksp", arg: 1, scope: !375, file: !376, line: 7, type: !379)
!622 = !DILocalVariable(name: "ierr", scope: !375, file: !376, line: 9, type: !178)
!623 = !DILocalVariable(name: "richardsonP", scope: !375, file: !376, line: 10, type: !144)
!624 = !DILocalVariable(name: "ierr__", scope: !625, file: !376, line: 14, type: !178)
!625 = distinct !DILexicalBlock(scope: !626, file: !376, line: 14, column: 34)
!626 = distinct !DILexicalBlock(scope: !627, file: !376, line: 13, column: 31)
!627 = distinct !DILexicalBlock(scope: !375, file: !376, line: 13, column: 7)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !376, line: 16, type: !178)
!629 = distinct !DILexicalBlock(scope: !630, file: !376, line: 16, column: 34)
!630 = distinct !DILexicalBlock(scope: !627, file: !376, line: 15, column: 10)
!631 = !DILocation(line: 0, scope: !375)
!632 = !DILocation(line: 10, column: 55, scope: !375)
!633 = !{!634, !639, i64 1216}
!634 = !{!"_p_KSP", !635, i64 0, !637, i64 560, !639, i64 672, !637, i64 680, !637, i64 684, !636, i64 688, !639, i64 696, !637, i64 704, !637, i64 708, !637, i64 712, !637, i64 716, !637, i64 720, !637, i64 724, !640, i64 776, !640, i64 784, !640, i64 792, !640, i64 800, !640, i64 808, !640, i64 816, !637, i64 824, !637, i64 828, !639, i64 832, !639, i64 840, !639, i64 848, !639, i64 856, !636, i64 864, !636, i64 868, !637, i64 872, !639, i64 880, !639, i64 888, !636, i64 896, !636, i64 900, !637, i64 904, !636, i64 908, !637, i64 912, !636, i64 916, !637, i64 920, !637, i64 960, !637, i64 1000, !636, i64 1040, !637, i64 1044, !637, i64 1048, !637, i64 1088, !637, i64 1128, !636, i64 1168, !639, i64 1176, !639, i64 1184, !639, i64 1192, !639, i64 1200, !639, i64 1208, !639, i64 1216, !637, i64 1224, !637, i64 1228, !637, i64 1232, !637, i64 1236, !637, i64 1240, !637, i64 1244, !637, i64 1248, !637, i64 1252, !637, i64 1256, !637, i64 1260, !637, i64 1264, !637, i64 1268, !637, i64 1272, !637, i64 1276, !639, i64 1280, !639, i64 1288, !639, i64 1296, !639, i64 1304, !639, i64 1312, !639, i64 1320, !639, i64 1328, !639, i64 1336, !639, i64 1344, !639, i64 1352, !639, i64 1360, !639, i64 1368, !639, i64 1376, !639, i64 1384, !637, i64 1392, !637, i64 1396, !637, i64 1400, !637, i64 1404, !637, i64 1408, !637, i64 1412, !637, i64 1416, !637, i64 1420, !637, i64 1424, !637, i64 1428, !637, i64 1432, !637, i64 1436, !637, i64 1440, !637, i64 1444, !636, i64 1448, !639, i64 1456, !637, i64 1464, !637, i64 1468, !636, i64 1472, !636, i64 1476, !637, i64 1480, !642, i64 1488, !637, i64 1512, !637, i64 1516, !637, i64 1520, !637, i64 1524, !637, i64 1528, !637, i64 1532, !639, i64 1536, !639, i64 1544, !636, i64 1552, !637, i64 1556, !639, i64 1560, !639, i64 1568, !639, i64 1576, !639, i64 1584, !639, i64 1592}
!635 = !{!"_p_PetscObject", !636, i64 0, !637, i64 8, !639, i64 64, !636, i64 72, !640, i64 80, !640, i64 88, !640, i64 96, !640, i64 104, !641, i64 112, !636, i64 120, !636, i64 124, !639, i64 128, !639, i64 136, !639, i64 144, !639, i64 152, !639, i64 160, !639, i64 168, !639, i64 176, !641, i64 184, !639, i64 192, !639, i64 200, !636, i64 208, !639, i64 216, !641, i64 224, !636, i64 232, !636, i64 236, !639, i64 240, !639, i64 248, !639, i64 256, !639, i64 264, !636, i64 272, !636, i64 276, !639, i64 280, !639, i64 288, !639, i64 296, !639, i64 304, !636, i64 312, !636, i64 316, !639, i64 320, !639, i64 328, !639, i64 336, !639, i64 344, !639, i64 352, !636, i64 360, !637, i64 368, !637, i64 384, !639, i64 392, !639, i64 400, !636, i64 408, !637, i64 416, !637, i64 456, !637, i64 496, !637, i64 536, !639, i64 544, !637, i64 552}
!636 = !{!"int", !637, i64 0}
!637 = !{!"omnipotent char", !638, i64 0}
!638 = !{!"Simple C/C++ TBAA"}
!639 = !{!"any pointer", !637, i64 0}
!640 = !{!"double", !637, i64 0}
!641 = !{!"long", !637, i64 0}
