; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntr/ntr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntr/ntr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 181, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!30 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!31 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!32 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!33 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!34 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!35 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 517, baseType: !28, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!57 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!58 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!59 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!60 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!61 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!62 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!63 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!64 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!65 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!66 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!67 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!68 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!69 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!70 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!71 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!72 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!73 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!74 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!75 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!76 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!77 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 155, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!86 = !{!87, !90, !108, !189, !129, !295, !207}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!89 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !93, line: 73, size: 4480, elements: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!94 = !{!95, !97, !150, !151, !153, !156, !157, !158, !159, !167, !168, !170, !174, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !190, !192, !193, !194, !196, !197, !199, !201, !202, !203, !204, !205, !208, !210, !211, !212, !213, !214, !217, !219, !220, !221, !231, !233, !234, !238, !239, !285, !290, !292, !293, !294}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !92, file: !93, line: 74, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !92, file: !93, line: 75, baseType: !98, size: 448, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 448, elements: !148)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !93, line: 53, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 45, size: 448, elements: !101)
!101 = !{!102, !112, !120, !125, !132, !136, !143}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !100, file: !93, line: 46, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !90, !107}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !109, line: 330, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !109, line: 330, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !100, file: !93, line: 47, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!106, !90, !116}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !117, line: 16, baseType: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !117, line: 16, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !100, file: !93, line: 48, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!106, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !100, file: !93, line: 49, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!106, !90, !129, !90}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !100, file: !93, line: 50, baseType: !133, size: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!106, !90, !129, !124}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !100, file: !93, line: 51, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!106, !90, !129, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !100, file: !93, line: 52, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!106, !90, !129, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !92, file: !93, line: 76, baseType: !108, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !93, line: 77, baseType: !152, size: 32, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !92, file: !93, line: 78, baseType: !154, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !155)
!155 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !92, file: !93, line: 78, baseType: !154, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !92, file: !93, line: 78, baseType: !154, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !92, file: !93, line: 78, baseType: !154, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !93, line: 79, baseType: !160, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !163, line: 27, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !165, line: 43, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !92, file: !93, line: 80, baseType: !152, size: 32, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !92, file: !93, line: 81, baseType: !169, size: 32, offset: 992)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !92, file: !93, line: 82, baseType: !171, size: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !92, file: !93, line: 83, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !92, file: !93, line: 84, baseType: !179, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !92, file: !93, line: 85, baseType: !179, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !92, file: !93, line: 86, baseType: !179, size: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !92, file: !93, line: 87, baseType: !179, size: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !92, file: !93, line: 88, baseType: !90, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !92, file: !93, line: 89, baseType: !160, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !93, line: 90, baseType: !179, size: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !92, file: !93, line: 91, baseType: !179, size: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !92, file: !93, line: 92, baseType: !152, size: 32, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !92, file: !93, line: 93, baseType: !189, size: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !92, file: !93, line: 94, baseType: !191, size: 64, offset: 1792)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !161)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !92, file: !93, line: 95, baseType: !152, size: 32, offset: 1856)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !92, file: !93, line: 95, baseType: !152, size: 32, offset: 1888)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !92, file: !93, line: 96, baseType: !195, size: 64, offset: 1920)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !92, file: !93, line: 96, baseType: !195, size: 64, offset: 1984)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !92, file: !93, line: 97, baseType: !198, size: 64, offset: 2048)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !92, file: !93, line: 97, baseType: !200, size: 64, offset: 2112)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !92, file: !93, line: 98, baseType: !152, size: 32, offset: 2176)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !92, file: !93, line: 98, baseType: !152, size: 32, offset: 2208)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !92, file: !93, line: 99, baseType: !195, size: 64, offset: 2240)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !92, file: !93, line: 99, baseType: !195, size: 64, offset: 2304)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !92, file: !93, line: 100, baseType: !206, size: 64, offset: 2368)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !155)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !92, file: !93, line: 100, baseType: !209, size: 64, offset: 2432)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !92, file: !93, line: 101, baseType: !152, size: 32, offset: 2496)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !92, file: !93, line: 101, baseType: !152, size: 32, offset: 2528)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !92, file: !93, line: 102, baseType: !195, size: 64, offset: 2560)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !92, file: !93, line: 102, baseType: !195, size: 64, offset: 2624)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !92, file: !93, line: 103, baseType: !215, size: 64, offset: 2688)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !207)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !92, file: !93, line: 103, baseType: !218, size: 64, offset: 2752)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !92, file: !93, line: 104, baseType: !147, size: 64, offset: 2816)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !92, file: !93, line: 105, baseType: !152, size: 32, offset: 2880)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !92, file: !93, line: 106, baseType: !222, size: 128, offset: 2944)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !229)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !93, line: 64, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 61, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !225, file: !93, line: 62, baseType: !140, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !225, file: !93, line: 63, baseType: !189, size: 64, offset: 64)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !92, file: !93, line: 107, baseType: !232, size: 64, offset: 3072)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !229)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !92, file: !93, line: 108, baseType: !189, size: 64, offset: 3136)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !92, file: !93, line: 109, baseType: !235, size: 64, offset: 3200)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!106, !189}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !92, file: !93, line: 111, baseType: !152, size: 32, offset: 3264)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !92, file: !93, line: 112, baseType: !240, size: 320, offset: 3328)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 320, elements: !283)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!106, !244, !90, !189}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !247)
!247 = !{!248, !249, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !246, file: !12, line: 100, baseType: !152, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !12, line: 101, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !261, !262, !263, !264, !266, !268, !269, !270}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !252, file: !12, line: 84, baseType: !179, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !252, file: !12, line: 85, baseType: !179, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !12, line: 86, baseType: !189, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !252, file: !12, line: 87, baseType: !171, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !252, file: !12, line: 88, baseType: !259, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !252, file: !12, line: 89, baseType: !131, size: 8, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !252, file: !12, line: 90, baseType: !179, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !252, file: !12, line: 91, baseType: !87, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !252, file: !12, line: 92, baseType: !265, size: 32, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !252, file: !12, line: 93, baseType: !267, size: 32, offset: 544)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !12, line: 94, baseType: !250, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !252, file: !12, line: 95, baseType: !179, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !252, file: !12, line: 96, baseType: !189, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !246, file: !12, line: 102, baseType: !179, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !246, file: !12, line: 102, baseType: !179, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !246, file: !12, line: 103, baseType: !179, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !246, file: !12, line: 104, baseType: !108, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !246, file: !12, line: 105, baseType: !265, size: 32, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !246, file: !12, line: 105, baseType: !265, size: 32, offset: 416)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !246, file: !12, line: 105, baseType: !265, size: 32, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !246, file: !12, line: 106, baseType: !90, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !246, file: !12, line: 107, baseType: !280, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!283 = !{!284}
!284 = !DISubrange(count: 5)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !92, file: !93, line: 113, baseType: !286, size: 320, offset: 3648)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 320, elements: !283)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!106, !90, !189}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !92, file: !93, line: 114, baseType: !291, size: 320, offset: 3968)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 320, elements: !283)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !92, file: !93, line: 115, baseType: !265, size: 32, offset: 4288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !92, file: !93, line: 120, baseType: !280, size: 64, offset: 4352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !92, file: !93, line: 121, baseType: !265, size: 32, offset: 4416)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_NTR", file: !297, line: 92, baseType: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/unconstrained/impls/ntr/ntrimpl.h", directory: "/home/users/ndemeye/xSDK")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 9, size: 2048, elements: !299)
!299 = !{!300, !305, !310, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !298, file: !297, line: 10, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !302, line: 16, baseType: !303)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !302, line: 16, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_pre", scope: !298, file: !297, line: 11, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !307, line: 11, baseType: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !307, line: 11, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !298, file: !297, line: 13, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !79, line: 21, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !79, line: 21, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !298, file: !297, line: 14, baseType: !311, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !298, file: !297, line: 16, baseType: !207, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "eta1", scope: !298, file: !297, line: 34, baseType: !207, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "eta2", scope: !298, file: !297, line: 35, baseType: !207, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "eta3", scope: !298, file: !297, line: 36, baseType: !207, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "eta4", scope: !298, file: !297, line: 37, baseType: !207, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !298, file: !297, line: 39, baseType: !207, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alpha2", scope: !298, file: !297, line: 40, baseType: !207, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alpha3", scope: !298, file: !297, line: 41, baseType: !207, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alpha4", scope: !298, file: !297, line: 42, baseType: !207, size: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alpha5", scope: !298, file: !297, line: 43, baseType: !207, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mu1", scope: !298, file: !297, line: 64, baseType: !207, size: 64, offset: 896)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mu2", scope: !298, file: !297, line: 65, baseType: !207, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1", scope: !298, file: !297, line: 67, baseType: !207, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2", scope: !298, file: !297, line: 68, baseType: !207, size: 64, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3", scope: !298, file: !297, line: 69, baseType: !207, size: 64, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4", scope: !298, file: !297, line: 70, baseType: !207, size: 64, offset: 1216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !298, file: !297, line: 72, baseType: !207, size: 64, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mu1_i", scope: !298, file: !297, line: 76, baseType: !207, size: 64, offset: 1344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mu2_i", scope: !298, file: !297, line: 77, baseType: !207, size: 64, offset: 1408)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1_i", scope: !298, file: !297, line: 79, baseType: !207, size: 64, offset: 1472)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2_i", scope: !298, file: !297, line: 80, baseType: !207, size: 64, offset: 1536)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3_i", scope: !298, file: !297, line: 81, baseType: !207, size: 64, offset: 1600)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4_i", scope: !298, file: !297, line: 82, baseType: !207, size: 64, offset: 1664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "theta_i", scope: !298, file: !297, line: 84, baseType: !207, size: 64, offset: 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_radius", scope: !298, file: !297, line: 86, baseType: !207, size: 64, offset: 1792)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_radius", scope: !298, file: !297, line: 87, baseType: !207, size: 64, offset: 1856)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !298, file: !297, line: 88, baseType: !207, size: 64, offset: 1920)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_type", scope: !298, file: !297, line: 90, baseType: !152, size: 32, offset: 1984)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "update_type", scope: !298, file: !297, line: 91, baseType: !152, size: 32, offset: 2016)
!344 = !{!0, !345}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "NTR_UPDATE", scope: !2, file: !347, line: 16, type: !348, isLocal: true, isDefinition: true)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/ntr/ntr.c", directory: "/home/users/ndemeye/xSDK")
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 4096, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 64)
!351 = !{i32 7, !"Dwarf Version", i32 4}
!352 = !{i32 2, !"Debug Info Version", i32 3}
!353 = !{i32 1, !"wchar_size", i32 4}
!354 = !{i32 7, !"PIC Level", i32 2}
!355 = !{i32 7, !"uwtable", i32 1}
!356 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!357 = distinct !DISubprogram(name: "TaoCreate_NTR", scope: !347, file: !347, line: 597, type: !358, scopeLine: 598, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !582)
!358 = !DISubroutineType(types: !359)
!359 = !{!106, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !363, line: 45, size: 14656, elements: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!364 = !{!365, !367, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !450, !456, !458, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !535, !536, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574, !575, !576, !577, !578, !579, !580, !581}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !362, file: !363, line: 46, baseType: !366, size: 4480)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !93, line: 122, baseType: !92)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !362, file: !363, line: 46, baseType: !368, size: 1536, offset: 4480)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1536, elements: !148)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !363, line: 13, size: 1536, elements: !370)
!370 = !{!371, !375, !379, !383, !387, !388, !389, !390, !391, !392, !393, !397, !401, !402, !403, !404, !408, !412, !413, !417, !419, !420, !424, !428}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !369, file: !363, line: 15, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!106, !360, !311, !206, !189}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !369, file: !363, line: 16, baseType: !376, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!106, !360, !311, !206, !311, !189}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !369, file: !363, line: 17, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!106, !360, !311, !311, !189}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !369, file: !363, line: 18, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!106, !360, !311, !301, !301, !189}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !369, file: !363, line: 19, baseType: !380, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !369, file: !363, line: 20, baseType: !384, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !369, file: !363, line: 21, baseType: !380, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !369, file: !363, line: 22, baseType: !380, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !369, file: !363, line: 23, baseType: !380, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !369, file: !363, line: 24, baseType: !384, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !369, file: !363, line: 25, baseType: !394, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!106, !360, !311, !301, !301, !301, !189}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !369, file: !363, line: 26, baseType: !398, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!106, !360, !311, !301, !189}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !369, file: !363, line: 27, baseType: !384, size: 64, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !369, file: !363, line: 28, baseType: !384, size: 64, offset: 832)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !369, file: !363, line: 29, baseType: !380, size: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !369, file: !363, line: 30, baseType: !405, size: 64, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!106, !360, !152, !189}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !369, file: !363, line: 31, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!106, !360, !189}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !369, file: !363, line: 32, baseType: !235, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !369, file: !363, line: 35, baseType: !414, size: 64, offset: 1152)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!106, !360, !311, !311}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !369, file: !363, line: 36, baseType: !418, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !369, file: !363, line: 37, baseType: !418, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !369, file: !363, line: 38, baseType: !421, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!106, !360, !116}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !369, file: !363, line: 39, baseType: !425, size: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!106, !244, !360}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !369, file: !363, line: 40, baseType: !418, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !362, file: !363, line: 47, baseType: !189, size: 64, offset: 6016)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !362, file: !363, line: 48, baseType: !189, size: 64, offset: 6080)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !362, file: !363, line: 49, baseType: !189, size: 64, offset: 6144)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !362, file: !363, line: 50, baseType: !189, size: 64, offset: 6208)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !362, file: !363, line: 51, baseType: !189, size: 64, offset: 6272)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !362, file: !363, line: 52, baseType: !189, size: 64, offset: 6336)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !362, file: !363, line: 53, baseType: !189, size: 64, offset: 6400)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !362, file: !363, line: 54, baseType: !189, size: 64, offset: 6464)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !362, file: !363, line: 55, baseType: !189, size: 64, offset: 6528)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !362, file: !363, line: 56, baseType: !189, size: 64, offset: 6592)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !362, file: !363, line: 57, baseType: !189, size: 64, offset: 6656)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !362, file: !363, line: 58, baseType: !189, size: 64, offset: 6720)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !362, file: !363, line: 59, baseType: !189, size: 64, offset: 6784)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !362, file: !363, line: 60, baseType: !189, size: 64, offset: 6848)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !362, file: !363, line: 61, baseType: !189, size: 64, offset: 6912)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !362, file: !363, line: 62, baseType: !189, size: 64, offset: 6976)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !362, file: !363, line: 63, baseType: !189, size: 64, offset: 7040)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !362, file: !363, line: 65, baseType: !447, size: 640, offset: 7104)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 640, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 10)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !362, file: !363, line: 66, baseType: !451, size: 640, offset: 7744)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 640, elements: !448)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!106, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !362, file: !363, line: 67, baseType: !457, size: 640, offset: 8384)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 640, elements: !448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !362, file: !363, line: 68, baseType: !152, size: 32, offset: 9024)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !362, file: !363, line: 69, baseType: !189, size: 64, offset: 9088)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !362, file: !363, line: 70, baseType: !461, size: 32, offset: 9152)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !362, file: !363, line: 72, baseType: !265, size: 32, offset: 9184)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !363, line: 73, baseType: !189, size: 64, offset: 9216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !362, file: !363, line: 75, baseType: !311, size: 64, offset: 9280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !362, file: !363, line: 76, baseType: !311, size: 64, offset: 9344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !362, file: !363, line: 77, baseType: !311, size: 64, offset: 9408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !362, file: !363, line: 78, baseType: !311, size: 64, offset: 9472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !362, file: !363, line: 79, baseType: !311, size: 64, offset: 9536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !362, file: !363, line: 80, baseType: !311, size: 64, offset: 9600)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !362, file: !363, line: 81, baseType: !311, size: 64, offset: 9664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !362, file: !363, line: 82, baseType: !311, size: 64, offset: 9728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !362, file: !363, line: 83, baseType: !311, size: 64, offset: 9792)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !362, file: !363, line: 84, baseType: !301, size: 64, offset: 9856)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !362, file: !363, line: 85, baseType: !301, size: 64, offset: 9920)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !362, file: !363, line: 86, baseType: !301, size: 64, offset: 9984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !362, file: !363, line: 87, baseType: !311, size: 64, offset: 10048)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !362, file: !363, line: 88, baseType: !311, size: 64, offset: 10112)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !362, file: !363, line: 89, baseType: !301, size: 64, offset: 10176)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !362, file: !363, line: 90, baseType: !301, size: 64, offset: 10240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !362, file: !363, line: 91, baseType: !311, size: 64, offset: 10304)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !362, file: !363, line: 92, baseType: !152, size: 32, offset: 10368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !362, file: !363, line: 93, baseType: !198, size: 64, offset: 10432)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !362, file: !363, line: 94, baseType: !198, size: 64, offset: 10496)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !362, file: !363, line: 95, baseType: !206, size: 64, offset: 10560)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !362, file: !363, line: 96, baseType: !311, size: 64, offset: 10624)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !362, file: !363, line: 97, baseType: !311, size: 64, offset: 10688)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !362, file: !363, line: 98, baseType: !311, size: 64, offset: 10752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !362, file: !363, line: 99, baseType: !301, size: 64, offset: 10816)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !362, file: !363, line: 100, baseType: !301, size: 64, offset: 10880)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !362, file: !363, line: 101, baseType: !301, size: 64, offset: 10944)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !362, file: !363, line: 102, baseType: !301, size: 64, offset: 11008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !362, file: !363, line: 103, baseType: !301, size: 64, offset: 11072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !362, file: !363, line: 104, baseType: !301, size: 64, offset: 11136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !362, file: !363, line: 105, baseType: !301, size: 64, offset: 11200)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !362, file: !363, line: 106, baseType: !301, size: 64, offset: 11264)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !362, file: !363, line: 107, baseType: !301, size: 64, offset: 11328)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !362, file: !363, line: 108, baseType: !301, size: 64, offset: 11392)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !362, file: !363, line: 109, baseType: !301, size: 64, offset: 11456)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !362, file: !363, line: 110, baseType: !500, size: 64, offset: 11520)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !501, line: 11, baseType: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !501, line: 11, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !362, file: !363, line: 111, baseType: !500, size: 64, offset: 11584)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !362, file: !363, line: 112, baseType: !207, size: 64, offset: 11648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !362, file: !363, line: 113, baseType: !207, size: 64, offset: 11712)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !362, file: !363, line: 114, baseType: !207, size: 64, offset: 11776)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !362, file: !363, line: 115, baseType: !207, size: 64, offset: 11840)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !362, file: !363, line: 116, baseType: !207, size: 64, offset: 11904)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !362, file: !363, line: 117, baseType: !207, size: 64, offset: 11968)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !362, file: !363, line: 119, baseType: !152, size: 32, offset: 12032)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !362, file: !363, line: 120, baseType: !152, size: 32, offset: 12064)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !362, file: !363, line: 121, baseType: !152, size: 32, offset: 12096)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !362, file: !363, line: 122, baseType: !152, size: 32, offset: 12128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !362, file: !363, line: 123, baseType: !152, size: 32, offset: 12160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !362, file: !363, line: 124, baseType: !152, size: 32, offset: 12192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !362, file: !363, line: 125, baseType: !152, size: 32, offset: 12224)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !362, file: !363, line: 126, baseType: !152, size: 32, offset: 12256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !362, file: !363, line: 127, baseType: !152, size: 32, offset: 12288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !362, file: !363, line: 128, baseType: !152, size: 32, offset: 12320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !362, file: !363, line: 129, baseType: !152, size: 32, offset: 12352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !362, file: !363, line: 130, baseType: !152, size: 32, offset: 12384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !362, file: !363, line: 131, baseType: !152, size: 32, offset: 12416)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !362, file: !363, line: 132, baseType: !152, size: 32, offset: 12448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !362, file: !363, line: 133, baseType: !152, size: 32, offset: 12480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !362, file: !363, line: 134, baseType: !152, size: 32, offset: 12512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !362, file: !363, line: 135, baseType: !152, size: 32, offset: 12544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !362, file: !363, line: 137, baseType: !152, size: 32, offset: 12576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !362, file: !363, line: 138, baseType: !152, size: 32, offset: 12608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !362, file: !363, line: 140, baseType: !531, size: 64, offset: 12672)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !532, line: 5, baseType: !533)
!532 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !532, line: 5, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !362, file: !363, line: 141, baseType: !265, size: 32, offset: 12736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !362, file: !363, line: 142, baseType: !537, size: 64, offset: 12800)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !55, line: 22, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !55, line: 22, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !362, file: !363, line: 143, baseType: !207, size: 64, offset: 12864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !362, file: !363, line: 144, baseType: !207, size: 64, offset: 12928)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !362, file: !363, line: 146, baseType: !207, size: 64, offset: 12992)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !362, file: !363, line: 147, baseType: !207, size: 64, offset: 13056)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !362, file: !363, line: 148, baseType: !207, size: 64, offset: 13120)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !362, file: !363, line: 149, baseType: !207, size: 64, offset: 13184)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !362, file: !363, line: 150, baseType: !207, size: 64, offset: 13248)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !362, file: !363, line: 151, baseType: !207, size: 64, offset: 13312)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !362, file: !363, line: 152, baseType: !207, size: 64, offset: 13376)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !362, file: !363, line: 153, baseType: !265, size: 32, offset: 13440)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !362, file: !363, line: 154, baseType: !265, size: 32, offset: 13472)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !362, file: !363, line: 155, baseType: !265, size: 32, offset: 13504)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !362, file: !363, line: 156, baseType: !265, size: 32, offset: 13536)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !362, file: !363, line: 157, baseType: !265, size: 32, offset: 13568)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !362, file: !363, line: 158, baseType: !265, size: 32, offset: 13600)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !362, file: !363, line: 159, baseType: !265, size: 32, offset: 13632)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !362, file: !363, line: 160, baseType: !265, size: 32, offset: 13664)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !362, file: !363, line: 161, baseType: !265, size: 32, offset: 13696)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !362, file: !363, line: 162, baseType: !265, size: 32, offset: 13728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !362, file: !363, line: 163, baseType: !265, size: 32, offset: 13760)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !362, file: !363, line: 164, baseType: !265, size: 32, offset: 13792)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !362, file: !363, line: 165, baseType: !265, size: 32, offset: 13824)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !362, file: !363, line: 166, baseType: !265, size: 32, offset: 13856)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !362, file: !363, line: 167, baseType: !265, size: 32, offset: 13888)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !362, file: !363, line: 168, baseType: !265, size: 32, offset: 13920)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !362, file: !363, line: 169, baseType: !265, size: 32, offset: 13952)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !362, file: !363, line: 170, baseType: !265, size: 32, offset: 13984)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !362, file: !363, line: 171, baseType: !265, size: 32, offset: 14016)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !362, file: !363, line: 172, baseType: !265, size: 32, offset: 14048)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !362, file: !363, line: 173, baseType: !265, size: 32, offset: 14080)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !362, file: !363, line: 174, baseType: !265, size: 32, offset: 14112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !362, file: !363, line: 175, baseType: !265, size: 32, offset: 14144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !362, file: !363, line: 177, baseType: !573, size: 32, offset: 14176)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !362, file: !363, line: 178, baseType: !152, size: 32, offset: 14208)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !362, file: !363, line: 179, baseType: !206, size: 64, offset: 14272)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !362, file: !363, line: 180, baseType: !206, size: 64, offset: 14336)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !362, file: !363, line: 181, baseType: !206, size: 64, offset: 14400)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !362, file: !363, line: 182, baseType: !198, size: 64, offset: 14464)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !362, file: !363, line: 183, baseType: !152, size: 32, offset: 14528)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !362, file: !363, line: 184, baseType: !265, size: 32, offset: 14560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !362, file: !363, line: 185, baseType: !265, size: 32, offset: 14592)
!582 = !{!583, !584, !585, !586, !588, !590, !592, !594, !596}
!583 = !DILocalVariable(name: "tao", arg: 1, scope: !357, file: !347, line: 597, type: !360)
!584 = !DILocalVariable(name: "tr", scope: !357, file: !347, line: 599, type: !295)
!585 = !DILocalVariable(name: "ierr", scope: !357, file: !347, line: 600, type: !106)
!586 = !DILocalVariable(name: "ierr__", scope: !587, file: !347, line: 604, type: !106)
!587 = distinct !DILexicalBlock(scope: !357, file: !347, line: 604, column: 31)
!588 = !DILocalVariable(name: "ierr__", scope: !589, file: !347, line: 658, type: !106)
!589 = distinct !DILexicalBlock(scope: !357, file: !347, line: 658, column: 56)
!590 = !DILocalVariable(name: "ierr__", scope: !591, file: !347, line: 659, type: !106)
!591 = distinct !DILexicalBlock(scope: !357, file: !347, line: 659, column: 81)
!592 = !DILocalVariable(name: "ierr__", scope: !593, file: !347, line: 660, type: !106)
!593 = distinct !DILexicalBlock(scope: !357, file: !347, line: 660, column: 56)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !347, line: 661, type: !106)
!595 = distinct !DILexicalBlock(scope: !357, file: !347, line: 661, column: 54)
!596 = !DILocalVariable(name: "ierr__", scope: !597, file: !347, line: 662, type: !106)
!597 = distinct !DILexicalBlock(scope: !357, file: !347, line: 662, column: 39)
!598 = !DILocation(line: 0, scope: !357)
!599 = !DILocation(line: 599, column: 3, scope: !357)
!600 = !DILocation(line: 602, column: 3, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !347, line: 602, column: 3)
!602 = distinct !DILexicalBlock(scope: !603, file: !347, line: 602, column: 3)
!603 = distinct !DILexicalBlock(scope: !357, file: !347, line: 602, column: 3)
!604 = !{!605, !605, i64 0}
!605 = !{!"any pointer", !606, i64 0}
!606 = !{!"omnipotent char", !607, i64 0}
!607 = !{!"Simple C/C++ TBAA"}
!608 = !DILocation(line: 602, column: 3, scope: !602)
!609 = !DILocation(line: 602, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !347, line: 602, column: 3)
!611 = distinct !DILexicalBlock(scope: !601, file: !347, line: 602, column: 3)
!612 = !{!613, !614, i64 1536}
!613 = !{!"", !606, i64 0, !606, i64 512, !606, i64 1024, !606, i64 1280, !614, i64 1536, !614, i64 1540, !606, i64 1544}
!614 = !{!"int", !606, i64 0}
!615 = !DILocation(line: 602, column: 3, scope: !611)
!616 = !DILocation(line: 602, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !610, file: !347, line: 602, column: 3)
!618 = !{!614, !614, i64 0}
!619 = !{!613, !614, i64 1540}
!620 = !DILocation(line: 604, column: 10, scope: !357)
!621 = !{!"branch_weights", i32 2146410443, i32 1073205}
!622 = !DILocation(line: 0, scope: !587)
!623 = !DILocation(line: 604, column: 31, scope: !587)
!624 = !{!"branch_weights", i32 2000, i32 1}
!625 = !DILocation(line: 604, column: 31, scope: !626)
!626 = distinct !DILexicalBlock(scope: !587, file: !347, line: 604, column: 31)
!627 = !DILocation(line: 606, column: 13, scope: !357)
!628 = !DILocation(line: 606, column: 19, scope: !357)
!629 = !{!630, !605, i64 152}
!630 = !{!"_TaoOps", !605, i64 0, !605, i64 8, !605, i64 16, !605, i64 24, !605, i64 32, !605, i64 40, !605, i64 48, !605, i64 56, !605, i64 64, !605, i64 72, !605, i64 80, !605, i64 88, !605, i64 96, !605, i64 104, !605, i64 112, !605, i64 120, !605, i64 128, !605, i64 136, !605, i64 144, !605, i64 152, !605, i64 160, !605, i64 168, !605, i64 176, !605, i64 184}
!631 = !DILocation(line: 607, column: 13, scope: !357)
!632 = !DILocation(line: 607, column: 19, scope: !357)
!633 = !{!630, !605, i64 160}
!634 = !DILocation(line: 608, column: 13, scope: !357)
!635 = !DILocation(line: 608, column: 28, scope: !357)
!636 = !{!630, !605, i64 176}
!637 = !DILocation(line: 609, column: 13, scope: !357)
!638 = !DILocation(line: 609, column: 21, scope: !357)
!639 = !{!630, !605, i64 184}
