; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope_coarsedm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope_coarsedm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!304 = !{!305, !306, !307, !308}
!305 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!306 = !DIEnumerator(name: "PC_LEFT", value: 0)
!307 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!308 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 74, baseType: !7, size: 32, elements: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 140, baseType: !7, size: 32, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !319}
!318 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 42, baseType: !7, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326}
!322 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 60, baseType: !7, size: 32, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334}
!329 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!330 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!331 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!332 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!333 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!334 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 395, baseType: !74, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343}
!337 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!338 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!339 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!340 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!341 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!342 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!343 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 657, baseType: !7, size: 32, elements: !345)
!345 = !{!346, !347, !348}
!346 = !DIEnumerator(name: "PETSC_SUBCOMM_GENERAL", value: 0, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_SUBCOMM_CONTIGUOUS", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_SUBCOMM_INTERLACED", value: 2, isUnsigned: true)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !350, line: 6, baseType: !7, size: 32, elements: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/telescope/telescope.h", directory: "/home/users/ndemeye/xSDK")
!351 = !{!352, !353, !354, !355}
!352 = !DIEnumerator(name: "TELESCOPE_DEFAULT", value: 0, isUnsigned: true)
!353 = !DIEnumerator(name: "TELESCOPE_DMDA", value: 1, isUnsigned: true)
!354 = !DIEnumerator(name: "TELESCOPE_DMPLEX", value: 2, isUnsigned: true)
!355 = !DIEnumerator(name: "TELESCOPE_COARSEDM", value: 3, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362}
!358 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 663, baseType: !7, size: 32, elements: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!365 = !{!366, !367, !368}
!366 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!369 = !{!370, !388, !469, !409, !544, !578, !581, !2177, !1426, !459}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !373, line: 73, size: 4480, elements: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!374 = !{!375, !377, !430, !431, !433, !436, !437, !438, !439, !447, !448, !450, !454, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !470, !472, !473, !474, !476, !477, !479, !481, !482, !483, !484, !485, !488, !490, !491, !492, !493, !494, !497, !499, !500, !501, !511, !513, !514, !518, !519, !568, !573, !575, !576, !577}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !372, file: !373, line: 74, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !372, file: !373, line: 75, baseType: !378, size: 448, offset: 64)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 448, elements: !428)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !373, line: 53, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 45, size: 448, elements: !381)
!381 = !{!382, !392, !400, !405, !412, !416, !423}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !380, file: !373, line: 46, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!386, !370, !387}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !389, line: 330, baseType: !390)
!389 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !389, line: 330, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !373, line: 47, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!386, !370, !396}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !397, line: 16, baseType: !398)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !397, line: 16, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !380, file: !373, line: 48, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!386, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !380, file: !373, line: 49, baseType: !406, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!386, !370, !409, !370}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !380, file: !373, line: 50, baseType: !413, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!386, !370, !409, !404}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !380, file: !373, line: 51, baseType: !417, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!386, !370, !409, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !380, file: !373, line: 52, baseType: !424, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!386, !370, !409, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!428 = !{!429}
!429 = !DISubrange(count: 1)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !372, file: !373, line: 76, baseType: !388, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !373, line: 77, baseType: !432, size: 32, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !372, file: !373, line: 78, baseType: !434, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !435)
!435 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !372, file: !373, line: 78, baseType: !434, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !372, file: !373, line: 78, baseType: !434, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !372, file: !373, line: 78, baseType: !434, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !373, line: 79, baseType: !440, size: 64, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !443, line: 27, baseType: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !445, line: 43, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!446 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !372, file: !373, line: 80, baseType: !432, size: 32, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !372, file: !373, line: 81, baseType: !449, size: 32, offset: 992)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !372, file: !373, line: 82, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !372, file: !373, line: 83, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !372, file: !373, line: 84, baseType: !459, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !372, file: !373, line: 85, baseType: !459, size: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !372, file: !373, line: 86, baseType: !459, size: 64, offset: 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !372, file: !373, line: 87, baseType: !459, size: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !372, file: !373, line: 88, baseType: !370, size: 64, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !372, file: !373, line: 89, baseType: !440, size: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 90, baseType: !459, size: 64, offset: 1536)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !372, file: !373, line: 91, baseType: !459, size: 64, offset: 1600)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !372, file: !373, line: 92, baseType: !432, size: 32, offset: 1664)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !372, file: !373, line: 93, baseType: !469, size: 64, offset: 1728)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !372, file: !373, line: 94, baseType: !471, size: 64, offset: 1792)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !441)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !372, file: !373, line: 95, baseType: !432, size: 32, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !372, file: !373, line: 95, baseType: !432, size: 32, offset: 1888)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !372, file: !373, line: 96, baseType: !475, size: 64, offset: 1920)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !372, file: !373, line: 96, baseType: !475, size: 64, offset: 1984)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !372, file: !373, line: 97, baseType: !478, size: 64, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !372, file: !373, line: 97, baseType: !480, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !372, file: !373, line: 98, baseType: !432, size: 32, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !372, file: !373, line: 98, baseType: !432, size: 32, offset: 2208)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !372, file: !373, line: 99, baseType: !475, size: 64, offset: 2240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !372, file: !373, line: 99, baseType: !475, size: 64, offset: 2304)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !372, file: !373, line: 100, baseType: !486, size: 64, offset: 2368)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !435)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !372, file: !373, line: 100, baseType: !489, size: 64, offset: 2432)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !372, file: !373, line: 101, baseType: !432, size: 32, offset: 2496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !372, file: !373, line: 101, baseType: !432, size: 32, offset: 2528)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !372, file: !373, line: 102, baseType: !475, size: 64, offset: 2560)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !372, file: !373, line: 102, baseType: !475, size: 64, offset: 2624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !372, file: !373, line: 103, baseType: !495, size: 64, offset: 2688)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !487)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !372, file: !373, line: 103, baseType: !498, size: 64, offset: 2752)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !372, file: !373, line: 104, baseType: !427, size: 64, offset: 2816)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !372, file: !373, line: 105, baseType: !432, size: 32, offset: 2880)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !372, file: !373, line: 106, baseType: !502, size: 128, offset: 2944)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 128, elements: !509)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !373, line: 64, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 61, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !505, file: !373, line: 62, baseType: !420, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !505, file: !373, line: 63, baseType: !469, size: 64, offset: 64)
!509 = !{!510}
!510 = !DISubrange(count: 2)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !372, file: !373, line: 107, baseType: !512, size: 64, offset: 3072)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 64, elements: !509)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !372, file: !373, line: 108, baseType: !469, size: 64, offset: 3136)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !372, file: !373, line: 109, baseType: !515, size: 64, offset: 3200)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!386, !469}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !372, file: !373, line: 111, baseType: !432, size: 32, offset: 3264)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !372, file: !373, line: 112, baseType: !520, size: 320, offset: 3328)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !566)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!386, !524, !370, !469}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !527)
!527 = !{!528, !529, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !526, file: !12, line: 100, baseType: !432, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !12, line: 101, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !541, !542, !543, !547, !549, !551, !552, !553}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !532, file: !12, line: 84, baseType: !459, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !532, file: !12, line: 85, baseType: !459, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !532, file: !12, line: 86, baseType: !469, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !532, file: !12, line: 87, baseType: !451, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !532, file: !12, line: 88, baseType: !539, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !532, file: !12, line: 89, baseType: !411, size: 8, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !532, file: !12, line: 90, baseType: !459, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !532, file: !12, line: 91, baseType: !544, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !545, line: 46, baseType: !546)
!545 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!546 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !532, file: !12, line: 92, baseType: !548, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !532, file: !12, line: 93, baseType: !550, size: 32, offset: 544)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !12, line: 94, baseType: !530, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !532, file: !12, line: 95, baseType: !459, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !532, file: !12, line: 96, baseType: !469, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !526, file: !12, line: 102, baseType: !459, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !526, file: !12, line: 102, baseType: !459, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !526, file: !12, line: 103, baseType: !459, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !526, file: !12, line: 104, baseType: !388, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !526, file: !12, line: 105, baseType: !548, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !526, file: !12, line: 105, baseType: !548, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !526, file: !12, line: 105, baseType: !548, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !526, file: !12, line: 106, baseType: !370, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !526, file: !12, line: 107, baseType: !563, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!566 = !{!567}
!567 = !DISubrange(count: 5)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !372, file: !373, line: 113, baseType: !569, size: 320, offset: 3648)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 320, elements: !566)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!386, !370, !469}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !372, file: !373, line: 114, baseType: !574, size: 320, offset: 3968)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 320, elements: !566)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !372, file: !373, line: 115, baseType: !548, size: 32, offset: 4288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !372, file: !373, line: 120, baseType: !563, size: 64, offset: 4352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !372, file: !373, line: 121, baseType: !548, size: 32, offset: 4416)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !580, line: 1451, baseType: !420)
!580 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Telescope", file: !350, line: 8, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PC_Telescope", file: !350, line: 9, size: 1152, elements: !584)
!584 = !{!585, !600, !601, !602, !603, !608, !613, !619, !623, !624, !625, !1389, !1390, !1391, !1392, !1394, !1395, !2168, !2172, !2176}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "psubcomm", scope: !583, file: !350, line: 10, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcomm", file: !6, line: 656, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSubcomm", file: !580, line: 2653, size: 448, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !597, !599}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !588, file: !580, line: 2654, baseType: !388, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dupparent", scope: !588, file: !580, line: 2655, baseType: !388, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !588, file: !580, line: 2656, baseType: !388, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !588, file: !580, line: 2657, baseType: !449, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !588, file: !580, line: 2658, baseType: !449, size: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !588, file: !580, line: 2659, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !580, line: 2660, baseType: !598, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcommType", file: !6, line: 657, baseType: !344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "subcommprefix", scope: !588, file: !580, line: 2661, baseType: !459, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "subcommtype", scope: !583, file: !350, line: 11, baseType: !598, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "subcomm", scope: !583, file: !350, line: 12, baseType: !388, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "redfactor", scope: !583, file: !350, line: 13, baseType: !432, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !583, file: !350, line: 14, baseType: !604, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !605, line: 22, baseType: !606)
!605 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !605, line: 22, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "isin", scope: !583, file: !350, line: 15, baseType: !609, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !610, line: 11, baseType: !611)
!610 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !610, line: 11, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "scatter", scope: !583, file: !350, line: 16, baseType: !614, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !615, line: 59, baseType: !616)
!615 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !615, line: 15, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !615, line: 15, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "xred", scope: !583, file: !350, line: 17, baseType: !620, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "yred", scope: !583, file: !350, line: 17, baseType: !620, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "xtmp", scope: !583, file: !350, line: 17, baseType: !620, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Bred", scope: !583, file: !350, line: 18, baseType: !626, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !629, line: 436, size: 23424, elements: !630)
!629 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!630 = !{!631, !633, !1133, !1153, !1154, !1155, !1157, !1158, !1159, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1285, !1286, !1302, !1303, !1304, !1305, !1306, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1361, !1362, !1364, !1365, !1366, !1367, !1368, !1369, !1387, !1388}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !628, file: !629, line: 437, baseType: !632, size: 4480)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !373, line: 122, baseType: !372)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !628, file: !629, line: 437, baseType: !634, size: 9472, offset: 4480)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 9472, elements: !428)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !629, line: 32, size: 9472, elements: !636)
!636 = !{!637, !646, !650, !651, !655, !659, !660, !661, !662, !663, !664, !665, !685, !689, !694, !700, !719, !724, !728, !729, !734, !739, !740, !745, !749, !753, !757, !761, !765, !766, !767, !768, !769, !773, !774, !779, !780, !781, !782, !783, !788, !795, !800, !804, !808, !812, !816, !817, !821, !822, !829, !834, !835, !836, !837, !899, !907, !908, !912, !913, !917, !918, !922, !927, !928, !932, !936, !943, !944, !945, !946, !947, !948, !953, !954, !958, !962, !966, !967, !968, !972, !982, !983, !987, !988, !992, !993, !997, !998, !1003, !1004, !1008, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1042, !1046, !1047, !1048, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1062, !1063, !1064, !1069, !1073, !1074, !1078, !1079, !1080, !1081, !1107, !1111, !1112, !1113, !1114, !1115, !1119, !1120, !1121, !1122, !1123, !1127, !1131, !1132}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !635, file: !629, line: 34, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!386, !626, !432, !641, !432, !641, !643, !645}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !635, file: !629, line: 35, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!386, !626, !432, !478, !480, !498}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !635, file: !629, line: 36, baseType: !647, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !635, file: !629, line: 37, baseType: !652, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!386, !626, !620, !620}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !635, file: !629, line: 38, baseType: !656, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!386, !626, !620, !620, !620}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !635, file: !629, line: 40, baseType: !652, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !635, file: !629, line: 41, baseType: !656, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !635, file: !629, line: 42, baseType: !652, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !635, file: !629, line: 43, baseType: !656, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !635, file: !629, line: 44, baseType: !652, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !635, file: !629, line: 46, baseType: !656, size: 64, offset: 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !635, file: !629, line: 47, baseType: !666, size: 64, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!386, !626, !609, !609, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !672, file: !38, line: 1227, baseType: !487, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !672, file: !38, line: 1228, baseType: !487, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !672, file: !38, line: 1229, baseType: !487, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !672, file: !38, line: 1230, baseType: !487, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !672, file: !38, line: 1231, baseType: !487, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !672, file: !38, line: 1232, baseType: !487, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !672, file: !38, line: 1233, baseType: !487, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !672, file: !38, line: 1234, baseType: !487, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !672, file: !38, line: 1236, baseType: !487, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !672, file: !38, line: 1237, baseType: !487, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !672, file: !38, line: 1238, baseType: !487, size: 64, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !635, file: !629, line: 48, baseType: !686, size: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!386, !626, !609, !669}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !635, file: !629, line: 49, baseType: !690, size: 64, offset: 832)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!386, !626, !620, !487, !693, !487, !432, !432, !620}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !635, file: !629, line: 50, baseType: !695, size: 64, offset: 896)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!386, !626, !698, !699}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !635, file: !629, line: 52, baseType: !701, size: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!386, !626, !704, !705}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !707, file: !38, line: 593, baseType: !434, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !707, file: !38, line: 594, baseType: !434, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !707, file: !38, line: 594, baseType: !434, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !707, file: !38, line: 594, baseType: !434, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !707, file: !38, line: 595, baseType: !434, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !707, file: !38, line: 596, baseType: !434, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !707, file: !38, line: 597, baseType: !434, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !707, file: !38, line: 598, baseType: !434, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !707, file: !38, line: 598, baseType: !434, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !707, file: !38, line: 599, baseType: !434, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !635, file: !629, line: 53, baseType: !720, size: 64, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!386, !626, !626, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !635, file: !629, line: 54, baseType: !725, size: 64, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!386, !626, !620}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !635, file: !629, line: 55, baseType: !652, size: 64, offset: 1152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !635, file: !629, line: 56, baseType: !730, size: 64, offset: 1216)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!386, !626, !733, !486}
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !635, file: !629, line: 58, baseType: !735, size: 64, offset: 1280)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!386, !626, !738}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !635, file: !629, line: 59, baseType: !735, size: 64, offset: 1344)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !635, file: !629, line: 60, baseType: !741, size: 64, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!386, !626, !744, !548}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !635, file: !629, line: 61, baseType: !746, size: 64, offset: 1472)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!386, !626}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !635, file: !629, line: 63, baseType: !750, size: 64, offset: 1536)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!386, !626, !432, !641, !496, !620, !620}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !635, file: !629, line: 64, baseType: !754, size: 64, offset: 1600)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!386, !626, !626, !609, !609, !669}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !635, file: !629, line: 65, baseType: !758, size: 64, offset: 1664)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!386, !626, !626, !669}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !635, file: !629, line: 66, baseType: !762, size: 64, offset: 1728)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!386, !626, !626, !609, !669}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !635, file: !629, line: 67, baseType: !758, size: 64, offset: 1792)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !635, file: !629, line: 69, baseType: !746, size: 64, offset: 1856)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !635, file: !629, line: 70, baseType: !754, size: 64, offset: 1920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !635, file: !629, line: 71, baseType: !762, size: 64, offset: 1984)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !635, file: !629, line: 72, baseType: !770, size: 64, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!386, !626, !699}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !635, file: !629, line: 73, baseType: !746, size: 64, offset: 2112)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !635, file: !629, line: 75, baseType: !775, size: 64, offset: 2176)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!386, !626, !778, !699}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !635, file: !629, line: 76, baseType: !652, size: 64, offset: 2240)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !635, file: !629, line: 77, baseType: !652, size: 64, offset: 2304)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !635, file: !629, line: 78, baseType: !666, size: 64, offset: 2368)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !635, file: !629, line: 79, baseType: !686, size: 64, offset: 2432)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !635, file: !629, line: 81, baseType: !784, size: 64, offset: 2496)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!386, !626, !496, !626, !787}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !635, file: !629, line: 82, baseType: !789, size: 64, offset: 2560)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!386, !626, !432, !792, !792, !698, !794}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !635, file: !629, line: 83, baseType: !796, size: 64, offset: 2624)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!386, !626, !432, !799, !432}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !635, file: !629, line: 84, baseType: !801, size: 64, offset: 2688)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!386, !626, !432, !641, !432, !641, !495}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !635, file: !629, line: 85, baseType: !805, size: 64, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!386, !626, !626, !787}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !635, file: !629, line: 87, baseType: !809, size: 64, offset: 2816)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!386, !626, !620, !478}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !635, file: !629, line: 88, baseType: !813, size: 64, offset: 2880)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!386, !626, !496}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !635, file: !629, line: 89, baseType: !813, size: 64, offset: 2944)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !635, file: !629, line: 90, baseType: !818, size: 64, offset: 3008)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!386, !626, !620, !645}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !635, file: !629, line: 91, baseType: !750, size: 64, offset: 3072)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !635, file: !629, line: 93, baseType: !823, size: 64, offset: 3136)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!386, !626, !826}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !635, file: !629, line: 94, baseType: !830, size: 64, offset: 3200)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!386, !626, !432, !548, !548, !478, !833, !833, !723}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !635, file: !629, line: 95, baseType: !830, size: 64, offset: 3264)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !635, file: !629, line: 96, baseType: !830, size: 64, offset: 3328)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !635, file: !629, line: 97, baseType: !830, size: 64, offset: 3392)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !635, file: !629, line: 99, baseType: !838, size: 64, offset: 3456)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!386, !626, !841, !844}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !610, line: 51, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !610, line: 51, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !629, line: 609, size: 6208, elements: !847)
!847 = !{!848, !849, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !868, !875, !876, !877, !878, !879, !880, !881, !882, !886, !887, !888, !889, !890, !892, !893, !894, !895, !896, !897, !898}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !846, file: !629, line: 610, baseType: !632, size: 4480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !846, file: !629, line: 610, baseType: !850, size: 32, offset: 4480)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !428)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !846, file: !629, line: 611, baseType: !432, size: 32, offset: 4512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !846, file: !629, line: 611, baseType: !432, size: 32, offset: 4544)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !846, file: !629, line: 611, baseType: !432, size: 32, offset: 4576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !846, file: !629, line: 612, baseType: !432, size: 32, offset: 4608)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !846, file: !629, line: 613, baseType: !432, size: 32, offset: 4640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !846, file: !629, line: 614, baseType: !478, size: 64, offset: 4672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !846, file: !629, line: 615, baseType: !480, size: 64, offset: 4736)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !846, file: !629, line: 616, baseType: !799, size: 64, offset: 4800)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !846, file: !629, line: 617, baseType: !478, size: 64, offset: 4864)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !846, file: !629, line: 618, baseType: !861, size: 64, offset: 4928)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !629, line: 602, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 598, size: 128, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !863, file: !629, line: 599, baseType: !432, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !863, file: !629, line: 600, baseType: !432, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !863, file: !629, line: 601, baseType: !495, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !846, file: !629, line: 619, baseType: !869, size: 64, offset: 4992)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !629, line: 607, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 604, size: 128, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !871, file: !629, line: 605, baseType: !432, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !871, file: !629, line: 606, baseType: !495, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !846, file: !629, line: 620, baseType: !495, size: 64, offset: 5056)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !846, file: !629, line: 621, baseType: !487, size: 64, offset: 5120)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !846, file: !629, line: 622, baseType: !487, size: 64, offset: 5184)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !846, file: !629, line: 623, baseType: !620, size: 64, offset: 5248)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !846, file: !629, line: 623, baseType: !620, size: 64, offset: 5312)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !846, file: !629, line: 623, baseType: !620, size: 64, offset: 5376)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !846, file: !629, line: 624, baseType: !548, size: 32, offset: 5440)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !846, file: !629, line: 625, baseType: !883, size: 64, offset: 5504)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!386}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !846, file: !629, line: 626, baseType: !469, size: 64, offset: 5568)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !846, file: !629, line: 627, baseType: !620, size: 64, offset: 5632)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !846, file: !629, line: 628, baseType: !432, size: 32, offset: 5696)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !846, file: !629, line: 629, baseType: !409, size: 64, offset: 5760)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !846, file: !629, line: 630, baseType: !891, size: 32, offset: 5824)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !846, file: !629, line: 631, baseType: !432, size: 32, offset: 5856)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !846, file: !629, line: 631, baseType: !432, size: 32, offset: 5888)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !846, file: !629, line: 632, baseType: !548, size: 32, offset: 5920)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !846, file: !629, line: 633, baseType: !548, size: 32, offset: 5952)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !846, file: !629, line: 634, baseType: !420, size: 64, offset: 6016)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !846, file: !629, line: 634, baseType: !469, size: 64, offset: 6080)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !846, file: !629, line: 635, baseType: !440, size: 64, offset: 6144)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !635, file: !629, line: 100, baseType: !900, size: 64, offset: 3520)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!386, !626, !432, !432, !903, !906}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !905)
!905 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !635, file: !629, line: 101, baseType: !746, size: 64, offset: 3584)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !635, file: !629, line: 102, baseType: !909, size: 64, offset: 3648)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!386, !626, !609, !609, !699}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !635, file: !629, line: 103, baseType: !638, size: 64, offset: 3712)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !635, file: !629, line: 105, baseType: !914, size: 64, offset: 3776)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!386, !626, !609, !609, !698, !699}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !635, file: !629, line: 106, baseType: !746, size: 64, offset: 3840)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !635, file: !629, line: 107, baseType: !919, size: 64, offset: 3904)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!386, !626, !396}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !635, file: !629, line: 108, baseType: !923, size: 64, offset: 3968)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!386, !626, !926, !698, !699}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !409)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !635, file: !629, line: 109, baseType: !883, size: 64, offset: 4032)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !635, file: !629, line: 111, baseType: !929, size: 64, offset: 4096)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!386, !626, !626, !626, !487, !626}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !635, file: !629, line: 112, baseType: !933, size: 64, offset: 4160)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!386, !626, !626, !626, !626}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !635, file: !629, line: 113, baseType: !937, size: 64, offset: 4224)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!386, !626, !940, !940}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !610, line: 30, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !610, line: 30, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !635, file: !629, line: 114, baseType: !638, size: 64, offset: 4288)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !635, file: !629, line: 115, baseType: !750, size: 64, offset: 4352)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !635, file: !629, line: 117, baseType: !809, size: 64, offset: 4416)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !635, file: !629, line: 118, baseType: !809, size: 64, offset: 4480)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !635, file: !629, line: 119, baseType: !923, size: 64, offset: 4544)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !635, file: !629, line: 120, baseType: !949, size: 64, offset: 4608)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!386, !626, !952, !723}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !635, file: !629, line: 121, baseType: !883, size: 64, offset: 4672)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !635, file: !629, line: 123, baseType: !955, size: 64, offset: 4736)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!386, !626, !432, !469}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !635, file: !629, line: 124, baseType: !959, size: 64, offset: 4800)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!386, !626, !844, !620, !469}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !635, file: !629, line: 125, baseType: !963, size: 64, offset: 4864)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!386, !524, !626}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !635, file: !629, line: 126, baseType: !652, size: 64, offset: 4928)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !635, file: !629, line: 127, baseType: !652, size: 64, offset: 4992)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !635, file: !629, line: 129, baseType: !969, size: 64, offset: 5056)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!386, !626, !799}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !635, file: !629, line: 130, baseType: !973, size: 64, offset: 5120)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!386, !626, !976, !976}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !978, file: !62, line: 653, baseType: !432, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !978, file: !62, line: 653, baseType: !620, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !635, file: !629, line: 131, baseType: !973, size: 64, offset: 5184)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !635, file: !629, line: 132, baseType: !984, size: 64, offset: 5248)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!386, !626, !478, !478, !478}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !635, file: !629, line: 133, baseType: !919, size: 64, offset: 5312)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !635, file: !629, line: 135, baseType: !989, size: 64, offset: 5376)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!386, !626, !487, !723}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !635, file: !629, line: 136, baseType: !989, size: 64, offset: 5440)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !635, file: !629, line: 137, baseType: !994, size: 64, offset: 5504)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!386, !626, !723}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !635, file: !629, line: 138, baseType: !638, size: 64, offset: 5568)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !635, file: !629, line: 139, baseType: !999, size: 64, offset: 5632)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!386, !626, !1002, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !635, file: !629, line: 141, baseType: !883, size: 64, offset: 5696)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !635, file: !629, line: 142, baseType: !1005, size: 64, offset: 5760)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!386, !626, !626, !487, !626}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !635, file: !629, line: 143, baseType: !1009, size: 64, offset: 5824)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!386, !626, !626, !626}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !635, file: !629, line: 144, baseType: !883, size: 64, offset: 5888)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !635, file: !629, line: 145, baseType: !1005, size: 64, offset: 5952)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !635, file: !629, line: 147, baseType: !1009, size: 64, offset: 6016)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !635, file: !629, line: 148, baseType: !883, size: 64, offset: 6080)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !635, file: !629, line: 149, baseType: !1005, size: 64, offset: 6144)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !635, file: !629, line: 150, baseType: !1009, size: 64, offset: 6208)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !635, file: !629, line: 151, baseType: !1019, size: 64, offset: 6272)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!386, !626, !548}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !635, file: !629, line: 153, baseType: !746, size: 64, offset: 6336)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !635, file: !629, line: 154, baseType: !746, size: 64, offset: 6400)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !635, file: !629, line: 155, baseType: !746, size: 64, offset: 6464)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !635, file: !629, line: 156, baseType: !746, size: 64, offset: 6528)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !635, file: !629, line: 157, baseType: !919, size: 64, offset: 6592)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !635, file: !629, line: 159, baseType: !1028, size: 64, offset: 6656)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!386, !626, !432, !643}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !635, file: !629, line: 160, baseType: !746, size: 64, offset: 6720)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !635, file: !629, line: 161, baseType: !746, size: 64, offset: 6784)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !635, file: !629, line: 162, baseType: !746, size: 64, offset: 6848)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !635, file: !629, line: 163, baseType: !746, size: 64, offset: 6912)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !635, file: !629, line: 165, baseType: !1009, size: 64, offset: 6976)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !635, file: !629, line: 166, baseType: !1009, size: 64, offset: 7040)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !635, file: !629, line: 167, baseType: !809, size: 64, offset: 7104)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !635, file: !629, line: 168, baseType: !1039, size: 64, offset: 7168)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!386, !626, !620, !432}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !635, file: !629, line: 169, baseType: !1043, size: 64, offset: 7232)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!386, !626, !723, !478}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !635, file: !629, line: 171, baseType: !770, size: 64, offset: 7296)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !635, file: !629, line: 172, baseType: !746, size: 64, offset: 7360)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !635, file: !629, line: 173, baseType: !1049, size: 64, offset: 7424)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!386, !626, !478, !833}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !635, file: !629, line: 174, baseType: !909, size: 64, offset: 7488)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !635, file: !629, line: 175, baseType: !909, size: 64, offset: 7552)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !635, file: !629, line: 177, baseType: !652, size: 64, offset: 7616)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !635, file: !629, line: 178, baseType: !695, size: 64, offset: 7680)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !635, file: !629, line: 179, baseType: !652, size: 64, offset: 7744)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !635, file: !629, line: 180, baseType: !656, size: 64, offset: 7808)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !635, file: !629, line: 181, baseType: !1059, size: 64, offset: 7872)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!386, !626, !388, !698, !699}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !635, file: !629, line: 183, baseType: !969, size: 64, offset: 7936)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !635, file: !629, line: 184, baseType: !730, size: 64, offset: 8000)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !635, file: !629, line: 185, baseType: !1065, size: 64, offset: 8064)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!386, !626, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !635, file: !629, line: 186, baseType: !1070, size: 64, offset: 8128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!386, !626, !432, !641, !495}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !635, file: !629, line: 187, baseType: !789, size: 64, offset: 8192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !635, file: !629, line: 189, baseType: !1075, size: 64, offset: 8256)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!386, !626, !432, !432, !478, !643}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !635, file: !629, line: 190, baseType: !883, size: 64, offset: 8320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !635, file: !629, line: 191, baseType: !1005, size: 64, offset: 8384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !635, file: !629, line: 192, baseType: !1009, size: 64, offset: 8448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !635, file: !629, line: 193, baseType: !1082, size: 64, offset: 8512)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!386, !626, !841, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !629, line: 660, size: 5312, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1087, file: !629, line: 661, baseType: !632, size: 4480)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1087, file: !629, line: 661, baseType: !850, size: 32, offset: 4480)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1087, file: !629, line: 662, baseType: !432, size: 32, offset: 4512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1087, file: !629, line: 662, baseType: !432, size: 32, offset: 4544)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1087, file: !629, line: 662, baseType: !432, size: 32, offset: 4576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1087, file: !629, line: 663, baseType: !432, size: 32, offset: 4608)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1087, file: !629, line: 664, baseType: !432, size: 32, offset: 4640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1087, file: !629, line: 665, baseType: !478, size: 64, offset: 4672)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1087, file: !629, line: 666, baseType: !478, size: 64, offset: 4736)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1087, file: !629, line: 667, baseType: !432, size: 32, offset: 4800)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1087, file: !629, line: 668, baseType: !891, size: 32, offset: 4832)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1087, file: !629, line: 670, baseType: !478, size: 64, offset: 4864)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1087, file: !629, line: 670, baseType: !478, size: 64, offset: 4928)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1087, file: !629, line: 671, baseType: !478, size: 64, offset: 4992)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1087, file: !629, line: 672, baseType: !478, size: 64, offset: 5056)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1087, file: !629, line: 673, baseType: !478, size: 64, offset: 5120)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1087, file: !629, line: 674, baseType: !432, size: 32, offset: 5184)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1087, file: !629, line: 675, baseType: !478, size: 64, offset: 5248)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !635, file: !629, line: 195, baseType: !1108, size: 64, offset: 8576)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!386, !1085, !626, !626}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !635, file: !629, line: 196, baseType: !1108, size: 64, offset: 8640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !635, file: !629, line: 197, baseType: !883, size: 64, offset: 8704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !635, file: !629, line: 198, baseType: !1005, size: 64, offset: 8768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !635, file: !629, line: 199, baseType: !1009, size: 64, offset: 8832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !635, file: !629, line: 201, baseType: !1116, size: 64, offset: 8896)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!386, !626, !432, !432}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !635, file: !629, line: 202, baseType: !784, size: 64, offset: 8960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !635, file: !629, line: 203, baseType: !656, size: 64, offset: 9024)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !635, file: !629, line: 204, baseType: !838, size: 64, offset: 9088)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !635, file: !629, line: 205, baseType: !969, size: 64, offset: 9152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !635, file: !629, line: 206, baseType: !1124, size: 64, offset: 9216)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!386, !388, !626, !432, !698, !699}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !635, file: !629, line: 208, baseType: !1128, size: 64, offset: 9280)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!386, !432, !794}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !635, file: !629, line: 209, baseType: !1009, size: 64, offset: 9344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !635, file: !629, line: 210, baseType: !801, size: 64, offset: 9408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !628, file: !629, line: 438, baseType: !1134, size: 64, offset: 13952)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !610, line: 60, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1136, file: !116, line: 241, baseType: !388, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !116, line: 242, baseType: !449, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1136, file: !116, line: 243, baseType: !432, size: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1136, file: !116, line: 243, baseType: !432, size: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1136, file: !116, line: 244, baseType: !432, size: 32, offset: 160)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1136, file: !116, line: 244, baseType: !432, size: 32, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1136, file: !116, line: 245, baseType: !478, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1136, file: !116, line: 246, baseType: !548, size: 32, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1136, file: !116, line: 247, baseType: !432, size: 32, offset: 352)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1136, file: !116, line: 251, baseType: !432, size: 32, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1136, file: !116, line: 252, baseType: !940, size: 64, offset: 448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1136, file: !116, line: 253, baseType: !548, size: 32, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1136, file: !116, line: 254, baseType: !432, size: 32, offset: 544)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1136, file: !116, line: 254, baseType: !432, size: 32, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1136, file: !116, line: 255, baseType: !432, size: 32, offset: 608)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !628, file: !629, line: 438, baseType: !1134, size: 64, offset: 14016)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !628, file: !629, line: 439, baseType: !469, size: 64, offset: 14080)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !628, file: !629, line: 440, baseType: !1156, size: 32, offset: 14144)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !628, file: !629, line: 441, baseType: !548, size: 32, offset: 14176)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !628, file: !629, line: 442, baseType: !548, size: 32, offset: 14208)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !628, file: !629, line: 443, baseType: !1160, size: 448, offset: 14272)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1161, size: 448, elements: !1162)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !409)
!1162 = !{!1163}
!1163 = !DISubrange(count: 7)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !628, file: !629, line: 444, baseType: !548, size: 32, offset: 14720)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !628, file: !629, line: 445, baseType: !548, size: 32, offset: 14752)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !628, file: !629, line: 446, baseType: !432, size: 32, offset: 14784)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !628, file: !629, line: 447, baseType: !471, size: 64, offset: 14848)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !628, file: !629, line: 448, baseType: !471, size: 64, offset: 14912)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !628, file: !629, line: 449, baseType: !706, size: 640, offset: 14976)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !628, file: !629, line: 450, baseType: !645, size: 32, offset: 15616)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !628, file: !629, line: 451, baseType: !1172, size: 2880, offset: 15680)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !629, line: 318, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !629, line: 319, size: 2880, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1194, !1195, !1200, !1204, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1219, !1220, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1252, !1253, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1276, !1277, !1278, !1282, !1283}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1173, file: !629, line: 320, baseType: !432, size: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1173, file: !629, line: 321, baseType: !432, size: 32, offset: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1173, file: !629, line: 322, baseType: !432, size: 32, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1173, file: !629, line: 323, baseType: !432, size: 32, offset: 96)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1173, file: !629, line: 324, baseType: !432, size: 32, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1173, file: !629, line: 325, baseType: !432, size: 32, offset: 160)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1173, file: !629, line: 326, baseType: !1182, size: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !629, line: 293, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !629, line: 295, size: 448, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1184, file: !629, line: 296, baseType: !1182, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1184, file: !629, line: 297, baseType: !495, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1184, file: !629, line: 297, baseType: !495, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1184, file: !629, line: 298, baseType: !478, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1184, file: !629, line: 298, baseType: !478, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1184, file: !629, line: 299, baseType: !432, size: 32, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1184, file: !629, line: 300, baseType: !432, size: 32, offset: 352)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1184, file: !629, line: 301, baseType: !432, size: 32, offset: 384)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1173, file: !629, line: 326, baseType: !1182, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1173, file: !629, line: 328, baseType: !1196, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!386, !626, !1199, !478}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1173, file: !629, line: 329, baseType: !1201, size: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!386, !1199, !596, !480, !480, !498, !478}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1173, file: !629, line: 330, baseType: !1205, size: 64, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!386, !1199}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1173, file: !629, line: 331, baseType: !1205, size: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1173, file: !629, line: 334, baseType: !388, size: 64, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !629, line: 335, baseType: !449, size: 32, offset: 640)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1173, file: !629, line: 335, baseType: !449, size: 32, offset: 672)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1173, file: !629, line: 336, baseType: !449, size: 32, offset: 704)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1173, file: !629, line: 336, baseType: !449, size: 32, offset: 736)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1173, file: !629, line: 337, baseType: !1215, size: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !389, line: 339, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !389, line: 339, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1173, file: !629, line: 338, baseType: !1215, size: 64, offset: 832)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1173, file: !629, line: 339, baseType: !1221, size: 64, offset: 896)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !389, line: 341, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !389, line: 351, size: 192, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1223, file: !389, line: 354, baseType: !74, size: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1223, file: !389, line: 355, baseType: !74, size: 32, offset: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1223, file: !389, line: 356, baseType: !74, size: 32, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1223, file: !389, line: 361, baseType: !74, size: 32, offset: 96)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1223, file: !389, line: 362, baseType: !544, size: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1173, file: !629, line: 340, baseType: !432, size: 32, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1173, file: !629, line: 340, baseType: !432, size: 32, offset: 992)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1173, file: !629, line: 341, baseType: !495, size: 64, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1173, file: !629, line: 342, baseType: !478, size: 64, offset: 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1173, file: !629, line: 343, baseType: !498, size: 64, offset: 1152)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1173, file: !629, line: 344, baseType: !480, size: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1173, file: !629, line: 345, baseType: !432, size: 32, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1173, file: !629, line: 346, baseType: !596, size: 64, offset: 1344)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1173, file: !629, line: 347, baseType: !548, size: 32, offset: 1408)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1173, file: !629, line: 348, baseType: !432, size: 32, offset: 1440)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1173, file: !629, line: 351, baseType: !548, size: 32, offset: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1173, file: !629, line: 352, baseType: !548, size: 32, offset: 1504)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1173, file: !629, line: 353, baseType: !449, size: 32, offset: 1536)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1173, file: !629, line: 354, baseType: !449, size: 32, offset: 1568)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1173, file: !629, line: 355, baseType: !596, size: 64, offset: 1600)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1173, file: !629, line: 356, baseType: !596, size: 64, offset: 1664)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1173, file: !629, line: 357, baseType: !1247, size: 64, offset: 1728)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !629, line: 310, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 308, size: 32, elements: !1250)
!1250 = !{!1251}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1249, file: !629, line: 309, baseType: !432, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1173, file: !629, line: 357, baseType: !1247, size: 64, offset: 1792)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1173, file: !629, line: 358, baseType: !1254, size: 64, offset: 1856)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !629, line: 316, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 312, size: 128, elements: !1257)
!1257 = !{!1258, !1259, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1256, file: !629, line: 313, baseType: !469, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1256, file: !629, line: 314, baseType: !432, size: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1256, file: !629, line: 315, baseType: !411, size: 8, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1173, file: !629, line: 359, baseType: !1254, size: 64, offset: 1920)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1173, file: !629, line: 360, baseType: !1254, size: 64, offset: 1984)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1173, file: !629, line: 361, baseType: !432, size: 32, offset: 2048)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1173, file: !629, line: 362, baseType: !449, size: 32, offset: 2080)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1173, file: !629, line: 363, baseType: !432, size: 32, offset: 2112)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1173, file: !629, line: 364, baseType: !596, size: 64, offset: 2176)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1173, file: !629, line: 365, baseType: !1221, size: 64, offset: 2240)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1173, file: !629, line: 366, baseType: !449, size: 32, offset: 2304)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1173, file: !629, line: 367, baseType: !449, size: 32, offset: 2336)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1173, file: !629, line: 368, baseType: !1215, size: 64, offset: 2368)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1173, file: !629, line: 369, baseType: !1215, size: 64, offset: 2432)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1173, file: !629, line: 370, baseType: !1273, size: 64, offset: 2496)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
