; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/utils/dmsnes.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/utils/dmsnes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!83 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!85 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!86 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 85, baseType: !26, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!91 = !DIEnumerator(name: "PC_LEFT", value: 0)
!92 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!93 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 285, baseType: !5, size: 32, elements: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108}
!103 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!104 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!105 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!106 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!107 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!108 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!113 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!116 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 663, baseType: !5, size: 32, elements: !136)
!135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!136 = !{!137, !138, !139}
!137 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!140 = !{!141, !145, !146, !149, !349, !1303, !315, !1304, !1305}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !142, line: 330, baseType: !143)
!142 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !142, line: 330, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !152, line: 73, size: 4480, elements: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!153 = !{!154, !156, !202, !203, !205, !208, !209, !210, !211, !219, !220, !222, !226, !230, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !244, !245, !247, !248, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !264, !265, !268, !270, !271, !272, !282, !284, !285, !289, !290, !339, !344, !346, !347, !348}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !151, file: !152, line: 74, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !151, file: !152, line: 75, baseType: !157, size: 448, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 448, elements: !200)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !152, line: 53, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 45, size: 448, elements: !160)
!160 = !{!161, !167, !175, !180, !184, !188, !195}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !159, file: !152, line: 46, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !149, !166}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !159, file: !152, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!165, !149, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !159, file: !152, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!165, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !159, file: !152, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!165, !149, !146, !149}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !159, file: !152, line: 50, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!165, !149, !146, !179}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !159, file: !152, line: 51, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!165, !149, !146, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !159, file: !152, line: 52, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!165, !149, !146, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !151, file: !152, line: 76, baseType: !141, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !152, line: 77, baseType: !204, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !151, file: !152, line: 78, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !207)
!207 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !151, file: !152, line: 78, baseType: !206, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !151, file: !152, line: 78, baseType: !206, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !151, file: !152, line: 78, baseType: !206, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 79, baseType: !212, size: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !215, line: 27, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 43, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!218 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !151, file: !152, line: 80, baseType: !204, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !151, file: !152, line: 81, baseType: !221, size: 32, offset: 992)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !151, file: !152, line: 82, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !151, file: !152, line: 83, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !151, file: !152, line: 84, baseType: !231, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !151, file: !152, line: 85, baseType: !231, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !151, file: !152, line: 86, baseType: !231, size: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !151, file: !152, line: 87, baseType: !231, size: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !151, file: !152, line: 88, baseType: !149, size: 64, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !151, file: !152, line: 89, baseType: !212, size: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 90, baseType: !231, size: 64, offset: 1536)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !151, file: !152, line: 91, baseType: !231, size: 64, offset: 1600)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !151, file: !152, line: 92, baseType: !204, size: 32, offset: 1664)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !151, file: !152, line: 93, baseType: !145, size: 64, offset: 1728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !151, file: !152, line: 94, baseType: !242, size: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !213)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !151, file: !152, line: 95, baseType: !204, size: 32, offset: 1856)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !151, file: !152, line: 95, baseType: !204, size: 32, offset: 1888)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !151, file: !152, line: 96, baseType: !246, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !151, file: !152, line: 96, baseType: !246, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !151, file: !152, line: 97, baseType: !249, size: 64, offset: 2048)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !151, file: !152, line: 97, baseType: !251, size: 64, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !151, file: !152, line: 98, baseType: !204, size: 32, offset: 2176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !151, file: !152, line: 98, baseType: !204, size: 32, offset: 2208)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !151, file: !152, line: 99, baseType: !246, size: 64, offset: 2240)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !151, file: !152, line: 99, baseType: !246, size: 64, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !151, file: !152, line: 100, baseType: !257, size: 64, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !207)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !151, file: !152, line: 100, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !151, file: !152, line: 101, baseType: !204, size: 32, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !151, file: !152, line: 101, baseType: !204, size: 32, offset: 2528)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !151, file: !152, line: 102, baseType: !246, size: 64, offset: 2560)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !151, file: !152, line: 102, baseType: !246, size: 64, offset: 2624)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !151, file: !152, line: 103, baseType: !266, size: 64, offset: 2688)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !151, file: !152, line: 103, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !151, file: !152, line: 104, baseType: !199, size: 64, offset: 2816)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !151, file: !152, line: 105, baseType: !204, size: 32, offset: 2880)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !151, file: !152, line: 106, baseType: !273, size: 128, offset: 2944)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !152, line: 64, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 61, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !276, file: !152, line: 62, baseType: !192, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !152, line: 63, baseType: !145, size: 64, offset: 64)
!280 = !{!281}
!281 = !DISubrange(count: 2)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !151, file: !152, line: 107, baseType: !283, size: 64, offset: 3072)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !151, file: !152, line: 108, baseType: !145, size: 64, offset: 3136)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !151, file: !152, line: 109, baseType: !286, size: 64, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!165, !145}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !151, file: !152, line: 111, baseType: !204, size: 32, offset: 3264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !151, file: !152, line: 112, baseType: !291, size: 320, offset: 3328)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !337)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!165, !295, !149, !145}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !298)
!298 = !{!299, !300, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !297, file: !10, line: 100, baseType: !204, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 101, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !312, !313, !314, !318, !320, !322, !323, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !303, file: !10, line: 84, baseType: !231, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !303, file: !10, line: 85, baseType: !231, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !10, line: 86, baseType: !145, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !303, file: !10, line: 87, baseType: !223, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !10, line: 88, baseType: !310, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !303, file: !10, line: 89, baseType: !148, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !303, file: !10, line: 90, baseType: !231, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !303, file: !10, line: 91, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!317 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !303, file: !10, line: 92, baseType: !319, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !10, line: 93, baseType: !321, size: 32, offset: 544)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !10, line: 94, baseType: !301, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !303, file: !10, line: 95, baseType: !231, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !303, file: !10, line: 96, baseType: !145, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !297, file: !10, line: 103, baseType: !231, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !297, file: !10, line: 104, baseType: !141, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !297, file: !10, line: 106, baseType: !149, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !10, line: 107, baseType: !334, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!337 = !{!338}
!338 = !DISubrange(count: 5)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !151, file: !152, line: 113, baseType: !340, size: 320, offset: 3648)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !337)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!165, !149, !145}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !151, file: !152, line: 114, baseType: !345, size: 320, offset: 3968)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 320, elements: !337)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !151, file: !152, line: 115, baseType: !319, size: 32, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !151, file: !152, line: 120, baseType: !334, size: 64, offset: 4352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !151, file: !152, line: 121, baseType: !319, size: 32, offset: 4416)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSNES", file: !350, line: 176, baseType: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSNES", file: !350, line: 197, size: 5568, elements: !353)
!353 = !{!354, !356, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !352, file: !350, line: 198, baseType: !355, size: 4480)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !152, line: 122, baseType: !151)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !352, file: !350, line: 198, baseType: !357, size: 576, offset: 4480)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 576, elements: !200)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSNESOps", file: !350, line: 178, size: 576, elements: !359)
!359 = !{!360, !1278, !1279, !1280, !1284, !1285, !1286, !1287, !1291}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "computefunction", scope: !358, file: !350, line: 179, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!165, !364, !377, !377, !145}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !350, line: 38, size: 11648, elements: !367)
!367 = !{!368, !369, !433, !1169, !1170, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1187, !1191, !1192, !1194, !1195, !1196, !1197, !1198, !1203, !1204, !1205, !1206, !1207, !1208, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1244, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !366, file: !350, line: 39, baseType: !355, size: 4480)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !366, file: !350, line: 39, baseType: !370, size: 1088, offset: 4480)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 1088, elements: !200)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !350, line: 12, size: 1088, elements: !372)
!372 = !{!373, !381, !385, !389, !395, !396, !400, !401, !405, !409, !410, !411, !416, !420, !424, !425, !432}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !371, file: !350, line: 13, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!165, !364, !377, !145}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !378, line: 21, baseType: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !378, line: 21, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !371, file: !350, line: 14, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!165, !377, !377, !145}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !371, file: !350, line: 15, baseType: !386, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!165, !364, !204}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !371, file: !350, line: 16, baseType: !390, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!165, !364, !204, !258, !258, !258, !393, !145}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !371, file: !350, line: 17, baseType: !286, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !371, file: !350, line: 18, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!165, !364}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !371, file: !350, line: 19, baseType: !397, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !371, file: !350, line: 20, baseType: !402, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!165, !364, !171}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !371, file: !350, line: 21, baseType: !406, size: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!165, !295, !364}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !371, file: !350, line: 22, baseType: !397, size: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !371, file: !350, line: 23, baseType: !397, size: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !371, file: !350, line: 24, baseType: !412, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!165, !364, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !371, file: !350, line: 25, baseType: !417, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!165, !415}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !371, file: !350, line: 26, baseType: !421, size: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!165, !364, !377, !377}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !371, file: !350, line: 27, baseType: !361, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !371, file: !350, line: 28, baseType: !426, size: 64, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!165, !364, !377, !429, !429, !145}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !95, line: 16, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !95, line: 16, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !371, file: !350, line: 29, baseType: !402, size: 64, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !366, file: !350, line: 40, baseType: !434, size: 64, offset: 5568)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !62, line: 14, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !68, line: 202, size: 40000, elements: !437)
!437 = !{!438, !439, !667, !671, !672, !673, !674, !684, !685, !693, !694, !702, !703, !704, !705, !706, !707, !711, !713, !715, !716, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !744, !756, !768, !780, !789, !790, !813, !814, !815, !816, !817, !818, !820, !911, !912, !932, !933, !934, !935, !936, !937, !941, !942, !946, !947, !948, !949, !950, !951, !952, !953, !954, !957, !969, !970, !971, !980, !1068, !1069, !1157, !1158, !1159, !1160, !1162, !1164, !1165, !1166, !1167, !1168}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !436, file: !68, line: 203, baseType: !355, size: 4480)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !436, file: !68, line: 203, baseType: !440, size: 3456, offset: 4480)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 3456, elements: !200)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !68, line: 30, size: 3456, elements: !442)
!442 = !{!443, !447, !448, !453, !457, !461, !462, !463, !468, !469, !470, !482, !483, !491, !500, !505, !509, !513, !514, !519, !520, !524, !525, !529, !530, !538, !542, !547, !548, !549, !550, !551, !552, !553, !557, !563, !567, !572, !576, !587, !591, !596, !603, !607, !608, !614, !624, !628, !638, !642, !650, !654, !662, !663}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !441, file: !68, line: 31, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!165, !434, !171}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !441, file: !68, line: 32, baseType: !444, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !441, file: !68, line: 33, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!165, !434, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !441, file: !68, line: 34, baseType: !454, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!165, !295, !434}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !441, file: !68, line: 35, baseType: !458, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!165, !434}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !441, file: !68, line: 36, baseType: !458, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !441, file: !68, line: 37, baseType: !458, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !441, file: !68, line: 38, baseType: !464, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!165, !434, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !441, file: !68, line: 39, baseType: !464, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !441, file: !68, line: 40, baseType: !458, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !441, file: !68, line: 41, baseType: !471, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!165, !434, !249, !474, !476}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !479, line: 11, baseType: !480)
!479 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !479, line: 11, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !441, file: !68, line: 42, baseType: !449, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !441, file: !68, line: 43, baseType: !484, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!165, !434, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !62, line: 165, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !62, line: 165, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !441, file: !68, line: 45, baseType: !492, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!165, !434, !495, !496}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !46, line: 213, baseType: !45)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !479, line: 51, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !479, line: 51, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !441, file: !68, line: 46, baseType: !501, size: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!165, !434, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !441, file: !68, line: 47, baseType: !506, size: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!165, !434, !434, !504, !467}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !441, file: !68, line: 48, baseType: !510, size: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!165, !434, !434, !504}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !441, file: !68, line: 49, baseType: !510, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !441, file: !68, line: 50, baseType: !515, size: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!165, !434, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !441, file: !68, line: 51, baseType: !510, size: 64, offset: 1216)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !441, file: !68, line: 53, baseType: !521, size: 64, offset: 1280)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!165, !434, !141, !452}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !441, file: !68, line: 54, baseType: !521, size: 64, offset: 1344)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !441, file: !68, line: 55, baseType: !526, size: 64, offset: 1408)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!165, !434, !204, !452}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !441, file: !68, line: 56, baseType: !526, size: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !441, file: !68, line: 57, baseType: !531, size: 64, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!165, !434, !534, !452}
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !535, line: 12, baseType: !536)
!535 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !535, line: 12, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !441, file: !68, line: 58, baseType: !539, size: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!165, !434, !377, !534, !452}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !441, file: !68, line: 60, baseType: !543, size: 64, offset: 1664)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!165, !434, !377, !546, !377}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !50)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !441, file: !68, line: 61, baseType: !543, size: 64, offset: 1728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !441, file: !68, line: 62, baseType: !543, size: 64, offset: 1792)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !441, file: !68, line: 63, baseType: !543, size: 64, offset: 1856)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !441, file: !68, line: 64, baseType: !543, size: 64, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !441, file: !68, line: 65, baseType: !543, size: 64, offset: 1984)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !441, file: !68, line: 67, baseType: !458, size: 64, offset: 2048)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !441, file: !68, line: 69, baseType: !554, size: 64, offset: 2112)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!165, !434, !377, !377}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !441, file: !68, line: 71, baseType: !558, size: 64, offset: 2176)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!165, !434, !204, !561, !477, !452}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !441, file: !68, line: 72, baseType: !564, size: 64, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!165, !452, !204, !476, !452}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !441, file: !68, line: 73, baseType: !568, size: 64, offset: 2304)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!165, !434, !249, !474, !476, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !441, file: !68, line: 74, baseType: !573, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!165, !434, !249, !474, !476, !476, !571}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !441, file: !68, line: 75, baseType: !577, size: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!165, !434, !204, !452, !580, !580, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !583, line: 59, baseType: !584)
!583 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !583, line: 15, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !583, line: 15, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !441, file: !68, line: 77, baseType: !588, size: 64, offset: 2496)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!165, !434, !204, !249, !249}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !441, file: !68, line: 78, baseType: !592, size: 64, offset: 2560)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!165, !434, !377, !595, !584}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !62, line: 74, baseType: !61)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !441, file: !68, line: 79, baseType: !597, size: 64, offset: 2624)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!165, !434, !249, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !441, file: !68, line: 80, baseType: !604, size: 64, offset: 2688)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!165, !434, !257, !257}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !441, file: !68, line: 81, baseType: !604, size: 64, offset: 2752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !441, file: !68, line: 82, baseType: !609, size: 64, offset: 2816)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!165, !434, !377, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !441, file: !68, line: 84, baseType: !615, size: 64, offset: 2880)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!165, !434, !258, !618, !415, !546, !377}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!165, !204, !258, !622, !204, !266, !145}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !441, file: !68, line: 85, baseType: !625, size: 64, offset: 2944)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!165, !434, !258, !534, !204, !561, !204, !561, !618, !415, !546, !377}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !441, file: !68, line: 86, baseType: !629, size: 64, offset: 3008)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!165, !434, !258, !377, !632, !546, !377}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !204, !204, !204, !561, !561, !636, !636, !636, !561, !561, !636, !636, !636, !258, !622, !204, !636, !266}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !441, file: !68, line: 87, baseType: !639, size: 64, offset: 3072)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!165, !434, !258, !534, !204, !561, !204, !561, !377, !632, !546, !377}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !441, file: !68, line: 88, baseType: !643, size: 64, offset: 3136)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!165, !434, !258, !534, !204, !561, !204, !561, !377, !646, !546, !377}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !204, !204, !204, !561, !561, !636, !636, !636, !561, !561, !636, !636, !636, !258, !622, !622, !204, !636, !266}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !441, file: !68, line: 89, baseType: !651, size: 64, offset: 3200)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!165, !434, !258, !618, !415, !377, !257}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !441, file: !68, line: 90, baseType: !655, size: 64, offset: 3264)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!165, !434, !258, !658, !415, !377, !622, !257}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!165, !204, !258, !622, !622, !204, !266, !145}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !441, file: !68, line: 91, baseType: !651, size: 64, offset: 3328)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !441, file: !68, line: 93, baseType: !664, size: 64, offset: 3392)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!165, !434, !434, !518, !518}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !436, file: !68, line: 204, baseType: !668, size: 6400, offset: 7936)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 6400, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 100)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !436, file: !68, line: 204, baseType: !668, size: 6400, offset: 14336)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !436, file: !68, line: 205, baseType: !668, size: 6400, offset: 20736)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !436, file: !68, line: 205, baseType: !668, size: 6400, offset: 27136)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !436, file: !68, line: 206, baseType: !675, size: 64, offset: 33536)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !68, line: 141, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !68, line: 142, size: 256, elements: !678)
!678 = !{!679, !680, !681, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !677, file: !68, line: 143, baseType: !377, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !68, line: 144, baseType: !231, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !677, file: !68, line: 145, baseType: !682, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !68, line: 140, baseType: !67)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !677, file: !68, line: 146, baseType: !675, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !436, file: !68, line: 207, baseType: !675, size: 64, offset: 33600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !436, file: !68, line: 208, baseType: !686, size: 64, offset: 33664)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !68, line: 149, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !68, line: 150, size: 192, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !688, file: !68, line: 151, baseType: !315, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !688, file: !68, line: 152, baseType: !145, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !68, line: 153, baseType: !686, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !436, file: !68, line: 208, baseType: !686, size: 64, offset: 33728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !436, file: !68, line: 209, baseType: !695, size: 64, offset: 33792)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !68, line: 163, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !68, line: 158, size: 192, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !697, file: !68, line: 159, baseType: !534, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !697, file: !68, line: 160, baseType: !319, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !68, line: 161, baseType: !696, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !436, file: !68, line: 210, baseType: !534, size: 64, offset: 33856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !436, file: !68, line: 211, baseType: !534, size: 64, offset: 33920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !436, file: !68, line: 212, baseType: !145, size: 64, offset: 33984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !436, file: !68, line: 213, baseType: !417, size: 64, offset: 34048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !436, file: !68, line: 214, baseType: !495, size: 32, offset: 34112)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !436, file: !68, line: 215, baseType: !708, size: 64, offset: 34176)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !95, line: 1378, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !95, line: 1378, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !436, file: !68, line: 216, baseType: !712, size: 64, offset: 34240)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !378, line: 83, baseType: !146)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !436, file: !68, line: 217, baseType: !714, size: 64, offset: 34304)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !95, line: 25, baseType: !146)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !436, file: !68, line: 218, baseType: !204, size: 32, offset: 34368)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !436, file: !68, line: 219, baseType: !717, size: 64, offset: 34432)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !479, line: 30, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !479, line: 30, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !436, file: !68, line: 220, baseType: !319, size: 32, offset: 34496)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !436, file: !68, line: 221, baseType: !319, size: 32, offset: 34528)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !436, file: !68, line: 222, baseType: !204, size: 32, offset: 34560)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !436, file: !68, line: 222, baseType: !204, size: 32, offset: 34592)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !436, file: !68, line: 223, baseType: !319, size: 32, offset: 34624)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !436, file: !68, line: 224, baseType: !319, size: 32, offset: 34656)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !68, line: 225, baseType: !145, size: 64, offset: 34688)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !436, file: !68, line: 227, baseType: !434, size: 64, offset: 34752)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !436, file: !68, line: 228, baseType: !434, size: 64, offset: 34816)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !436, file: !68, line: 229, baseType: !730, size: 64, offset: 34880)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !68, line: 100, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !68, line: 101, size: 256, elements: !733)
!733 = !{!734, !738, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !732, file: !68, line: 102, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!165, !434, !434, !145}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !732, file: !68, line: 103, baseType: !739, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!165, !434, !429, !377, !429, !434, !145}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !732, file: !68, line: 104, baseType: !145, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !68, line: 105, baseType: !730, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !436, file: !68, line: 230, baseType: !745, size: 64, offset: 34944)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !68, line: 108, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !68, line: 109, size: 256, elements: !748)
!748 = !{!749, !750, !754, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !747, file: !68, line: 110, baseType: !735, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !747, file: !68, line: 111, baseType: !751, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!165, !434, !429, !434, !145}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !747, file: !68, line: 112, baseType: !145, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !68, line: 113, baseType: !745, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !436, file: !68, line: 231, baseType: !757, size: 64, offset: 35008)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !68, line: 116, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !68, line: 117, size: 256, elements: !760)
!760 = !{!761, !762, !766, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !759, file: !68, line: 118, baseType: !735, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !759, file: !68, line: 119, baseType: !763, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!165, !434, !582, !582, !434, !145}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !759, file: !68, line: 120, baseType: !145, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !68, line: 121, baseType: !757, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !436, file: !68, line: 232, baseType: !769, size: 64, offset: 35072)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !68, line: 124, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !68, line: 125, size: 256, elements: !772)
!772 = !{!773, !777, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !771, file: !68, line: 126, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!165, !434, !377, !546, !377, !145}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !771, file: !68, line: 127, baseType: !774, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !771, file: !68, line: 128, baseType: !145, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !68, line: 129, baseType: !769, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !436, file: !68, line: 233, baseType: !781, size: 64, offset: 35136)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !68, line: 132, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !68, line: 133, size: 256, elements: !784)
!784 = !{!785, !786, !787, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !783, file: !68, line: 134, baseType: !774, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !783, file: !68, line: 135, baseType: !774, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !783, file: !68, line: 136, baseType: !145, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !68, line: 137, baseType: !781, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !436, file: !68, line: 235, baseType: !204, size: 32, offset: 35200)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !436, file: !68, line: 237, baseType: !791, size: 64, offset: 35264)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !68, line: 27, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !68, line: 27, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !68, line: 27, size: 320, elements: !795)
!795 = !{!796, !800, !801, !802, !803, !805, !812}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !794, file: !68, line: 27, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !798, line: 166, baseType: !799)
!798 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !798, line: 139, baseType: !5)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !68, line: 27, baseType: !797, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !794, file: !68, line: 27, baseType: !797, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !794, file: !68, line: 27, baseType: !797, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !794, file: !68, line: 27, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !794, file: !68, line: 27, baseType: !806, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !68, line: 21, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !68, line: 17, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !808, file: !68, line: 19, baseType: !534, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !808, file: !68, line: 20, baseType: !204, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !794, file: !68, line: 27, baseType: !467, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !436, file: !68, line: 239, baseType: !584, size: 64, offset: 35328)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !436, file: !68, line: 240, baseType: !584, size: 64, offset: 35392)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !436, file: !68, line: 241, baseType: !584, size: 64, offset: 35456)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !436, file: !68, line: 242, baseType: !584, size: 64, offset: 35520)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !436, file: !68, line: 243, baseType: !319, size: 32, offset: 35584)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !436, file: !68, line: 245, baseType: !819, size: 64, offset: 35616)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !280)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !436, file: !68, line: 246, baseType: !821, size: 64, offset: 35712)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !822, line: 18, baseType: !823)
!822 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !825, line: 29, size: 5760, elements: !826)
!825 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!826 = !{!827, !828, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !847, !848, !849, !874, !875, !876}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !824, file: !825, line: 30, baseType: !355, size: 4480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !824, file: !825, line: 30, baseType: !829, size: 32, offset: 4480)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !200)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !824, file: !825, line: 31, baseType: !204, size: 32, offset: 4512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !824, file: !825, line: 31, baseType: !204, size: 32, offset: 4544)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !824, file: !825, line: 32, baseType: !478, size: 64, offset: 4608)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !824, file: !825, line: 33, baseType: !319, size: 32, offset: 4672)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !824, file: !825, line: 34, baseType: !319, size: 32, offset: 4704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !824, file: !825, line: 35, baseType: !249, size: 64, offset: 4736)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !824, file: !825, line: 36, baseType: !249, size: 64, offset: 4800)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !824, file: !825, line: 37, baseType: !204, size: 32, offset: 4864)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !824, file: !825, line: 38, baseType: !821, size: 64, offset: 4928)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !824, file: !825, line: 39, baseType: !249, size: 64, offset: 4992)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !824, file: !825, line: 40, baseType: !319, size: 32, offset: 5056)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !824, file: !825, line: 42, baseType: !204, size: 32, offset: 5088)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !824, file: !825, line: 43, baseType: !475, size: 64, offset: 5120)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !824, file: !825, line: 44, baseType: !249, size: 64, offset: 5184)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !824, file: !825, line: 45, baseType: !845, size: 64, offset: 5248)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !824, file: !825, line: 46, baseType: !319, size: 32, offset: 5312)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !824, file: !825, line: 47, baseType: !474, size: 64, offset: 5376)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !824, file: !825, line: 49, baseType: !149, size: 64, offset: 5440)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !824, file: !825, line: 50, baseType: !850, size: 64, offset: 5504)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !825, line: 27, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !825, line: 27, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !825, line: 27, size: 320, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !867}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !853, file: !825, line: 27, baseType: !797, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !853, file: !825, line: 27, baseType: !797, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !853, file: !825, line: 27, baseType: !797, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !853, file: !825, line: 27, baseType: !797, size: 32, offset: 96)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !853, file: !825, line: 27, baseType: !804, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !853, file: !825, line: 27, baseType: !861, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !825, line: 10, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !825, line: 8, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !863, file: !825, line: 9, baseType: !204, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !863, file: !825, line: 9, baseType: !204, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !853, file: !825, line: 27, baseType: !868, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !825, line: 14, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 12, size: 128, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !870, file: !825, line: 13, baseType: !249, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !870, file: !825, line: 13, baseType: !249, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !824, file: !825, line: 51, baseType: !821, size: 64, offset: 5568)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !824, file: !825, line: 52, baseType: !478, size: 64, offset: 5632)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !824, file: !825, line: 53, baseType: !877, size: 64, offset: 5696)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !822, line: 33, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !825, line: 72, size: 4864, elements: !880)
!880 = !{!881, !882, !900, !901, !910}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !879, file: !825, line: 73, baseType: !355, size: 4480)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !879, file: !825, line: 73, baseType: !883, size: 192, offset: 4480)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 192, elements: !200)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !825, line: 56, size: 192, elements: !885)
!885 = !{!886, !892, !896}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !884, file: !825, line: 57, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!165, !877, !821, !204, !561, !890, !891}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !884, file: !825, line: 58, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!165, !877}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !884, file: !825, line: 59, baseType: !897, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!165, !877, !171}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !879, file: !825, line: 74, baseType: !145, size: 64, offset: 4672)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !879, file: !825, line: 75, baseType: !902, size: 64, offset: 4736)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !825, line: 62, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !825, line: 64, size: 256, elements: !905)
!905 = !{!906, !907, !908, !909}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !904, file: !825, line: 66, baseType: !902, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !904, file: !825, line: 67, baseType: !890, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !904, file: !825, line: 68, baseType: !891, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !904, file: !825, line: 69, baseType: !204, size: 32, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !879, file: !825, line: 76, baseType: !902, size: 64, offset: 4800)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !436, file: !68, line: 247, baseType: !821, size: 64, offset: 35776)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !436, file: !68, line: 248, baseType: !913, size: 64, offset: 35840)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !479, line: 60, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !46, line: 240, size: 640, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !915, file: !46, line: 241, baseType: !141, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !915, file: !46, line: 242, baseType: !221, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !915, file: !46, line: 243, baseType: !204, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !915, file: !46, line: 243, baseType: !204, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !915, file: !46, line: 244, baseType: !204, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !915, file: !46, line: 244, baseType: !204, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !915, file: !46, line: 245, baseType: !249, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !915, file: !46, line: 246, baseType: !319, size: 32, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !915, file: !46, line: 247, baseType: !204, size: 32, offset: 352)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !915, file: !46, line: 251, baseType: !204, size: 32, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !915, file: !46, line: 252, baseType: !717, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !915, file: !46, line: 253, baseType: !319, size: 32, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !915, file: !46, line: 254, baseType: !204, size: 32, offset: 544)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !915, file: !46, line: 254, baseType: !204, size: 32, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !915, file: !46, line: 255, baseType: !204, size: 32, offset: 608)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !436, file: !68, line: 250, baseType: !821, size: 64, offset: 35904)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !436, file: !68, line: 251, baseType: !429, size: 64, offset: 35968)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !436, file: !68, line: 253, baseType: !434, size: 64, offset: 36032)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !436, file: !68, line: 254, baseType: !377, size: 64, offset: 36096)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !436, file: !68, line: 255, baseType: !145, size: 64, offset: 36160)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !436, file: !68, line: 256, baseType: !938, size: 64, offset: 36224)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!165, !434, !145}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !436, file: !68, line: 257, baseType: !938, size: 64, offset: 36288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !436, file: !68, line: 258, baseType: !943, size: 64, offset: 36352)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!165, !434, !622, !319, !891, !145}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !436, file: !68, line: 260, baseType: !204, size: 32, offset: 36416)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !436, file: !68, line: 261, baseType: !434, size: 64, offset: 36480)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !436, file: !68, line: 262, baseType: !377, size: 64, offset: 36544)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !436, file: !68, line: 263, baseType: !377, size: 64, offset: 36608)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !436, file: !68, line: 264, baseType: !319, size: 32, offset: 36672)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !436, file: !68, line: 265, baseType: !488, size: 64, offset: 36736)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !436, file: !68, line: 266, baseType: !257, size: 64, offset: 36800)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !436, file: !68, line: 266, baseType: !257, size: 64, offset: 36864)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !436, file: !68, line: 267, baseType: !955, size: 64, offset: 36928)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !62, line: 42, baseType: !72)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !436, file: !68, line: 269, baseType: !958, size: 640, offset: 36992)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 640, elements: !967)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !68, line: 15, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!165, !434, !204, !204, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !95, line: 1723, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !95, line: 1723, flags: DIFlagFwdDecl)
!967 = !{!968}
!968 = !DISubrange(count: 10)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !436, file: !68, line: 270, baseType: !958, size: 640, offset: 37632)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !436, file: !68, line: 272, baseType: !204, size: 32, offset: 38272)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !436, file: !68, line: 273, baseType: !972, size: 64, offset: 38336)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !68, line: 178, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !68, line: 173, size: 256, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !974, file: !68, line: 174, baseType: !149, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !974, file: !68, line: 175, baseType: !534, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !974, file: !68, line: 176, baseType: !819, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !974, file: !68, line: 177, baseType: !319, size: 32, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !436, file: !68, line: 274, baseType: !981, size: 64, offset: 38400)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !68, line: 165, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !68, line: 167, size: 192, elements: !984)
!984 = !{!985, !1066, !1067}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !983, file: !68, line: 168, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !987, line: 11, baseType: !988)
!987 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !987, line: 13, size: 832, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !1057, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !987, line: 14, baseType: !146, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !989, file: !987, line: 15, baseType: !534, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !989, file: !987, line: 16, baseType: !146, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !989, file: !987, line: 17, baseType: !204, size: 32, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !989, file: !987, line: 18, baseType: !249, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !989, file: !987, line: 19, baseType: !997, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !998, line: 22, baseType: !999)
!998 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !987, line: 81, size: 4992, elements: !1001)
!1001 = !{!1002, !1003, !1017, !1018, !1019, !1028}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1000, file: !987, line: 82, baseType: !355, size: 4480)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1000, file: !987, line: 82, baseType: !1004, size: 256, offset: 4480)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 256, elements: !200)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !987, line: 74, size: 256, elements: !1006)
!1006 = !{!1007, !1011, !1012, !1016}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1005, file: !987, line: 75, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!165, !997}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1005, file: !987, line: 76, baseType: !1008, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1005, file: !987, line: 77, baseType: !1013, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!165, !997, !171}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1005, file: !987, line: 78, baseType: !1008, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1000, file: !987, line: 83, baseType: !145, size: 64, offset: 4736)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1000, file: !987, line: 85, baseType: !204, size: 32, offset: 4800)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !1000, file: !987, line: 86, baseType: !1020, size: 64, offset: 4864)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !987, line: 41, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !987, line: 36, size: 256, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1022, file: !987, line: 37, baseType: !315, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1022, file: !987, line: 38, baseType: !315, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !1022, file: !987, line: 39, baseType: !315, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1022, file: !987, line: 40, baseType: !231, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !1000, file: !987, line: 87, baseType: !1029, size: 64, offset: 4928)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !987, line: 54, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !987, line: 54, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !987, line: 54, size: 320, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1049}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1033, file: !987, line: 54, baseType: !797, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !987, line: 54, baseType: !797, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1033, file: !987, line: 54, baseType: !797, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1033, file: !987, line: 54, baseType: !797, size: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1033, file: !987, line: 54, baseType: !804, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1033, file: !987, line: 54, baseType: !1041, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !998, line: 41, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !998, line: 35, size: 192, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1043, file: !998, line: 37, baseType: !534, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1043, file: !998, line: 38, baseType: !204, size: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1043, file: !998, line: 39, baseType: !204, size: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1043, file: !998, line: 40, baseType: !204, size: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1033, file: !987, line: 54, baseType: !1050, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !987, line: 34, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !987, line: 30, size: 96, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1052, file: !987, line: 31, baseType: !204, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1052, file: !987, line: 32, baseType: !204, size: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1052, file: !987, line: 33, baseType: !204, size: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !989, file: !987, line: 20, baseType: !1058, size: 32, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !62, line: 60, baseType: !79)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !989, file: !987, line: 21, baseType: !204, size: 32, offset: 416)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !989, file: !987, line: 22, baseType: !204, size: 32, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !989, file: !987, line: 23, baseType: !249, size: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !989, file: !987, line: 24, baseType: !192, size: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !989, file: !987, line: 25, baseType: !192, size: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !989, file: !987, line: 26, baseType: !145, size: 64, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !987, line: 27, baseType: !986, size: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !983, file: !68, line: 169, baseType: !534, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !68, line: 170, baseType: !981, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !436, file: !68, line: 275, baseType: !204, size: 32, offset: 38464)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !436, file: !68, line: 276, baseType: !1070, size: 64, offset: 38528)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !68, line: 184, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !68, line: 180, size: 192, elements: !1073)
!1073 = !{!1074, !1155, !1156}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1072, file: !68, line: 181, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !998, line: 13, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !987, line: 98, size: 7232, elements: !1078)
!1078 = !{!1079, !1080, !1094, !1095, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1111, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1077, file: !987, line: 99, baseType: !355, size: 4480)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1077, file: !987, line: 99, baseType: !1081, size: 256, offset: 4480)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 256, elements: !200)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !987, line: 91, size: 256, elements: !1083)
!1083 = !{!1084, !1088, !1089, !1093}
