; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/natural/natural.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/natural/natural.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_MatColoring = type { %struct._p_PetscObject, [1 x %struct._MatColoringOps], %struct._p_Mat*, i32, i32, i8*, i32, i32, double*, i32*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!262 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!263 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!264 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!265 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!266 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!267 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!268 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 161, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 1265, baseType: !5, size: 32, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 1203, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 187, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 1345, baseType: !5, size: 32, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!312 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!313 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!314 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 663, baseType: !5, size: 32, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !319, !320}
!318 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!321 = !{!322, !323, !326, !344, !412, !92, !496, !530}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !329, line: 73, size: 4480, elements: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!330 = !{!331, !333, !383, !384, !386, !389, !390, !391, !392, !400, !401, !403, !407, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !424, !425, !426, !428, !429, !431, !433, !434, !435, !436, !437, !440, !442, !443, !444, !445, !446, !449, !451, !452, !453, !463, !465, !466, !470, !471, !520, !525, !527, !528, !529}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !328, file: !329, line: 74, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !92)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !328, file: !329, line: 75, baseType: !334, size: 448, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 448, elements: !381)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !329, line: 53, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 45, size: 448, elements: !337)
!337 = !{!338, !348, !356, !361, !365, !369, !376}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !336, file: !329, line: 46, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !326, !343}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !92)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !345, line: 330, baseType: !346)
!345 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !345, line: 330, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !329, line: 47, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!342, !326, !352}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !353, line: 16, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !353, line: 16, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !329, line: 48, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!342, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !336, file: !329, line: 49, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!342, !326, !323, !326}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !336, file: !329, line: 50, baseType: !366, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!342, !326, !323, !360}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !336, file: !329, line: 51, baseType: !370, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!342, !326, !323, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !336, file: !329, line: 52, baseType: !377, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!342, !326, !323, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!381 = !{!382}
!382 = !DISubrange(count: 1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !328, file: !329, line: 76, baseType: !344, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !329, line: 77, baseType: !385, size: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !92)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !328, file: !329, line: 78, baseType: !387, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !388)
!388 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !328, file: !329, line: 78, baseType: !387, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !328, file: !329, line: 78, baseType: !387, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !328, file: !329, line: 78, baseType: !387, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !329, line: 79, baseType: !393, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !396, line: 27, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !398, line: 43, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!399 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !328, file: !329, line: 80, baseType: !385, size: 32, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !328, file: !329, line: 81, baseType: !402, size: 32, offset: 992)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !92)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !328, file: !329, line: 82, baseType: !404, size: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !328, file: !329, line: 83, baseType: !408, size: 64, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !328, file: !329, line: 84, baseType: !412, size: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !328, file: !329, line: 85, baseType: !412, size: 64, offset: 1216)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !328, file: !329, line: 86, baseType: !412, size: 64, offset: 1280)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !328, file: !329, line: 87, baseType: !412, size: 64, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !328, file: !329, line: 88, baseType: !326, size: 64, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !328, file: !329, line: 89, baseType: !393, size: 64, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 90, baseType: !412, size: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !328, file: !329, line: 91, baseType: !412, size: 64, offset: 1600)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !328, file: !329, line: 92, baseType: !385, size: 32, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !328, file: !329, line: 93, baseType: !322, size: 64, offset: 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !329, line: 94, baseType: !423, size: 64, offset: 1792)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !394)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !328, file: !329, line: 95, baseType: !385, size: 32, offset: 1856)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !328, file: !329, line: 95, baseType: !385, size: 32, offset: 1888)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !328, file: !329, line: 96, baseType: !427, size: 64, offset: 1920)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !328, file: !329, line: 96, baseType: !427, size: 64, offset: 1984)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !328, file: !329, line: 97, baseType: !430, size: 64, offset: 2048)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !328, file: !329, line: 97, baseType: !432, size: 64, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !328, file: !329, line: 98, baseType: !385, size: 32, offset: 2176)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !328, file: !329, line: 98, baseType: !385, size: 32, offset: 2208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !328, file: !329, line: 99, baseType: !427, size: 64, offset: 2240)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !328, file: !329, line: 99, baseType: !427, size: 64, offset: 2304)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !328, file: !329, line: 100, baseType: !438, size: 64, offset: 2368)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !388)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !328, file: !329, line: 100, baseType: !441, size: 64, offset: 2432)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !328, file: !329, line: 101, baseType: !385, size: 32, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !328, file: !329, line: 101, baseType: !385, size: 32, offset: 2528)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !328, file: !329, line: 102, baseType: !427, size: 64, offset: 2560)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !328, file: !329, line: 102, baseType: !427, size: 64, offset: 2624)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !328, file: !329, line: 103, baseType: !447, size: 64, offset: 2688)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !439)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !328, file: !329, line: 103, baseType: !450, size: 64, offset: 2752)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !328, file: !329, line: 104, baseType: !380, size: 64, offset: 2816)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !328, file: !329, line: 105, baseType: !385, size: 32, offset: 2880)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !328, file: !329, line: 106, baseType: !454, size: 128, offset: 2944)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 128, elements: !461)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !329, line: 64, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 61, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !457, file: !329, line: 62, baseType: !373, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !457, file: !329, line: 63, baseType: !322, size: 64, offset: 64)
!461 = !{!462}
!462 = !DISubrange(count: 2)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !328, file: !329, line: 107, baseType: !464, size: 64, offset: 3072)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !461)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !328, file: !329, line: 108, baseType: !322, size: 64, offset: 3136)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !328, file: !329, line: 109, baseType: !467, size: 64, offset: 3200)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!342, !322}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !328, file: !329, line: 111, baseType: !385, size: 32, offset: 3264)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !328, file: !329, line: 112, baseType: !472, size: 320, offset: 3328)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 320, elements: !518)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!342, !476, !326, !322}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !479)
!479 = !{!480, !481, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !478, file: !10, line: 100, baseType: !385, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !10, line: 101, baseType: !482, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !493, !494, !495, !499, !501, !503, !504, !505}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !484, file: !10, line: 84, baseType: !412, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !484, file: !10, line: 85, baseType: !412, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !484, file: !10, line: 86, baseType: !322, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !484, file: !10, line: 87, baseType: !404, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !484, file: !10, line: 88, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !484, file: !10, line: 89, baseType: !325, size: 8, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !484, file: !10, line: 90, baseType: !412, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !484, file: !10, line: 91, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !497, line: 46, baseType: !498)
!497 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!498 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !484, file: !10, line: 92, baseType: !500, size: 32, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !10, line: 93, baseType: !502, size: 32, offset: 544)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !10, line: 94, baseType: !482, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !484, file: !10, line: 95, baseType: !412, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !484, file: !10, line: 96, baseType: !322, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !478, file: !10, line: 102, baseType: !412, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !478, file: !10, line: 102, baseType: !412, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !478, file: !10, line: 103, baseType: !412, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !478, file: !10, line: 104, baseType: !344, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 416)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !478, file: !10, line: 106, baseType: !326, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !478, file: !10, line: 107, baseType: !515, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!518 = !{!519}
!519 = !DISubrange(count: 5)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !328, file: !329, line: 113, baseType: !521, size: 320, offset: 3648)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!342, !326, !322}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !328, file: !329, line: 114, baseType: !526, size: 320, offset: 3968)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 320, elements: !518)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !328, file: !329, line: 115, baseType: !500, size: 32, offset: 4288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !328, file: !329, line: 120, baseType: !515, size: 64, offset: 4352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !328, file: !329, line: 121, baseType: !500, size: 32, offset: 4416)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !30, line: 215, baseType: !531)
!531 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!532 = !{i32 7, !"Dwarf Version", i32 4}
!533 = !{i32 2, !"Debug Info Version", i32 3}
!534 = !{i32 1, !"wchar_size", i32 4}
!535 = !{i32 7, !"PIC Level", i32 2}
!536 = !{i32 7, !"uwtable", i32 1}
!537 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!538 = distinct !DISubprogram(name: "MatColoringCreate_Natural", scope: !539, file: !539, line: 68, type: !540, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1466)
!539 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/natural/natural.c", directory: "/home/users/ndemeye/xSDK")
!540 = !DISubroutineType(types: !541)
!541 = !{!342, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !56, line: 1312, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !545, line: 647, size: 5248, elements: !546)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!546 = !{!547, !549, !726, !1457, !1458, !1459, !1460, !1461, !1463, !1464, !1465}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !544, file: !545, line: 648, baseType: !548, size: 4480)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !329, line: 122, baseType: !328)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !544, file: !545, line: 648, baseType: !550, size: 320, offset: 4480)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 320, elements: !381)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !545, line: 639, size: 320, elements: !552)
!552 = !{!553, !555, !559, !563, !722}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !551, file: !545, line: 640, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !551, file: !545, line: 641, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!342, !476, !542}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !551, file: !545, line: 642, baseType: !560, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!342, !542, !352}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !551, file: !545, line: 643, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!342, !542, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !569, line: 51, baseType: !570)
!569 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !35, line: 91, size: 384, elements: !572)
!572 = !{!573, !574, !575, !715, !716, !718, !719, !721}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !571, file: !35, line: 92, baseType: !385, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !571, file: !35, line: 93, baseType: !385, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !571, file: !35, line: 94, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !569, line: 11, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !35, line: 50, size: 7104, elements: !580)
!580 = !{!581, !582, !648, !702, !703, !704, !705, !706, !707, !708, !709, !712}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !579, file: !35, line: 51, baseType: !548, size: 4480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !579, file: !35, line: 51, baseType: !583, size: 1536, offset: 4480)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 1536, elements: !381)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !35, line: 21, size: 1536, elements: !585)
!585 = !{!586, !593, !594, !598, !602, !603, !608, !612, !613, !617, !618, !622, !623, !628, !632, !636, !640, !641, !642, !643, !644, !645, !646, !647}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !584, file: !35, line: 22, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!342, !577, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !584, file: !35, line: 23, baseType: !587, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !584, file: !35, line: 24, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!342, !577, !385, !576}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !584, file: !35, line: 25, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!342, !577}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !584, file: !35, line: 26, baseType: !599, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !584, file: !35, line: 27, baseType: !604, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!342, !577, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !584, file: !35, line: 28, baseType: !609, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!342, !577, !576}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !584, file: !35, line: 29, baseType: !599, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !584, file: !35, line: 30, baseType: !614, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!342, !577, !352}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !584, file: !35, line: 31, baseType: !614, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !584, file: !35, line: 32, baseType: !619, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!342, !577, !577}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !584, file: !35, line: 33, baseType: !599, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !584, file: !35, line: 34, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!342, !577, !344, !627, !576}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !24)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !584, file: !35, line: 35, baseType: !629, size: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!342, !577, !385}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !584, file: !35, line: 36, baseType: !633, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!342, !577, !385, !385, !430, !607}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !584, file: !35, line: 37, baseType: !637, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!342, !577, !385, !430}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !584, file: !35, line: 38, baseType: !604, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !584, file: !35, line: 39, baseType: !604, size: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !584, file: !35, line: 40, baseType: !604, size: 64, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !584, file: !35, line: 41, baseType: !604, size: 64, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !584, file: !35, line: 42, baseType: !604, size: 64, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !584, file: !35, line: 43, baseType: !604, size: 64, offset: 1344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !584, file: !35, line: 44, baseType: !604, size: 64, offset: 1408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !584, file: !35, line: 45, baseType: !604, size: 64, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !579, file: !35, line: 52, baseType: !649, size: 64, offset: 6016)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !569, line: 60, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !30, line: 240, size: 640, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !698, !699, !700, !701}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !651, file: !30, line: 241, baseType: !344, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !651, file: !30, line: 242, baseType: !402, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !651, file: !30, line: 243, baseType: !385, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !651, file: !30, line: 243, baseType: !385, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !651, file: !30, line: 244, baseType: !385, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !651, file: !30, line: 244, baseType: !385, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !651, file: !30, line: 245, baseType: !430, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !651, file: !30, line: 246, baseType: !500, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !651, file: !30, line: 247, baseType: !385, size: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !651, file: !30, line: 251, baseType: !385, size: 32, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !651, file: !30, line: 252, baseType: !664, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !569, line: 30, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !35, line: 73, size: 5440, elements: !667)
!667 = !{!668, !669, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !666, file: !35, line: 74, baseType: !548, size: 4480)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !666, file: !35, line: 74, baseType: !670, size: 256, offset: 4480)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 256, elements: !381)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !35, line: 66, size: 256, elements: !672)
!672 = !{!673, !677, !682, !683}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !671, file: !35, line: 67, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!342, !664}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !671, file: !35, line: 68, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!342, !664, !681, !385, !591, !430, !430}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !30, line: 149, baseType: !29)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !671, file: !35, line: 69, baseType: !678, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !671, file: !35, line: 70, baseType: !674, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !666, file: !35, line: 75, baseType: !385, size: 32, offset: 4736)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !666, file: !35, line: 76, baseType: !385, size: 32, offset: 4768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !666, file: !35, line: 77, baseType: !430, size: 64, offset: 4800)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !666, file: !35, line: 78, baseType: !385, size: 32, offset: 4864)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !666, file: !35, line: 79, baseType: !385, size: 32, offset: 4896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !666, file: !35, line: 80, baseType: !500, size: 32, offset: 4928)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !666, file: !35, line: 81, baseType: !500, size: 32, offset: 4960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !666, file: !35, line: 82, baseType: !385, size: 32, offset: 4992)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !666, file: !35, line: 83, baseType: !430, size: 64, offset: 5056)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !666, file: !35, line: 84, baseType: !430, size: 64, offset: 5120)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !666, file: !35, line: 85, baseType: !432, size: 64, offset: 5184)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !666, file: !35, line: 86, baseType: !430, size: 64, offset: 5248)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !666, file: !35, line: 87, baseType: !432, size: 64, offset: 5312)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !35, line: 88, baseType: !322, size: 64, offset: 5376)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !651, file: !30, line: 253, baseType: !500, size: 32, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !651, file: !30, line: 254, baseType: !385, size: 32, offset: 544)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !651, file: !30, line: 254, baseType: !385, size: 32, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !651, file: !30, line: 255, baseType: !385, size: 32, offset: 608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !579, file: !35, line: 53, baseType: !385, size: 32, offset: 6080)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !579, file: !35, line: 53, baseType: !385, size: 32, offset: 6112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !579, file: !35, line: 54, baseType: !322, size: 64, offset: 6144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !579, file: !35, line: 55, baseType: !430, size: 64, offset: 6208)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !579, file: !35, line: 55, baseType: !430, size: 64, offset: 6272)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !579, file: !35, line: 56, baseType: !385, size: 32, offset: 6336)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !579, file: !35, line: 57, baseType: !577, size: 64, offset: 6400)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !579, file: !35, line: 58, baseType: !710, size: 320, offset: 6464)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !711)
!711 = !{!462, !519}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !579, file: !35, line: 59, baseType: !713, size: 320, offset: 6784)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 320, elements: !711)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !35, line: 48, baseType: !34)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !571, file: !35, line: 95, baseType: !344, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !571, file: !35, line: 96, baseType: !717, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !571, file: !35, line: 97, baseType: !385, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !571, file: !35, line: 98, baseType: !720, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !30, line: 213, baseType: !40)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !571, file: !35, line: 99, baseType: !500, size: 32, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !551, file: !545, line: 644, baseType: !723, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!342, !542, !441, !432}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !544, file: !545, line: 649, baseType: !727, size: 64, offset: 4800)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !56, line: 16, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !545, line: 436, size: 23424, elements: !730)
!730 = !{!731, !732, !1219, !1220, !1221, !1222, !1224, !1225, !1226, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1353, !1354, !1370, !1371, !1372, !1373, !1374, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1409, !1429, !1430, !1432, !1433, !1434, !1435, !1436, !1437, !1455, !1456}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !729, file: !545, line: 437, baseType: !548, size: 4480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !729, file: !545, line: 437, baseType: !733, size: 9472, offset: 4480)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 9472, elements: !381)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !545, line: 32, size: 9472, elements: !735)
!735 = !{!736, !743, !747, !748, !755, !759, !760, !761, !762, !763, !764, !765, !785, !789, !794, !800, !819, !823, !827, !828, !833, !838, !839, !844, !848, !852, !856, !860, !864, !865, !866, !867, !868, !872, !873, !878, !879, !880, !881, !882, !887, !894, !898, !902, !906, !910, !914, !915, !919, !920, !927, !931, !932, !933, !934, !992, !996, !997, !1001, !1002, !1006, !1007, !1011, !1016, !1017, !1021, !1025, !1029, !1030, !1031, !1032, !1033, !1034, !1039, !1040, !1044, !1048, !1052, !1053, !1054, !1058, !1068, !1069, !1073, !1074, !1078, !1079, !1083, !1084, !1089, !1090, !1094, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1108, !1109, !1110, !1111, !1112, !1113, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1128, !1132, !1133, !1134, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1148, !1149, !1150, !1155, !1159, !1160, !1164, !1165, !1166, !1167, !1193, !1197, !1198, !1199, !1200, !1201, !1205, !1206, !1207, !1208, !1209, !1213, !1217, !1218}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !734, file: !545, line: 34, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!342, !727, !385, !591, !385, !591, !740, !742}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !44)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !734, file: !545, line: 35, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!342, !727, !385, !430, !432, !450}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !734, file: !545, line: 36, baseType: !744, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !734, file: !545, line: 37, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!342, !727, !752, !752}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !80, line: 21, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !80, line: 21, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !734, file: !545, line: 38, baseType: !756, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!342, !727, !752, !752, !752}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !734, file: !545, line: 40, baseType: !749, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !734, file: !545, line: 41, baseType: !756, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !734, file: !545, line: 42, baseType: !749, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !734, file: !545, line: 43, baseType: !756, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !734, file: !545, line: 44, baseType: !749, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !734, file: !545, line: 46, baseType: !756, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !734, file: !545, line: 47, baseType: !766, size: 64, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!342, !727, !577, !577, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !56, line: 1239, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 1226, size: 704, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !772, file: !56, line: 1227, baseType: !439, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !772, file: !56, line: 1228, baseType: !439, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !772, file: !56, line: 1229, baseType: !439, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !772, file: !56, line: 1230, baseType: !439, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !772, file: !56, line: 1231, baseType: !439, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !772, file: !56, line: 1232, baseType: !439, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !772, file: !56, line: 1233, baseType: !439, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !772, file: !56, line: 1234, baseType: !439, size: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !772, file: !56, line: 1236, baseType: !439, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !772, file: !56, line: 1237, baseType: !439, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !772, file: !56, line: 1238, baseType: !439, size: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !734, file: !545, line: 48, baseType: !786, size: 64, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!342, !727, !577, !769}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !734, file: !545, line: 49, baseType: !790, size: 64, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!342, !727, !752, !439, !793, !439, !385, !385, !752}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !56, line: 1291, baseType: !55)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !734, file: !545, line: 50, baseType: !795, size: 64, offset: 896)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!342, !727, !798, !799}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !56, line: 238, baseType: !68)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !734, file: !545, line: 52, baseType: !801, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!342, !727, !804, !805}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !56, line: 612, baseType: !74)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !56, line: 600, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 592, size: 640, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !807, file: !56, line: 593, baseType: !387, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !807, file: !56, line: 594, baseType: !387, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !807, file: !56, line: 594, baseType: !387, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !807, file: !56, line: 594, baseType: !387, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !807, file: !56, line: 595, baseType: !387, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !807, file: !56, line: 596, baseType: !387, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !807, file: !56, line: 597, baseType: !387, size: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !807, file: !56, line: 598, baseType: !387, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !807, file: !56, line: 598, baseType: !387, size: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !807, file: !56, line: 599, baseType: !387, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !734, file: !545, line: 53, baseType: !820, size: 64, offset: 1024)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!342, !727, !727, !607}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !734, file: !545, line: 54, baseType: !824, size: 64, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!342, !727, !752}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !734, file: !545, line: 55, baseType: !749, size: 64, offset: 1152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !734, file: !545, line: 56, baseType: !829, size: 64, offset: 1216)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!342, !727, !832, !438}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !80, line: 155, baseType: !79)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !734, file: !545, line: 58, baseType: !834, size: 64, offset: 1280)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!342, !727, !837}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !56, line: 424, baseType: !87)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !734, file: !545, line: 59, baseType: !834, size: 64, offset: 1344)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !734, file: !545, line: 60, baseType: !840, size: 64, offset: 1408)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!342, !727, !843, !500}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !56, line: 469, baseType: !91)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !734, file: !545, line: 61, baseType: !845, size: 64, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!342, !727}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !734, file: !545, line: 63, baseType: !849, size: 64, offset: 1536)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!342, !727, !385, !591, !448, !752, !752}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !734, file: !545, line: 64, baseType: !853, size: 64, offset: 1600)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!342, !727, !727, !577, !577, !769}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !734, file: !545, line: 65, baseType: !857, size: 64, offset: 1664)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!342, !727, !727, !769}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !734, file: !545, line: 66, baseType: !861, size: 64, offset: 1728)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!342, !727, !727, !577, !769}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !734, file: !545, line: 67, baseType: !857, size: 64, offset: 1792)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !734, file: !545, line: 69, baseType: !845, size: 64, offset: 1856)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !734, file: !545, line: 70, baseType: !853, size: 64, offset: 1920)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !734, file: !545, line: 71, baseType: !861, size: 64, offset: 1984)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !734, file: !545, line: 72, baseType: !869, size: 64, offset: 2048)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!342, !727, !799}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !734, file: !545, line: 73, baseType: !845, size: 64, offset: 2112)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !734, file: !545, line: 75, baseType: !874, size: 64, offset: 2176)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!342, !727, !877, !799}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !56, line: 563, baseType: !122)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !734, file: !545, line: 76, baseType: !749, size: 64, offset: 2240)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !734, file: !545, line: 77, baseType: !749, size: 64, offset: 2304)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !734, file: !545, line: 78, baseType: !766, size: 64, offset: 2368)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !734, file: !545, line: 79, baseType: !786, size: 64, offset: 2432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !734, file: !545, line: 81, baseType: !883, size: 64, offset: 2496)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!342, !727, !448, !727, !886}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !56, line: 285, baseType: !127)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !734, file: !545, line: 82, baseType: !888, size: 64, offset: 2560)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!342, !727, !385, !891, !891, !798, !893}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !734, file: !545, line: 83, baseType: !895, size: 64, offset: 2624)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!342, !727, !385, !576, !385}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !734, file: !545, line: 84, baseType: !899, size: 64, offset: 2688)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!342, !727, !385, !591, !385, !591, !447}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !734, file: !545, line: 85, baseType: !903, size: 64, offset: 2752)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!342, !727, !727, !886}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !734, file: !545, line: 87, baseType: !907, size: 64, offset: 2816)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!342, !727, !752, !430}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !734, file: !545, line: 88, baseType: !911, size: 64, offset: 2880)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!342, !727, !448}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !734, file: !545, line: 89, baseType: !911, size: 64, offset: 2944)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !734, file: !545, line: 90, baseType: !916, size: 64, offset: 3008)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!342, !727, !752, !742}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !734, file: !545, line: 91, baseType: !849, size: 64, offset: 3072)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !734, file: !545, line: 93, baseType: !921, size: 64, offset: 3136)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!342, !727, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !734, file: !545, line: 94, baseType: !928, size: 64, offset: 3200)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!342, !727, !385, !500, !500, !430, !590, !590, !607}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !734, file: !545, line: 95, baseType: !928, size: 64, offset: 3264)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !734, file: !545, line: 96, baseType: !928, size: 64, offset: 3328)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !734, file: !545, line: 97, baseType: !928, size: 64, offset: 3392)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !734, file: !545, line: 99, baseType: !935, size: 64, offset: 3456)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!342, !727, !568, !938}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !56, line: 1378, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !545, line: 609, size: 6208, elements: !941)
!941 = !{!942, !943, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !962, !969, !970, !971, !972, !973, !974, !975, !976, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !940, file: !545, line: 610, baseType: !548, size: 4480)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !940, file: !545, line: 610, baseType: !944, size: 32, offset: 4480)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !381)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !940, file: !545, line: 611, baseType: !385, size: 32, offset: 4512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !940, file: !545, line: 611, baseType: !385, size: 32, offset: 4544)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !940, file: !545, line: 611, baseType: !385, size: 32, offset: 4576)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !940, file: !545, line: 612, baseType: !385, size: 32, offset: 4608)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !940, file: !545, line: 613, baseType: !385, size: 32, offset: 4640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !940, file: !545, line: 614, baseType: !430, size: 64, offset: 4672)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !940, file: !545, line: 615, baseType: !432, size: 64, offset: 4736)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !940, file: !545, line: 616, baseType: !576, size: 64, offset: 4800)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !940, file: !545, line: 617, baseType: !430, size: 64, offset: 4864)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !940, file: !545, line: 618, baseType: !955, size: 64, offset: 4928)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !545, line: 602, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 598, size: 128, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !957, file: !545, line: 599, baseType: !385, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !957, file: !545, line: 600, baseType: !385, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !957, file: !545, line: 601, baseType: !447, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !940, file: !545, line: 619, baseType: !963, size: 64, offset: 4992)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !545, line: 607, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 604, size: 128, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !965, file: !545, line: 605, baseType: !385, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !965, file: !545, line: 606, baseType: !447, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !940, file: !545, line: 620, baseType: !447, size: 64, offset: 5056)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !940, file: !545, line: 621, baseType: !439, size: 64, offset: 5120)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !940, file: !545, line: 622, baseType: !439, size: 64, offset: 5184)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !940, file: !545, line: 623, baseType: !752, size: 64, offset: 5248)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !940, file: !545, line: 623, baseType: !752, size: 64, offset: 5312)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !940, file: !545, line: 623, baseType: !752, size: 64, offset: 5376)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !940, file: !545, line: 624, baseType: !500, size: 32, offset: 5440)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !940, file: !545, line: 625, baseType: !977, size: 64, offset: 5504)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!342}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !940, file: !545, line: 626, baseType: !322, size: 64, offset: 5568)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !940, file: !545, line: 627, baseType: !752, size: 64, offset: 5632)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !940, file: !545, line: 628, baseType: !385, size: 32, offset: 5696)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !940, file: !545, line: 629, baseType: !323, size: 64, offset: 5760)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !940, file: !545, line: 630, baseType: !720, size: 32, offset: 5824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !940, file: !545, line: 631, baseType: !385, size: 32, offset: 5856)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !940, file: !545, line: 631, baseType: !385, size: 32, offset: 5888)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !940, file: !545, line: 632, baseType: !500, size: 32, offset: 5920)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !940, file: !545, line: 633, baseType: !500, size: 32, offset: 5952)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !940, file: !545, line: 634, baseType: !373, size: 64, offset: 6016)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !940, file: !545, line: 634, baseType: !322, size: 64, offset: 6080)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !940, file: !545, line: 635, baseType: !393, size: 64, offset: 6144)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !734, file: !545, line: 100, baseType: !993, size: 64, offset: 3520)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!342, !727, !385, !385, !717, !567}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !734, file: !545, line: 101, baseType: !845, size: 64, offset: 3584)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !734, file: !545, line: 102, baseType: !998, size: 64, offset: 3648)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!342, !727, !577, !577, !799}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !734, file: !545, line: 103, baseType: !737, size: 64, offset: 3712)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !734, file: !545, line: 105, baseType: !1003, size: 64, offset: 3776)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!342, !727, !577, !577, !798, !799}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !734, file: !545, line: 106, baseType: !845, size: 64, offset: 3840)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !734, file: !545, line: 107, baseType: !1008, size: 64, offset: 3904)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!342, !727, !352}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !734, file: !545, line: 108, baseType: !1012, size: 64, offset: 3968)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!342, !727, !1015, !798, !799}
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !56, line: 25, baseType: !323)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !734, file: !545, line: 109, baseType: !977, size: 64, offset: 4032)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !734, file: !545, line: 111, baseType: !1018, size: 64, offset: 4096)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!342, !727, !727, !727, !439, !727}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !734, file: !545, line: 112, baseType: !1022, size: 64, offset: 4160)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!342, !727, !727, !727, !727}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !734, file: !545, line: 113, baseType: !1026, size: 64, offset: 4224)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!342, !727, !664, !664}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !734, file: !545, line: 114, baseType: !737, size: 64, offset: 4288)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !734, file: !545, line: 115, baseType: !849, size: 64, offset: 4352)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !734, file: !545, line: 117, baseType: !907, size: 64, offset: 4416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !734, file: !545, line: 118, baseType: !907, size: 64, offset: 4480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !734, file: !545, line: 119, baseType: !1012, size: 64, offset: 4544)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !734, file: !545, line: 120, baseType: !1035, size: 64, offset: 4608)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!342, !727, !1038, !607}
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !56, line: 1675, baseType: !133)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !734, file: !545, line: 121, baseType: !977, size: 64, offset: 4672)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !734, file: !545, line: 123, baseType: !1041, size: 64, offset: 4736)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!342, !727, !385, !322}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !734, file: !545, line: 124, baseType: !1045, size: 64, offset: 4800)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!342, !727, !938, !752, !322}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !734, file: !545, line: 125, baseType: !1049, size: 64, offset: 4864)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!342, !476, !727}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !734, file: !545, line: 126, baseType: !749, size: 64, offset: 4928)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !734, file: !545, line: 127, baseType: !749, size: 64, offset: 4992)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !734, file: !545, line: 129, baseType: !1055, size: 64, offset: 5056)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!342, !727, !576}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !734, file: !545, line: 130, baseType: !1059, size: 64, offset: 5120)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!342, !727, !1062, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !80, line: 654, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !80, line: 653, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1064, file: !80, line: 653, baseType: !385, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1064, file: !80, line: 653, baseType: !752, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !734, file: !545, line: 131, baseType: !1059, size: 64, offset: 5184)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !734, file: !545, line: 132, baseType: !1070, size: 64, offset: 5248)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!342, !727, !430, !430, !430}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !734, file: !545, line: 133, baseType: !1008, size: 64, offset: 5312)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !734, file: !545, line: 135, baseType: !1075, size: 64, offset: 5376)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!342, !727, !439, !607}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !734, file: !545, line: 136, baseType: !1075, size: 64, offset: 5440)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !734, file: !545, line: 137, baseType: !1080, size: 64, offset: 5504)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!342, !727, !607}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !734, file: !545, line: 138, baseType: !737, size: 64, offset: 5568)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !734, file: !545, line: 139, baseType: !1085, size: 64, offset: 5632)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!342, !727, !1088, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !734, file: !545, line: 141, baseType: !977, size: 64, offset: 5696)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !734, file: !545, line: 142, baseType: !1091, size: 64, offset: 5760)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!342, !727, !727, !439, !727}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !734, file: !545, line: 143, baseType: !1095, size: 64, offset: 5824)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!342, !727, !727, !727}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !734, file: !545, line: 144, baseType: !977, size: 64, offset: 5888)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !734, file: !545, line: 145, baseType: !1091, size: 64, offset: 5952)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !734, file: !545, line: 147, baseType: !1095, size: 64, offset: 6016)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !734, file: !545, line: 148, baseType: !977, size: 64, offset: 6080)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !734, file: !545, line: 149, baseType: !1091, size: 64, offset: 6144)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !734, file: !545, line: 150, baseType: !1095, size: 64, offset: 6208)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !734, file: !545, line: 151, baseType: !1105, size: 64, offset: 6272)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!342, !727, !500}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !734, file: !545, line: 153, baseType: !845, size: 64, offset: 6336)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !734, file: !545, line: 154, baseType: !845, size: 64, offset: 6400)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !734, file: !545, line: 155, baseType: !845, size: 64, offset: 6464)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !734, file: !545, line: 156, baseType: !845, size: 64, offset: 6528)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !734, file: !545, line: 157, baseType: !1008, size: 64, offset: 6592)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !734, file: !545, line: 159, baseType: !1114, size: 64, offset: 6656)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!342, !727, !385, !740}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !734, file: !545, line: 160, baseType: !845, size: 64, offset: 6720)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !734, file: !545, line: 161, baseType: !845, size: 64, offset: 6784)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !734, file: !545, line: 162, baseType: !845, size: 64, offset: 6848)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !734, file: !545, line: 163, baseType: !845, size: 64, offset: 6912)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !734, file: !545, line: 165, baseType: !1095, size: 64, offset: 6976)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !734, file: !545, line: 166, baseType: !1095, size: 64, offset: 7040)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !734, file: !545, line: 167, baseType: !907, size: 64, offset: 7104)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !734, file: !545, line: 168, baseType: !1125, size: 64, offset: 7168)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!342, !727, !752, !385}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !734, file: !545, line: 169, baseType: !1129, size: 64, offset: 7232)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!342, !727, !607, !430}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !734, file: !545, line: 171, baseType: !869, size: 64, offset: 7296)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !734, file: !545, line: 172, baseType: !845, size: 64, offset: 7360)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !734, file: !545, line: 173, baseType: !1135, size: 64, offset: 7424)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!342, !727, !430, !590}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !734, file: !545, line: 174, baseType: !998, size: 64, offset: 7488)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !734, file: !545, line: 175, baseType: !998, size: 64, offset: 7552)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !734, file: !545, line: 177, baseType: !749, size: 64, offset: 7616)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !734, file: !545, line: 178, baseType: !795, size: 64, offset: 7680)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !734, file: !545, line: 179, baseType: !749, size: 64, offset: 7744)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !734, file: !545, line: 180, baseType: !756, size: 64, offset: 7808)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !734, file: !545, line: 181, baseType: !1145, size: 64, offset: 7872)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!342, !727, !344, !798, !799}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !734, file: !545, line: 183, baseType: !1055, size: 64, offset: 7936)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !734, file: !545, line: 184, baseType: !829, size: 64, offset: 8000)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !734, file: !545, line: 185, baseType: !1151, size: 64, offset: 8064)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!342, !727, !1154}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !734, file: !545, line: 186, baseType: !1156, size: 64, offset: 8128)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!342, !727, !385, !591, !447}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !734, file: !545, line: 187, baseType: !888, size: 64, offset: 8192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !734, file: !545, line: 189, baseType: !1161, size: 64, offset: 8256)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!342, !727, !385, !385, !430, !740}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !734, file: !545, line: 190, baseType: !977, size: 64, offset: 8320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !734, file: !545, line: 191, baseType: !1091, size: 64, offset: 8384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !734, file: !545, line: 192, baseType: !1095, size: 64, offset: 8448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !734, file: !545, line: 193, baseType: !1168, size: 64, offset: 8512)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!342, !727, !568, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !56, line: 1401, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !545, line: 660, size: 5312, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1173, file: !545, line: 661, baseType: !548, size: 4480)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1173, file: !545, line: 661, baseType: !944, size: 32, offset: 4480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1173, file: !545, line: 662, baseType: !385, size: 32, offset: 4512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1173, file: !545, line: 662, baseType: !385, size: 32, offset: 4544)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1173, file: !545, line: 662, baseType: !385, size: 32, offset: 4576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1173, file: !545, line: 663, baseType: !385, size: 32, offset: 4608)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1173, file: !545, line: 664, baseType: !385, size: 32, offset: 4640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1173, file: !545, line: 665, baseType: !430, size: 64, offset: 4672)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1173, file: !545, line: 666, baseType: !430, size: 64, offset: 4736)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1173, file: !545, line: 667, baseType: !385, size: 32, offset: 4800)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1173, file: !545, line: 668, baseType: !720, size: 32, offset: 4832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1173, file: !545, line: 670, baseType: !430, size: 64, offset: 4864)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1173, file: !545, line: 670, baseType: !430, size: 64, offset: 4928)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1173, file: !545, line: 671, baseType: !430, size: 64, offset: 4992)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1173, file: !545, line: 672, baseType: !430, size: 64, offset: 5056)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1173, file: !545, line: 673, baseType: !430, size: 64, offset: 5120)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1173, file: !545, line: 674, baseType: !385, size: 32, offset: 5184)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1173, file: !545, line: 675, baseType: !430, size: 64, offset: 5248)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !734, file: !545, line: 195, baseType: !1194, size: 64, offset: 8576)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!342, !1171, !727, !727}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !734, file: !545, line: 196, baseType: !1194, size: 64, offset: 8640)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !734, file: !545, line: 197, baseType: !977, size: 64, offset: 8704)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !734, file: !545, line: 198, baseType: !1091, size: 64, offset: 8768)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !734, file: !545, line: 199, baseType: !1095, size: 64, offset: 8832)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !734, file: !545, line: 201, baseType: !1202, size: 64, offset: 8896)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!342, !727, !385, !385}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !734, file: !545, line: 202, baseType: !883, size: 64, offset: 8960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !734, file: !545, line: 203, baseType: !756, size: 64, offset: 9024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !734, file: !545, line: 204, baseType: !935, size: 64, offset: 9088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !734, file: !545, line: 205, baseType: !1055, size: 64, offset: 9152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !734, file: !545, line: 206, baseType: !1210, size: 64, offset: 9216)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!342, !344, !727, !385, !798, !799}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !734, file: !545, line: 208, baseType: !1214, size: 64, offset: 9280)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!342, !385, !893}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !734, file: !545, line: 209, baseType: !1095, size: 64, offset: 9344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !734, file: !545, line: 210, baseType: !899, size: 64, offset: 9408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !729, file: !545, line: 438, baseType: !649, size: 64, offset: 13952)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !729, file: !545, line: 438, baseType: !649, size: 64, offset: 14016)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !729, file: !545, line: 439, baseType: !322, size: 64, offset: 14080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !729, file: !545, line: 440, baseType: !1223, size: 32, offset: 14144)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !56, line: 161, baseType: !278)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !729, file: !545, line: 441, baseType: !500, size: 32, offset: 14176)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !729, file: !545, line: 442, baseType: !500, size: 32, offset: 14208)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !729, file: !545, line: 443, baseType: !1227, size: 448, offset: 14272)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 448, elements: !1229)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !56, line: 1159, baseType: !323)
!1229 = !{!1230}
!1230 = !DISubrange(count: 7)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !729, file: !545, line: 444, baseType: !500, size: 32, offset: 14720)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !729, file: !545, line: 445, baseType: !500, size: 32, offset: 14752)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !729, file: !545, line: 446, baseType: !385, size: 32, offset: 14784)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !729, file: !545, line: 447, baseType: !423, size: 64, offset: 14848)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !729, file: !545, line: 448, baseType: !423, size: 64, offset: 14912)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !729, file: !545, line: 449, baseType: !806, size: 640, offset: 14976)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !729, file: !545, line: 450, baseType: !742, size: 32, offset: 15616)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !729, file: !545, line: 451, baseType: !1239, size: 2880, offset: 15680)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !545, line: 318, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !545, line: 319, size: 2880, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247, !1248, !1261, !1262, !1267, !1272, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1287, !1288, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1320, !1321, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1350, !1351}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1240, file: !545, line: 320, baseType: !385, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1240, file: !545, line: 321, baseType: !385, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1240, file: !545, line: 322, baseType: !385, size: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1240, file: !545, line: 323, baseType: !385, size: 32, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1240, file: !545, line: 324, baseType: !385, size: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1240, file: !545, line: 325, baseType: !385, size: 32, offset: 160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1240, file: !545, line: 326, baseType: !1249, size: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !545, line: 293, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !545, line: 295, size: 448, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
