; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/symmlq/symmlq.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/symmlq/symmlq.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128}
!122 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!123 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!124 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!125 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!126 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!127 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!128 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 155, baseType: !5, size: 32, elements: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!131 = !{!132, !133, !134, !135, !136}
!132 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!137 = !{!138, !142, !143, !146, !154, !209, !352, !355, !235, !26, !358, !153, !318}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !139, line: 330, baseType: !140)
!139 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !139, line: 330, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_SYMMLQ", file: !148, line: 6, baseType: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/symmlq/symmlq.c", directory: "/home/users/ndemeye/xSDK")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 4, size: 64, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !149, file: !148, line: 5, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !153)
!153 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !157, line: 73, size: 4480, elements: !158)
!157 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!158 = !{!159, !161, !207, !208, !210, !212, !213, !214, !215, !223, !224, !226, !230, !234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !251, !252, !254, !256, !257, !258, !259, !260, !262, !264, !265, !266, !267, !268, !271, !273, !274, !275, !285, !287, !288, !292, !293, !342, !347, !349, !350, !351}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !156, file: !157, line: 74, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !156, file: !157, line: 75, baseType: !162, size: 448, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 448, elements: !205)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !157, line: 53, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 45, size: 448, elements: !165)
!165 = !{!166, !172, !180, !185, !189, !193, !200}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !164, file: !157, line: 46, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !154, !171}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !164, file: !157, line: 47, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!170, !154, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !177, line: 16, baseType: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !177, line: 16, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !164, file: !157, line: 48, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!170, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !164, file: !157, line: 49, baseType: !186, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!170, !154, !143, !154}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !164, file: !157, line: 50, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!170, !154, !143, !184}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !164, file: !157, line: 51, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!170, !154, !143, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !164, file: !157, line: 52, baseType: !201, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!170, !154, !143, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !156, file: !157, line: 76, baseType: !138, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !157, line: 77, baseType: !209, size: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !156, file: !157, line: 78, baseType: !211, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !153)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !156, file: !157, line: 78, baseType: !211, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !156, file: !157, line: 78, baseType: !211, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !156, file: !157, line: 78, baseType: !211, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !157, line: 79, baseType: !216, size: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !219, line: 27, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !221, line: 43, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !156, file: !157, line: 80, baseType: !209, size: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !157, line: 81, baseType: !225, size: 32, offset: 992)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !156, file: !157, line: 82, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !156, file: !157, line: 83, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !156, file: !157, line: 84, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !156, file: !157, line: 85, baseType: !235, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !156, file: !157, line: 86, baseType: !235, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !156, file: !157, line: 87, baseType: !235, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !157, line: 88, baseType: !154, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !156, file: !157, line: 89, baseType: !216, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 90, baseType: !235, size: 64, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !156, file: !157, line: 91, baseType: !235, size: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !156, file: !157, line: 92, baseType: !209, size: 32, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !156, file: !157, line: 93, baseType: !142, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !157, line: 94, baseType: !246, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !217)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !156, file: !157, line: 95, baseType: !209, size: 32, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !156, file: !157, line: 95, baseType: !209, size: 32, offset: 1888)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !156, file: !157, line: 96, baseType: !250, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !156, file: !157, line: 96, baseType: !250, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !156, file: !157, line: 97, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !156, file: !157, line: 97, baseType: !255, size: 64, offset: 2112)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !156, file: !157, line: 98, baseType: !209, size: 32, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !156, file: !157, line: 98, baseType: !209, size: 32, offset: 2208)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !156, file: !157, line: 99, baseType: !250, size: 64, offset: 2240)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !156, file: !157, line: 99, baseType: !250, size: 64, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !156, file: !157, line: 100, baseType: !261, size: 64, offset: 2368)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !156, file: !157, line: 100, baseType: !263, size: 64, offset: 2432)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !156, file: !157, line: 101, baseType: !209, size: 32, offset: 2496)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !156, file: !157, line: 101, baseType: !209, size: 32, offset: 2528)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !156, file: !157, line: 102, baseType: !250, size: 64, offset: 2560)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !156, file: !157, line: 102, baseType: !250, size: 64, offset: 2624)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !156, file: !157, line: 103, baseType: !269, size: 64, offset: 2688)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !156, file: !157, line: 103, baseType: !272, size: 64, offset: 2752)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !156, file: !157, line: 104, baseType: !204, size: 64, offset: 2816)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !156, file: !157, line: 105, baseType: !209, size: 32, offset: 2880)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !156, file: !157, line: 106, baseType: !276, size: 128, offset: 2944)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !283)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !157, line: 64, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 61, size: 128, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !279, file: !157, line: 62, baseType: !197, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !279, file: !157, line: 63, baseType: !142, size: 64, offset: 64)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !156, file: !157, line: 107, baseType: !286, size: 64, offset: 3072)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 64, elements: !283)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !156, file: !157, line: 108, baseType: !142, size: 64, offset: 3136)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !156, file: !157, line: 109, baseType: !289, size: 64, offset: 3200)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!170, !142}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !156, file: !157, line: 111, baseType: !209, size: 32, offset: 3264)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !156, file: !157, line: 112, baseType: !294, size: 320, offset: 3328)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !340)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!170, !298, !154, !142}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !301)
!301 = !{!302, !303, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !300, file: !10, line: 100, baseType: !209, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !10, line: 101, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !315, !316, !317, !321, !323, !325, !326, !327}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !306, file: !10, line: 84, baseType: !235, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !306, file: !10, line: 85, baseType: !235, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !10, line: 86, baseType: !142, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !306, file: !10, line: 87, baseType: !227, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !306, file: !10, line: 88, baseType: !313, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !306, file: !10, line: 89, baseType: !145, size: 8, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !306, file: !10, line: 90, baseType: !235, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !306, file: !10, line: 91, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !319, line: 46, baseType: !320)
!319 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!320 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !10, line: 92, baseType: !322, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !10, line: 93, baseType: !324, size: 32, offset: 544)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !10, line: 94, baseType: !304, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !306, file: !10, line: 95, baseType: !235, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !306, file: !10, line: 96, baseType: !142, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !300, file: !10, line: 102, baseType: !235, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !300, file: !10, line: 102, baseType: !235, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !300, file: !10, line: 103, baseType: !235, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !300, file: !10, line: 104, baseType: !138, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !10, line: 106, baseType: !154, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !300, file: !10, line: 107, baseType: !337, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!340 = !{!341}
!341 = !DISubrange(count: 5)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !156, file: !157, line: 113, baseType: !343, size: 320, offset: 3648)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 320, elements: !340)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!170, !154, !142}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !156, file: !157, line: 114, baseType: !348, size: 320, offset: 3968)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 320, elements: !340)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !156, file: !157, line: 115, baseType: !322, size: 32, offset: 4288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !156, file: !157, line: 120, baseType: !337, size: 64, offset: 4352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !156, file: !157, line: 121, baseType: !322, size: 32, offset: 4416)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !139, line: 331, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !139, line: 331, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !139, line: 338, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !139, line: 338, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !120)
!359 = !{i32 7, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{i32 7, !"PIC Level", i32 2}
!363 = !{i32 7, !"uwtable", i32 1}
!364 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!365 = distinct !DISubprogram(name: "KSPSetUp_SYMMLQ", scope: !148, file: !148, line: 8, type: !366, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !610)
!366 = !DISubroutineType(types: !367)
!367 = !{!170, !368}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !371)
!371 = !{!372, !374, !425, !430, !431, !432, !433, !463, !464, !465, !466, !467, !469, !474, !475, !476, !477, !478, !479, !480, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !503, !509, !510, !511, !512, !517, !518, !519, !520, !525, !526, !527, !528, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !580, !581, !582, !583, !584, !591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !608, !609}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !102, line: 76, baseType: !373, size: 4480)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !157, line: 122, baseType: !156)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !102, line: 76, baseType: !375, size: 896, offset: 4480)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 896, elements: !205)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !377)
!377 = !{!378, !386, !390, !392, !400, !401, !405, !406, !410, !414, !418, !419, !423, !424}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !376, file: !102, line: 19, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!170, !368, !382, !385}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !130, line: 21, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !130, line: 21, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !376, file: !102, line: 22, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!170, !368, !382, !382, !385}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !376, file: !102, line: 25, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !376, file: !102, line: 26, baseType: !393, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!170, !368, !396, !396}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !397, line: 16, baseType: !398)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !397, line: 16, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !376, file: !102, line: 27, baseType: !391, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !376, file: !102, line: 28, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!170, !298, !368}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !376, file: !102, line: 29, baseType: !391, size: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !376, file: !102, line: 30, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!170, !368, !261, !261}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !376, file: !102, line: 31, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!170, !368, !209, !261, !261, !253}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !376, file: !102, line: 32, baseType: !415, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!170, !368, !322, !322, !253, !385, !261, !261}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !376, file: !102, line: 33, baseType: !391, size: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !376, file: !102, line: 34, baseType: !420, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!170, !368, !176}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !376, file: !102, line: 35, baseType: !391, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !376, file: !102, line: 36, baseType: !420, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !370, file: !102, line: 77, baseType: !426, size: 64, offset: 5376)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !427, line: 14, baseType: !428)
!427 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !427, line: 14, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !370, file: !102, line: 78, baseType: !322, size: 32, offset: 5440)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !370, file: !102, line: 79, baseType: !322, size: 32, offset: 5472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !370, file: !102, line: 81, baseType: !209, size: 32, offset: 5504)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !370, file: !102, line: 82, baseType: !434, size: 64, offset: 5568)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !437)
!437 = !{!438, !439, !459, !460, !461, !462}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !436, file: !102, line: 55, baseType: !373, size: 4480)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !436, file: !102, line: 55, baseType: !440, size: 448, offset: 4480)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 448, elements: !205)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !442)
!442 = !{!443, !447, !448, !452, !453, !454, !458}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !441, file: !102, line: 42, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!170, !434, !382, !382}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !441, file: !102, line: 43, baseType: !444, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !441, file: !102, line: 44, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!170, !434}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !441, file: !102, line: 45, baseType: !449, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !441, file: !102, line: 46, baseType: !449, size: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !441, file: !102, line: 47, baseType: !455, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!170, !434, !176}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !441, file: !102, line: 48, baseType: !449, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !436, file: !102, line: 56, baseType: !368, size: 64, offset: 4928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !436, file: !102, line: 57, baseType: !396, size: 64, offset: 4992)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !436, file: !102, line: 58, baseType: !246, size: 64, offset: 5056)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !102, line: 59, baseType: !142, size: 64, offset: 5120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !370, file: !102, line: 83, baseType: !322, size: 32, offset: 5632)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !370, file: !102, line: 84, baseType: !322, size: 32, offset: 5664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !370, file: !102, line: 85, baseType: !322, size: 32, offset: 5696)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !370, file: !102, line: 86, baseType: !322, size: 32, offset: 5728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !370, file: !102, line: 87, baseType: !468, size: 32, offset: 5760)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !370, file: !102, line: 88, baseType: !470, size: 384, offset: 5792)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 384, elements: !471)
!471 = !{!472, !473}
!472 = !DISubrange(count: 4)
!473 = !DISubrange(count: 3)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !370, file: !102, line: 89, baseType: !152, size: 64, offset: 6208)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !370, file: !102, line: 90, baseType: !152, size: 64, offset: 6272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !370, file: !102, line: 91, baseType: !152, size: 64, offset: 6336)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !370, file: !102, line: 92, baseType: !152, size: 64, offset: 6400)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !370, file: !102, line: 93, baseType: !152, size: 64, offset: 6464)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !370, file: !102, line: 94, baseType: !152, size: 64, offset: 6528)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !370, file: !102, line: 95, baseType: !481, size: 32, offset: 6592)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !370, file: !102, line: 96, baseType: !322, size: 32, offset: 6624)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !370, file: !102, line: 98, baseType: !382, size: 64, offset: 6656)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !370, file: !102, line: 98, baseType: !382, size: 64, offset: 6720)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !370, file: !102, line: 102, baseType: !261, size: 64, offset: 6784)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !370, file: !102, line: 103, baseType: !261, size: 64, offset: 6848)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !370, file: !102, line: 104, baseType: !209, size: 32, offset: 6912)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !370, file: !102, line: 105, baseType: !209, size: 32, offset: 6944)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !370, file: !102, line: 106, baseType: !322, size: 32, offset: 6976)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !370, file: !102, line: 107, baseType: !261, size: 64, offset: 7040)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !370, file: !102, line: 108, baseType: !261, size: 64, offset: 7104)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !370, file: !102, line: 109, baseType: !209, size: 32, offset: 7168)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !370, file: !102, line: 110, baseType: !209, size: 32, offset: 7200)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !370, file: !102, line: 111, baseType: !322, size: 32, offset: 7232)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !370, file: !102, line: 113, baseType: !209, size: 32, offset: 7264)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !370, file: !102, line: 114, baseType: !322, size: 32, offset: 7296)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !370, file: !102, line: 117, baseType: !209, size: 32, offset: 7328)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !370, file: !102, line: 120, baseType: !499, size: 320, offset: 7360)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !340)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!170, !368, !209, !152, !142}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !370, file: !102, line: 121, baseType: !504, size: 320, offset: 7680)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 320, elements: !340)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!170, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !370, file: !102, line: 122, baseType: !348, size: 320, offset: 8000)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !370, file: !102, line: 123, baseType: !209, size: 32, offset: 8320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !370, file: !102, line: 124, baseType: !322, size: 32, offset: 8352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !370, file: !102, line: 126, baseType: !513, size: 320, offset: 8384)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !340)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!170, !368, !142}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !370, file: !102, line: 127, baseType: !504, size: 320, offset: 8704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !370, file: !102, line: 128, baseType: !348, size: 320, offset: 9024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !370, file: !102, line: 129, baseType: !209, size: 32, offset: 9344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !370, file: !102, line: 131, baseType: !521, size: 64, offset: 9408)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!170, !368, !209, !152, !524, !142}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !370, file: !102, line: 132, baseType: !289, size: 64, offset: 9472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !370, file: !102, line: 133, baseType: !142, size: 64, offset: 9536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !370, file: !102, line: 135, baseType: !142, size: 64, offset: 9600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !370, file: !102, line: 137, baseType: !529, size: 64, offset: 9664)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !102, line: 139, baseType: !142, size: 64, offset: 9728)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9792)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9824)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9856)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9888)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9952)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 9984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10016)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10080)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10112)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10176)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !370, file: !102, line: 142, baseType: !322, size: 32, offset: 10208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10240)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10304)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10368)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10432)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10496)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10560)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10624)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10688)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10752)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10816)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10880)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 10944)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 11008)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !370, file: !102, line: 143, baseType: !176, size: 64, offset: 11072)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11136)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11168)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11232)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11264)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11296)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11328)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11360)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11392)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11424)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11456)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11488)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11520)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !370, file: !102, line: 144, baseType: !562, size: 32, offset: 11552)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !370, file: !102, line: 147, baseType: !209, size: 32, offset: 11584)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !370, file: !102, line: 148, baseType: !385, size: 64, offset: 11648)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !370, file: !102, line: 150, baseType: !579, size: 32, offset: 11712)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !370, file: !102, line: 151, baseType: !322, size: 32, offset: 11744)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !370, file: !102, line: 153, baseType: !209, size: 32, offset: 11776)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !370, file: !102, line: 154, baseType: !209, size: 32, offset: 11808)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !370, file: !102, line: 156, baseType: !322, size: 32, offset: 11840)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !370, file: !102, line: 161, baseType: !585, size: 192, offset: 11904)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !102, line: 157, size: 192, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !585, file: !102, line: 158, baseType: !396, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !585, file: !102, line: 158, baseType: !396, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !585, file: !102, line: 159, baseType: !322, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !585, file: !102, line: 160, baseType: !322, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !370, file: !102, line: 163, baseType: !592, size: 32, offset: 12096)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !370, file: !102, line: 165, baseType: !468, size: 32, offset: 12128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !370, file: !102, line: 166, baseType: !592, size: 32, offset: 12160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !370, file: !102, line: 171, baseType: !322, size: 32, offset: 12192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !370, file: !102, line: 172, baseType: !322, size: 32, offset: 12224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !370, file: !102, line: 173, baseType: !322, size: 32, offset: 12256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !370, file: !102, line: 174, baseType: !382, size: 64, offset: 12288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !370, file: !102, line: 175, baseType: !382, size: 64, offset: 12352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !370, file: !102, line: 177, baseType: !209, size: 32, offset: 12416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !370, file: !102, line: 178, baseType: !322, size: 32, offset: 12448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !370, file: !102, line: 180, baseType: !176, size: 64, offset: 12480)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !370, file: !102, line: 182, baseType: !604, size: 64, offset: 12544)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!170, !368, !382, !382, !142}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !370, file: !102, line: 183, baseType: !604, size: 64, offset: 12608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !370, file: !102, line: 184, baseType: !142, size: 64, offset: 12672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !370, file: !102, line: 184, baseType: !142, size: 64, offset: 12736)
!610 = !{!611, !612, !613}
!611 = !DILocalVariable(name: "ksp", arg: 1, scope: !365, file: !148, line: 8, type: !368)
!612 = !DILocalVariable(name: "ierr", scope: !365, file: !148, line: 10, type: !170)
!613 = !DILocalVariable(name: "ierr__", scope: !614, file: !148, line: 13, type: !170)
!614 = distinct !DILexicalBlock(scope: !365, file: !148, line: 13, column: 32)
!615 = !DILocation(line: 0, scope: !365)
!616 = !DILocation(line: 12, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !148, line: 12, column: 3)
!618 = distinct !DILexicalBlock(scope: !619, file: !148, line: 12, column: 3)
!619 = distinct !DILexicalBlock(scope: !365, file: !148, line: 12, column: 3)
!620 = !{!621, !621, i64 0}
!621 = !{!"any pointer", !622, i64 0}
!622 = !{!"omnipotent char", !623, i64 0}
!623 = !{!"Simple C/C++ TBAA"}
!624 = !DILocation(line: 12, column: 3, scope: !618)
!625 = !DILocation(line: 12, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !148, line: 12, column: 3)
!627 = distinct !DILexicalBlock(scope: !617, file: !148, line: 12, column: 3)
!628 = !{!629, !630, i64 1536}
!629 = !{!"", !622, i64 0, !622, i64 512, !622, i64 1024, !622, i64 1280, !630, i64 1536, !630, i64 1540, !622, i64 1544}
!630 = !{!"int", !622, i64 0}
!631 = !DILocation(line: 12, column: 3, scope: !627)
!632 = !DILocation(line: 12, column: 3, scope: !633)
!633 = distinct !DILexicalBlock(scope: !626, file: !148, line: 12, column: 3)
!634 = !{!630, !630, i64 0}
!635 = !{!629, !630, i64 1540}
!636 = !DILocation(line: 13, column: 10, scope: !365)
!637 = !DILocation(line: 0, scope: !614)
!638 = !DILocation(line: 13, column: 32, scope: !639)
!639 = distinct !DILexicalBlock(scope: !614, file: !148, line: 13, column: 32)
!640 = !DILocation(line: 13, column: 32, scope: !614)
!641 = !{!"branch_weights", i32 2000, i32 1}
!642 = !DILocation(line: 14, column: 3, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !148, line: 14, column: 3)
!644 = distinct !DILexicalBlock(scope: !645, file: !148, line: 14, column: 3)
!645 = distinct !DILexicalBlock(scope: !365, file: !148, line: 14, column: 3)
!646 = !DILocation(line: 14, column: 3, scope: !644)
!647 = !DILocation(line: 14, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !148, line: 14, column: 3)
!649 = distinct !DILexicalBlock(scope: !643, file: !148, line: 14, column: 3)
!650 = !DILocation(line: 14, column: 3, scope: !649)
!651 = !DILocation(line: 14, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !148, line: 14, column: 3)
!653 = distinct !DILexicalBlock(scope: !648, file: !148, line: 14, column: 3)
!654 = !{!629, !622, i64 1544}
!655 = !DILocation(line: 14, column: 3, scope: !653)
!656 = !DILocation(line: 14, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !652, file: !148, line: 14, column: 3)
!658 = !DILocation(line: 14, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !648, file: !148, line: 14, column: 3)
!660 = !DILocation(line: 14, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !659, file: !148, line: 14, column: 3)
!662 = !DILocation(line: 14, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !148, line: 14, column: 3)
!664 = distinct !DILexicalBlock(scope: !661, file: !148, line: 14, column: 3)
!665 = !DILocation(line: 14, column: 3, scope: !664)
!666 = !DILocation(line: 14, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !148, line: 14, column: 3)
!668 = !DILocation(line: 15, column: 1, scope: !365)
!669 = !DISubprogram(name: "KSPSetWorkVecs", scope: !33, file: !33, line: 155, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!26, !369, !26}
!672 = !{}
