; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/fe/interface/fegeom.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/fe/interface/fegeom.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscQuadrature = type opaque
%struct._n_PetscFEGeom = type { double*, double*, double*, double*, double*, double*, [2 x i32]*, [2 x double*], [2 x double*], [2 x double*], i32, i32, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscFEGeomCreate = private unnamed_addr constant [18 x i8] c"PetscFEGeomCreate\00", align 1
@.str = private unnamed_addr constant [85 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/fe/interface/fegeom.c\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@.str.1 = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"Invalid stack size %d, pop %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [42 x i8] c"Invalid stack: push from %s, pop from %s\0A\00", align 1

!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/fe/interface/fegeom.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 663, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!17 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!35 = !{!36, !40, !41, !44}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !37, line: 330, baseType: !38)
!37 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !37, line: 330, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!43 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !{i32 7, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = !{i32 7, !"PIC Level", i32 2}
!51 = !{i32 7, !"uwtable", i32 1}
!52 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!53 = distinct !DISubprogram(name: "PetscFEGeomCreate", scope: !54, file: !54, line: 19, type: !55, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !97)
!54 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/fe/interface/fegeom.c", directory: "/home/users/ndemeye/xSDK")
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !59, !63, !63, !64, !65}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !58)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscQuadrature", file: !60, line: 18, baseType: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscQuadrature", file: !60, line: 18, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !58)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFEGeom", file: !68, line: 28, baseType: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfe.h", directory: "/home/users/ndemeye/xSDK")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFEGeom", file: !68, line: 11, size: 1024, elements: !70)
!70 = !{!71, !76, !78, !79, !80, !81, !82, !87, !89, !90, !91, !92, !93, !94, !95, !96}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !69, file: !68, line: 12, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !75)
!75 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !69, file: !68, line: 13, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "J", scope: !69, file: !68, line: 14, baseType: !77, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "invJ", scope: !69, file: !68, line: 15, baseType: !77, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "detJ", scope: !69, file: !68, line: 16, baseType: !77, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !69, file: !68, line: 17, baseType: !77, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !69, file: !68, line: 18, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "suppJ", scope: !69, file: !68, line: 19, baseType: !88, size: 128, offset: 448)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !85)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "suppInvJ", scope: !69, file: !68, line: 20, baseType: !88, size: 128, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "suppDetJ", scope: !69, file: !68, line: 21, baseType: !88, size: 128, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !69, file: !68, line: 22, baseType: !63, size: 32, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !69, file: !68, line: 23, baseType: !63, size: 32, offset: 864)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "numCells", scope: !69, file: !68, line: 24, baseType: !63, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !69, file: !68, line: 25, baseType: !63, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "isAffine", scope: !69, file: !68, line: 26, baseType: !64, size: 32, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !69, file: !68, line: 27, baseType: !64, size: 32, offset: 992)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !111, !113, !115, !119, !121}
!98 = !DILocalVariable(name: "quad", arg: 1, scope: !53, file: !54, line: 19, type: !59)
!99 = !DILocalVariable(name: "numCells", arg: 2, scope: !53, file: !54, line: 19, type: !63)
!100 = !DILocalVariable(name: "dimEmbed", arg: 3, scope: !53, file: !54, line: 19, type: !63)
!101 = !DILocalVariable(name: "faceData", arg: 4, scope: !53, file: !54, line: 19, type: !64)
!102 = !DILocalVariable(name: "geom", arg: 5, scope: !53, file: !54, line: 19, type: !65)
!103 = !DILocalVariable(name: "g", scope: !53, file: !54, line: 21, type: !66)
!104 = !DILocalVariable(name: "dim", scope: !53, file: !54, line: 22, type: !63)
!105 = !DILocalVariable(name: "Nq", scope: !53, file: !54, line: 22, type: !63)
!106 = !DILocalVariable(name: "N", scope: !53, file: !54, line: 22, type: !63)
!107 = !DILocalVariable(name: "p", scope: !53, file: !54, line: 23, type: !72)
!108 = !DILocalVariable(name: "ierr", scope: !53, file: !54, line: 24, type: !57)
!109 = !DILocalVariable(name: "ierr__", scope: !110, file: !54, line: 27, type: !57)
!110 = distinct !DILexicalBlock(scope: !53, file: !54, line: 27, column: 61)
!111 = !DILocalVariable(name: "ierr__", scope: !112, file: !54, line: 28, type: !57)
!112 = distinct !DILexicalBlock(scope: !53, file: !54, line: 28, column: 23)
!113 = !DILocalVariable(name: "ierr__", scope: !114, file: !54, line: 36, type: !57)
!114 = distinct !DILexicalBlock(scope: !53, file: !54, line: 36, column: 89)
!115 = !DILocalVariable(name: "ierr__", scope: !116, file: !54, line: 38, type: !57)
!116 = distinct !DILexicalBlock(scope: !117, file: !54, line: 38, column: 66)
!117 = distinct !DILexicalBlock(scope: !118, file: !54, line: 37, column: 17)
!118 = distinct !DILexicalBlock(scope: !53, file: !54, line: 37, column: 7)
!119 = !DILocalVariable(name: "ierr__", scope: !120, file: !54, line: 41, type: !57)
!120 = distinct !DILexicalBlock(scope: !117, file: !54, line: 41, column: 113)
!121 = !DILocalVariable(name: "ierr__", scope: !122, file: !54, line: 43, type: !57)
!122 = distinct !DILexicalBlock(scope: !53, file: !54, line: 43, column: 58)
!123 = !DILocation(line: 0, scope: !53)
!124 = !DILocation(line: 21, column: 3, scope: !53)
!125 = !DILocation(line: 22, column: 3, scope: !53)
!126 = !DILocation(line: 23, column: 3, scope: !53)
!127 = !DILocation(line: 26, column: 3, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !54, line: 26, column: 3)
!129 = distinct !DILexicalBlock(scope: !130, file: !54, line: 26, column: 3)
!130 = distinct !DILexicalBlock(scope: !53, file: !54, line: 26, column: 3)
!131 = !{!132, !132, i64 0}
!132 = !{!"any pointer", !133, i64 0}
!133 = !{!"omnipotent char", !134, i64 0}
!134 = !{!"Simple C/C++ TBAA"}
!135 = !DILocation(line: 26, column: 3, scope: !129)
!136 = !DILocation(line: 26, column: 3, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !54, line: 26, column: 3)
!138 = distinct !DILexicalBlock(scope: !128, file: !54, line: 26, column: 3)
!139 = !{!140, !141, i64 1536}
!140 = !{!"", !133, i64 0, !133, i64 512, !133, i64 1024, !133, i64 1280, !141, i64 1536, !141, i64 1540, !133, i64 1544}
!141 = !{!"int", !133, i64 0}
!142 = !DILocation(line: 26, column: 3, scope: !138)
!143 = !DILocation(line: 26, column: 3, scope: !144)
!144 = distinct !DILexicalBlock(scope: !137, file: !54, line: 26, column: 3)
!145 = !{!141, !141, i64 0}
!146 = !{!140, !141, i64 1540}
!147 = !DILocation(line: 27, column: 10, scope: !53)
!148 = !DILocation(line: 0, scope: !110)
!149 = !DILocation(line: 27, column: 61, scope: !150)
!150 = distinct !DILexicalBlock(scope: !110, file: !54, line: 27, column: 61)
!151 = !DILocation(line: 27, column: 61, scope: !110)
!152 = !{!"branch_weights", i32 2000, i32 1}
!153 = !DILocation(line: 28, column: 10, scope: !53)
