; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/fgmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/fgmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 155, baseType: !5, size: 32, elements: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!127 = !{!128, !129, !130, !131, !132}
!128 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141}
!135 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!136 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!137 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!138 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!139 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!140 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!141 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!144 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!162 = !{!163, !214, !293, !364, !211, !235, !184, !662, !665, !283, !26, !668, !172, !669}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_FGMRES", file: !165, line: 22, baseType: !166)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/fgmres/fgmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 7, size: 1920, elements: !167)
!167 = !{!168, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !185, !186, !636, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !660, !661}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !166, file: !165, line: 8, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !172)
!172 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !166, file: !165, line: 8, baseType: !180, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !166, file: !165, line: 8, baseType: !171, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !166, file: !165, line: 8, baseType: !187, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !191, !184}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !194)
!194 = !{!195, !398, !451, !456, !457, !458, !459, !489, !490, !491, !492, !493, !495, !500, !501, !502, !503, !504, !505, !506, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !529, !535, !536, !537, !538, !543, !544, !545, !546, !551, !552, !553, !554, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !606, !607, !608, !609, !610, !617, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !633, !634, !635}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !193, file: !102, line: 76, baseType: !196, size: 4480)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !197, line: 122, baseType: !198)
!197 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !197, line: 73, size: 4480, elements: !199)
!199 = !{!200, !202, !256, !257, !258, !260, !261, !262, !263, !271, !272, !274, !278, !282, !284, !285, !286, !287, !288, !289, !290, !291, !292, !294, !296, !297, !298, !300, !301, !303, !305, !306, !307, !308, !309, !310, !312, !313, !314, !315, !316, !317, !319, !320, !321, !331, !333, !334, !338, !339, !388, !393, !395, !396, !397}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !198, file: !197, line: 74, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !198, file: !197, line: 75, baseType: !203, size: 448, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 448, elements: !254)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !197, line: 53, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 45, size: 448, elements: !206)
!206 = !{!207, !218, !226, !231, !238, !242, !249}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !205, file: !197, line: 46, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!190, !211, !213}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !215, line: 330, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !215, line: 330, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !205, file: !197, line: 47, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!190, !211, !222}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !223, line: 16, baseType: !224)
!223 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !223, line: 16, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !205, file: !197, line: 48, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!190, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !205, file: !197, line: 49, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!190, !211, !235, !211}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !205, file: !197, line: 50, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!190, !211, !235, !230}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !205, file: !197, line: 51, baseType: !243, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!190, !211, !235, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !205, file: !197, line: 52, baseType: !250, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!190, !211, !235, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!254 = !{!255}
!255 = !DISubrange(count: 1)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !198, file: !197, line: 76, baseType: !214, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !197, line: 77, baseType: !184, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !198, file: !197, line: 78, baseType: !259, size: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !172)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !198, file: !197, line: 78, baseType: !259, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !198, file: !197, line: 78, baseType: !259, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !198, file: !197, line: 78, baseType: !259, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !197, line: 79, baseType: !264, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !267, line: 27, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !269, line: 43, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!270 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !198, file: !197, line: 80, baseType: !184, size: 32, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !198, file: !197, line: 81, baseType: !273, size: 32, offset: 992)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !198, file: !197, line: 82, baseType: !275, size: 64, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !198, file: !197, line: 83, baseType: !279, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !198, file: !197, line: 84, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !198, file: !197, line: 85, baseType: !283, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !198, file: !197, line: 86, baseType: !283, size: 64, offset: 1280)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !198, file: !197, line: 87, baseType: !283, size: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !198, file: !197, line: 88, baseType: !211, size: 64, offset: 1408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !198, file: !197, line: 89, baseType: !264, size: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !197, line: 90, baseType: !283, size: 64, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !198, file: !197, line: 91, baseType: !283, size: 64, offset: 1600)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !198, file: !197, line: 92, baseType: !184, size: 32, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !198, file: !197, line: 93, baseType: !293, size: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !198, file: !197, line: 94, baseType: !295, size: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !265)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !198, file: !197, line: 95, baseType: !184, size: 32, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !198, file: !197, line: 95, baseType: !184, size: 32, offset: 1888)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !198, file: !197, line: 96, baseType: !299, size: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !198, file: !197, line: 96, baseType: !299, size: 64, offset: 1984)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !198, file: !197, line: 97, baseType: !302, size: 64, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !198, file: !197, line: 97, baseType: !304, size: 64, offset: 2112)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !198, file: !197, line: 98, baseType: !184, size: 32, offset: 2176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !198, file: !197, line: 98, baseType: !184, size: 32, offset: 2208)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !198, file: !197, line: 99, baseType: !299, size: 64, offset: 2240)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !198, file: !197, line: 99, baseType: !299, size: 64, offset: 2304)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !198, file: !197, line: 100, baseType: !180, size: 64, offset: 2368)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !198, file: !197, line: 100, baseType: !311, size: 64, offset: 2432)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !198, file: !197, line: 101, baseType: !184, size: 32, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !198, file: !197, line: 101, baseType: !184, size: 32, offset: 2528)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !198, file: !197, line: 102, baseType: !299, size: 64, offset: 2560)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !198, file: !197, line: 102, baseType: !299, size: 64, offset: 2624)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !198, file: !197, line: 103, baseType: !169, size: 64, offset: 2688)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !198, file: !197, line: 103, baseType: !318, size: 64, offset: 2752)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !198, file: !197, line: 104, baseType: !253, size: 64, offset: 2816)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !198, file: !197, line: 105, baseType: !184, size: 32, offset: 2880)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !198, file: !197, line: 106, baseType: !322, size: 128, offset: 2944)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, elements: !329)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !197, line: 64, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 61, size: 128, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !325, file: !197, line: 62, baseType: !246, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !325, file: !197, line: 63, baseType: !293, size: 64, offset: 64)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !198, file: !197, line: 107, baseType: !332, size: 64, offset: 3072)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !329)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !198, file: !197, line: 108, baseType: !293, size: 64, offset: 3136)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !198, file: !197, line: 109, baseType: !335, size: 64, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!190, !293}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !198, file: !197, line: 111, baseType: !184, size: 32, offset: 3264)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !198, file: !197, line: 112, baseType: !340, size: 320, offset: 3328)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !386)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!190, !344, !211, !293}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !347)
!347 = !{!348, !349, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !346, file: !10, line: 100, baseType: !184, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !10, line: 101, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !361, !362, !363, !367, !369, !371, !372, !373}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !352, file: !10, line: 84, baseType: !283, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !352, file: !10, line: 85, baseType: !283, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !10, line: 86, baseType: !293, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !352, file: !10, line: 87, baseType: !275, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !352, file: !10, line: 88, baseType: !359, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !352, file: !10, line: 89, baseType: !237, size: 8, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !352, file: !10, line: 90, baseType: !283, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !352, file: !10, line: 91, baseType: !364, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !365, line: 46, baseType: !366)
!365 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!366 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !352, file: !10, line: 92, baseType: !368, size: 32, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !10, line: 93, baseType: !370, size: 32, offset: 544)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !10, line: 94, baseType: !350, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !352, file: !10, line: 95, baseType: !283, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !352, file: !10, line: 96, baseType: !293, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !346, file: !10, line: 102, baseType: !283, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !346, file: !10, line: 102, baseType: !283, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !346, file: !10, line: 103, baseType: !283, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !346, file: !10, line: 104, baseType: !214, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !346, file: !10, line: 105, baseType: !368, size: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !346, file: !10, line: 105, baseType: !368, size: 32, offset: 416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !346, file: !10, line: 105, baseType: !368, size: 32, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !346, file: !10, line: 106, baseType: !211, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !346, file: !10, line: 107, baseType: !383, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!386 = !{!387}
!387 = !DISubrange(count: 5)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !198, file: !197, line: 113, baseType: !389, size: 320, offset: 3648)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 320, elements: !386)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!190, !211, !293}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !198, file: !197, line: 114, baseType: !394, size: 320, offset: 3968)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 320, elements: !386)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !198, file: !197, line: 115, baseType: !368, size: 32, offset: 4288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !198, file: !197, line: 120, baseType: !383, size: 64, offset: 4352)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !198, file: !197, line: 121, baseType: !368, size: 32, offset: 4416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !193, file: !102, line: 76, baseType: !399, size: 896, offset: 4480)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 896, elements: !254)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !401)
!401 = !{!402, !410, !414, !418, !426, !427, !431, !432, !436, !440, !444, !445, !449, !450}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !400, file: !102, line: 19, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!190, !191, !406, !409}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !126, line: 21, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !126, line: 21, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !400, file: !102, line: 22, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!190, !191, !406, !406, !409}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !400, file: !102, line: 25, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!190, !191}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !400, file: !102, line: 26, baseType: !419, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!190, !191, !422, !422}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !423, line: 16, baseType: !424)
!423 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !423, line: 16, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !400, file: !102, line: 27, baseType: !415, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !400, file: !102, line: 28, baseType: !428, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!190, !344, !191}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !400, file: !102, line: 29, baseType: !415, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !400, file: !102, line: 30, baseType: !433, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!190, !191, !180, !180}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !400, file: !102, line: 31, baseType: !437, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!190, !191, !184, !180, !180, !302}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !400, file: !102, line: 32, baseType: !441, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!190, !191, !368, !368, !302, !409, !180, !180}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !400, file: !102, line: 33, baseType: !415, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !400, file: !102, line: 34, baseType: !446, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!190, !191, !222}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !400, file: !102, line: 35, baseType: !415, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !400, file: !102, line: 36, baseType: !446, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !193, file: !102, line: 77, baseType: !452, size: 64, offset: 5376)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !453, line: 14, baseType: !454)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !453, line: 14, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !193, file: !102, line: 78, baseType: !368, size: 32, offset: 5440)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !193, file: !102, line: 79, baseType: !368, size: 32, offset: 5472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !193, file: !102, line: 81, baseType: !184, size: 32, offset: 5504)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !193, file: !102, line: 82, baseType: !460, size: 64, offset: 5568)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !463)
!463 = !{!464, !465, !485, !486, !487, !488}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !462, file: !102, line: 55, baseType: !196, size: 4480)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !462, file: !102, line: 55, baseType: !466, size: 448, offset: 4480)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 448, elements: !254)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !468)
!468 = !{!469, !473, !474, !478, !479, !480, !484}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !467, file: !102, line: 42, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!190, !460, !406, !406}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !467, file: !102, line: 43, baseType: !470, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !467, file: !102, line: 44, baseType: !475, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!190, !460}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !467, file: !102, line: 45, baseType: !475, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !467, file: !102, line: 46, baseType: !475, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !467, file: !102, line: 47, baseType: !481, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!190, !460, !222}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !467, file: !102, line: 48, baseType: !475, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !462, file: !102, line: 56, baseType: !191, size: 64, offset: 4928)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !462, file: !102, line: 57, baseType: !422, size: 64, offset: 4992)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !462, file: !102, line: 58, baseType: !295, size: 64, offset: 5056)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !462, file: !102, line: 59, baseType: !293, size: 64, offset: 5120)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !193, file: !102, line: 83, baseType: !368, size: 32, offset: 5632)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !193, file: !102, line: 84, baseType: !368, size: 32, offset: 5664)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !193, file: !102, line: 85, baseType: !368, size: 32, offset: 5696)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !193, file: !102, line: 86, baseType: !368, size: 32, offset: 5728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !193, file: !102, line: 87, baseType: !494, size: 32, offset: 5760)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !193, file: !102, line: 88, baseType: !496, size: 384, offset: 5792)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 384, elements: !497)
!497 = !{!498, !499}
!498 = !DISubrange(count: 4)
!499 = !DISubrange(count: 3)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !193, file: !102, line: 89, baseType: !171, size: 64, offset: 6208)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !193, file: !102, line: 90, baseType: !171, size: 64, offset: 6272)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !193, file: !102, line: 91, baseType: !171, size: 64, offset: 6336)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !193, file: !102, line: 92, baseType: !171, size: 64, offset: 6400)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !193, file: !102, line: 93, baseType: !171, size: 64, offset: 6464)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !193, file: !102, line: 94, baseType: !171, size: 64, offset: 6528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !193, file: !102, line: 95, baseType: !507, size: 32, offset: 6592)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !193, file: !102, line: 96, baseType: !368, size: 32, offset: 6624)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !193, file: !102, line: 98, baseType: !406, size: 64, offset: 6656)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !193, file: !102, line: 98, baseType: !406, size: 64, offset: 6720)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !193, file: !102, line: 102, baseType: !180, size: 64, offset: 6784)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !193, file: !102, line: 103, baseType: !180, size: 64, offset: 6848)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !193, file: !102, line: 104, baseType: !184, size: 32, offset: 6912)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !193, file: !102, line: 105, baseType: !184, size: 32, offset: 6944)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !193, file: !102, line: 106, baseType: !368, size: 32, offset: 6976)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !193, file: !102, line: 107, baseType: !180, size: 64, offset: 7040)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !193, file: !102, line: 108, baseType: !180, size: 64, offset: 7104)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !193, file: !102, line: 109, baseType: !184, size: 32, offset: 7168)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !193, file: !102, line: 110, baseType: !184, size: 32, offset: 7200)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !193, file: !102, line: 111, baseType: !368, size: 32, offset: 7232)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !193, file: !102, line: 113, baseType: !184, size: 32, offset: 7264)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !193, file: !102, line: 114, baseType: !368, size: 32, offset: 7296)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !193, file: !102, line: 117, baseType: !184, size: 32, offset: 7328)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !193, file: !102, line: 120, baseType: !525, size: 320, offset: 7360)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !386)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!190, !191, !184, !171, !293}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !193, file: !102, line: 121, baseType: !530, size: 320, offset: 7680)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 320, elements: !386)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!190, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !193, file: !102, line: 122, baseType: !394, size: 320, offset: 8000)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !193, file: !102, line: 123, baseType: !184, size: 32, offset: 8320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !193, file: !102, line: 124, baseType: !368, size: 32, offset: 8352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !193, file: !102, line: 126, baseType: !539, size: 320, offset: 8384)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 320, elements: !386)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!190, !191, !293}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !193, file: !102, line: 127, baseType: !530, size: 320, offset: 8704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !193, file: !102, line: 128, baseType: !394, size: 320, offset: 9024)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !193, file: !102, line: 129, baseType: !184, size: 32, offset: 9344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !193, file: !102, line: 131, baseType: !547, size: 64, offset: 9408)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!190, !191, !184, !171, !550, !293}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !193, file: !102, line: 132, baseType: !335, size: 64, offset: 9472)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !193, file: !102, line: 133, baseType: !293, size: 64, offset: 9536)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !193, file: !102, line: 135, baseType: !293, size: 64, offset: 9600)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !193, file: !102, line: 137, baseType: !555, size: 64, offset: 9664)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !102, line: 139, baseType: !293, size: 64, offset: 9728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9792)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9824)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9856)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9888)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9920)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9952)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 9984)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10016)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10080)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10112)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10144)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10176)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !193, file: !102, line: 142, baseType: !368, size: 32, offset: 10208)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10304)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10432)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10560)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10816)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10880)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 10944)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 11008)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !193, file: !102, line: 143, baseType: !222, size: 64, offset: 11072)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11136)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11168)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11200)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11232)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11296)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11360)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11392)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11424)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11456)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11488)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11520)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !193, file: !102, line: 144, baseType: !588, size: 32, offset: 11552)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !193, file: !102, line: 147, baseType: !184, size: 32, offset: 11584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !193, file: !102, line: 148, baseType: !409, size: 64, offset: 11648)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !193, file: !102, line: 150, baseType: !605, size: 32, offset: 11712)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !193, file: !102, line: 151, baseType: !368, size: 32, offset: 11744)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !193, file: !102, line: 153, baseType: !184, size: 32, offset: 11776)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !193, file: !102, line: 154, baseType: !184, size: 32, offset: 11808)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !193, file: !102, line: 156, baseType: !368, size: 32, offset: 11840)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !193, file: !102, line: 161, baseType: !611, size: 192, offset: 11904)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !102, line: 157, size: 192, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !611, file: !102, line: 158, baseType: !422, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !611, file: !102, line: 158, baseType: !422, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !611, file: !102, line: 159, baseType: !368, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !611, file: !102, line: 160, baseType: !368, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !193, file: !102, line: 163, baseType: !618, size: 32, offset: 12096)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !193, file: !102, line: 165, baseType: !494, size: 32, offset: 12128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !193, file: !102, line: 166, baseType: !618, size: 32, offset: 12160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !193, file: !102, line: 171, baseType: !368, size: 32, offset: 12192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !193, file: !102, line: 172, baseType: !368, size: 32, offset: 12224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !193, file: !102, line: 173, baseType: !368, size: 32, offset: 12256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !193, file: !102, line: 174, baseType: !406, size: 64, offset: 12288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !193, file: !102, line: 175, baseType: !406, size: 64, offset: 12352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !193, file: !102, line: 177, baseType: !184, size: 32, offset: 12416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !193, file: !102, line: 178, baseType: !368, size: 32, offset: 12448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !193, file: !102, line: 180, baseType: !222, size: 64, offset: 12480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !193, file: !102, line: 182, baseType: !630, size: 64, offset: 12544)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!190, !191, !406, !406, !293}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !193, file: !102, line: 183, baseType: !630, size: 64, offset: 12608)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !193, file: !102, line: 184, baseType: !293, size: 64, offset: 12672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !193, file: !102, line: 184, baseType: !293, size: 64, offset: 12736)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !166, file: !165, line: 8, baseType: !637, size: 32, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !166, file: !165, line: 8, baseType: !409, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !166, file: !165, line: 8, baseType: !409, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 992)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 1056)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !166, file: !165, line: 8, baseType: !645, size: 64, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !166, file: !165, line: 8, baseType: !302, size: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 1248)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !166, file: !165, line: 8, baseType: !184, size: 32, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !166, file: !165, line: 8, baseType: !169, size: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !166, file: !165, line: 8, baseType: !406, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !166, file: !165, line: 8, baseType: !171, size: 64, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !166, file: !165, line: 8, baseType: !171, size: 64, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "prevecs", scope: !166, file: !165, line: 11, baseType: !409, size: 64, offset: 1600)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prevecs_user_work", scope: !166, file: !165, line: 14, baseType: !645, size: 64, offset: 1664)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc", scope: !166, file: !165, line: 19, baseType: !657, size: 64, offset: 1728)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!190, !191, !184, !184, !171, !293}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "modifydestroy", scope: !166, file: !165, line: 20, baseType: !335, size: 64, offset: 1792)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "modifyctx", scope: !166, file: !165, line: 21, baseType: !293, size: 64, offset: 1856)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !215, line: 331, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !215, line: 331, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !215, line: 338, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !215, line: 338, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !133)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !670, line: 1451, baseType: !246)
!670 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!671 = !{i32 7, !"Dwarf Version", i32 4}
!672 = !{i32 2, !"Debug Info Version", i32 3}
!673 = !{i32 1, !"wchar_size", i32 4}
!674 = !{i32 7, !"PIC Level", i32 2}
!675 = !{i32 7, !"uwtable", i32 1}
!676 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!677 = distinct !DISubprogram(name: "KSPSetUp_FGMRES", scope: !678, file: !678, line: 32, type: !416, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !679)
!678 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/fgmres.c", directory: "/home/users/ndemeye/xSDK")
!679 = !{!680, !681, !682, !683, !684, !685, !687, !689, !691, !693, !695, !697, !702}
!680 = !DILocalVariable(name: "ksp", arg: 1, scope: !677, file: !678, line: 32, type: !191)
!681 = !DILocalVariable(name: "ierr", scope: !677, file: !678, line: 34, type: !190)
!682 = !DILocalVariable(name: "max_k", scope: !677, file: !678, line: 35, type: !184)
!683 = !DILocalVariable(name: "k", scope: !677, file: !678, line: 35, type: !184)
!684 = !DILocalVariable(name: "fgmres", scope: !677, file: !678, line: 36, type: !163)
!685 = !DILocalVariable(name: "ierr__", scope: !686, file: !678, line: 41, type: !190)
!686 = distinct !DILexicalBlock(scope: !677, file: !678, line: 41, column: 30)
!687 = !DILocalVariable(name: "ierr__", scope: !688, file: !678, line: 43, type: !190)
!688 = distinct !DILexicalBlock(scope: !677, file: !678, line: 43, column: 49)
!689 = !DILocalVariable(name: "ierr__", scope: !690, file: !678, line: 44, type: !190)
!690 = distinct !DILexicalBlock(scope: !677, file: !678, line: 44, column: 59)
!691 = !DILocalVariable(name: "ierr__", scope: !692, file: !678, line: 45, type: !190)
!692 = distinct !DILexicalBlock(scope: !677, file: !678, line: 45, column: 77)
!693 = !DILocalVariable(name: "ierr__", scope: !694, file: !678, line: 50, type: !190)
!694 = distinct !DILexicalBlock(scope: !677, file: !678, line: 50, column: 98)
!695 = !DILocalVariable(name: "_i", scope: !696, file: !678, line: 51, type: !26)
!696 = distinct !DILexicalBlock(scope: !677, file: !678, line: 51, column: 10)
!697 = !DILocalVariable(name: "ierr__", scope: !698, file: !678, line: 51, type: !190)
!698 = distinct !DILexicalBlock(scope: !699, file: !678, line: 51, column: 10)
!699 = distinct !DILexicalBlock(scope: !700, file: !678, line: 51, column: 10)
!700 = distinct !DILexicalBlock(scope: !701, file: !678, line: 51, column: 10)
!701 = distinct !DILexicalBlock(scope: !696, file: !678, line: 51, column: 10)
!702 = !DILocalVariable(name: "ierr__", scope: !703, file: !678, line: 51, type: !190)
!703 = distinct !DILexicalBlock(scope: !677, file: !678, line: 51, column: 98)
!704 = !DILocation(line: 0, scope: !677)
!705 = !DILocation(line: 36, column: 46, scope: !677)
!706 = !{!707, !712, i64 1216}
