; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/utils/isutil.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/utils/isutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!66 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 663, baseType: !5, size: 32, elements: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!76 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 30, baseType: !5, size: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 238, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 563, baseType: !5, size: 32, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "MAT_DO_NOT_COPY_VALUES", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "MAT_COPY_VALUES", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "MAT_SHARE_NONZERO_PATTERN", value: 2, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 624, baseType: !5, size: 32, elements: !115)
!114 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!125 = !{!126, !129, !130, !166, !216, !137, !300, !206, !334, !337, !5}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !114, line: 330, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !114, line: 330, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !133, line: 73, size: 4480, elements: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!134 = !{!135, !138, !187, !188, !190, !193, !194, !195, !196, !204, !205, !207, !211, !215, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !228, !229, !230, !232, !233, !235, !237, !238, !239, !240, !241, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !267, !269, !270, !274, !275, !324, !329, !331, !332, !333}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !132, file: !133, line: 74, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !137)
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !132, file: !133, line: 75, baseType: !139, size: 448, offset: 64)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 448, elements: !185)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !133, line: 53, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 45, size: 448, elements: !142)
!142 = !{!143, !149, !157, !162, !169, !173, !180}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !141, file: !133, line: 46, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !130, !148}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !137)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !141, file: !133, line: 47, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!147, !130, !153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !154, line: 16, baseType: !155)
!154 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !154, line: 16, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !141, file: !133, line: 48, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!147, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !141, file: !133, line: 49, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!147, !130, !166, !130}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !141, file: !133, line: 50, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!147, !130, !166, !161}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !141, file: !133, line: 51, baseType: !174, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!147, !130, !166, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !141, file: !133, line: 52, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!147, !130, !166, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!185 = !{!186}
!186 = !DISubrange(count: 1)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !132, file: !133, line: 76, baseType: !126, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !133, line: 77, baseType: !189, size: 32, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !137)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !132, file: !133, line: 78, baseType: !191, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !192)
!192 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !132, file: !133, line: 78, baseType: !191, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !132, file: !133, line: 78, baseType: !191, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !132, file: !133, line: 78, baseType: !191, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !133, line: 79, baseType: !197, size: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !200, line: 27, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !202, line: 43, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !132, file: !133, line: 80, baseType: !189, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !132, file: !133, line: 81, baseType: !206, size: 32, offset: 992)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !137)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !132, file: !133, line: 82, baseType: !208, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !132, file: !133, line: 83, baseType: !212, size: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !132, file: !133, line: 84, baseType: !216, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !132, file: !133, line: 85, baseType: !216, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !132, file: !133, line: 86, baseType: !216, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !132, file: !133, line: 87, baseType: !216, size: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !132, file: !133, line: 88, baseType: !130, size: 64, offset: 1408)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !132, file: !133, line: 89, baseType: !197, size: 64, offset: 1472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !133, line: 90, baseType: !216, size: 64, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !132, file: !133, line: 91, baseType: !216, size: 64, offset: 1600)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !132, file: !133, line: 92, baseType: !189, size: 32, offset: 1664)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !132, file: !133, line: 93, baseType: !129, size: 64, offset: 1728)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !132, file: !133, line: 94, baseType: !227, size: 64, offset: 1792)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !198)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !132, file: !133, line: 95, baseType: !189, size: 32, offset: 1856)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !132, file: !133, line: 95, baseType: !189, size: 32, offset: 1888)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !132, file: !133, line: 96, baseType: !231, size: 64, offset: 1920)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !132, file: !133, line: 96, baseType: !231, size: 64, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !132, file: !133, line: 97, baseType: !234, size: 64, offset: 2048)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !132, file: !133, line: 97, baseType: !236, size: 64, offset: 2112)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !132, file: !133, line: 98, baseType: !189, size: 32, offset: 2176)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !132, file: !133, line: 98, baseType: !189, size: 32, offset: 2208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !132, file: !133, line: 99, baseType: !231, size: 64, offset: 2240)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !132, file: !133, line: 99, baseType: !231, size: 64, offset: 2304)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !132, file: !133, line: 100, baseType: !242, size: 64, offset: 2368)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !132, file: !133, line: 100, baseType: !245, size: 64, offset: 2432)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !132, file: !133, line: 101, baseType: !189, size: 32, offset: 2496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !132, file: !133, line: 101, baseType: !189, size: 32, offset: 2528)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !132, file: !133, line: 102, baseType: !231, size: 64, offset: 2560)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !132, file: !133, line: 102, baseType: !231, size: 64, offset: 2624)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !132, file: !133, line: 103, baseType: !251, size: 64, offset: 2688)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !243)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !132, file: !133, line: 103, baseType: !254, size: 64, offset: 2752)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !132, file: !133, line: 104, baseType: !184, size: 64, offset: 2816)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !132, file: !133, line: 105, baseType: !189, size: 32, offset: 2880)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !132, file: !133, line: 106, baseType: !258, size: 128, offset: 2944)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !265)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !133, line: 64, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 61, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !261, file: !133, line: 62, baseType: !177, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !261, file: !133, line: 63, baseType: !129, size: 64, offset: 64)
!265 = !{!266}
!266 = !DISubrange(count: 2)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !132, file: !133, line: 107, baseType: !268, size: 64, offset: 3072)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !265)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !132, file: !133, line: 108, baseType: !129, size: 64, offset: 3136)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !132, file: !133, line: 109, baseType: !271, size: 64, offset: 3200)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!147, !129}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !132, file: !133, line: 111, baseType: !189, size: 32, offset: 3264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !132, file: !133, line: 112, baseType: !276, size: 320, offset: 3328)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !322)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!147, !280, !130, !129}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !283)
!283 = !{!284, !285, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !282, file: !10, line: 100, baseType: !189, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !10, line: 101, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !297, !298, !299, !303, !305, !307, !308, !309}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !288, file: !10, line: 84, baseType: !216, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !288, file: !10, line: 85, baseType: !216, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !10, line: 86, baseType: !129, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !288, file: !10, line: 87, baseType: !208, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !288, file: !10, line: 88, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !288, file: !10, line: 89, baseType: !168, size: 8, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !288, file: !10, line: 90, baseType: !216, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !288, file: !10, line: 91, baseType: !300, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !301, line: 46, baseType: !302)
!301 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!302 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !288, file: !10, line: 92, baseType: !304, size: 32, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !10, line: 93, baseType: !306, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 94, baseType: !286, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !288, file: !10, line: 95, baseType: !216, size: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !288, file: !10, line: 96, baseType: !129, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !282, file: !10, line: 102, baseType: !216, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !282, file: !10, line: 102, baseType: !216, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !282, file: !10, line: 103, baseType: !216, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !282, file: !10, line: 104, baseType: !126, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !282, file: !10, line: 105, baseType: !304, size: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !282, file: !10, line: 106, baseType: !130, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !282, file: !10, line: 107, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!322 = !{!323}
!323 = !DISubrange(count: 5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !132, file: !133, line: 113, baseType: !325, size: 320, offset: 3648)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, elements: !322)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!147, !130, !129}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !132, file: !133, line: 114, baseType: !330, size: 320, offset: 3968)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !322)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !132, file: !133, line: 115, baseType: !304, size: 32, offset: 4288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !132, file: !133, line: 120, baseType: !319, size: 64, offset: 4352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !132, file: !133, line: 121, baseType: !304, size: 32, offset: 4416)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !114, line: 331, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !114, line: 331, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !114, line: 338, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !114, line: 338, flags: DIFlagFwdDecl)
!340 = !{i32 7, !"Dwarf Version", i32 4}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{i32 7, !"PIC Level", i32 2}
!344 = !{i32 7, !"uwtable", i32 1}
!345 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!346 = distinct !DISubprogram(name: "TaoVecGetSubVec", scope: !347, file: !347, line: 23, type: !348, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !653)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/bound/utils/isutil.c", directory: "/home/users/ndemeye/xSDK")
!348 = !DISubroutineType(types: !349)
!349 = !{!147, !350, !532, !652, !243, !365}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !353, line: 142, size: 12800, elements: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!354 = !{!355, !357, !577, !598, !599, !600, !646, !647, !648, !649, !651}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !352, file: !353, line: 143, baseType: !356, size: 4480)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !133, line: 122, baseType: !132)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !352, file: !353, line: 143, baseType: !358, size: 5248, offset: 4480)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 5248, elements: !185)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !353, line: 23, size: 5248, elements: !360)
!360 = !{!361, !366, !371, !375, !379, !385, !390, !391, !392, !396, !400, !401, !402, !406, !410, !416, !417, !421, !425, !429, !430, !437, !441, !442, !446, !450, !451, !452, !456, !457, !464, !469, !470, !471, !475, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !496, !497, !498, !502, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !523, !524, !528, !535, !536, !541, !542, !546, !547, !548, !549, !550, !551, !552, !553, !557, !558, !559, !565, !569, !570, !571}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !359, file: !353, line: 24, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!147, !350, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !359, file: !353, line: 25, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!147, !350, !189, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !359, file: !353, line: 26, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!147, !189, !365}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !359, file: !353, line: 27, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!147, !350, !350, !251}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !359, file: !353, line: 28, baseType: !380, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!147, !350, !189, !383, !251}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !359, file: !353, line: 29, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!147, !350, !389, !242}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !359, file: !353, line: 30, baseType: !376, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !359, file: !353, line: 31, baseType: !380, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !359, file: !353, line: 32, baseType: !393, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!147, !350, !252}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !359, file: !353, line: 33, baseType: !397, size: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!147, !350, !350}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !359, file: !353, line: 34, baseType: !393, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !359, file: !353, line: 35, baseType: !397, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !359, file: !353, line: 36, baseType: !403, size: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!147, !350, !252, !350}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !359, file: !353, line: 37, baseType: !407, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!147, !350, !252, !252, !350}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !359, file: !353, line: 38, baseType: !411, size: 64, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!147, !350, !189, !414, !365}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !359, file: !353, line: 39, baseType: !403, size: 64, offset: 960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !359, file: !353, line: 40, baseType: !418, size: 64, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!147, !350, !252, !350, !350}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !359, file: !353, line: 41, baseType: !422, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!147, !350, !252, !252, !252, !350, !350}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !359, file: !353, line: 42, baseType: !426, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!147, !350, !350, !350}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !359, file: !353, line: 43, baseType: !426, size: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !359, file: !353, line: 44, baseType: !431, size: 64, offset: 1280)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!147, !350, !189, !434, !414, !436}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !359, file: !353, line: 45, baseType: !438, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!147, !350}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !359, file: !353, line: 46, baseType: !438, size: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !359, file: !353, line: 47, baseType: !443, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!147, !350, !254}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !359, file: !353, line: 48, baseType: !447, size: 64, offset: 1536)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!147, !350, !234}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !359, file: !353, line: 49, baseType: !447, size: 64, offset: 1600)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !359, file: !353, line: 50, baseType: !443, size: 64, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !359, file: !353, line: 51, baseType: !453, size: 64, offset: 1728)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!147, !350, !234, !242}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !359, file: !353, line: 52, baseType: !453, size: 64, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !359, file: !353, line: 53, baseType: !458, size: 64, offset: 1856)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!147, !350, !461}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !359, file: !353, line: 54, baseType: !465, size: 64, offset: 1920)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!147, !350, !468, !304}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !359, file: !353, line: 55, baseType: !431, size: 64, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !359, file: !353, line: 56, baseType: !438, size: 64, offset: 2048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !359, file: !353, line: 57, baseType: !472, size: 64, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!147, !350, !153}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !359, file: !353, line: 58, baseType: !476, size: 64, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!147, !350, !414}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !359, file: !353, line: 59, baseType: !476, size: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !359, file: !353, line: 60, baseType: !376, size: 64, offset: 2304)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !359, file: !353, line: 61, baseType: !376, size: 64, offset: 2368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !359, file: !353, line: 62, baseType: !386, size: 64, offset: 2432)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !359, file: !353, line: 63, baseType: !380, size: 64, offset: 2496)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !359, file: !353, line: 64, baseType: !380, size: 64, offset: 2560)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !359, file: !353, line: 65, baseType: !472, size: 64, offset: 2624)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !359, file: !353, line: 66, baseType: !438, size: 64, offset: 2688)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !359, file: !353, line: 67, baseType: !438, size: 64, offset: 2752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !359, file: !353, line: 68, baseType: !489, size: 64, offset: 2816)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!147, !350, !492}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !493, line: 30, baseType: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !493, line: 30, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !359, file: !353, line: 69, baseType: !431, size: 64, offset: 2880)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !359, file: !353, line: 70, baseType: !438, size: 64, offset: 2944)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !359, file: !353, line: 71, baseType: !499, size: 64, offset: 3008)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!147, !280, !350}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !359, file: !353, line: 72, baseType: !503, size: 64, offset: 3072)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!147, !350, !350, !242}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !359, file: !353, line: 73, baseType: !426, size: 64, offset: 3136)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !359, file: !353, line: 74, baseType: !426, size: 64, offset: 3200)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !359, file: !353, line: 75, baseType: !426, size: 64, offset: 3264)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !359, file: !353, line: 76, baseType: !510, size: 64, offset: 3328)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!147, !350, !189, !434, !251}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !359, file: !353, line: 77, baseType: !438, size: 64, offset: 3392)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !359, file: !353, line: 78, baseType: !438, size: 64, offset: 3456)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !359, file: !353, line: 79, baseType: !438, size: 64, offset: 3520)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !359, file: !353, line: 80, baseType: !438, size: 64, offset: 3584)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !359, file: !353, line: 81, baseType: !393, size: 64, offset: 3648)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !359, file: !353, line: 82, baseType: !438, size: 64, offset: 3712)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !359, file: !353, line: 83, baseType: !520, size: 64, offset: 3776)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!147, !350, !189, !350, !436}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !359, file: !353, line: 84, baseType: !520, size: 64, offset: 3840)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !359, file: !353, line: 85, baseType: !525, size: 64, offset: 3904)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!147, !350, !350, !251, !251}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !359, file: !353, line: 86, baseType: !529, size: 64, offset: 3968)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!147, !350, !532, !365}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !493, line: 11, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !493, line: 11, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !359, file: !353, line: 87, baseType: !529, size: 64, offset: 4032)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !359, file: !353, line: 88, baseType: !537, size: 64, offset: 4096)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!147, !350, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !359, file: !353, line: 89, baseType: !537, size: 64, offset: 4160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !359, file: !353, line: 90, baseType: !543, size: 64, offset: 4224)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!147, !350, !189, !434, !434, !350, !436}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !359, file: !353, line: 91, baseType: !543, size: 64, offset: 4288)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !359, file: !353, line: 92, baseType: !472, size: 64, offset: 4352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !359, file: !353, line: 93, baseType: !472, size: 64, offset: 4416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !359, file: !353, line: 94, baseType: !397, size: 64, offset: 4480)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !359, file: !353, line: 95, baseType: !397, size: 64, offset: 4544)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !359, file: !353, line: 96, baseType: !397, size: 64, offset: 4608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !359, file: !353, line: 97, baseType: !397, size: 64, offset: 4672)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !359, file: !353, line: 98, baseType: !554, size: 64, offset: 4736)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!147, !350, !304}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !359, file: !353, line: 99, baseType: !443, size: 64, offset: 4800)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !359, file: !353, line: 100, baseType: !443, size: 64, offset: 4864)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !359, file: !353, line: 101, baseType: !560, size: 64, offset: 4928)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!147, !350, !254, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !359, file: !353, line: 102, baseType: !566, size: 64, offset: 4992)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!147, !350, !540, !563}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !359, file: !353, line: 103, baseType: !443, size: 64, offset: 5056)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !359, file: !353, line: 104, baseType: !537, size: 64, offset: 5120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !359, file: !353, line: 105, baseType: !572, size: 64, offset: 5184)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!147, !189, !383, !365, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !352, file: !353, line: 144, baseType: !578, size: 64, offset: 9728)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !493, line: 60, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !581, line: 240, size: 640, elements: !582)
!581 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !580, file: !581, line: 241, baseType: !126, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !580, file: !581, line: 242, baseType: !206, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !580, file: !581, line: 243, baseType: !189, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !580, file: !581, line: 243, baseType: !189, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !580, file: !581, line: 244, baseType: !189, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !580, file: !581, line: 244, baseType: !189, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !580, file: !581, line: 245, baseType: !234, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !580, file: !581, line: 246, baseType: !304, size: 32, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !580, file: !581, line: 247, baseType: !189, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !580, file: !581, line: 251, baseType: !189, size: 32, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !580, file: !581, line: 252, baseType: !492, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !580, file: !581, line: 253, baseType: !304, size: 32, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !580, file: !581, line: 254, baseType: !189, size: 32, offset: 544)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !580, file: !581, line: 254, baseType: !189, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !580, file: !581, line: 255, baseType: !189, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !353, line: 145, baseType: !129, size: 64, offset: 9792)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !352, file: !353, line: 146, baseType: !304, size: 32, offset: 9856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !352, file: !353, line: 147, baseType: !601, size: 1344, offset: 9920)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !353, line: 140, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 114, size: 1344, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !622, !623, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !602, file: !353, line: 115, baseType: !189, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !602, file: !353, line: 116, baseType: !189, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !602, file: !353, line: 117, baseType: !189, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !602, file: !353, line: 118, baseType: !189, size: 32, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !602, file: !353, line: 119, baseType: !189, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !602, file: !353, line: 120, baseType: !189, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !602, file: !353, line: 121, baseType: !234, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !602, file: !353, line: 122, baseType: !251, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !602, file: !353, line: 124, baseType: !126, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !353, line: 125, baseType: !206, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !602, file: !353, line: 125, baseType: !206, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !602, file: !353, line: 126, baseType: !206, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !602, file: !353, line: 126, baseType: !206, size: 32, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !602, file: !353, line: 127, baseType: !618, size: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !114, line: 339, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !114, line: 339, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !602, file: !353, line: 128, baseType: !618, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !602, file: !353, line: 129, baseType: !624, size: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !114, line: 341, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !114, line: 351, size: 192, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !626, file: !114, line: 354, baseType: !137, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !626, file: !114, line: 355, baseType: !137, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !626, file: !114, line: 356, baseType: !137, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !626, file: !114, line: 361, baseType: !137, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !626, file: !114, line: 362, baseType: !300, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !602, file: !353, line: 130, baseType: !189, size: 32, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !602, file: !353, line: 130, baseType: !189, size: 32, offset: 736)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !602, file: !353, line: 131, baseType: !251, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !602, file: !353, line: 131, baseType: !251, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !602, file: !353, line: 132, baseType: !234, size: 64, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !602, file: !353, line: 132, baseType: !234, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !602, file: !353, line: 133, baseType: !189, size: 32, offset: 1024)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !602, file: !353, line: 134, baseType: !234, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !602, file: !353, line: 135, baseType: !189, size: 32, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !602, file: !353, line: 136, baseType: !304, size: 32, offset: 1184)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !602, file: !353, line: 137, baseType: !304, size: 32, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !602, file: !353, line: 138, baseType: !436, size: 32, offset: 1248)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !602, file: !353, line: 139, baseType: !234, size: 64, offset: 1280)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !352, file: !353, line: 147, baseType: !601, size: 1344, offset: 11264)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !352, file: !353, line: 148, baseType: !304, size: 32, offset: 12608)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !352, file: !353, line: 149, baseType: !189, size: 32, offset: 12640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !352, file: !353, line: 150, baseType: !650, size: 32, offset: 12672)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !352, file: !353, line: 157, baseType: !216, size: 64, offset: 12736)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !63, line: 26, baseType: !62)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !681, !682, !684, !686, !690, !692, !694, !698, !700, !702, !704, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !732, !734, !736, !738, !740, !742, !744, !746, !748}
!654 = !DILocalVariable(name: "vfull", arg: 1, scope: !346, file: !347, line: 23, type: !350)
!655 = !DILocalVariable(name: "is", arg: 2, scope: !346, file: !347, line: 23, type: !532)
!656 = !DILocalVariable(name: "reduced_type", arg: 3, scope: !346, file: !347, line: 23, type: !652)
!657 = !DILocalVariable(name: "maskvalue", arg: 4, scope: !346, file: !347, line: 23, type: !243)
!658 = !DILocalVariable(name: "vreduced", arg: 5, scope: !346, file: !347, line: 23, type: !365)
!659 = !DILocalVariable(name: "ierr", scope: !346, file: !347, line: 25, type: !147)
!660 = !DILocalVariable(name: "nfull", scope: !346, file: !347, line: 26, type: !189)
!661 = !DILocalVariable(name: "nreduced", scope: !346, file: !347, line: 26, type: !189)
!662 = !DILocalVariable(name: "nreduced_local", scope: !346, file: !347, line: 26, type: !189)
!663 = !DILocalVariable(name: "rlow", scope: !346, file: !347, line: 26, type: !189)
!664 = !DILocalVariable(name: "rhigh", scope: !346, file: !347, line: 26, type: !189)
!665 = !DILocalVariable(name: "flow", scope: !346, file: !347, line: 26, type: !189)
!666 = !DILocalVariable(name: "fhigh", scope: !346, file: !347, line: 26, type: !189)
!667 = !DILocalVariable(name: "i", scope: !346, file: !347, line: 27, type: !189)
!668 = !DILocalVariable(name: "nlocal", scope: !346, file: !347, line: 27, type: !189)
!669 = !DILocalVariable(name: "fv", scope: !346, file: !347, line: 28, type: !242)
!670 = !DILocalVariable(name: "rv", scope: !346, file: !347, line: 28, type: !242)
!671 = !DILocalVariable(name: "s", scope: !346, file: !347, line: 29, type: !434)
!672 = !DILocalVariable(name: "ident", scope: !346, file: !347, line: 30, type: !532)
!673 = !DILocalVariable(name: "vtype", scope: !346, file: !347, line: 31, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !25, line: 83, baseType: !166)
!675 = !DILocalVariable(name: "scatter", scope: !346, file: !347, line: 32, type: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !677, line: 59, baseType: !678)
!677 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !677, line: 15, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !677, line: 15, flags: DIFlagFwdDecl)
!681 = !DILocalVariable(name: "comm", scope: !346, file: !347, line: 33, type: !126)
!682 = !DILocalVariable(name: "ierr__", scope: !683, file: !347, line: 39, type: !147)
!683 = distinct !DILexicalBlock(scope: !346, file: !347, line: 39, column: 36)
!684 = !DILocalVariable(name: "ierr__", scope: !685, file: !347, line: 40, type: !147)
!685 = distinct !DILexicalBlock(scope: !346, file: !347, line: 40, column: 35)
!686 = !DILocalVariable(name: "ierr__", scope: !687, file: !347, line: 43, type: !147)
!687 = distinct !DILexicalBlock(scope: !688, file: !347, line: 43, column: 33)
!688 = distinct !DILexicalBlock(scope: !689, file: !347, line: 42, column: 26)
!689 = distinct !DILexicalBlock(scope: !346, file: !347, line: 42, column: 7)
!690 = !DILocalVariable(name: "ierr__", scope: !691, file: !347, line: 44, type: !147)
!691 = distinct !DILexicalBlock(scope: !688, file: !347, line: 44, column: 41)
!692 = !DILocalVariable(name: "ierr__", scope: !693, file: !347, line: 45, type: !147)
