; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/or.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/or.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_VecTagger = type { %struct._p_PetscObject, [1 x %struct._VecTaggerOps], i8*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 155, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!73 = !{!74, !78, !79, !82, !85}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !75, line: 330, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !75, line: 330, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !88, line: 73, size: 4480, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !93, !139, !140, !142, !145, !146, !147, !148, !156, !157, !159, !163, !167, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181, !182, !184, !185, !187, !189, !190, !191, !192, !193, !196, !198, !199, !200, !201, !202, !205, !207, !208, !209, !219, !221, !222, !226, !227, !273, !278, !280, !281, !282}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !87, file: !88, line: 74, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !92)
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !87, file: !88, line: 75, baseType: !94, size: 448, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 448, elements: !137)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !88, line: 53, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 45, size: 448, elements: !97)
!97 = !{!98, !104, !112, !117, !121, !125, !132}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !96, file: !88, line: 46, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !85, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !92)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !96, file: !88, line: 47, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!102, !85, !108}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !109, line: 16, baseType: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !109, line: 16, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !88, line: 48, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!102, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !96, file: !88, line: 49, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!102, !85, !79, !85}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !96, file: !88, line: 50, baseType: !122, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!102, !85, !79, !116}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !96, file: !88, line: 51, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!102, !85, !79, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !96, file: !88, line: 52, baseType: !133, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!102, !85, !79, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !87, file: !88, line: 76, baseType: !74, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 77, baseType: !141, size: 32, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !92)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !87, file: !88, line: 78, baseType: !143, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !144)
!144 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !88, line: 78, baseType: !143, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !87, file: !88, line: 78, baseType: !143, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !87, file: !88, line: 78, baseType: !143, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !88, line: 79, baseType: !149, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !152, line: 27, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !154, line: 43, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!155 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !87, file: !88, line: 80, baseType: !141, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !88, line: 81, baseType: !158, size: 32, offset: 992)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !92)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !87, file: !88, line: 82, baseType: !160, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !87, file: !88, line: 83, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !88, line: 84, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !87, file: !88, line: 85, baseType: !168, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !87, file: !88, line: 86, baseType: !168, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !87, file: !88, line: 87, baseType: !168, size: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !88, line: 88, baseType: !85, size: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !87, file: !88, line: 89, baseType: !149, size: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 90, baseType: !168, size: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 91, baseType: !168, size: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !87, file: !88, line: 92, baseType: !141, size: 32, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !87, file: !88, line: 93, baseType: !78, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !88, line: 94, baseType: !179, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !150)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !87, file: !88, line: 95, baseType: !141, size: 32, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !87, file: !88, line: 95, baseType: !141, size: 32, offset: 1888)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !87, file: !88, line: 96, baseType: !183, size: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !87, file: !88, line: 96, baseType: !183, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !87, file: !88, line: 97, baseType: !186, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !87, file: !88, line: 97, baseType: !188, size: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !87, file: !88, line: 98, baseType: !141, size: 32, offset: 2176)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !87, file: !88, line: 98, baseType: !141, size: 32, offset: 2208)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !87, file: !88, line: 99, baseType: !183, size: 64, offset: 2240)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !87, file: !88, line: 99, baseType: !183, size: 64, offset: 2304)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !87, file: !88, line: 100, baseType: !194, size: 64, offset: 2368)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !144)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !87, file: !88, line: 100, baseType: !197, size: 64, offset: 2432)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !87, file: !88, line: 101, baseType: !141, size: 32, offset: 2496)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !87, file: !88, line: 101, baseType: !141, size: 32, offset: 2528)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !87, file: !88, line: 102, baseType: !183, size: 64, offset: 2560)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !87, file: !88, line: 102, baseType: !183, size: 64, offset: 2624)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !87, file: !88, line: 103, baseType: !203, size: 64, offset: 2688)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !87, file: !88, line: 103, baseType: !206, size: 64, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !87, file: !88, line: 104, baseType: !136, size: 64, offset: 2816)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !87, file: !88, line: 105, baseType: !141, size: 32, offset: 2880)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !87, file: !88, line: 106, baseType: !210, size: 128, offset: 2944)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !217)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !88, line: 64, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 61, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !213, file: !88, line: 62, baseType: !129, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !213, file: !88, line: 63, baseType: !78, size: 64, offset: 64)
!217 = !{!218}
!218 = !DISubrange(count: 2)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !87, file: !88, line: 107, baseType: !220, size: 64, offset: 3072)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !217)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !87, file: !88, line: 108, baseType: !78, size: 64, offset: 3136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !87, file: !88, line: 109, baseType: !223, size: 64, offset: 3200)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!102, !78}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !87, file: !88, line: 111, baseType: !141, size: 32, offset: 3264)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !87, file: !88, line: 112, baseType: !228, size: 320, offset: 3328)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 320, elements: !271)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!102, !232, !85, !78}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !235)
!235 = !{!236, !237, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !234, file: !10, line: 100, baseType: !141, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !10, line: 101, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !249, !250, !251, !252, !254, !256, !257, !258}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !240, file: !10, line: 84, baseType: !168, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !240, file: !10, line: 85, baseType: !168, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !10, line: 86, baseType: !78, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !240, file: !10, line: 87, baseType: !160, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !240, file: !10, line: 88, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !240, file: !10, line: 89, baseType: !81, size: 8, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !240, file: !10, line: 90, baseType: !168, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !240, file: !10, line: 91, baseType: !82, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !240, file: !10, line: 92, baseType: !253, size: 32, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !10, line: 93, baseType: !255, size: 32, offset: 544)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !10, line: 94, baseType: !238, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !240, file: !10, line: 95, baseType: !168, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !240, file: !10, line: 96, baseType: !78, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !234, file: !10, line: 102, baseType: !168, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !234, file: !10, line: 102, baseType: !168, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !234, file: !10, line: 103, baseType: !168, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !234, file: !10, line: 104, baseType: !74, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !234, file: !10, line: 105, baseType: !253, size: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !234, file: !10, line: 105, baseType: !253, size: 32, offset: 416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !234, file: !10, line: 105, baseType: !253, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !234, file: !10, line: 106, baseType: !85, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !234, file: !10, line: 107, baseType: !268, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!271 = !{!272}
!272 = !DISubrange(count: 5)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !87, file: !88, line: 113, baseType: !274, size: 320, offset: 3648)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 320, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!102, !85, !78}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !87, file: !88, line: 114, baseType: !279, size: 320, offset: 3968)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 320, elements: !271)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !87, file: !88, line: 115, baseType: !253, size: 32, offset: 4288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !88, line: 120, baseType: !268, size: 64, offset: 4352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !87, file: !88, line: 121, baseType: !253, size: 32, offset: 4416)
!283 = !{i32 7, !"Dwarf Version", i32 4}
!284 = !{i32 2, !"Debug Info Version", i32 3}
!285 = !{i32 1, !"wchar_size", i32 4}
!286 = !{i32 7, !"PIC Level", i32 2}
!287 = !{i32 7, !"uwtable", i32 1}
!288 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!289 = distinct !DISubprogram(name: "VecTaggerOrGetSubs", scope: !290, file: !290, line: 21, type: !291, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !639)
!290 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/or.c", directory: "/home/users/ndemeye/xSDK")
!291 = !DISubroutineType(types: !292)
!292 = !{!102, !293, !186, !637}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !25, line: 721, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !296, line: 339, size: 5120, elements: !297)
!296 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!297 = !{!298, !300, !633, !634, !635, !636}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !295, file: !296, line: 340, baseType: !299, size: 4480)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !88, line: 122, baseType: !87)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !295, file: !296, line: 340, baseType: !301, size: 448, offset: 4480)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 448, elements: !137)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !296, line: 330, size: 448, elements: !303)
!303 = !{!304, !308, !309, !313, !314, !318, !629}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !302, file: !296, line: 331, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!102, !293}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !302, file: !296, line: 332, baseType: !305, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !302, file: !296, line: 333, baseType: !310, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!102, !232, !293}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !302, file: !296, line: 334, baseType: !305, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !302, file: !296, line: 335, baseType: !315, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!102, !293, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !302, file: !296, line: 336, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!102, !293, !322, !186, !622}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !296, line: 142, size: 12800, elements: !325)
!325 = !{!326, !327, !547, !568, !569, !570, !616, !617, !618, !619, !621}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !324, file: !296, line: 143, baseType: !299, size: 4480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !324, file: !296, line: 143, baseType: !328, size: 5248, offset: 4480)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 5248, elements: !137)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !296, line: 23, size: 5248, elements: !330)
!330 = !{!331, !336, !341, !345, !349, !355, !360, !361, !362, !366, !370, !371, !372, !376, !380, !386, !387, !391, !395, !399, !400, !407, !411, !412, !416, !420, !421, !422, !426, !427, !434, !439, !440, !441, !445, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !466, !467, !468, !472, !476, !477, !478, !479, !483, !484, !485, !486, !487, !488, !489, !493, !494, !498, !505, !506, !511, !512, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528, !529, !535, !539, !540, !541}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !329, file: !296, line: 24, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!102, !322, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !329, file: !296, line: 25, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!102, !322, !141, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !329, file: !296, line: 26, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!102, !141, !335}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !329, file: !296, line: 27, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!102, !322, !322, !203}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !329, file: !296, line: 28, baseType: !350, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!102, !322, !141, !353, !203}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !329, file: !296, line: 29, baseType: !356, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!102, !322, !359, !194}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !329, file: !296, line: 30, baseType: !346, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !329, file: !296, line: 31, baseType: !350, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !329, file: !296, line: 32, baseType: !363, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!102, !322, !204}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !329, file: !296, line: 33, baseType: !367, size: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!102, !322, !322}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !329, file: !296, line: 34, baseType: !363, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !329, file: !296, line: 35, baseType: !367, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !329, file: !296, line: 36, baseType: !373, size: 64, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!102, !322, !204, !322}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !329, file: !296, line: 37, baseType: !377, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!102, !322, !204, !204, !322}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !329, file: !296, line: 38, baseType: !381, size: 64, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!102, !322, !141, !384, !335}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !329, file: !296, line: 39, baseType: !373, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !329, file: !296, line: 40, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!102, !322, !204, !322, !322}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !329, file: !296, line: 41, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!102, !322, !204, !204, !204, !322, !322}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !329, file: !296, line: 42, baseType: !396, size: 64, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!102, !322, !322, !322}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !329, file: !296, line: 43, baseType: !396, size: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !329, file: !296, line: 44, baseType: !401, size: 64, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!102, !322, !141, !404, !384, !406}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !329, file: !296, line: 45, baseType: !408, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!102, !322}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !329, file: !296, line: 46, baseType: !408, size: 64, offset: 1408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !329, file: !296, line: 47, baseType: !413, size: 64, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!102, !322, !206}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !329, file: !296, line: 48, baseType: !417, size: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!102, !322, !186}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !329, file: !296, line: 49, baseType: !417, size: 64, offset: 1600)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !329, file: !296, line: 50, baseType: !413, size: 64, offset: 1664)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !329, file: !296, line: 51, baseType: !423, size: 64, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!102, !322, !186, !194}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !329, file: !296, line: 52, baseType: !423, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !329, file: !296, line: 53, baseType: !428, size: 64, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!102, !322, !431}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !329, file: !296, line: 54, baseType: !435, size: 64, offset: 1920)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!102, !322, !438, !253}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !329, file: !296, line: 55, baseType: !401, size: 64, offset: 1984)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !296, line: 56, baseType: !408, size: 64, offset: 2048)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !296, line: 57, baseType: !442, size: 64, offset: 2112)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!102, !322, !108}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !329, file: !296, line: 58, baseType: !446, size: 64, offset: 2176)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!102, !322, !384}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !329, file: !296, line: 59, baseType: !446, size: 64, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !329, file: !296, line: 60, baseType: !346, size: 64, offset: 2304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !329, file: !296, line: 61, baseType: !346, size: 64, offset: 2368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !329, file: !296, line: 62, baseType: !356, size: 64, offset: 2432)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !329, file: !296, line: 63, baseType: !350, size: 64, offset: 2496)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !329, file: !296, line: 64, baseType: !350, size: 64, offset: 2560)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !329, file: !296, line: 65, baseType: !442, size: 64, offset: 2624)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !329, file: !296, line: 66, baseType: !408, size: 64, offset: 2688)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !329, file: !296, line: 67, baseType: !408, size: 64, offset: 2752)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !329, file: !296, line: 68, baseType: !459, size: 64, offset: 2816)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!102, !322, !462}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !463, line: 30, baseType: !464)
!463 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !463, line: 30, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !329, file: !296, line: 69, baseType: !401, size: 64, offset: 2880)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !329, file: !296, line: 70, baseType: !408, size: 64, offset: 2944)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !329, file: !296, line: 71, baseType: !469, size: 64, offset: 3008)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!102, !232, !322}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !329, file: !296, line: 72, baseType: !473, size: 64, offset: 3072)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!102, !322, !322, !194}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !329, file: !296, line: 73, baseType: !396, size: 64, offset: 3136)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !329, file: !296, line: 74, baseType: !396, size: 64, offset: 3200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !329, file: !296, line: 75, baseType: !396, size: 64, offset: 3264)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !329, file: !296, line: 76, baseType: !480, size: 64, offset: 3328)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!102, !322, !141, !404, !203}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !329, file: !296, line: 77, baseType: !408, size: 64, offset: 3392)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !329, file: !296, line: 78, baseType: !408, size: 64, offset: 3456)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !329, file: !296, line: 79, baseType: !408, size: 64, offset: 3520)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !329, file: !296, line: 80, baseType: !408, size: 64, offset: 3584)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !329, file: !296, line: 81, baseType: !363, size: 64, offset: 3648)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !329, file: !296, line: 82, baseType: !408, size: 64, offset: 3712)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !329, file: !296, line: 83, baseType: !490, size: 64, offset: 3776)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!102, !322, !141, !322, !406}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !329, file: !296, line: 84, baseType: !490, size: 64, offset: 3840)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !329, file: !296, line: 85, baseType: !495, size: 64, offset: 3904)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!102, !322, !322, !203, !203}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !329, file: !296, line: 86, baseType: !499, size: 64, offset: 3968)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!102, !322, !502, !335}
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !463, line: 11, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !463, line: 11, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !329, file: !296, line: 87, baseType: !499, size: 64, offset: 4032)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !329, file: !296, line: 88, baseType: !507, size: 64, offset: 4096)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!102, !322, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !329, file: !296, line: 89, baseType: !507, size: 64, offset: 4160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !329, file: !296, line: 90, baseType: !513, size: 64, offset: 4224)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!102, !322, !141, !404, !404, !322, !406}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !329, file: !296, line: 91, baseType: !513, size: 64, offset: 4288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !329, file: !296, line: 92, baseType: !442, size: 64, offset: 4352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !329, file: !296, line: 93, baseType: !442, size: 64, offset: 4416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !329, file: !296, line: 94, baseType: !367, size: 64, offset: 4480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !329, file: !296, line: 95, baseType: !367, size: 64, offset: 4544)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !329, file: !296, line: 96, baseType: !367, size: 64, offset: 4608)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !329, file: !296, line: 97, baseType: !367, size: 64, offset: 4672)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !329, file: !296, line: 98, baseType: !524, size: 64, offset: 4736)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!102, !322, !253}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !329, file: !296, line: 99, baseType: !413, size: 64, offset: 4800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !329, file: !296, line: 100, baseType: !413, size: 64, offset: 4864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !329, file: !296, line: 101, baseType: !530, size: 64, offset: 4928)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!102, !322, !206, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !329, file: !296, line: 102, baseType: !536, size: 64, offset: 4992)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!102, !322, !510, !533}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !329, file: !296, line: 103, baseType: !413, size: 64, offset: 5056)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !329, file: !296, line: 104, baseType: !507, size: 64, offset: 5120)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !329, file: !296, line: 105, baseType: !542, size: 64, offset: 5184)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!102, !141, !353, !335, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !324, file: !296, line: 144, baseType: !548, size: 64, offset: 9728)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !463, line: 60, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !551, line: 240, size: 640, elements: !552)
!551 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !550, file: !551, line: 241, baseType: !74, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !550, file: !551, line: 242, baseType: !158, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !550, file: !551, line: 243, baseType: !141, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !550, file: !551, line: 243, baseType: !141, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !550, file: !551, line: 244, baseType: !141, size: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !550, file: !551, line: 244, baseType: !141, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !550, file: !551, line: 245, baseType: !186, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !550, file: !551, line: 246, baseType: !253, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !550, file: !551, line: 247, baseType: !141, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !550, file: !551, line: 251, baseType: !141, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !550, file: !551, line: 252, baseType: !462, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !550, file: !551, line: 253, baseType: !253, size: 32, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !550, file: !551, line: 254, baseType: !141, size: 32, offset: 544)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !550, file: !551, line: 254, baseType: !141, size: 32, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !550, file: !551, line: 255, baseType: !141, size: 32, offset: 608)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !296, line: 145, baseType: !78, size: 64, offset: 9792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !324, file: !296, line: 146, baseType: !253, size: 32, offset: 9856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !324, file: !296, line: 147, baseType: !571, size: 1344, offset: 9920)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !296, line: 140, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 114, size: 1344, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !592, !593, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !572, file: !296, line: 115, baseType: !141, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !572, file: !296, line: 116, baseType: !141, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !572, file: !296, line: 117, baseType: !141, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !572, file: !296, line: 118, baseType: !141, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !572, file: !296, line: 119, baseType: !141, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !572, file: !296, line: 120, baseType: !141, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !572, file: !296, line: 121, baseType: !186, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !572, file: !296, line: 122, baseType: !203, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !572, file: !296, line: 124, baseType: !74, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !572, file: !296, line: 125, baseType: !158, size: 32, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !572, file: !296, line: 125, baseType: !158, size: 32, offset: 416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !572, file: !296, line: 126, baseType: !158, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !572, file: !296, line: 126, baseType: !158, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !572, file: !296, line: 127, baseType: !588, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !75, line: 339, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !75, line: 339, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !572, file: !296, line: 128, baseType: !588, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !572, file: !296, line: 129, baseType: !594, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !75, line: 341, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !75, line: 351, size: 192, elements: !597)
!597 = !{!598, !599, !600, !601, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !596, file: !75, line: 354, baseType: !92, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !596, file: !75, line: 355, baseType: !92, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !596, file: !75, line: 356, baseType: !92, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !596, file: !75, line: 361, baseType: !92, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !596, file: !75, line: 362, baseType: !82, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !572, file: !296, line: 130, baseType: !141, size: 32, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !572, file: !296, line: 130, baseType: !141, size: 32, offset: 736)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !572, file: !296, line: 131, baseType: !203, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !572, file: !296, line: 131, baseType: !203, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !572, file: !296, line: 132, baseType: !186, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !572, file: !296, line: 132, baseType: !186, size: 64, offset: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !572, file: !296, line: 133, baseType: !141, size: 32, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !572, file: !296, line: 134, baseType: !186, size: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !572, file: !296, line: 135, baseType: !141, size: 32, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !572, file: !296, line: 136, baseType: !253, size: 32, offset: 1184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !572, file: !296, line: 137, baseType: !253, size: 32, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !572, file: !296, line: 138, baseType: !406, size: 32, offset: 1248)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !572, file: !296, line: 139, baseType: !186, size: 64, offset: 1280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !324, file: !296, line: 147, baseType: !571, size: 1344, offset: 11264)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !324, file: !296, line: 148, baseType: !253, size: 32, offset: 12608)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !324, file: !296, line: 149, baseType: !141, size: 32, offset: 12640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !324, file: !296, line: 150, baseType: !620, size: 32, offset: 12672)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !324, file: !296, line: 157, baseType: !168, size: 64, offset: 12736)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !25, line: 768, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 765, size: 128, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !625, file: !25, line: 766, baseType: !204, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !625, file: !25, line: 767, baseType: !204, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !302, file: !296, line: 337, baseType: !630, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!102, !293, !322, !546}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !296, line: 341, baseType: !78, size: 64, offset: 4928)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !295, file: !296, line: 342, baseType: !141, size: 32, offset: 4992)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !295, file: !296, line: 343, baseType: !253, size: 32, offset: 5024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !295, file: !296, line: 344, baseType: !253, size: 32, offset: 5056)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!639 = !{!640, !641, !642, !643, !644}
!640 = !DILocalVariable(name: "tagger", arg: 1, scope: !289, file: !290, line: 21, type: !293)
!641 = !DILocalVariable(name: "nsubs", arg: 2, scope: !289, file: !290, line: 21, type: !186)
!642 = !DILocalVariable(name: "subs", arg: 3, scope: !289, file: !290, line: 21, type: !637)
!643 = !DILocalVariable(name: "ierr", scope: !289, file: !290, line: 23, type: !102)
!644 = !DILocalVariable(name: "ierr__", scope: !645, file: !290, line: 26, type: !102)
!645 = distinct !DILexicalBlock(scope: !289, file: !290, line: 26, column: 52)
!646 = !DILocation(line: 0, scope: !289)
!647 = !DILocation(line: 25, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !290, line: 25, column: 3)
!649 = distinct !DILexicalBlock(scope: !650, file: !290, line: 25, column: 3)
!650 = distinct !DILexicalBlock(scope: !289, file: !290, line: 25, column: 3)
!651 = !{!652, !652, i64 0}
!652 = !{!"any pointer", !653, i64 0}
!653 = !{!"omnipotent char", !654, i64 0}
!654 = !{!"Simple C/C++ TBAA"}
!655 = !DILocation(line: 25, column: 3, scope: !649)
!656 = !DILocation(line: 25, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !290, line: 25, column: 3)
!658 = distinct !DILexicalBlock(scope: !648, file: !290, line: 25, column: 3)
!659 = !{!660, !661, i64 1536}
!660 = !{!"", !653, i64 0, !653, i64 512, !653, i64 1024, !653, i64 1280, !661, i64 1536, !661, i64 1540, !653, i64 1544}
!661 = !{!"int", !653, i64 0}
!662 = !DILocation(line: 25, column: 3, scope: !658)
!663 = !DILocation(line: 25, column: 3, scope: !664)
!664 = distinct !DILexicalBlock(scope: !657, file: !290, line: 25, column: 3)
!665 = !{!661, !661, i64 0}
!666 = !{!660, !661, i64 1540}
!667 = !DILocation(line: 26, column: 10, scope: !289)
!668 = !DILocation(line: 0, scope: !645)
!669 = !DILocation(line: 26, column: 52, scope: !670)
!670 = distinct !DILexicalBlock(scope: !645, file: !290, line: 26, column: 52)
!671 = !DILocation(line: 26, column: 52, scope: !645)
!672 = !{!"branch_weights", i32 2000, i32 1}
!673 = !DILocation(line: 27, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !290, line: 27, column: 3)
!675 = distinct !DILexicalBlock(scope: !676, file: !290, line: 27, column: 3)
!676 = distinct !DILexicalBlock(scope: !289, file: !290, line: 27, column: 3)
!677 = !DILocation(line: 27, column: 3, scope: !675)
!678 = !DILocation(line: 27, column: 3, scope: !679)
!679 = distinct !DILexicalBlock(scope: !680, file: !290, line: 27, column: 3)
!680 = distinct !DILexicalBlock(scope: !674, file: !290, line: 27, column: 3)
!681 = !DILocation(line: 27, column: 3, scope: !680)
!682 = !DILocation(line: 27, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !290, line: 27, column: 3)
!684 = distinct !DILexicalBlock(scope: !679, file: !290, line: 27, column: 3)
!685 = !{!660, !653, i64 1544}
!686 = !DILocation(line: 27, column: 3, scope: !684)
!687 = !DILocation(line: 27, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !683, file: !290, line: 27, column: 3)
!689 = !DILocation(line: 27, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !679, file: !290, line: 27, column: 3)
!691 = !DILocation(line: 27, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !690, file: !290, line: 27, column: 3)
!693 = !DILocation(line: 27, column: 3, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !290, line: 27, column: 3)
!695 = distinct !DILexicalBlock(scope: !692, file: !290, line: 27, column: 3)
!696 = !DILocation(line: 27, column: 3, scope: !695)
!697 = !DILocation(line: 27, column: 3, scope: !698)
!698 = distinct !DILexicalBlock(scope: !694, file: !290, line: 27, column: 3)
