; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/admm/admm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/admm/admm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!202 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!203 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!204 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!205 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!206 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!207 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!208 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!209 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!210 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!211 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!212 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!213 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!214 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!215 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!216 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!217 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!218 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!219 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!220 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!221 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!222 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!223 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!224 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!225 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!226 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!227 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!228 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!229 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 155, baseType: !7, size: 32, elements: !241)
!240 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!241 = !{!242, !243, !244, !245, !246}
!242 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!245 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!246 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 238, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 285, baseType: !7, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!256 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!257 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!258 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!259 = !{!260, !263, !281, !361, !467, !301, !469, !351, !28, !296, !341, !780, !783, !786, !312, !484, !787, !788, !7}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !261, line: 46, baseType: !262)
!261 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!262 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !266, line: 73, size: 4480, elements: !267)
!266 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!267 = !{!268, !270, !322, !323, !325, !328, !329, !330, !331, !339, !340, !342, !346, !350, !352, !353, !354, !355, !356, !357, !358, !359, !360, !362, !364, !365, !366, !368, !369, !371, !373, !374, !375, !376, !377, !380, !382, !383, !384, !385, !386, !389, !391, !392, !393, !403, !405, !406, !410, !411, !457, !462, !464, !465, !466}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !265, file: !266, line: 74, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !265, file: !266, line: 75, baseType: !271, size: 448, offset: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 448, elements: !320)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !266, line: 53, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 45, size: 448, elements: !274)
!274 = !{!275, !284, !292, !297, !304, !308, !315}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !273, file: !266, line: 46, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !263, !280}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !84, line: 330, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !84, line: 330, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !273, file: !266, line: 47, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!279, !263, !288}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !289, line: 16, baseType: !290)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !289, line: 16, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !273, file: !266, line: 48, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!279, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !273, file: !266, line: 49, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!279, !263, !301, !263}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !273, file: !266, line: 50, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!279, !263, !301, !296}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !273, file: !266, line: 51, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!279, !263, !301, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !273, file: !266, line: 52, baseType: !316, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!279, !263, !301, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !265, file: !266, line: 76, baseType: !281, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !266, line: 77, baseType: !324, size: 32, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !265, file: !266, line: 78, baseType: !326, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !327)
!327 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !265, file: !266, line: 78, baseType: !326, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !265, file: !266, line: 78, baseType: !326, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !265, file: !266, line: 78, baseType: !326, size: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !265, file: !266, line: 79, baseType: !332, size: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !335, line: 27, baseType: !336)
!335 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !337, line: 43, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!338 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !265, file: !266, line: 80, baseType: !324, size: 32, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !265, file: !266, line: 81, baseType: !341, size: 32, offset: 992)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !265, file: !266, line: 82, baseType: !343, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !265, file: !266, line: 83, baseType: !347, size: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !265, file: !266, line: 84, baseType: !351, size: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !265, file: !266, line: 85, baseType: !351, size: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !265, file: !266, line: 86, baseType: !351, size: 64, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !265, file: !266, line: 87, baseType: !351, size: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !265, file: !266, line: 88, baseType: !263, size: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !265, file: !266, line: 89, baseType: !332, size: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !266, line: 90, baseType: !351, size: 64, offset: 1536)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !265, file: !266, line: 91, baseType: !351, size: 64, offset: 1600)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !265, file: !266, line: 92, baseType: !324, size: 32, offset: 1664)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !265, file: !266, line: 93, baseType: !361, size: 64, offset: 1728)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !265, file: !266, line: 94, baseType: !363, size: 64, offset: 1792)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !333)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !265, file: !266, line: 95, baseType: !324, size: 32, offset: 1856)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !265, file: !266, line: 95, baseType: !324, size: 32, offset: 1888)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !265, file: !266, line: 96, baseType: !367, size: 64, offset: 1920)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !265, file: !266, line: 96, baseType: !367, size: 64, offset: 1984)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !265, file: !266, line: 97, baseType: !370, size: 64, offset: 2048)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !265, file: !266, line: 97, baseType: !372, size: 64, offset: 2112)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !265, file: !266, line: 98, baseType: !324, size: 32, offset: 2176)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !265, file: !266, line: 98, baseType: !324, size: 32, offset: 2208)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !265, file: !266, line: 99, baseType: !367, size: 64, offset: 2240)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !265, file: !266, line: 99, baseType: !367, size: 64, offset: 2304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !265, file: !266, line: 100, baseType: !378, size: 64, offset: 2368)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !327)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !265, file: !266, line: 100, baseType: !381, size: 64, offset: 2432)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !265, file: !266, line: 101, baseType: !324, size: 32, offset: 2496)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !265, file: !266, line: 101, baseType: !324, size: 32, offset: 2528)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !265, file: !266, line: 102, baseType: !367, size: 64, offset: 2560)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !265, file: !266, line: 102, baseType: !367, size: 64, offset: 2624)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !265, file: !266, line: 103, baseType: !387, size: 64, offset: 2688)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !379)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !265, file: !266, line: 103, baseType: !390, size: 64, offset: 2752)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !265, file: !266, line: 104, baseType: !319, size: 64, offset: 2816)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !265, file: !266, line: 105, baseType: !324, size: 32, offset: 2880)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !265, file: !266, line: 106, baseType: !394, size: 128, offset: 2944)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 128, elements: !401)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !266, line: 64, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 61, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !397, file: !266, line: 62, baseType: !312, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !397, file: !266, line: 63, baseType: !361, size: 64, offset: 64)
!401 = !{!402}
!402 = !DISubrange(count: 2)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !265, file: !266, line: 107, baseType: !404, size: 64, offset: 3072)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 64, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !265, file: !266, line: 108, baseType: !361, size: 64, offset: 3136)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !265, file: !266, line: 109, baseType: !407, size: 64, offset: 3200)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!279, !361}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !265, file: !266, line: 111, baseType: !324, size: 32, offset: 3264)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !265, file: !266, line: 112, baseType: !412, size: 320, offset: 3328)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 320, elements: !455)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!279, !416, !263, !361}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !419)
!419 = !{!420, !421, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !418, file: !12, line: 100, baseType: !324, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !12, line: 101, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !433, !434, !435, !436, !438, !440, !441, !442}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !424, file: !12, line: 84, baseType: !351, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !424, file: !12, line: 85, baseType: !351, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !424, file: !12, line: 86, baseType: !361, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !424, file: !12, line: 87, baseType: !343, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !424, file: !12, line: 88, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !424, file: !12, line: 89, baseType: !303, size: 8, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !424, file: !12, line: 90, baseType: !351, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !424, file: !12, line: 91, baseType: !260, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !424, file: !12, line: 92, baseType: !437, size: 32, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !12, line: 93, baseType: !439, size: 32, offset: 544)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !12, line: 94, baseType: !422, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !424, file: !12, line: 95, baseType: !351, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !424, file: !12, line: 96, baseType: !361, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !418, file: !12, line: 102, baseType: !351, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !418, file: !12, line: 102, baseType: !351, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !418, file: !12, line: 103, baseType: !351, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !418, file: !12, line: 104, baseType: !281, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !418, file: !12, line: 105, baseType: !437, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !418, file: !12, line: 105, baseType: !437, size: 32, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !418, file: !12, line: 105, baseType: !437, size: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !418, file: !12, line: 106, baseType: !263, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !418, file: !12, line: 107, baseType: !452, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!455 = !{!456}
!456 = !DISubrange(count: 5)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !265, file: !266, line: 113, baseType: !458, size: 320, offset: 3648)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 320, elements: !455)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!279, !263, !361}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !265, file: !266, line: 114, baseType: !463, size: 320, offset: 3968)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 320, elements: !455)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !265, file: !266, line: 115, baseType: !437, size: 32, offset: 4288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !265, file: !266, line: 120, baseType: !452, size: 64, offset: 4352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !265, file: !266, line: 121, baseType: !437, size: 32, offset: 4416)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !468, line: 1451, baseType: !312)
!468 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_ADMM", file: !471, line: 39, baseType: !472)
!471 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/constrained/impls/admm/admm.h", directory: "/home/users/ndemeye/xSDK")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 16, size: 8576, elements: !473)
!473 = !{!474, !476, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !778}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !472, file: !471, line: 17, baseType: !475, size: 4480)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !266, line: 122, baseType: !265)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !472, file: !471, line: 17, baseType: !477, size: 384, offset: 4480)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 384, elements: !320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoADMMOps", file: !471, line: 7, size: 384, elements: !479)
!479 = !{!480, !711, !712, !713, !714, !715}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "misfitobjgrad", scope: !478, file: !471, line: 8, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!279, !484, !498, !378, !498, !361}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !487, line: 45, size: 14656, elements: !488)
!487 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!488 = !{!489, !490, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !578, !584, !586, !587, !588, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !663, !664, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !703, !704, !705, !706, !707, !708, !709, !710}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !486, file: !487, line: 46, baseType: !475, size: 4480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !486, file: !487, line: 46, baseType: !491, size: 1536, offset: 4480)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 1536, elements: !320)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !487, line: 13, size: 1536, elements: !493)
!493 = !{!494, !501, !502, !506, !513, !514, !515, !516, !517, !518, !519, !523, !527, !528, !529, !530, !534, !538, !539, !543, !547, !548, !552, !556}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !492, file: !487, line: 15, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!279, !484, !498, !378, !361}
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !240, line: 21, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !240, line: 21, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !492, file: !487, line: 16, baseType: !481, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !492, file: !487, line: 17, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!279, !484, !498, !498, !361}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !492, file: !487, line: 18, baseType: !507, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!279, !484, !498, !510, !510, !361}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !91, line: 16, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !91, line: 16, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !492, file: !487, line: 19, baseType: !503, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !492, file: !487, line: 20, baseType: !507, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !492, file: !487, line: 21, baseType: !503, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !492, file: !487, line: 22, baseType: !503, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !492, file: !487, line: 23, baseType: !503, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !492, file: !487, line: 24, baseType: !507, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !492, file: !487, line: 25, baseType: !520, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!279, !484, !498, !510, !510, !510, !361}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !492, file: !487, line: 26, baseType: !524, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!279, !484, !498, !510, !361}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !492, file: !487, line: 27, baseType: !507, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !492, file: !487, line: 28, baseType: !507, size: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !492, file: !487, line: 29, baseType: !503, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !492, file: !487, line: 30, baseType: !531, size: 64, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!279, !484, !324, !361}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !492, file: !487, line: 31, baseType: !535, size: 64, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!279, !484, !361}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !492, file: !487, line: 32, baseType: !407, size: 64, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !492, file: !487, line: 35, baseType: !540, size: 64, offset: 1152)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!279, !484, !498, !498}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !492, file: !487, line: 36, baseType: !544, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!279, !484}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !492, file: !487, line: 37, baseType: !544, size: 64, offset: 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !492, file: !487, line: 38, baseType: !549, size: 64, offset: 1344)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!279, !484, !288}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !492, file: !487, line: 39, baseType: !553, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!279, !416, !484}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !492, file: !487, line: 40, baseType: !544, size: 64, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !486, file: !487, line: 47, baseType: !361, size: 64, offset: 6016)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !486, file: !487, line: 48, baseType: !361, size: 64, offset: 6080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !486, file: !487, line: 49, baseType: !361, size: 64, offset: 6144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !486, file: !487, line: 50, baseType: !361, size: 64, offset: 6208)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !486, file: !487, line: 51, baseType: !361, size: 64, offset: 6272)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !486, file: !487, line: 52, baseType: !361, size: 64, offset: 6336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !486, file: !487, line: 53, baseType: !361, size: 64, offset: 6400)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !486, file: !487, line: 54, baseType: !361, size: 64, offset: 6464)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !486, file: !487, line: 55, baseType: !361, size: 64, offset: 6528)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !486, file: !487, line: 56, baseType: !361, size: 64, offset: 6592)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !486, file: !487, line: 57, baseType: !361, size: 64, offset: 6656)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !486, file: !487, line: 58, baseType: !361, size: 64, offset: 6720)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !486, file: !487, line: 59, baseType: !361, size: 64, offset: 6784)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !486, file: !487, line: 60, baseType: !361, size: 64, offset: 6848)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !486, file: !487, line: 61, baseType: !361, size: 64, offset: 6912)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !486, file: !487, line: 62, baseType: !361, size: 64, offset: 6976)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !486, file: !487, line: 63, baseType: !361, size: 64, offset: 7040)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !486, file: !487, line: 65, baseType: !575, size: 640, offset: 7104)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 640, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 10)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !486, file: !487, line: 66, baseType: !579, size: 640, offset: 7744)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 640, elements: !576)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!279, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !486, file: !487, line: 67, baseType: !585, size: 640, offset: 8384)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 640, elements: !576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !486, file: !487, line: 68, baseType: !324, size: 32, offset: 9024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !486, file: !487, line: 69, baseType: !361, size: 64, offset: 9088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !486, file: !487, line: 70, baseType: !589, size: 32, offset: 9152)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !486, file: !487, line: 72, baseType: !437, size: 32, offset: 9184)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !487, line: 73, baseType: !361, size: 64, offset: 9216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !486, file: !487, line: 75, baseType: !498, size: 64, offset: 9280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !486, file: !487, line: 76, baseType: !498, size: 64, offset: 9344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !486, file: !487, line: 77, baseType: !498, size: 64, offset: 9408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !486, file: !487, line: 78, baseType: !498, size: 64, offset: 9472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !486, file: !487, line: 79, baseType: !498, size: 64, offset: 9536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !486, file: !487, line: 80, baseType: !498, size: 64, offset: 9600)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !486, file: !487, line: 81, baseType: !498, size: 64, offset: 9664)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !486, file: !487, line: 82, baseType: !498, size: 64, offset: 9728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !486, file: !487, line: 83, baseType: !498, size: 64, offset: 9792)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !486, file: !487, line: 84, baseType: !510, size: 64, offset: 9856)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !486, file: !487, line: 85, baseType: !510, size: 64, offset: 9920)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !486, file: !487, line: 86, baseType: !510, size: 64, offset: 9984)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !486, file: !487, line: 87, baseType: !498, size: 64, offset: 10048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !486, file: !487, line: 88, baseType: !498, size: 64, offset: 10112)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !486, file: !487, line: 89, baseType: !510, size: 64, offset: 10176)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !486, file: !487, line: 90, baseType: !510, size: 64, offset: 10240)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !486, file: !487, line: 91, baseType: !498, size: 64, offset: 10304)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !486, file: !487, line: 92, baseType: !324, size: 32, offset: 10368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !486, file: !487, line: 93, baseType: !370, size: 64, offset: 10432)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !486, file: !487, line: 94, baseType: !370, size: 64, offset: 10496)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !486, file: !487, line: 95, baseType: !378, size: 64, offset: 10560)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !486, file: !487, line: 96, baseType: !498, size: 64, offset: 10624)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !486, file: !487, line: 97, baseType: !498, size: 64, offset: 10688)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !486, file: !487, line: 98, baseType: !498, size: 64, offset: 10752)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !486, file: !487, line: 99, baseType: !510, size: 64, offset: 10816)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !486, file: !487, line: 100, baseType: !510, size: 64, offset: 10880)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !486, file: !487, line: 101, baseType: !510, size: 64, offset: 10944)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !486, file: !487, line: 102, baseType: !510, size: 64, offset: 11008)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !486, file: !487, line: 103, baseType: !510, size: 64, offset: 11072)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !486, file: !487, line: 104, baseType: !510, size: 64, offset: 11136)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !486, file: !487, line: 105, baseType: !510, size: 64, offset: 11200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !486, file: !487, line: 106, baseType: !510, size: 64, offset: 11264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !486, file: !487, line: 107, baseType: !510, size: 64, offset: 11328)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !486, file: !487, line: 108, baseType: !510, size: 64, offset: 11392)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !486, file: !487, line: 109, baseType: !510, size: 64, offset: 11456)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !486, file: !487, line: 110, baseType: !628, size: 64, offset: 11520)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !629, line: 11, baseType: !630)
!629 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !629, line: 11, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !486, file: !487, line: 111, baseType: !628, size: 64, offset: 11584)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !486, file: !487, line: 112, baseType: !379, size: 64, offset: 11648)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !486, file: !487, line: 113, baseType: !379, size: 64, offset: 11712)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !486, file: !487, line: 114, baseType: !379, size: 64, offset: 11776)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !486, file: !487, line: 115, baseType: !379, size: 64, offset: 11840)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !486, file: !487, line: 116, baseType: !379, size: 64, offset: 11904)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !486, file: !487, line: 117, baseType: !379, size: 64, offset: 11968)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !486, file: !487, line: 119, baseType: !324, size: 32, offset: 12032)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !486, file: !487, line: 120, baseType: !324, size: 32, offset: 12064)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !486, file: !487, line: 121, baseType: !324, size: 32, offset: 12096)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !486, file: !487, line: 122, baseType: !324, size: 32, offset: 12128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !486, file: !487, line: 123, baseType: !324, size: 32, offset: 12160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !486, file: !487, line: 124, baseType: !324, size: 32, offset: 12192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !486, file: !487, line: 125, baseType: !324, size: 32, offset: 12224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !486, file: !487, line: 126, baseType: !324, size: 32, offset: 12256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !486, file: !487, line: 127, baseType: !324, size: 32, offset: 12288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !486, file: !487, line: 128, baseType: !324, size: 32, offset: 12320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !486, file: !487, line: 129, baseType: !324, size: 32, offset: 12352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !486, file: !487, line: 130, baseType: !324, size: 32, offset: 12384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !486, file: !487, line: 131, baseType: !324, size: 32, offset: 12416)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !486, file: !487, line: 132, baseType: !324, size: 32, offset: 12448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !486, file: !487, line: 133, baseType: !324, size: 32, offset: 12480)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !486, file: !487, line: 134, baseType: !324, size: 32, offset: 12512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !486, file: !487, line: 135, baseType: !324, size: 32, offset: 12544)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !486, file: !487, line: 137, baseType: !324, size: 32, offset: 12576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !486, file: !487, line: 138, baseType: !324, size: 32, offset: 12608)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !486, file: !487, line: 140, baseType: !659, size: 64, offset: 12672)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !660, line: 5, baseType: !661)
!660 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !660, line: 5, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !486, file: !487, line: 141, baseType: !437, size: 32, offset: 12736)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !486, file: !487, line: 142, baseType: !665, size: 64, offset: 12800)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !666, line: 22, baseType: !667)
!666 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !666, line: 22, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !486, file: !487, line: 143, baseType: !379, size: 64, offset: 12864)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !486, file: !487, line: 144, baseType: !379, size: 64, offset: 12928)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !486, file: !487, line: 146, baseType: !379, size: 64, offset: 12992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !486, file: !487, line: 147, baseType: !379, size: 64, offset: 13056)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !486, file: !487, line: 148, baseType: !379, size: 64, offset: 13120)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !486, file: !487, line: 149, baseType: !379, size: 64, offset: 13184)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !486, file: !487, line: 150, baseType: !379, size: 64, offset: 13248)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !486, file: !487, line: 151, baseType: !379, size: 64, offset: 13312)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !486, file: !487, line: 152, baseType: !379, size: 64, offset: 13376)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !486, file: !487, line: 153, baseType: !437, size: 32, offset: 13440)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !486, file: !487, line: 154, baseType: !437, size: 32, offset: 13472)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !486, file: !487, line: 155, baseType: !437, size: 32, offset: 13504)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !486, file: !487, line: 156, baseType: !437, size: 32, offset: 13536)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !486, file: !487, line: 157, baseType: !437, size: 32, offset: 13568)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !486, file: !487, line: 158, baseType: !437, size: 32, offset: 13600)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !486, file: !487, line: 159, baseType: !437, size: 32, offset: 13632)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !486, file: !487, line: 160, baseType: !437, size: 32, offset: 13664)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !486, file: !487, line: 161, baseType: !437, size: 32, offset: 13696)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !486, file: !487, line: 162, baseType: !437, size: 32, offset: 13728)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !486, file: !487, line: 163, baseType: !437, size: 32, offset: 13760)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !486, file: !487, line: 164, baseType: !437, size: 32, offset: 13792)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !486, file: !487, line: 165, baseType: !437, size: 32, offset: 13824)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !486, file: !487, line: 166, baseType: !437, size: 32, offset: 13856)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !486, file: !487, line: 167, baseType: !437, size: 32, offset: 13888)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !486, file: !487, line: 168, baseType: !437, size: 32, offset: 13920)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !486, file: !487, line: 169, baseType: !437, size: 32, offset: 13952)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !486, file: !487, line: 170, baseType: !437, size: 32, offset: 13984)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !486, file: !487, line: 171, baseType: !437, size: 32, offset: 14016)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !486, file: !487, line: 172, baseType: !437, size: 32, offset: 14048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !486, file: !487, line: 173, baseType: !437, size: 32, offset: 14080)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !486, file: !487, line: 174, baseType: !437, size: 32, offset: 14112)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !486, file: !487, line: 175, baseType: !437, size: 32, offset: 14144)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !486, file: !487, line: 177, baseType: !702, size: 32, offset: 14176)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !486, file: !487, line: 178, baseType: !324, size: 32, offset: 14208)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !486, file: !487, line: 179, baseType: !378, size: 64, offset: 14272)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !486, file: !487, line: 180, baseType: !378, size: 64, offset: 14336)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !486, file: !487, line: 181, baseType: !378, size: 64, offset: 14400)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !486, file: !487, line: 182, baseType: !370, size: 64, offset: 14464)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !486, file: !487, line: 183, baseType: !324, size: 32, offset: 14528)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !486, file: !487, line: 184, baseType: !437, size: 32, offset: 14560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !486, file: !487, line: 185, baseType: !437, size: 32, offset: 14592)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "misfithess", scope: !478, file: !471, line: 9, baseType: !507, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "misfitjac", scope: !478, file: !471, line: 10, baseType: !507, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "regobjgrad", scope: !478, file: !471, line: 11, baseType: !481, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reghess", scope: !478, file: !471, line: 12, baseType: !507, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "regjac", scope: !478, file: !471, line: 13, baseType: !507, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "subsolverX", scope: !472, file: !471, line: 18, baseType: !484, size: 64, offset: 4864)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "subsolverZ", scope: !472, file: !471, line: 18, baseType: !484, size: 64, offset: 4928)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !472, file: !471, line: 18, baseType: !484, size: 64, offset: 4992)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5056)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5120)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "yold", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5184)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5248)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "yhat", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5312)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "yhatold", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5376)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !472, file: !471, line: 19, baseType: !498, size: 64, offset: 5440)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5504)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "zold", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5568)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Ax", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5632)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Bz", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5696)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Axold", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5760)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Bzold", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Bz0", scope: !472, file: !471, line: 20, baseType: !498, size: 64, offset: 5888)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "workLeft", scope: !472, file: !471, line: 21, baseType: !498, size: 64, offset: 5952)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "workJacobianRight", scope: !472, file: !471, line: 21, baseType: !498, size: 64, offset: 6016)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "workJacobianRight2", scope: !472, file: !471, line: 21, baseType: !498, size: 64, offset: 6080)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Hx", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Hxpre", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6208)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Hz", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6272)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Hzpre", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6336)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ATA", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6400)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "BTB", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6464)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "JA", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6528)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "JApre", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6592)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "JB", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6656)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "JBpre", scope: !472, file: !471, line: 22, baseType: !510, size: 64, offset: 6720)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "regobjgradP", scope: !472, file: !471, line: 23, baseType: !361, size: 64, offset: 6784)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reghessP", scope: !472, file: !471, line: 24, baseType: !361, size: 64, offset: 6848)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "regjacobianP", scope: !472, file: !471, line: 25, baseType: !361, size: 64, offset: 6912)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "misfitobjgradP", scope: !472, file: !471, line: 26, baseType: !361, size: 64, offset: 6976)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "misfithessP", scope: !472, file: !471, line: 27, baseType: !361, size: 64, offset: 7040)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "misfitjacobianP", scope: !472, file: !471, line: 28, baseType: !361, size: 64, offset: 7104)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !472, file: !471, line: 29, baseType: !379, size: 64, offset: 7168)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "last_misfit_val", scope: !472, file: !471, line: 29, baseType: !379, size: 64, offset: 7232)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "last_reg_val", scope: !472, file: !471, line: 29, baseType: !379, size: 64, offset: 7296)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "l1epsilon", scope: !472, file: !471, line: 29, baseType: !379, size: 64, offset: 7360)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7424)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7488)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "muold", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7552)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "orthval", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7616)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mueps", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7680)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7744)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mumin", scope: !472, file: !471, line: 30, baseType: !379, size: 64, offset: 7808)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Bzdiffnorm", scope: !472, file: !471, line: 31, baseType: !379, size: 64, offset: 7872)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "dualres", scope: !472, file: !471, line: 31, baseType: !379, size: 64, offset: 7936)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "resnorm", scope: !472, file: !471, line: 31, baseType: !379, size: 64, offset: 8000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "const_norm", scope: !472, file: !471, line: 31, baseType: !379, size: 64, offset: 8064)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_admm", scope: !472, file: !471, line: 32, baseType: !379, size: 64, offset: 8128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "catol_admm", scope: !472, file: !471, line: 32, baseType: !379, size: 64, offset: 8192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !472, file: !471, line: 33, baseType: !324, size: 32, offset: 8256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "xJI", scope: !472, file: !471, line: 34, baseType: !437, size: 32, offset: 8288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "zJI", scope: !472, file: !471, line: 34, baseType: !437, size: 32, offset: 8320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Hxchange", scope: !472, file: !471, line: 35, baseType: !437, size: 32, offset: 8352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Hzchange", scope: !472, file: !471, line: 35, baseType: !437, size: 32, offset: 8384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Hxbool", scope: !472, file: !471, line: 36, baseType: !437, size: 32, offset: 8416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Hzbool", scope: !472, file: !471, line: 36, baseType: !437, size: 32, offset: 8448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !472, file: !471, line: 37, baseType: !777, size: 32, offset: 8480)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoADMMUpdateType", file: !27, line: 43, baseType: !48)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "regswitch", scope: !472, file: !471, line: 38, baseType: !779, size: 32, offset: 8512)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoADMMRegularizerType", file: !27, line: 82, baseType: !53)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !84, line: 331, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !84, line: 331, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !84, line: 338, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !84, line: 338, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !236)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!789 = !{!0, !790}
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "cited", scope: !2, file: !792, line: 13, type: !437, isLocal: true, isDefinition: true)
!792 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/admm/admm.c", directory: "/home/users/ndemeye/xSDK")
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 2448, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 306)
!796 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!797 = !{i32 7, !"Dwarf Version", i32 4}
!798 = !{i32 2, !"Debug Info Version", i32 3}
!799 = !{i32 1, !"wchar_size", i32 4}
!800 = !{i32 7, !"PIC Level", i32 2}
!801 = !{i32 7, !"uwtable", i32 1}
!802 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!803 = distinct !DISubprogram(name: "TaoCreate_ADMM", scope: !792, file: !792, line: 768, type: !545, scopeLine: 769, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !804)
!804 = !{!805, !806, !807, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !836}
!805 = !DILocalVariable(name: "tao", arg: 1, scope: !803, file: !792, line: 768, type: !484)
!806 = !DILocalVariable(name: "am", scope: !803, file: !792, line: 770, type: !469)
!807 = !DILocalVariable(name: "ierr", scope: !803, file: !792, line: 771, type: !279)
!808 = !DILocalVariable(name: "ierr__", scope: !809, file: !792, line: 774, type: !279)
!809 = distinct !DILexicalBlock(scope: !803, file: !792, line: 774, column: 31)
!810 = !DILocalVariable(name: "ierr__", scope: !811, file: !792, line: 810, type: !279)
!811 = distinct !DILexicalBlock(scope: !803, file: !792, line: 810, column: 71)
!812 = !DILocalVariable(name: "ierr__", scope: !813, file: !792, line: 811, type: !279)
!813 = distinct !DILexicalBlock(scope: !803, file: !792, line: 811, column: 56)
!814 = !DILocalVariable(name: "ierr__", scope: !815, file: !792, line: 812, type: !279)
!815 = distinct !DILexicalBlock(scope: !803, file: !792, line: 812, column: 87)
!816 = !DILocalVariable(name: "ierr__", scope: !817, file: !792, line: 813, type: !279)
!817 = distinct !DILexicalBlock(scope: !803, file: !792, line: 813, column: 71)
!818 = !DILocalVariable(name: "ierr__", scope: !819, file: !792, line: 814, type: !279)
!819 = distinct !DILexicalBlock(scope: !803, file: !792, line: 814, column: 53)
!820 = !DILocalVariable(name: "ierr__", scope: !821, file: !792, line: 815, type: !279)
!821 = distinct !DILexicalBlock(scope: !803, file: !792, line: 815, column: 87)
!822 = !DILocalVariable(name: "ierr__", scope: !823, file: !792, line: 817, type: !279)
!823 = distinct !DILexicalBlock(scope: !803, file: !792, line: 817, column: 44)
