; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtweakform.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtweakform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!85 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!127 = !{!128, !131, !135, !136, !140, !141, !142, !145, !308, !342, !343, !344, !357, !361, !364, !365, !224, !362, !366, !367, !368, !376, !197}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !132, line: 330, baseType: !133)
!132 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !132, line: 330, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, null}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !148, line: 73, size: 4480, elements: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!149 = !{!150, !153, !195, !196, !198, !201, !202, !203, !204, !212, !213, !215, !219, !223, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !236, !237, !238, !240, !241, !243, !245, !246, !247, !248, !249, !252, !254, !255, !256, !257, !258, !261, !263, !264, !265, !275, !277, !278, !282, !283, !332, !337, !339, !340, !341}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !147, file: !148, line: 74, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !152)
!152 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !147, file: !148, line: 75, baseType: !154, size: 448, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 448, elements: !193)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !148, line: 53, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 45, size: 448, elements: !157)
!157 = !{!158, !164, !172, !177, !181, !185, !189}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !156, file: !148, line: 46, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !145, !163}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !152)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !156, file: !148, line: 47, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!162, !145, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !169, line: 16, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !169, line: 16, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !156, file: !148, line: 48, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!162, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !156, file: !148, line: 49, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!162, !145, !128, !145}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !156, file: !148, line: 50, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!162, !145, !128, !176}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !156, file: !148, line: 51, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!162, !145, !128, !142}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !156, file: !148, line: 52, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!162, !145, !128, !141}
!193 = !{!194}
!194 = !DISubrange(count: 1)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !147, file: !148, line: 76, baseType: !131, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 77, baseType: !197, size: 32, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !147, file: !148, line: 78, baseType: !199, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !200)
!200 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !147, file: !148, line: 78, baseType: !199, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !147, file: !148, line: 78, baseType: !199, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !147, file: !148, line: 78, baseType: !199, size: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !148, line: 79, baseType: !205, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !208, line: 27, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !210, line: 43, baseType: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!211 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !147, file: !148, line: 80, baseType: !197, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !148, line: 81, baseType: !214, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !152)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !147, file: !148, line: 82, baseType: !216, size: 64, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !147, file: !148, line: 83, baseType: !220, size: 64, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !148, line: 84, baseType: !224, size: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !147, file: !148, line: 85, baseType: !224, size: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !147, file: !148, line: 86, baseType: !224, size: 64, offset: 1280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !147, file: !148, line: 87, baseType: !224, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 88, baseType: !145, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !147, file: !148, line: 89, baseType: !205, size: 64, offset: 1472)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 90, baseType: !224, size: 64, offset: 1536)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !147, file: !148, line: 91, baseType: !224, size: 64, offset: 1600)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !147, file: !148, line: 92, baseType: !197, size: 32, offset: 1664)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !147, file: !148, line: 93, baseType: !135, size: 64, offset: 1728)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 94, baseType: !235, size: 64, offset: 1792)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !206)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !147, file: !148, line: 95, baseType: !197, size: 32, offset: 1856)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !147, file: !148, line: 95, baseType: !197, size: 32, offset: 1888)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !147, file: !148, line: 96, baseType: !239, size: 64, offset: 1920)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !147, file: !148, line: 96, baseType: !239, size: 64, offset: 1984)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !147, file: !148, line: 97, baseType: !242, size: 64, offset: 2048)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !147, file: !148, line: 97, baseType: !244, size: 64, offset: 2112)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !147, file: !148, line: 98, baseType: !197, size: 32, offset: 2176)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !147, file: !148, line: 98, baseType: !197, size: 32, offset: 2208)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !147, file: !148, line: 99, baseType: !239, size: 64, offset: 2240)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !147, file: !148, line: 99, baseType: !239, size: 64, offset: 2304)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !147, file: !148, line: 100, baseType: !250, size: 64, offset: 2368)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !200)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !147, file: !148, line: 100, baseType: !253, size: 64, offset: 2432)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !147, file: !148, line: 101, baseType: !197, size: 32, offset: 2496)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !147, file: !148, line: 101, baseType: !197, size: 32, offset: 2528)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !147, file: !148, line: 102, baseType: !239, size: 64, offset: 2560)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !147, file: !148, line: 102, baseType: !239, size: 64, offset: 2624)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !147, file: !148, line: 103, baseType: !259, size: 64, offset: 2688)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !251)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !147, file: !148, line: 103, baseType: !262, size: 64, offset: 2752)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !147, file: !148, line: 104, baseType: !141, size: 64, offset: 2816)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !147, file: !148, line: 105, baseType: !197, size: 32, offset: 2880)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !147, file: !148, line: 106, baseType: !266, size: 128, offset: 2944)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !273)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !148, line: 64, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 61, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !269, file: !148, line: 62, baseType: !142, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !269, file: !148, line: 63, baseType: !135, size: 64, offset: 64)
!273 = !{!274}
!274 = !DISubrange(count: 2)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !147, file: !148, line: 107, baseType: !276, size: 64, offset: 3072)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !273)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !147, file: !148, line: 108, baseType: !135, size: 64, offset: 3136)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !147, file: !148, line: 109, baseType: !279, size: 64, offset: 3200)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!162, !135}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !147, file: !148, line: 111, baseType: !197, size: 32, offset: 3264)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !147, file: !148, line: 112, baseType: !284, size: 320, offset: 3328)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 320, elements: !330)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!162, !288, !145, !135}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !38, line: 108, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !38, line: 99, size: 640, elements: !291)
!291 = !{!292, !293, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !290, file: !38, line: 100, baseType: !197, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !38, line: 101, baseType: !294, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !38, line: 82, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !38, line: 83, size: 768, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !305, !306, !307, !311, !313, !315, !316, !317}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !296, file: !38, line: 84, baseType: !224, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !296, file: !38, line: 85, baseType: !224, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !38, line: 86, baseType: !135, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !296, file: !38, line: 87, baseType: !216, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !296, file: !38, line: 88, baseType: !303, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !296, file: !38, line: 89, baseType: !130, size: 8, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !296, file: !38, line: 90, baseType: !224, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !296, file: !38, line: 91, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !309, line: 46, baseType: !310)
!309 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!310 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !296, file: !38, line: 92, baseType: !312, size: 32, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !33)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !38, line: 93, baseType: !314, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !38, line: 81, baseType: !37)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !38, line: 94, baseType: !294, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !296, file: !38, line: 95, baseType: !224, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !296, file: !38, line: 96, baseType: !135, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !290, file: !38, line: 102, baseType: !224, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !290, file: !38, line: 102, baseType: !224, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !290, file: !38, line: 103, baseType: !224, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !290, file: !38, line: 104, baseType: !131, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !290, file: !38, line: 105, baseType: !312, size: 32, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !290, file: !38, line: 105, baseType: !312, size: 32, offset: 416)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !290, file: !38, line: 105, baseType: !312, size: 32, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !290, file: !38, line: 106, baseType: !145, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !290, file: !38, line: 107, baseType: !327, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !38, line: 10, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !38, line: 10, flags: DIFlagFwdDecl)
!330 = !{!331}
!331 = !DISubrange(count: 5)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !147, file: !148, line: 113, baseType: !333, size: 320, offset: 3648)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !330)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!162, !145, !135}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !147, file: !148, line: 114, baseType: !338, size: 320, offset: 3968)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 320, elements: !330)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !147, file: !148, line: 115, baseType: !312, size: 32, offset: 4288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !147, file: !148, line: 120, baseType: !327, size: 64, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !147, file: !148, line: 121, baseType: !312, size: 32, offset: 4416)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !148, line: 130, baseType: !173)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !148, line: 131, baseType: !165)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !53, line: 41, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !53, line: 35, size: 192, elements: !348)
!348 = !{!349, !354, !355, !356}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !347, file: !53, line: 37, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !351, line: 12, baseType: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !351, line: 12, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !53, line: 38, baseType: !197, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !347, file: !53, line: 39, baseType: !197, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !347, file: !53, line: 40, baseType: !197, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHash64_t", file: !358, line: 124, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashtable.h", directory: "/home/users/ndemeye/xSDK")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint64_t", file: !360, line: 145, baseType: !310)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHash_t", file: !358, line: 125, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !360, line: 166, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !360, line: 139, baseType: !7)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHash32_t", file: !358, line: 123, baseType: !363)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !370, line: 34, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 30, size: 96, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !371, file: !370, line: 31, baseType: !197, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !370, line: 32, baseType: !197, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !371, file: !370, line: 33, baseType: !197, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !370, line: 54, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !370, line: 54, size: 320, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !378, file: !370, line: 54, baseType: !362, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !370, line: 54, baseType: !362, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !378, file: !370, line: 54, baseType: !362, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !378, file: !370, line: 54, baseType: !362, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !378, file: !370, line: 54, baseType: !366, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !378, file: !370, line: 54, baseType: !367, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !378, file: !370, line: 54, baseType: !368, size: 64, offset: 256)
!387 = !{!0, !388, !394, !396}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "PetscWeakFormKinds", scope: !2, file: !390, line: 5, type: !391, isLocal: false, isDefinition: true)
!390 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtweakform.c", directory: "/home/users/ndemeye/xSDK")
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 1856, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 29)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "_PetscInvalidChunk", scope: !2, file: !370, line: 52, type: !369, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_constu, 4605110762971426980, DW_OP_stack_value))
!397 = distinct !DIGlobalVariable(name: "__ac_HASH_UPPER", scope: !2, file: !360, line: 196, type: !398, isLocal: true, isDefinition: true)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!399 = !{i32 7, !"Dwarf Version", i32 4}
!400 = !{i32 2, !"Debug Info Version", i32 3}
!401 = !{i32 1, !"wchar_size", i32 4}
!402 = !{i32 7, !"PIC Level", i32 2}
!403 = !{i32 7, !"uwtable", i32 1}
!404 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!405 = distinct !DISubprogram(name: "PetscFormKeySort", scope: !390, file: !390, line: 101, type: !406, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!162, !197, !367}
!408 = !{!409, !410, !411, !412}
!409 = !DILocalVariable(name: "n", arg: 1, scope: !405, file: !390, line: 101, type: !197)
!410 = !DILocalVariable(name: "arr", arg: 2, scope: !405, file: !390, line: 101, type: !367)
!411 = !DILocalVariable(name: "ierr", scope: !405, file: !390, line: 103, type: !162)
!412 = !DILocalVariable(name: "ierr__", scope: !413, file: !390, line: 108, type: !162)
!413 = distinct !DILexicalBlock(scope: !405, file: !390, line: 108, column: 89)
!414 = !DILocation(line: 0, scope: !405)
!415 = !DILocation(line: 105, column: 3, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !390, line: 105, column: 3)
!417 = distinct !DILexicalBlock(scope: !418, file: !390, line: 105, column: 3)
!418 = distinct !DILexicalBlock(scope: !405, file: !390, line: 105, column: 3)
!419 = !{!420, !420, i64 0}
!420 = !{!"any pointer", !421, i64 0}
!421 = !{!"omnipotent char", !422, i64 0}
!422 = !{!"Simple C/C++ TBAA"}
!423 = !DILocation(line: 105, column: 3, scope: !417)
!424 = !DILocation(line: 105, column: 3, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !390, line: 105, column: 3)
!426 = distinct !DILexicalBlock(scope: !416, file: !390, line: 105, column: 3)
!427 = !{!428, !429, i64 1536}
!428 = !{!"", !421, i64 0, !421, i64 512, !421, i64 1024, !421, i64 1280, !429, i64 1536, !429, i64 1540, !421, i64 1544}
!429 = !{!"int", !421, i64 0}
!430 = !DILocation(line: 105, column: 3, scope: !426)
!431 = !DILocation(line: 105, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !425, file: !390, line: 105, column: 3)
!433 = !{!429, !429, i64 0}
!434 = !{!428, !429, i64 1540}
!435 = !DILocation(line: 106, column: 9, scope: !436)
!436 = distinct !DILexicalBlock(scope: !405, file: !390, line: 106, column: 7)
!437 = !DILocation(line: 106, column: 7, scope: !405)
!438 = !DILocation(line: 106, column: 15, scope: !439)
!439 = distinct !DILexicalBlock(scope: !440, file: !390, line: 106, column: 15)
!440 = distinct !DILexicalBlock(scope: !441, file: !390, line: 106, column: 15)
!441 = distinct !DILexicalBlock(scope: !442, file: !390, line: 106, column: 15)
!442 = distinct !DILexicalBlock(scope: !443, file: !390, line: 106, column: 15)
!443 = distinct !DILexicalBlock(scope: !436, file: !390, line: 106, column: 15)
!444 = !DILocation(line: 106, column: 15, scope: !440)
!445 = !DILocation(line: 106, column: 15, scope: !446)
!446 = distinct !DILexicalBlock(scope: !447, file: !390, line: 106, column: 15)
!447 = distinct !DILexicalBlock(scope: !439, file: !390, line: 106, column: 15)
!448 = !{!428, !421, i64 1544}
!449 = !DILocation(line: 106, column: 15, scope: !447)
!450 = !DILocation(line: 106, column: 15, scope: !451)
!451 = distinct !DILexicalBlock(scope: !446, file: !390, line: 106, column: 15)
!452 = !DILocation(line: 106, column: 15, scope: !453)
!453 = distinct !DILexicalBlock(scope: !439, file: !390, line: 106, column: 15)
!454 = !DILocation(line: 106, column: 15, scope: !455)
!455 = distinct !DILexicalBlock(scope: !453, file: !390, line: 106, column: 15)
!456 = !DILocation(line: 106, column: 15, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !390, line: 106, column: 15)
!458 = distinct !DILexicalBlock(scope: !455, file: !390, line: 106, column: 15)
!459 = !DILocation(line: 106, column: 15, scope: !458)
!460 = !DILocation(line: 106, column: 15, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !390, line: 106, column: 15)
!462 = !DILocation(line: 107, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !390, line: 107, column: 3)
!464 = distinct !DILexicalBlock(scope: !405, file: !390, line: 107, column: 3)
!465 = !DILocation(line: 107, column: 3, scope: !464)
!466 = !DILocation(line: 107, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !464, file: !390, line: 107, column: 3)
!468 = !DILocation(line: 108, column: 10, scope: !405)
!469 = !DILocation(line: 0, scope: !413)
!470 = !DILocation(line: 108, column: 89, scope: !471)
!471 = distinct !DILexicalBlock(scope: !413, file: !390, line: 108, column: 89)
!472 = !DILocation(line: 108, column: 89, scope: !413)
!473 = !{!"branch_weights", i32 2000, i32 1}
!474 = !DILocation(line: 109, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !390, line: 109, column: 3)
!476 = distinct !DILexicalBlock(scope: !477, file: !390, line: 109, column: 3)
!477 = distinct !DILexicalBlock(scope: !405, file: !390, line: 109, column: 3)
!478 = !DILocation(line: 109, column: 3, scope: !476)
!479 = !DILocation(line: 109, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !390, line: 109, column: 3)
!481 = distinct !DILexicalBlock(scope: !475, file: !390, line: 109, column: 3)
!482 = !DILocation(line: 109, column: 3, scope: !481)
!483 = !DILocation(line: 109, column: 3, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !390, line: 109, column: 3)
!485 = distinct !DILexicalBlock(scope: !480, file: !390, line: 109, column: 3)
!486 = !DILocation(line: 109, column: 3, scope: !485)
!487 = !DILocation(line: 109, column: 3, scope: !488)
!488 = distinct !DILexicalBlock(scope: !484, file: !390, line: 109, column: 3)
!489 = !DILocation(line: 109, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !480, file: !390, line: 109, column: 3)
!491 = !DILocation(line: 109, column: 3, scope: !492)
!492 = distinct !DILexicalBlock(scope: !490, file: !390, line: 109, column: 3)
!493 = !DILocation(line: 109, column: 3, scope: !494)
!494 = distinct !DILexicalBlock(scope: !495, file: !390, line: 109, column: 3)
!495 = distinct !DILexicalBlock(scope: !492, file: !390, line: 109, column: 3)
!496 = !DILocation(line: 109, column: 3, scope: !495)
!497 = !DILocation(line: 109, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !390, line: 109, column: 3)
!499 = !DILocation(line: 110, column: 1, scope: !405)
!500 = !DISubprogram(name: "PetscError", scope: !6, file: !6, line: 668, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!501 = !DISubroutineType(types: !502)
!502 = !{!162, !133, !152, !128, !128, !152, !5, !128, null}
!503 = !{}
!504 = !DISubprogram(name: "PetscCheckPointer", scope: !148, file: !148, line: 183, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!505 = !DISubroutineType(types: !506)
!506 = !{!33, !507, !12}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!509 = !DISubprogram(name: "PetscTimSort", scope: !510, file: !510, line: 2528, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !503)
!510 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!511 = !DISubroutineType(types: !512)
!512 = !{!152, !152, !135, !310, !513, !135}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!152, !507, !507, !135}
!516 = distinct !DISubprogram(name: "Compare_PetscFormKey_Private", scope: !370, file: !370, line: 63, type: !514, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !517)
!517 = !{!518, !519, !520, !521, !522}
!518 = !DILocalVariable(name: "left", arg: 1, scope: !516, file: !370, line: 63, type: !507)
!519 = !DILocalVariable(name: "right", arg: 2, scope: !516, file: !370, line: 63, type: !507)
!520 = !DILocalVariable(name: "ctx", arg: 3, scope: !516, file: !370, line: 63, type: !135)
!521 = !DILocalVariable(name: "l", scope: !516, file: !370, line: 65, type: !346)
!522 = !DILocalVariable(name: "r", scope: !516, file: !370, line: 66, type: !346)
!523 = !DILocation(line: 0, scope: !516)
!524 = !DILocation(line: 65, column: 20, scope: !516)
!525 = !{i64 0, i64 8, !419, i64 8, i64 4, !433, i64 12, i64 4, !433, i64 16, i64 4, !433}
!526 = !{i64 0, i64 4, !433, i64 4, i64 4, !433, i64 8, i64 4, !433}
!527 = !{i64 0, i64 4, !433, i64 4, i64 4, !433}
!528 = !{i64 0, i64 4, !433}
!529 = !DILocation(line: 66, column: 20, scope: !516)
!530 = !DILocation(line: 67, column: 19, scope: !516)
!531 = !DILocation(line: 67, column: 10, scope: !516)
!532 = !DILocation(line: 67, column: 47, scope: !516)
!533 = !DILocation(line: 67, column: 38, scope: !516)
!534 = !DILocation(line: 68, column: 22, scope: !516)
!535 = !DILocation(line: 68, column: 13, scope: !516)
!536 = !DILocation(line: 68, column: 49, scope: !516)
!537 = !DILocation(line: 68, column: 40, scope: !516)
!538 = !DILocation(line: 69, column: 24, scope: !516)
!539 = !DILocation(line: 69, column: 15, scope: !516)
!540 = !DILocation(line: 69, column: 51, scope: !516)
!541 = !DILocation(line: 69, column: 42, scope: !516)
!542 = !DILocation(line: 70, column: 25, scope: !516)
!543 = !DILocation(line: 70, column: 17, scope: !516)
!544 = !DILocation(line: 67, column: 3, scope: !516)
!545 = distinct !DISubprogram(name: "PetscWeakFormGetFunction_Private", scope: !390, file: !390, line: 112, type: !546, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !583)
!546 = !DISubroutineType(types: !547)
!547 = !{!162, !548, !581, !350, !197, !197, !197, !242, !582}
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !53, line: 22, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !370, line: 81, size: 4992, elements: !551)
!551 = !{!552, !554, !568, !569, !570, !579}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !550, file: !370, line: 82, baseType: !553, size: 4480)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !148, line: 122, baseType: !147)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !550, file: !370, line: 82, baseType: !555, size: 256, offset: 4480)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 256, elements: !193)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !370, line: 74, size: 256, elements: !557)
!557 = !{!558, !562, !563, !567}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !556, file: !370, line: 75, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!162, !548}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !556, file: !370, line: 76, baseType: !559, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !556, file: !370, line: 77, baseType: !564, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!162, !548, !168}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !556, file: !370, line: 78, baseType: !559, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !370, line: 83, baseType: !135, size: 64, offset: 4736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !550, file: !370, line: 85, baseType: !197, size: 32, offset: 4800)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !550, file: !370, line: 86, baseType: !571, size: 64, offset: 4864)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !370, line: 41, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 36, size: 256, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !573, file: !370, line: 37, baseType: !308, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !573, file: !370, line: 38, baseType: !308, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !573, file: !370, line: 39, baseType: !308, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !573, file: !370, line: 40, baseType: !224, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !550, file: !370, line: 87, baseType: !580, size: 64, offset: 4928)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !370, line: 54, baseType: !376)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!584 = !DILocalVariable(name: "wf", arg: 1, scope: !545, file: !390, line: 112, type: !548)
!585 = !DILocalVariable(name: "ht", arg: 2, scope: !545, file: !390, line: 112, type: !581)
!586 = !DILocalVariable(name: "label", arg: 3, scope: !545, file: !390, line: 112, type: !350)
!587 = !DILocalVariable(name: "value", arg: 4, scope: !545, file: !390, line: 112, type: !197)
!588 = !DILocalVariable(name: "f", arg: 5, scope: !545, file: !390, line: 112, type: !197)
!589 = !DILocalVariable(name: "part", arg: 6, scope: !545, file: !390, line: 112, type: !197)
!590 = !DILocalVariable(name: "n", arg: 7, scope: !545, file: !390, line: 112, type: !242)
!591 = !DILocalVariable(name: "func", arg: 8, scope: !545, file: !390, line: 112, type: !582)
!592 = !DILocalVariable(name: "key", scope: !545, file: !390, line: 114, type: !346)
!593 = !DILocalVariable(name: "chunk", scope: !545, file: !390, line: 115, type: !369)
!594 = !DILocalVariable(name: "ierr", scope: !545, file: !390, line: 116, type: !162)
!595 = !DILocalVariable(name: "ierr__", scope: !596, file: !390, line: 120, type: !162)
!596 = distinct !DILexicalBlock(scope: !545, file: !390, line: 120, column: 44)
!597 = !DILocation(line: 0, scope: !545)
!598 = !DILocation(line: 114, column: 3, scope: !545)
!599 = !DILocation(line: 114, column: 18, scope: !545)
!600 = !DILocation(line: 115, column: 3, scope: !545)
!601 = !DILocation(line: 115, column: 18, scope: !545)
!602 = !DILocation(line: 118, column: 3, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !390, line: 118, column: 3)
!604 = distinct !DILexicalBlock(scope: !605, file: !390, line: 118, column: 3)
!605 = distinct !DILexicalBlock(scope: !545, file: !390, line: 118, column: 3)
!606 = !DILocation(line: 118, column: 3, scope: !604)
!607 = !DILocation(line: 118, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !390, line: 118, column: 3)
!609 = distinct !DILexicalBlock(scope: !603, file: !390, line: 118, column: 3)
!610 = !DILocation(line: 118, column: 3, scope: !609)
!611 = !DILocation(line: 118, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !608, file: !390, line: 118, column: 3)
!613 = !DILocation(line: 119, column: 7, scope: !545)
!614 = !DILocation(line: 119, column: 13, scope: !545)
!615 = !{!616, !420, i64 0}
!616 = !{!"_PetscFormKey", !420, i64 0, !429, i64 8, !429, i64 12, !429, i64 16}
!617 = !DILocation(line: 119, column: 26, scope: !545)
!618 = !DILocation(line: 119, column: 32, scope: !545)
!619 = !{!616, !429, i64 8}
!620 = !DILocation(line: 119, column: 45, scope: !545)
!621 = !DILocation(line: 119, column: 51, scope: !545)
!622 = !{!616, !429, i64 12}
!623 = !DILocation(line: 119, column: 60, scope: !545)
!624 = !DILocation(line: 119, column: 65, scope: !545)
!625 = !{!616, !429, i64 16}
!626 = !DILocation(line: 120, column: 10, scope: !545)
!627 = !DILocation(line: 0, scope: !596)
!628 = !DILocation(line: 120, column: 44, scope: !629)
!629 = distinct !DILexicalBlock(scope: !596, file: !390, line: 120, column: 44)
!630 = !DILocation(line: 120, column: 44, scope: !596)
!631 = !DILocation(line: 121, column: 13, scope: !632)
!632 = distinct !DILexicalBlock(scope: !545, file: !390, line: 121, column: 7)
!633 = !{!634, !429, i64 4}
!634 = !{!"", !429, i64 0, !429, i64 4, !429, i64 8}
!635 = !DILocation(line: 121, column: 18, scope: !632)
!636 = !DILocation(line: 121, column: 7, scope: !545)
!637 = !DILocation(line: 121, column: 27, scope: !638)
!638 = distinct !DILexicalBlock(scope: !632, file: !390, line: 121, column: 23)
