; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/image.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscDrawImageSavePPM = private unnamed_addr constant [22 x i8] c"PetscDrawImageSavePPM\00", align 1
@.str = private unnamed_addr constant [88 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/image.c\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Null Pointer: Parameter # %d\00", align 1
@.str.2 = private unnamed_addr constant [40 x i8] c"Invalid Pointer to char: Parameter # %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !44, globals: !58, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/image.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !10, !31, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 385, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!13 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 170, baseType: !5, size: 32, elements: !32)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 481, baseType: !36, size: 32, elements: !37)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!39 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!40 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!41 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!42 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!43 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!44 = !{!45, !49, !36, !50, !53, !55}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !46, line: 330, baseType: !47)
!46 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !46, line: 330, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !{!59}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "PetscDrawImageSaveTable", scope: !0, file: !61, line: 316, type: !62, isLocal: true, isDefinition: true)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/image.c", directory: "/home/users/ndemeye/xSDK")
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !77)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 313, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !63, file: !61, line: 314, baseType: !55, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "SaveImage", scope: !63, file: !61, line: 315, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !55, !71, !5, !5, !75}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !11, line: 14, baseType: !36)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 24, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !{i32 7, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{i32 1, !"wchar_size", i32 4}
!82 = !{i32 7, !"PIC Level", i32 2}
!83 = !{i32 7, !"uwtable", i32 1}
!84 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!85 = distinct !DISubprogram(name: "PetscDrawImageSavePPM", scope: !61, file: !61, line: 11, type: !68, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !97, !98, !99, !100, !103, !104, !105, !106, !108, !110, !112, !114, !116, !118, !120}
!87 = !DILocalVariable(name: "filename", arg: 1, scope: !85, file: !61, line: 11, type: !55)
!88 = !DILocalVariable(name: "palette", arg: 2, scope: !85, file: !61, line: 11, type: !71)
!89 = !DILocalVariable(name: "w", arg: 3, scope: !85, file: !61, line: 11, type: !5)
!90 = !DILocalVariable(name: "h", arg: 4, scope: !85, file: !61, line: 11, type: !5)
!91 = !DILocalVariable(name: "pixels", arg: 5, scope: !85, file: !61, line: 11, type: !75)
!92 = !DILocalVariable(name: "fd", scope: !85, file: !61, line: 13, type: !36)
!93 = !DILocalVariable(name: "header", scope: !85, file: !61, line: 14, type: !94)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 32)
!97 = !DILocalVariable(name: "hdrlen", scope: !85, file: !61, line: 15, type: !50)
!98 = !DILocalVariable(name: "rgb", scope: !85, file: !61, line: 16, type: !53)
!99 = !DILocalVariable(name: "ierr", scope: !85, file: !61, line: 17, type: !70)
!100 = !DILocalVariable(name: "k", scope: !101, file: !61, line: 25, type: !36)
!101 = distinct !DILexicalBlock(scope: !102, file: !61, line: 24, column: 16)
!102 = distinct !DILexicalBlock(scope: !85, file: !61, line: 24, column: 7)
!103 = !DILocalVariable(name: "p", scope: !101, file: !61, line: 25, type: !36)
!104 = !DILocalVariable(name: "n", scope: !101, file: !61, line: 25, type: !36)
!105 = !DILocalVariable(name: "colordef", scope: !101, file: !61, line: 26, type: !75)
!106 = !DILocalVariable(name: "ierr__", scope: !107, file: !61, line: 27, type: !70)
!107 = distinct !DILexicalBlock(scope: !101, file: !61, line: 27, column: 37)
!108 = !DILocalVariable(name: "ierr__", scope: !109, file: !61, line: 38, type: !70)
!109 = distinct !DILexicalBlock(scope: !85, file: !61, line: 38, column: 56)
!110 = !DILocalVariable(name: "ierr__", scope: !111, file: !61, line: 39, type: !70)
!111 = distinct !DILexicalBlock(scope: !85, file: !61, line: 39, column: 82)
!112 = !DILocalVariable(name: "ierr__", scope: !113, file: !61, line: 40, type: !70)
!113 = distinct !DILexicalBlock(scope: !85, file: !61, line: 40, column: 38)
!114 = !DILocalVariable(name: "ierr__", scope: !115, file: !61, line: 41, type: !70)
!115 = distinct !DILexicalBlock(scope: !85, file: !61, line: 41, column: 56)
!116 = !DILocalVariable(name: "ierr__", scope: !117, file: !61, line: 43, type: !70)
!117 = distinct !DILexicalBlock(scope: !85, file: !61, line: 43, column: 52)
!118 = !DILocalVariable(name: "ierr__", scope: !119, file: !61, line: 44, type: !70)
!119 = distinct !DILexicalBlock(scope: !85, file: !61, line: 44, column: 31)
!120 = !DILocalVariable(name: "ierr__", scope: !121, file: !61, line: 45, type: !70)
!121 = distinct !DILexicalBlock(scope: !122, file: !61, line: 45, column: 39)
!122 = distinct !DILexicalBlock(scope: !123, file: !61, line: 45, column: 16)
!123 = distinct !DILexicalBlock(scope: !85, file: !61, line: 45, column: 7)
!124 = !DILocation(line: 0, scope: !85)
!125 = !DILocation(line: 13, column: 3, scope: !85)
!126 = !DILocation(line: 14, column: 3, scope: !85)
!127 = !DILocation(line: 14, column: 18, scope: !85)
!128 = !DILocation(line: 15, column: 3, scope: !85)
!129 = !DILocation(line: 16, column: 3, scope: !85)
!130 = !DILocation(line: 19, column: 3, scope: !131)
!131 = distinct !DILexicalBlock(scope: !132, file: !61, line: 19, column: 3)
!132 = distinct !DILexicalBlock(scope: !133, file: !61, line: 19, column: 3)
!133 = distinct !DILexicalBlock(scope: !85, file: !61, line: 19, column: 3)
!134 = !{!135, !135, i64 0}
!135 = !{!"any pointer", !136, i64 0}
!136 = !{!"omnipotent char", !137, i64 0}
!137 = !{!"Simple C/C++ TBAA"}
!138 = !DILocation(line: 19, column: 3, scope: !132)
!139 = !DILocation(line: 19, column: 3, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !61, line: 19, column: 3)
!141 = distinct !DILexicalBlock(scope: !131, file: !61, line: 19, column: 3)
!142 = !{!143, !144, i64 1536}
!143 = !{!"", !136, i64 0, !136, i64 512, !136, i64 1024, !136, i64 1280, !144, i64 1536, !144, i64 1540, !136, i64 1544}
!144 = !{!"int", !136, i64 0}
!145 = !DILocation(line: 19, column: 3, scope: !141)
!146 = !DILocation(line: 19, column: 3, scope: !147)
!147 = distinct !DILexicalBlock(scope: !140, file: !61, line: 19, column: 3)
!148 = !{!144, !144, i64 0}
!149 = !{!143, !144, i64 1540}
!150 = !DILocation(line: 20, column: 3, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !61, line: 20, column: 3)
!152 = distinct !DILexicalBlock(scope: !85, file: !61, line: 20, column: 3)
!153 = !DILocation(line: 20, column: 3, scope: !152)
!154 = !DILocation(line: 20, column: 3, scope: !155)
!155 = distinct !DILexicalBlock(scope: !152, file: !61, line: 20, column: 3)
!156 = !DILocation(line: 21, column: 7, scope: !157)
!157 = distinct !DILexicalBlock(scope: !85, file: !61, line: 21, column: 7)
!158 = !DILocation(line: 21, column: 7, scope: !85)
!159 = !DILocation(line: 21, column: 16, scope: !160)
!160 = distinct !DILexicalBlock(scope: !161, file: !61, line: 21, column: 16)
!161 = distinct !DILexicalBlock(scope: !157, file: !61, line: 21, column: 16)
!162 = !DILocation(line: 21, column: 16, scope: !161)
!163 = !DILocation(line: 22, column: 3, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !61, line: 22, column: 3)
!165 = distinct !DILexicalBlock(scope: !85, file: !61, line: 22, column: 3)
!166 = !DILocation(line: 22, column: 3, scope: !165)
!167 = !DILocation(line: 22, column: 3, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !61, line: 22, column: 3)
!169 = !DILocation(line: 24, column: 7, scope: !85)
!170 = !DILocation(line: 25, column: 24, scope: !101)
!171 = !DILocation(line: 0, scope: !101)
!172 = !DILocation(line: 27, column: 12, scope: !101)
!173 = !DILocation(line: 0, scope: !107)
!174 = !DILocation(line: 27, column: 37, scope: !175)
!175 = distinct !DILexicalBlock(scope: !107, file: !61, line: 27, column: 37)
!176 = !DILocation(line: 27, column: 37, scope: !107)
!177 = !{!"branch_weights", i32 2000, i32 1}
!178 = !DILocation(line: 28, column: 18, scope: !179)
!179 = distinct !DILexicalBlock(scope: !180, file: !61, line: 28, column: 5)
!180 = distinct !DILexicalBlock(scope: !101, file: !61, line: 28, column: 5)
!181 = !DILocation(line: 28, column: 5, scope: !180)
!182 = !DILocation(line: 29, column: 26, scope: !183)
!183 = distinct !DILexicalBlock(scope: !179, file: !61, line: 28, column: 27)
!184 = !{!136, !136, i64 0}
!185 = !DILocation(line: 29, column: 18, scope: !183)
!186 = !DILocation(line: 30, column: 18, scope: !183)
!187 = !DILocation(line: 30, column: 7, scope: !183)
!188 = !DILocation(line: 30, column: 12, scope: !183)
!189 = !DILocation(line: 30, column: 16, scope: !183)
!190 = !DILocation(line: 31, column: 18, scope: !183)
!191 = !DILocation(line: 31, column: 7, scope: !183)
!192 = !DILocation(line: 31, column: 12, scope: !183)
!193 = !DILocation(line: 31, column: 16, scope: !183)
!194 = !DILocation(line: 32, column: 18, scope: !183)
!195 = !DILocation(line: 32, column: 7, scope: !183)
!196 = !DILocation(line: 32, column: 12, scope: !183)
!197 = !DILocation(line: 32, column: 16, scope: !183)
!198 = !DILocation(line: 28, column: 23, scope: !179)
!199 = distinct !{!199, !181, !200, !201}
!200 = !DILocation(line: 33, column: 5, scope: !180)
!201 = !{!"llvm.loop.mustprogress"}
!202 = !DILocation(line: 35, column: 9, scope: !203)
!203 = distinct !DILexicalBlock(scope: !102, file: !61, line: 34, column: 10)
!204 = !DILocation(line: 38, column: 10, scope: !85)
!205 = !DILocation(line: 0, scope: !109)
!206 = !DILocation(line: 38, column: 56, scope: !207)
!207 = distinct !DILexicalBlock(scope: !109, file: !61, line: 38, column: 56)
!208 = !DILocation(line: 38, column: 56, scope: !109)
!209 = !DILocation(line: 39, column: 10, scope: !85)
!210 = !DILocation(line: 0, scope: !111)
!211 = !DILocation(line: 39, column: 82, scope: !212)
!212 = distinct !DILexicalBlock(scope: !111, file: !61, line: 39, column: 82)
!213 = !DILocation(line: 39, column: 82, scope: !111)
!214 = !DILocation(line: 40, column: 10, scope: !85)
!215 = !DILocation(line: 0, scope: !113)
!216 = !DILocation(line: 40, column: 38, scope: !217)
!217 = distinct !DILexicalBlock(scope: !113, file: !61, line: 40, column: 38)
!218 = !DILocation(line: 40, column: 38, scope: !113)
!219 = !DILocation(line: 41, column: 27, scope: !85)
!220 = !DILocation(line: 41, column: 37, scope: !85)
!221 = !{!222, !222, i64 0}
!222 = !{!"long", !136, i64 0}
!223 = !DILocation(line: 41, column: 10, scope: !85)
!224 = !DILocation(line: 0, scope: !115)
!225 = !DILocation(line: 41, column: 56, scope: !226)
!226 = distinct !DILexicalBlock(scope: !115, file: !61, line: 41, column: 56)
!227 = !DILocation(line: 41, column: 56, scope: !115)
!228 = !DILocation(line: 43, column: 27, scope: !85)
!229 = !DILocation(line: 43, column: 30, scope: !85)
!230 = !DILocation(line: 43, column: 35, scope: !85)
!231 = !DILocation(line: 43, column: 37, scope: !85)
!232 = !DILocation(line: 43, column: 10, scope: !85)
!233 = !DILocation(line: 0, scope: !117)
!234 = !DILocation(line: 43, column: 52, scope: !235)
!235 = distinct !DILexicalBlock(scope: !117, file: !61, line: 43, column: 52)
!236 = !DILocation(line: 43, column: 52, scope: !117)
!237 = !DILocation(line: 44, column: 27, scope: !85)
!238 = !DILocation(line: 44, column: 10, scope: !85)
!239 = !DILocation(line: 0, scope: !119)
!240 = !DILocation(line: 44, column: 31, scope: !241)
!241 = distinct !DILexicalBlock(scope: !119, file: !61, line: 44, column: 31)
!242 = !DILocation(line: 44, column: 31, scope: !119)
!243 = !DILocation(line: 45, column: 7, scope: !85)
!244 = !DILocation(line: 45, column: 24, scope: !122)
!245 = !DILocation(line: 0, scope: !121)
!246 = !DILocation(line: 45, column: 39, scope: !247)
!247 = distinct !DILexicalBlock(scope: !121, file: !61, line: 45, column: 39)
!248 = !DILocation(line: 46, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !61, line: 46, column: 3)
!250 = distinct !DILexicalBlock(scope: !251, file: !61, line: 46, column: 3)
!251 = distinct !DILexicalBlock(scope: !85, file: !61, line: 46, column: 3)
!252 = !DILocation(line: 46, column: 3, scope: !250)
!253 = !DILocation(line: 46, column: 3, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !61, line: 46, column: 3)
!255 = distinct !DILexicalBlock(scope: !249, file: !61, line: 46, column: 3)
!256 = !DILocation(line: 46, column: 3, scope: !255)
!257 = !DILocation(line: 46, column: 3, scope: !258)
!258 = distinct !DILexicalBlock(scope: !259, file: !61, line: 46, column: 3)
!259 = distinct !DILexicalBlock(scope: !254, file: !61, line: 46, column: 3)
!260 = !{!143, !136, i64 1544}
!261 = !DILocation(line: 46, column: 3, scope: !259)
!262 = !DILocation(line: 46, column: 3, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !61, line: 46, column: 3)
!264 = !DILocation(line: 46, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !254, file: !61, line: 46, column: 3)
!266 = !DILocation(line: 46, column: 3, scope: !267)
!267 = distinct !DILexicalBlock(scope: !265, file: !61, line: 46, column: 3)
!268 = !DILocation(line: 46, column: 3, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !61, line: 46, column: 3)
!270 = distinct !DILexicalBlock(scope: !267, file: !61, line: 46, column: 3)
!271 = !DILocation(line: 46, column: 3, scope: !270)
!272 = !DILocation(line: 46, column: 3, scope: !273)
!273 = distinct !DILexicalBlock(scope: !269, file: !61, line: 46, column: 3)
!274 = !DILocation(line: 47, column: 1, scope: !85)
!275 = !DISubprogram(name: "PetscError", scope: !4, file: !4, line: 668, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{!70, !47, !36, !55, !55, !36, !3, !55, null}
!278 = !{}
!279 = !DISubprogram(name: "PetscCheckPointer", scope: !280, file: !280, line: 183, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!280 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!281 = !DISubroutineType(types: !282)
!282 = !{!31, !283, !10}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!285 = !DISubprogram(name: "PetscMallocA", scope: !286, file: !286, line: 1288, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!287 = !DISubroutineType(types: !288)
!288 = !{!70, !36, !31, !36, !55, !55, !52, !49, null}
!289 = !DISubprogram(name: "PetscBinaryOpen", scope: !286, file: !286, line: 2603, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!290 = !DISubroutineType(types: !291)
!291 = !{!36, !55, !35, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!293 = !DISubprogram(name: "PetscSNPrintf", scope: !286, file: !286, line: 1660, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!294 = !DISubroutineType(types: !295)
!295 = !{!70, !296, !52, !55, null}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!297 = !DISubprogram(name: "PetscStrlen", scope: !286, file: !286, line: 1343, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!298 = !DISubroutineType(types: !299)
!299 = !{!36, !55, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!301 = !DISubprogram(name: "PetscBinaryWrite", scope: !286, file: !286, line: 2601, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!302 = !DISubroutineType(types: !303)
!303 = !{!36, !36, !283, !36, !10}
!304 = !DISubprogram(name: "PetscBinaryClose", scope: !286, file: !286, line: 2604, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!305 = !DISubroutineType(types: !306)
!306 = !{!36, !36}
!307 = distinct !DISubprogram(name: "PetscDrawImageCheckFormat", scope: !61, file: !61, line: 329, type: !308, scopeLine: 330, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !311)
!308 = !DISubroutineType(types: !309)
!309 = !{!70, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!311 = !{!312, !313, !314, !316, !317}
!312 = !DILocalVariable(name: "ext", arg: 1, scope: !307, file: !61, line: 329, type: !310)
!313 = !DILocalVariable(name: "k", scope: !307, file: !61, line: 331, type: !50)
!314 = !DILocalVariable(name: "match", scope: !307, file: !61, line: 332, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !11, line: 170, baseType: !31)
!316 = !DILocalVariable(name: "ierr", scope: !307, file: !61, line: 333, type: !70)
!317 = !DILocalVariable(name: "ierr__", scope: !318, file: !61, line: 345, type: !70)
!318 = distinct !DILexicalBlock(scope: !319, file: !61, line: 345, column: 78)
!319 = distinct !DILexicalBlock(scope: !320, file: !61, line: 344, column: 88)
!320 = distinct !DILexicalBlock(scope: !321, file: !61, line: 344, column: 3)
!321 = distinct !DILexicalBlock(scope: !307, file: !61, line: 344, column: 3)
!322 = !DILocation(line: 0, scope: !307)
!323 = !DILocation(line: 332, column: 3, scope: !307)
!324 = !DILocation(line: 332, column: 18, scope: !307)
!325 = !DILocation(line: 335, column: 3, scope: !326)
!326 = distinct !DILexicalBlock(scope: !327, file: !61, line: 335, column: 3)
!327 = distinct !DILexicalBlock(scope: !328, file: !61, line: 335, column: 3)
!328 = distinct !DILexicalBlock(scope: !307, file: !61, line: 335, column: 3)
!329 = !DILocation(line: 335, column: 3, scope: !327)
!330 = !DILocation(line: 335, column: 3, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !61, line: 335, column: 3)
!332 = distinct !DILexicalBlock(scope: !326, file: !61, line: 335, column: 3)
!333 = !DILocation(line: 335, column: 3, scope: !332)
!334 = !DILocation(line: 335, column: 3, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !61, line: 335, column: 3)
!336 = !DILocation(line: 337, column: 3, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !61, line: 337, column: 3)
!338 = distinct !DILexicalBlock(scope: !307, file: !61, line: 337, column: 3)
!339 = !DILocation(line: 337, column: 3, scope: !338)
!340 = !DILocation(line: 337, column: 3, scope: !341)
!341 = distinct !DILexicalBlock(scope: !338, file: !61, line: 337, column: 3)
!342 = !DILocation(line: 338, column: 8, scope: !343)
!343 = distinct !DILexicalBlock(scope: !307, file: !61, line: 338, column: 7)
!344 = !DILocation(line: 338, column: 13, scope: !343)
!345 = !DILocation(line: 338, column: 17, scope: !343)
!346 = !DILocation(line: 338, column: 7, scope: !307)
!347 = !DILocation(line: 339, column: 10, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !61, line: 338, column: 24)
!349 = !DILocation(line: 340, column: 5, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !61, line: 340, column: 5)
!351 = distinct !DILexicalBlock(scope: !352, file: !61, line: 340, column: 5)
!352 = distinct !DILexicalBlock(scope: !348, file: !61, line: 340, column: 5)
!353 = !DILocation(line: 340, column: 5, scope: !351)
!354 = !DILocation(line: 340, column: 5, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !61, line: 340, column: 5)
!356 = distinct !DILexicalBlock(scope: !350, file: !61, line: 340, column: 5)
!357 = !DILocation(line: 340, column: 5, scope: !356)
!358 = !DILocation(line: 340, column: 5, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !61, line: 340, column: 5)
!360 = distinct !DILexicalBlock(scope: !355, file: !61, line: 340, column: 5)
!361 = !DILocation(line: 340, column: 5, scope: !360)
!362 = !DILocation(line: 340, column: 5, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !61, line: 340, column: 5)
!364 = !DILocation(line: 340, column: 5, scope: !365)
!365 = distinct !DILexicalBlock(scope: !355, file: !61, line: 340, column: 5)
!366 = !DILocation(line: 340, column: 5, scope: !367)
!367 = distinct !DILexicalBlock(scope: !365, file: !61, line: 340, column: 5)
!368 = !DILocation(line: 340, column: 5, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !61, line: 340, column: 5)
!370 = distinct !DILexicalBlock(scope: !367, file: !61, line: 340, column: 5)
!371 = !DILocation(line: 340, column: 5, scope: !370)
!372 = !DILocation(line: 340, column: 5, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !61, line: 340, column: 5)
!374 = !DILocation(line: 343, column: 3, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !61, line: 343, column: 3)
!376 = distinct !DILexicalBlock(scope: !307, file: !61, line: 343, column: 3)
!377 = !DILocation(line: 343, column: 3, scope: !376)
!378 = !DILocation(line: 345, column: 28, scope: !319)
!379 = !DILocation(line: 345, column: 12, scope: !319)
!380 = !DILocation(line: 0, scope: !318)
!381 = !DILocation(line: 345, column: 78, scope: !382)
!382 = distinct !DILexicalBlock(scope: !318, file: !61, line: 345, column: 78)
!383 = !DILocation(line: 345, column: 78, scope: !318)
!384 = !DILocation(line: 346, column: 9, scope: !385)
!385 = distinct !DILexicalBlock(scope: !319, file: !61, line: 346, column: 9)
!386 = !DILocation(line: 346, column: 15, scope: !385)
!387 = distinct !{!387, !388, !389, !201}
!388 = !DILocation(line: 344, column: 3, scope: !321)
!389 = !DILocation(line: 347, column: 3, scope: !321)
!390 = !DILocation(line: 346, column: 56, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !61, line: 346, column: 56)
!392 = distinct !DILexicalBlock(scope: !393, file: !61, line: 346, column: 56)
!393 = distinct !DILexicalBlock(scope: !385, file: !61, line: 346, column: 56)
!394 = !DILocation(line: 346, column: 56, scope: !392)
!395 = !DILocation(line: 346, column: 56, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !61, line: 346, column: 56)
!397 = distinct !DILexicalBlock(scope: !391, file: !61, line: 346, column: 56)
!398 = !DILocation(line: 346, column: 56, scope: !397)
!399 = !DILocation(line: 346, column: 56, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !61, line: 346, column: 56)
!401 = distinct !DILexicalBlock(scope: !396, file: !61, line: 346, column: 56)
!402 = !DILocation(line: 346, column: 56, scope: !401)
!403 = !DILocation(line: 346, column: 56, scope: !404)
!404 = distinct !DILexicalBlock(scope: !400, file: !61, line: 346, column: 56)
!405 = !DILocation(line: 346, column: 56, scope: !406)
!406 = distinct !DILexicalBlock(scope: !396, file: !61, line: 346, column: 56)
!407 = !DILocation(line: 346, column: 56, scope: !408)
!408 = distinct !DILexicalBlock(scope: !406, file: !61, line: 346, column: 56)
!409 = !DILocation(line: 346, column: 56, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !61, line: 346, column: 56)
!411 = distinct !DILexicalBlock(scope: !408, file: !61, line: 346, column: 56)
!412 = !DILocation(line: 346, column: 56, scope: !411)
!413 = !DILocation(line: 346, column: 56, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !61, line: 346, column: 56)
!415 = !DILocation(line: 348, column: 3, scope: !307)
!416 = !DILocation(line: 349, column: 1, scope: !307)
!417 = !DISubprogram(name: "PetscStrcasecmp", scope: !286, file: !286, line: 1348, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !278)
!418 = !DISubroutineType(types: !419)
!419 = !{!36, !55, !55, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!421 = distinct !DISubprogram(name: "PetscDrawImageSave", scope: !61, file: !61, line: 351, type: !422, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!70, !55, !55, !71, !5, !5, !75}
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !437, !438, !440, !442, !447}
!425 = !DILocalVariable(name: "basename", arg: 1, scope: !421, file: !61, line: 351, type: !55)
!426 = !DILocalVariable(name: "ext", arg: 2, scope: !421, file: !61, line: 351, type: !55)
!427 = !DILocalVariable(name: "palette", arg: 3, scope: !421, file: !61, line: 351, type: !71)
!428 = !DILocalVariable(name: "w", arg: 4, scope: !421, file: !61, line: 351, type: !5)
!429 = !DILocalVariable(name: "h", arg: 5, scope: !421, file: !61, line: 351, type: !5)
!430 = !DILocalVariable(name: "pixels", arg: 6, scope: !421, file: !61, line: 351, type: !75)
!431 = !DILocalVariable(name: "k", scope: !421, file: !61, line: 353, type: !50)
!432 = !DILocalVariable(name: "match", scope: !421, file: !61, line: 354, type: !315)
!433 = !DILocalVariable(name: "filename", scope: !421, file: !61, line: 355, type: !434)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32768, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 4096)
!437 = !DILocalVariable(name: "ierr", scope: !421, file: !61, line: 356, type: !70)
!438 = !DILocalVariable(name: "ierr__", scope: !439, file: !61, line: 364, type: !70)
!439 = distinct !DILexicalBlock(scope: !421, file: !61, line: 364, column: 42)
!440 = !DILocalVariable(name: "ierr__", scope: !441, file: !61, line: 365, type: !70)
!441 = distinct !DILexicalBlock(scope: !421, file: !61, line: 365, column: 71)
!442 = !DILocalVariable(name: "ierr__", scope: !443, file: !61, line: 367, type: !70)
!443 = distinct !DILexicalBlock(scope: !444, file: !61, line: 367, column: 77)
!444 = distinct !DILexicalBlock(scope: !445, file: !61, line: 366, column: 88)
!445 = distinct !DILexicalBlock(scope: !446, file: !61, line: 366, column: 3)
!446 = distinct !DILexicalBlock(scope: !421, file: !61, line: 366, column: 3)
!447 = !DILocalVariable(name: "ierr__", scope: !448, file: !61, line: 369, type: !70)
!448 = distinct !DILexicalBlock(scope: !449, file: !61, line: 369, column: 80)
!449 = distinct !DILexicalBlock(scope: !450, file: !61, line: 368, column: 56)
!450 = distinct !DILexicalBlock(scope: !444, file: !61, line: 368, column: 9)
!451 = !DILocation(line: 0, scope: !421)
!452 = !DILocation(line: 354, column: 3, scope: !421)
!453 = !DILocation(line: 354, column: 18, scope: !421)
!454 = !DILocation(line: 355, column: 3, scope: !421)
!455 = !DILocation(line: 355, column: 18, scope: !421)
!456 = !DILocation(line: 358, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !61, line: 358, column: 3)
!458 = distinct !DILexicalBlock(scope: !459, file: !61, line: 358, column: 3)
!459 = distinct !DILexicalBlock(scope: !421, file: !61, line: 358, column: 3)
!460 = !DILocation(line: 358, column: 3, scope: !458)
!461 = !DILocation(line: 358, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !61, line: 358, column: 3)
!463 = distinct !DILexicalBlock(scope: !457, file: !61, line: 358, column: 3)
!464 = !DILocation(line: 358, column: 3, scope: !463)
!465 = !DILocation(line: 358, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !61, line: 358, column: 3)
!467 = !DILocation(line: 359, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !61, line: 359, column: 3)
!469 = distinct !DILexicalBlock(scope: !421, file: !61, line: 359, column: 3)
!470 = !DILocation(line: 359, column: 3, scope: !469)
!471 = !DILocation(line: 359, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !469, file: !61, line: 359, column: 3)
!473 = !DILocation(line: 360, column: 7, scope: !474)
!474 = distinct !DILexicalBlock(scope: !421, file: !61, line: 360, column: 7)
!475 = !DILocation(line: 360, column: 7, scope: !421)
!476 = !DILocation(line: 360, column: 12, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !61, line: 360, column: 12)
!478 = distinct !DILexicalBlock(scope: !474, file: !61, line: 360, column: 12)
!479 = !DILocation(line: 360, column: 12, scope: !478)
!480 = !DILocation(line: 361, column: 7, scope: !481)
!481 = distinct !DILexicalBlock(scope: !421, file: !61, line: 361, column: 7)
!482 = !DILocation(line: 361, column: 7, scope: !421)
!483 = !DILocation(line: 361, column: 16, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !61, line: 361, column: 16)
!485 = distinct !DILexicalBlock(scope: !481, file: !61, line: 361, column: 16)
!486 = !DILocation(line: 361, column: 16, scope: !485)
!487 = !DILocation(line: 362, column: 3, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !61, line: 362, column: 3)
!489 = distinct !DILexicalBlock(scope: !421, file: !61, line: 362, column: 3)
!490 = !DILocation(line: 362, column: 3, scope: !489)
!491 = !DILocation(line: 362, column: 3, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !61, line: 362, column: 3)
!493 = !DILocation(line: 364, column: 10, scope: !421)
!494 = !DILocation(line: 0, scope: !439)
!495 = !DILocation(line: 364, column: 42, scope: !496)
!496 = distinct !DILexicalBlock(scope: !439, file: !61, line: 364, column: 42)
!497 = !DILocation(line: 364, column: 42, scope: !439)
!498 = !DILocation(line: 365, column: 66, scope: !421)
!499 = !DILocation(line: 365, column: 10, scope: !421)
!500 = !DILocation(line: 0, scope: !441)
!501 = !DILocation(line: 365, column: 71, scope: !502)
!502 = distinct !DILexicalBlock(scope: !441, file: !61, line: 365, column: 71)
!503 = !DILocation(line: 365, column: 71, scope: !441)
!504 = !DILocation(line: 367, column: 28, scope: !444)
!505 = !DILocation(line: 367, column: 12, scope: !444)
!506 = !DILocation(line: 0, scope: !443)
!507 = !DILocation(line: 367, column: 77, scope: !508)
!508 = distinct !DILexicalBlock(scope: !443, file: !61, line: 367, column: 77)
!509 = !DILocation(line: 367, column: 77, scope: !443)
!510 = !DILocation(line: 368, column: 9, scope: !450)
!511 = !DILocation(line: 368, column: 15, scope: !450)
!512 = distinct !{!512, !513, !514, !201}
!513 = !DILocation(line: 366, column: 3, scope: !446)
!514 = !DILocation(line: 372, column: 3, scope: !446)
!515 = !DILocalVariable(name: "filename", arg: 1, scope: !516, file: !61, line: 49, type: !55)
!516 = distinct !DISubprogram(name: "PetscDrawImageSave_PPM", scope: !61, file: !61, line: 49, type: !68, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !517)
!517 = !{!515, !518, !519, !520, !521}
!518 = !DILocalVariable(name: "palette", arg: 2, scope: !516, file: !61, line: 49, type: !71)
!519 = !DILocalVariable(name: "w", arg: 3, scope: !516, file: !61, line: 49, type: !5)
!520 = !DILocalVariable(name: "h", arg: 4, scope: !516, file: !61, line: 49, type: !5)
!521 = !DILocalVariable(name: "pixels", arg: 5, scope: !516, file: !61, line: 49, type: !75)
!522 = !DILocation(line: 0, scope: !516, inlinedAt: !523)
!523 = distinct !DILocation(line: 369, column: 14, scope: !449)
!524 = !DILocation(line: 50, column: 10, scope: !516, inlinedAt: !523)
!525 = !DILocation(line: 0, scope: !448)
!526 = !DILocation(line: 369, column: 80, scope: !527)
!527 = distinct !DILexicalBlock(scope: !448, file: !61, line: 369, column: 80)
!528 = !DILocation(line: 369, column: 80, scope: !448)
!529 = !DILocation(line: 370, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !61, line: 370, column: 7)
!531 = distinct !DILexicalBlock(scope: !532, file: !61, line: 370, column: 7)
!532 = distinct !DILexicalBlock(scope: !449, file: !61, line: 370, column: 7)
!533 = !DILocation(line: 370, column: 7, scope: !531)
!534 = !DILocation(line: 370, column: 7, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !61, line: 370, column: 7)
!536 = distinct !DILexicalBlock(scope: !530, file: !61, line: 370, column: 7)
!537 = !DILocation(line: 370, column: 7, scope: !536)
!538 = !DILocation(line: 370, column: 7, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !61, line: 370, column: 7)
!540 = distinct !DILexicalBlock(scope: !535, file: !61, line: 370, column: 7)
!541 = !DILocation(line: 370, column: 7, scope: !540)
!542 = !DILocation(line: 370, column: 7, scope: !543)
!543 = distinct !DILexicalBlock(scope: !539, file: !61, line: 370, column: 7)
!544 = !DILocation(line: 370, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !535, file: !61, line: 370, column: 7)
!546 = !DILocation(line: 370, column: 7, scope: !547)
!547 = distinct !DILexicalBlock(scope: !545, file: !61, line: 370, column: 7)
!548 = !DILocation(line: 370, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !61, line: 370, column: 7)
!550 = distinct !DILexicalBlock(scope: !547, file: !61, line: 370, column: 7)
!551 = !DILocation(line: 370, column: 7, scope: !550)
!552 = !DILocation(line: 370, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !549, file: !61, line: 370, column: 7)
!554 = !DILocation(line: 373, column: 3, scope: !421)
!555 = !DILocation(line: 374, column: 1, scope: !421)
!556 = distinct !DISubprogram(name: "PetscDrawMovieCheckFormat", scope: !61, file: !61, line: 376, type: !308, scopeLine: 377, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !557)
!557 = !{!558}
!558 = !DILocalVariable(name: "ext", arg: 1, scope: !556, file: !61, line: 376, type: !310)
!559 = !DILocation(line: 0, scope: !556)
!560 = !DILocation(line: 378, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !61, line: 378, column: 3)
!562 = distinct !DILexicalBlock(scope: !563, file: !61, line: 378, column: 3)
!563 = distinct !DILexicalBlock(scope: !556, file: !61, line: 378, column: 3)
!564 = !DILocation(line: 378, column: 3, scope: !562)
!565 = !DILocation(line: 378, column: 3, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !61, line: 378, column: 3)
!567 = distinct !DILexicalBlock(scope: !561, file: !61, line: 378, column: 3)
!568 = !DILocation(line: 378, column: 3, scope: !567)
!569 = !DILocation(line: 378, column: 3, scope: !570)
!570 = distinct !DILexicalBlock(scope: !566, file: !61, line: 378, column: 3)
!571 = !DILocation(line: 379, column: 3, scope: !572)
!572 = distinct !DILexicalBlock(scope: !573, file: !61, line: 379, column: 3)
!573 = distinct !DILexicalBlock(scope: !556, file: !61, line: 379, column: 3)
!574 = !DILocation(line: 379, column: 3, scope: !573)
!575 = !DILocation(line: 379, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !573, file: !61, line: 379, column: 3)
!577 = !DILocation(line: 380, column: 8, scope: !578)
!578 = distinct !DILexicalBlock(scope: !556, file: !61, line: 380, column: 7)
!579 = !DILocation(line: 380, column: 13, scope: !578)
!580 = !DILocation(line: 380, column: 17, scope: !578)
!581 = !DILocation(line: 380, column: 7, scope: !556)
!582 = !DILocation(line: 380, column: 29, scope: !578)
!583 = !DILocation(line: 380, column: 24, scope: !578)
!584 = !DILocation(line: 381, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !61, line: 381, column: 3)
!586 = distinct !DILexicalBlock(scope: !587, file: !61, line: 381, column: 3)
!587 = distinct !DILexicalBlock(scope: !556, file: !61, line: 381, column: 3)
!588 = !DILocation(line: 381, column: 3, scope: !586)
!589 = !DILocation(line: 381, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !61, line: 381, column: 3)
!591 = distinct !DILexicalBlock(scope: !585, file: !61, line: 381, column: 3)
!592 = !DILocation(line: 381, column: 3, scope: !591)
!593 = !DILocation(line: 381, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !61, line: 381, column: 3)
!595 = distinct !DILexicalBlock(scope: !590, file: !61, line: 381, column: 3)
!596 = !DILocation(line: 381, column: 3, scope: !595)
!597 = !DILocation(line: 381, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !594, file: !61, line: 381, column: 3)
!599 = !DILocation(line: 381, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !590, file: !61, line: 381, column: 3)
!601 = !DILocation(line: 381, column: 3, scope: !602)
!602 = distinct !DILexicalBlock(scope: !600, file: !61, line: 381, column: 3)
!603 = !DILocation(line: 381, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !61, line: 381, column: 3)
!605 = distinct !DILexicalBlock(scope: !602, file: !61, line: 381, column: 3)
!606 = !DILocation(line: 381, column: 3, scope: !605)
!607 = !DILocation(line: 381, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !604, file: !61, line: 381, column: 3)
!609 = !DILocation(line: 382, column: 1, scope: !556)
!610 = distinct !DISubprogram(name: "PetscDrawMovieSave", scope: !61, file: !61, line: 384, type: !611, scopeLine: 385, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !614)
!611 = !DISubroutineType(types: !612)
!612 = !{!70, !55, !613, !55, !613, !55}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !11, line: 102, baseType: !36)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !626, !628, !630, !632, !688, !692, !693, !697, !701, !705, !709, !711, !714, !718, !722, !724, !726}
!615 = !DILocalVariable(name: "basename", arg: 1, scope: !610, file: !61, line: 384, type: !55)
!616 = !DILocalVariable(name: "count", arg: 2, scope: !610, file: !61, line: 384, type: !613)
!617 = !DILocalVariable(name: "imext", arg: 3, scope: !610, file: !61, line: 384, type: !55)
!618 = !DILocalVariable(name: "fps", arg: 4, scope: !610, file: !61, line: 384, type: !613)
!619 = !DILocalVariable(name: "mvext", arg: 5, scope: !610, file: !61, line: 384, type: !55)
!620 = !DILocalVariable(name: "input", scope: !610, file: !61, line: 386, type: !434)
!621 = !DILocalVariable(name: "output", scope: !610, file: !61, line: 387, type: !434)
!622 = !DILocalVariable(name: "gifinput", scope: !610, file: !61, line: 388, type: !315)
!623 = !DILocalVariable(name: "ierr", scope: !610, file: !61, line: 389, type: !70)
!624 = !DILocalVariable(name: "ierr__", scope: !625, file: !61, line: 397, type: !70)
!625 = distinct !DILexicalBlock(scope: !610, file: !61, line: 397, column: 50)
!626 = !DILocalVariable(name: "ierr__", scope: !627, file: !61, line: 398, type: !70)
!627 = distinct !DILexicalBlock(scope: !610, file: !61, line: 398, column: 44)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !61, line: 399, type: !70)
!629 = distinct !DILexicalBlock(scope: !610, file: !61, line: 399, column: 83)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !61, line: 400, type: !70)
!631 = distinct !DILexicalBlock(scope: !610, file: !61, line: 400, column: 69)
!632 = !DILocalVariable(name: "fd", scope: !633, file: !61, line: 415, type: !634)
!633 = distinct !DILexicalBlock(scope: !610, file: !61, line: 414, column: 3)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !636, line: 7, baseType: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !638, line: 245, size: 1728, elements: !639)
!638 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !660, !661, !662, !663, !667, !669, !671, !673, !676, !678, !679, !680, !681, !682, !683, !684}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !637, file: !638, line: 246, baseType: !36, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !637, file: !638, line: 251, baseType: !296, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !637, file: !638, line: 252, baseType: !296, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !637, file: !638, line: 253, baseType: !296, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !637, file: !638, line: 254, baseType: !296, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !637, file: !638, line: 255, baseType: !296, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !637, file: !638, line: 256, baseType: !296, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !637, file: !638, line: 257, baseType: !296, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !637, file: !638, line: 258, baseType: !296, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !637, file: !638, line: 260, baseType: !296, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !637, file: !638, line: 261, baseType: !296, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !637, file: !638, line: 262, baseType: !296, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !637, file: !638, line: 264, baseType: !653, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !638, line: 160, size: 192, elements: !655)
!655 = !{!656, !657, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !654, file: !638, line: 161, baseType: !653, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !654, file: !638, line: 162, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !654, file: !638, line: 166, baseType: !36, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !637, file: !638, line: 266, baseType: !658, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !637, file: !638, line: 268, baseType: !36, size: 32, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !637, file: !638, line: 272, baseType: !36, size: 32, offset: 928)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !637, file: !638, line: 274, baseType: !664, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !665, line: 140, baseType: !666)
!665 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!666 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !637, file: !638, line: 278, baseType: !668, size: 16, offset: 1024)
!668 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !637, file: !638, line: 279, baseType: !670, size: 8, offset: 1040)
!670 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !637, file: !638, line: 280, baseType: !672, size: 8, offset: 1048)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !77)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !637, file: !638, line: 284, baseType: !674, size: 64, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !638, line: 154, baseType: null)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !637, file: !638, line: 293, baseType: !677, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !665, line: 141, baseType: !666)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !637, file: !638, line: 301, baseType: !49, size: 64, offset: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !637, file: !638, line: 302, baseType: !49, size: 64, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !637, file: !638, line: 303, baseType: !49, size: 64, offset: 1344)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !637, file: !638, line: 304, baseType: !49, size: 64, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !637, file: !638, line: 306, baseType: !50, size: 64, offset: 1472)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !637, file: !638, line: 307, baseType: !36, size: 32, offset: 1536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !637, file: !638, line: 309, baseType: !685, size: 160, offset: 1568)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 20)
!688 = !DILocalVariable(name: "options", scope: !633, file: !61, line: 416, type: !689)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 64)
!692 = !DILocalVariable(name: "extraopts", scope: !633, file: !61, line: 416, type: !94)
!693 = !DILocalVariable(name: "framerate", scope: !633, file: !61, line: 416, type: !694)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 24)
!697 = !DILocalVariable(name: "command", scope: !633, file: !61, line: 417, type: !698)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 66496, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 8312)
!701 = !DILocalVariable(name: "ierr__", scope: !702, file: !61, line: 418, type: !70)
!702 = distinct !DILexicalBlock(scope: !703, file: !61, line: 418, column: 86)
!703 = distinct !DILexicalBlock(scope: !704, file: !61, line: 418, column: 18)
!704 = distinct !DILexicalBlock(scope: !633, file: !61, line: 418, column: 9)
!705 = !DILocalVariable(name: "ierr__", scope: !706, file: !61, line: 420, type: !70)
!706 = distinct !DILexicalBlock(scope: !707, file: !61, line: 420, column: 62)
!707 = distinct !DILexicalBlock(scope: !708, file: !61, line: 419, column: 19)
!708 = distinct !DILexicalBlock(scope: !633, file: !61, line: 419, column: 9)
!709 = !DILocalVariable(name: "ierr__", scope: !710, file: !61, line: 421, type: !70)
!710 = distinct !DILexicalBlock(scope: !707, file: !61, line: 421, column: 107)
!711 = !DILocalVariable(name: "ierr__", scope: !712, file: !61, line: 423, type: !70)
!712 = distinct !DILexicalBlock(scope: !713, file: !61, line: 423, column: 65)
!713 = distinct !DILexicalBlock(scope: !708, file: !61, line: 422, column: 12)
!714 = !DILocalVariable(name: "ierr__", scope: !715, file: !61, line: 424, type: !70)
!715 = distinct !DILexicalBlock(scope: !716, file: !61, line: 424, column: 97)
!716 = distinct !DILexicalBlock(scope: !717, file: !61, line: 424, column: 20)
!717 = distinct !DILexicalBlock(scope: !713, file: !61, line: 424, column: 11)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !61, line: 426, type: !70)
!719 = distinct !DILexicalBlock(scope: !720, file: !61, line: 426, column: 79)
!720 = distinct !DILexicalBlock(scope: !721, file: !61, line: 426, column: 23)
!721 = distinct !DILexicalBlock(scope: !633, file: !61, line: 426, column: 9)
!722 = !DILocalVariable(name: "ierr__", scope: !723, file: !61, line: 427, type: !70)
!723 = distinct !DILexicalBlock(scope: !633, file: !61, line: 427, column: 114)
!724 = !DILocalVariable(name: "ierr__", scope: !725, file: !61, line: 428, type: !70)
!725 = distinct !DILexicalBlock(scope: !633, file: !61, line: 428, column: 61)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !61, line: 429, type: !70)
!727 = distinct !DILexicalBlock(scope: !633, file: !61, line: 429, column: 44)
!728 = !DILocation(line: 0, scope: !610)
!729 = !DILocation(line: 386, column: 3, scope: !610)
!730 = !DILocation(line: 386, column: 18, scope: !610)
!731 = !DILocation(line: 387, column: 3, scope: !610)
!732 = !DILocation(line: 387, column: 18, scope: !610)
!733 = !DILocation(line: 388, column: 3, scope: !610)
!734 = !DILocation(line: 391, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !61, line: 391, column: 3)
!736 = distinct !DILexicalBlock(scope: !737, file: !61, line: 391, column: 3)
!737 = distinct !DILexicalBlock(scope: !610, file: !61, line: 391, column: 3)
!738 = !DILocation(line: 391, column: 3, scope: !736)
!739 = !DILocation(line: 391, column: 3, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !61, line: 391, column: 3)
