; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/symbrdn/symbadbrdn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/symbrdn/symbadbrdn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!270 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!278 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!279 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!280 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!281 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 161, baseType: !5, size: 32, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291}
!284 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1265, baseType: !5, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!295 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1203, baseType: !5, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 187, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 663, baseType: !5, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318}
!316 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 790, baseType: !5, size: 32, elements: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!321 = !{!322, !323, !324, !325}
!322 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_NONE", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_SCALAR", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_DIAGONAL", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_USER", value: 3, isUnsigned: true)
!326 = !{!327, !331, !332, !535, !367, !1601, !1640}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !328, line: 330, baseType: !329)
!328 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !328, line: 330, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !335, line: 73, size: 4480, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !339, !388, !389, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !433, !434, !436, !438, !439, !440, !441, !442, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !468, !470, !471, !475, !476, !525, !530, !532, !533, !534}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !334, file: !335, line: 74, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !334, file: !335, line: 75, baseType: !340, size: 448, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 448, elements: !386)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !335, line: 53, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 45, size: 448, elements: !343)
!343 = !{!344, !350, !358, !363, !370, !374, !381}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !342, file: !335, line: 46, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !332, !349}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !335, line: 47, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!348, !332, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !355, line: 16, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !355, line: 16, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !335, line: 48, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!348, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !342, file: !335, line: 49, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!348, !332, !367, !332}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !342, file: !335, line: 50, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!348, !332, !367, !362}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !342, file: !335, line: 51, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!348, !332, !367, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !342, file: !335, line: 52, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!348, !332, !367, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !334, file: !335, line: 76, baseType: !327, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !335, line: 77, baseType: !390, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !334, file: !335, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !334, file: !335, line: 80, baseType: !390, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !334, file: !335, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !334, file: !335, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !334, file: !335, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !334, file: !335, line: 84, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !334, file: !335, line: 85, baseType: !417, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !334, file: !335, line: 86, baseType: !417, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !334, file: !335, line: 87, baseType: !417, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !334, file: !335, line: 88, baseType: !332, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !334, file: !335, line: 89, baseType: !398, size: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !335, line: 90, baseType: !417, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !334, file: !335, line: 91, baseType: !417, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !334, file: !335, line: 92, baseType: !390, size: 32, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !334, file: !335, line: 93, baseType: !331, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !335, line: 94, baseType: !428, size: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !399)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !334, file: !335, line: 95, baseType: !390, size: 32, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !334, file: !335, line: 95, baseType: !390, size: 32, offset: 1888)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !334, file: !335, line: 96, baseType: !432, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !334, file: !335, line: 96, baseType: !432, size: 64, offset: 1984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !334, file: !335, line: 97, baseType: !435, size: 64, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !334, file: !335, line: 97, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !334, file: !335, line: 98, baseType: !390, size: 32, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !334, file: !335, line: 98, baseType: !390, size: 32, offset: 2208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !334, file: !335, line: 99, baseType: !432, size: 64, offset: 2240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !334, file: !335, line: 99, baseType: !432, size: 64, offset: 2304)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !334, file: !335, line: 100, baseType: !443, size: 64, offset: 2368)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !334, file: !335, line: 100, baseType: !446, size: 64, offset: 2432)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !334, file: !335, line: 101, baseType: !390, size: 32, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !334, file: !335, line: 101, baseType: !390, size: 32, offset: 2528)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !334, file: !335, line: 102, baseType: !432, size: 64, offset: 2560)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !334, file: !335, line: 102, baseType: !432, size: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !334, file: !335, line: 103, baseType: !452, size: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !444)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !334, file: !335, line: 103, baseType: !455, size: 64, offset: 2752)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !334, file: !335, line: 104, baseType: !385, size: 64, offset: 2816)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !334, file: !335, line: 105, baseType: !390, size: 32, offset: 2880)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !334, file: !335, line: 106, baseType: !459, size: 128, offset: 2944)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !466)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !335, line: 64, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 61, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !462, file: !335, line: 62, baseType: !378, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !462, file: !335, line: 63, baseType: !331, size: 64, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 2)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !334, file: !335, line: 107, baseType: !469, size: 64, offset: 3072)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !466)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !334, file: !335, line: 108, baseType: !331, size: 64, offset: 3136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !334, file: !335, line: 109, baseType: !472, size: 64, offset: 3200)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!348, !331}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !334, file: !335, line: 111, baseType: !390, size: 32, offset: 3264)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !334, file: !335, line: 112, baseType: !477, size: 320, offset: 3328)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !523)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!348, !481, !332, !331}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !484)
!484 = !{!485, !486, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !483, file: !10, line: 100, baseType: !390, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 101, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !498, !499, !500, !504, !506, !508, !509, !510}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !489, file: !10, line: 84, baseType: !417, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !489, file: !10, line: 85, baseType: !417, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !10, line: 86, baseType: !331, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !489, file: !10, line: 87, baseType: !409, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !489, file: !10, line: 88, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !489, file: !10, line: 89, baseType: !369, size: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !489, file: !10, line: 90, baseType: !417, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !489, file: !10, line: 91, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !502, line: 46, baseType: !503)
!502 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!503 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !489, file: !10, line: 92, baseType: !505, size: 32, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !10, line: 93, baseType: !507, size: 32, offset: 544)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !10, line: 94, baseType: !487, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !489, file: !10, line: 95, baseType: !417, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !489, file: !10, line: 96, baseType: !331, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !483, file: !10, line: 103, baseType: !417, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !483, file: !10, line: 104, baseType: !327, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !483, file: !10, line: 106, baseType: !332, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !483, file: !10, line: 107, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!523 = !{!524}
!524 = !DISubrange(count: 5)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !334, file: !335, line: 113, baseType: !526, size: 320, offset: 3648)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!348, !332, !331}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !334, file: !335, line: 114, baseType: !531, size: 320, offset: 3968)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 320, elements: !523)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !334, file: !335, line: 115, baseType: !505, size: 32, offset: 4288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !334, file: !335, line: 120, baseType: !520, size: 64, offset: 4352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !334, file: !335, line: 121, baseType: !505, size: 32, offset: 4416)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !537, line: 52, baseType: !538)
!537 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 27, size: 6208, elements: !539)
!539 = !{!540, !542, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1593, !1597, !1598, !1599, !1600}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !538, file: !537, line: 29, baseType: !541, size: 4480)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !335, line: 122, baseType: !334)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !538, file: !537, line: 29, baseType: !543, size: 320, offset: 4480)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 320, elements: !386)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !537, line: 19, size: 320, elements: !545)
!545 = !{!546, !1563, !1564, !1565, !1566}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !544, file: !537, line: 20, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!348, !550, !579, !579}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !553, line: 436, size: 23424, elements: !554)
!553 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!554 = !{!555, !556, !1338, !1339, !1340, !1341, !1343, !1344, !1345, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1459, !1460, !1476, !1477, !1478, !1479, !1480, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1515, !1535, !1536, !1538, !1539, !1540, !1541, !1542, !1543, !1561, !1562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !552, file: !553, line: 437, baseType: !541, size: 4480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !552, file: !553, line: 437, baseType: !557, size: 9472, offset: 4480)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 9472, elements: !386)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !553, line: 32, size: 9472, elements: !559)
!559 = !{!560, !569, !573, !574, !575, !874, !875, !876, !877, !878, !879, !880, !900, !904, !909, !915, !934, !939, !943, !944, !948, !953, !954, !959, !963, !967, !971, !975, !979, !980, !981, !982, !983, !987, !988, !993, !994, !995, !996, !997, !1002, !1009, !1013, !1017, !1021, !1025, !1029, !1030, !1034, !1035, !1039, !1044, !1045, !1046, !1047, !1109, !1117, !1118, !1122, !1123, !1127, !1128, !1132, !1137, !1138, !1142, !1146, !1150, !1151, !1152, !1153, !1154, !1155, !1160, !1161, !1165, !1169, !1173, !1174, !1175, !1179, !1189, !1190, !1194, !1195, !1199, !1200, !1204, !1205, !1209, !1210, !1214, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1252, !1253, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1269, !1270, !1274, !1278, !1279, !1283, !1284, !1285, !1286, !1312, !1316, !1317, !1318, !1319, !1320, !1324, !1325, !1326, !1327, !1328, !1332, !1336, !1337}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !558, file: !553, line: 34, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!348, !550, !390, !564, !390, !564, !566, !568}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !558, file: !553, line: 35, baseType: !570, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!348, !550, !390, !435, !437, !455}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !558, file: !553, line: 36, baseType: !570, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !558, file: !553, line: 37, baseType: !547, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !558, file: !553, line: 38, baseType: !576, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!348, !550, !579, !579, !579}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !582, line: 142, size: 12800, elements: !583)
!582 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!583 = !{!584, !585, !800, !820, !821, !822, !868, !869, !870, !871, !873}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !581, file: !582, line: 143, baseType: !541, size: 4480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !581, file: !582, line: 143, baseType: !586, size: 5248, offset: 4480)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 5248, elements: !386)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !582, line: 23, size: 5248, elements: !588)
!588 = !{!589, !594, !599, !603, !607, !613, !618, !619, !620, !624, !628, !629, !630, !634, !638, !642, !643, !647, !651, !655, !656, !660, !664, !665, !669, !673, !674, !675, !679, !680, !687, !692, !693, !694, !698, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !719, !720, !721, !725, !729, !730, !731, !732, !736, !737, !738, !739, !740, !741, !742, !746, !747, !751, !758, !759, !764, !765, !769, !770, !771, !772, !773, !774, !775, !776, !780, !781, !782, !788, !792, !793, !794}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !587, file: !582, line: 24, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!348, !579, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !587, file: !582, line: 25, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!348, !579, !390, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !587, file: !582, line: 26, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!348, !390, !593}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !587, file: !582, line: 27, baseType: !604, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!348, !579, !579, !452}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !587, file: !582, line: 28, baseType: !608, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!348, !579, !390, !611, !452}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !587, file: !582, line: 29, baseType: !614, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!348, !579, !617, !443}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !587, file: !582, line: 30, baseType: !604, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !587, file: !582, line: 31, baseType: !608, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !587, file: !582, line: 32, baseType: !621, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!348, !579, !453}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !587, file: !582, line: 33, baseType: !625, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!348, !579, !579}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !587, file: !582, line: 34, baseType: !621, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !587, file: !582, line: 35, baseType: !625, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !587, file: !582, line: 36, baseType: !631, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!348, !579, !453, !579}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !587, file: !582, line: 37, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!348, !579, !453, !453, !579}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !587, file: !582, line: 38, baseType: !639, size: 64, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!348, !579, !390, !566, !593}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !587, file: !582, line: 39, baseType: !631, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !587, file: !582, line: 40, baseType: !644, size: 64, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!348, !579, !453, !579, !579}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !587, file: !582, line: 41, baseType: !648, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!348, !579, !453, !453, !453, !579, !579}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !587, file: !582, line: 42, baseType: !652, size: 64, offset: 1152)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!348, !579, !579, !579}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !587, file: !582, line: 43, baseType: !652, size: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !587, file: !582, line: 44, baseType: !657, size: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!348, !579, !390, !564, !566, !568}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !587, file: !582, line: 45, baseType: !661, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!348, !579}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !587, file: !582, line: 46, baseType: !661, size: 64, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !587, file: !582, line: 47, baseType: !666, size: 64, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!348, !579, !455}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !587, file: !582, line: 48, baseType: !670, size: 64, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!348, !579, !435}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !587, file: !582, line: 49, baseType: !670, size: 64, offset: 1600)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !587, file: !582, line: 50, baseType: !666, size: 64, offset: 1664)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !587, file: !582, line: 51, baseType: !676, size: 64, offset: 1728)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!348, !579, !435, !443}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !587, file: !582, line: 52, baseType: !676, size: 64, offset: 1792)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !587, file: !582, line: 53, baseType: !681, size: 64, offset: 1856)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!348, !579, !684}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !587, file: !582, line: 54, baseType: !688, size: 64, offset: 1920)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!348, !579, !691, !505}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !587, file: !582, line: 55, baseType: !657, size: 64, offset: 1984)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !587, file: !582, line: 56, baseType: !661, size: 64, offset: 2048)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !587, file: !582, line: 57, baseType: !695, size: 64, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!348, !579, !354}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !587, file: !582, line: 58, baseType: !699, size: 64, offset: 2176)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!348, !579, !566}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !587, file: !582, line: 59, baseType: !699, size: 64, offset: 2240)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !587, file: !582, line: 60, baseType: !604, size: 64, offset: 2304)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !587, file: !582, line: 61, baseType: !604, size: 64, offset: 2368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !587, file: !582, line: 62, baseType: !614, size: 64, offset: 2432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !587, file: !582, line: 63, baseType: !608, size: 64, offset: 2496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !587, file: !582, line: 64, baseType: !608, size: 64, offset: 2560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !587, file: !582, line: 65, baseType: !695, size: 64, offset: 2624)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !587, file: !582, line: 66, baseType: !661, size: 64, offset: 2688)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !587, file: !582, line: 67, baseType: !661, size: 64, offset: 2752)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !587, file: !582, line: 68, baseType: !712, size: 64, offset: 2816)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!348, !579, !715}
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !716, line: 30, baseType: !717)
!716 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !716, line: 30, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !587, file: !582, line: 69, baseType: !657, size: 64, offset: 2880)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !587, file: !582, line: 70, baseType: !661, size: 64, offset: 2944)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !587, file: !582, line: 71, baseType: !722, size: 64, offset: 3008)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!348, !481, !579}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !587, file: !582, line: 72, baseType: !726, size: 64, offset: 3072)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!348, !579, !579, !443}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !587, file: !582, line: 73, baseType: !652, size: 64, offset: 3136)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !587, file: !582, line: 74, baseType: !652, size: 64, offset: 3200)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !587, file: !582, line: 75, baseType: !652, size: 64, offset: 3264)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !587, file: !582, line: 76, baseType: !733, size: 64, offset: 3328)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!348, !579, !390, !564, !452}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !587, file: !582, line: 77, baseType: !661, size: 64, offset: 3392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !587, file: !582, line: 78, baseType: !661, size: 64, offset: 3456)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !587, file: !582, line: 79, baseType: !661, size: 64, offset: 3520)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !587, file: !582, line: 80, baseType: !661, size: 64, offset: 3584)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !587, file: !582, line: 81, baseType: !621, size: 64, offset: 3648)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !587, file: !582, line: 82, baseType: !661, size: 64, offset: 3712)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !587, file: !582, line: 83, baseType: !743, size: 64, offset: 3776)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!348, !579, !390, !579, !568}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !587, file: !582, line: 84, baseType: !743, size: 64, offset: 3840)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !587, file: !582, line: 85, baseType: !748, size: 64, offset: 3904)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!348, !579, !579, !452, !452}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !587, file: !582, line: 86, baseType: !752, size: 64, offset: 3968)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!348, !579, !755, !593}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !716, line: 11, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !716, line: 11, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !587, file: !582, line: 87, baseType: !752, size: 64, offset: 4032)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !587, file: !582, line: 88, baseType: !760, size: 64, offset: 4096)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!348, !579, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !587, file: !582, line: 89, baseType: !760, size: 64, offset: 4160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !587, file: !582, line: 90, baseType: !766, size: 64, offset: 4224)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!348, !579, !390, !564, !564, !579, !568}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !587, file: !582, line: 91, baseType: !766, size: 64, offset: 4288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !587, file: !582, line: 92, baseType: !695, size: 64, offset: 4352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !587, file: !582, line: 93, baseType: !695, size: 64, offset: 4416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !587, file: !582, line: 94, baseType: !625, size: 64, offset: 4480)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !587, file: !582, line: 95, baseType: !625, size: 64, offset: 4544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !587, file: !582, line: 96, baseType: !625, size: 64, offset: 4608)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !587, file: !582, line: 97, baseType: !625, size: 64, offset: 4672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !587, file: !582, line: 98, baseType: !777, size: 64, offset: 4736)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!348, !579, !505}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !587, file: !582, line: 99, baseType: !666, size: 64, offset: 4800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !587, file: !582, line: 100, baseType: !666, size: 64, offset: 4864)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !587, file: !582, line: 101, baseType: !783, size: 64, offset: 4928)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!348, !579, !455, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !587, file: !582, line: 102, baseType: !789, size: 64, offset: 4992)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!348, !579, !763, !786}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !587, file: !582, line: 103, baseType: !666, size: 64, offset: 5056)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !587, file: !582, line: 104, baseType: !760, size: 64, offset: 5120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !587, file: !582, line: 105, baseType: !795, size: 64, offset: 5184)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!348, !390, !611, !593, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !581, file: !582, line: 144, baseType: !801, size: 64, offset: 9728)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !716, line: 60, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !803, file: !133, line: 241, baseType: !327, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !803, file: !133, line: 242, baseType: !407, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !803, file: !133, line: 243, baseType: !390, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !803, file: !133, line: 243, baseType: !390, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !803, file: !133, line: 244, baseType: !390, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !803, file: !133, line: 244, baseType: !390, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !803, file: !133, line: 245, baseType: !435, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !803, file: !133, line: 246, baseType: !505, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !803, file: !133, line: 247, baseType: !390, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !803, file: !133, line: 251, baseType: !390, size: 32, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !803, file: !133, line: 252, baseType: !715, size: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !803, file: !133, line: 253, baseType: !505, size: 32, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !803, file: !133, line: 254, baseType: !390, size: 32, offset: 544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !803, file: !133, line: 254, baseType: !390, size: 32, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !803, file: !133, line: 255, baseType: !390, size: 32, offset: 608)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !581, file: !582, line: 145, baseType: !331, size: 64, offset: 9792)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !581, file: !582, line: 146, baseType: !505, size: 32, offset: 9856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !581, file: !582, line: 147, baseType: !823, size: 1344, offset: 9920)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !582, line: 140, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 114, size: 1344, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !844, !845, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !824, file: !582, line: 115, baseType: !390, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !824, file: !582, line: 116, baseType: !390, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !824, file: !582, line: 117, baseType: !390, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !824, file: !582, line: 118, baseType: !390, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !824, file: !582, line: 119, baseType: !390, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !824, file: !582, line: 120, baseType: !390, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !824, file: !582, line: 121, baseType: !435, size: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !824, file: !582, line: 122, baseType: !452, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !824, file: !582, line: 124, baseType: !327, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !824, file: !582, line: 125, baseType: !407, size: 32, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !824, file: !582, line: 125, baseType: !407, size: 32, offset: 416)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !824, file: !582, line: 126, baseType: !407, size: 32, offset: 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !824, file: !582, line: 126, baseType: !407, size: 32, offset: 480)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !824, file: !582, line: 127, baseType: !840, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !328, line: 339, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !328, line: 339, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !824, file: !582, line: 128, baseType: !840, size: 64, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !824, file: !582, line: 129, baseType: !846, size: 64, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !328, line: 341, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !328, line: 351, size: 192, elements: !849)
!849 = !{!850, !851, !852, !853, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !848, file: !328, line: 354, baseType: !91, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !848, file: !328, line: 355, baseType: !91, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !848, file: !328, line: 356, baseType: !91, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !848, file: !328, line: 361, baseType: !91, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !848, file: !328, line: 362, baseType: !501, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !824, file: !582, line: 130, baseType: !390, size: 32, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !824, file: !582, line: 130, baseType: !390, size: 32, offset: 736)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !824, file: !582, line: 131, baseType: !452, size: 64, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !824, file: !582, line: 131, baseType: !452, size: 64, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !824, file: !582, line: 132, baseType: !435, size: 64, offset: 896)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !824, file: !582, line: 132, baseType: !435, size: 64, offset: 960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !824, file: !582, line: 133, baseType: !390, size: 32, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !824, file: !582, line: 134, baseType: !435, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !824, file: !582, line: 135, baseType: !390, size: 32, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !824, file: !582, line: 136, baseType: !505, size: 32, offset: 1184)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !824, file: !582, line: 137, baseType: !505, size: 32, offset: 1216)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !824, file: !582, line: 138, baseType: !568, size: 32, offset: 1248)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !824, file: !582, line: 139, baseType: !435, size: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !581, file: !582, line: 147, baseType: !823, size: 1344, offset: 11264)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !581, file: !582, line: 148, baseType: !505, size: 32, offset: 12608)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !581, file: !582, line: 149, baseType: !390, size: 32, offset: 12640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !581, file: !582, line: 150, baseType: !872, size: 32, offset: 12672)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !581, file: !582, line: 157, baseType: !417, size: 64, offset: 12736)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !558, file: !553, line: 40, baseType: !547, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !558, file: !553, line: 41, baseType: !576, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !558, file: !553, line: 42, baseType: !547, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !558, file: !553, line: 43, baseType: !576, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !558, file: !553, line: 44, baseType: !547, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !558, file: !553, line: 46, baseType: !576, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !558, file: !553, line: 47, baseType: !881, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!348, !550, !755, !755, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !887, file: !63, line: 1227, baseType: !444, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !887, file: !63, line: 1228, baseType: !444, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !887, file: !63, line: 1229, baseType: !444, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !887, file: !63, line: 1230, baseType: !444, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !887, file: !63, line: 1231, baseType: !444, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !887, file: !63, line: 1232, baseType: !444, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !887, file: !63, line: 1233, baseType: !444, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !887, file: !63, line: 1234, baseType: !444, size: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !887, file: !63, line: 1236, baseType: !444, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !887, file: !63, line: 1237, baseType: !444, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !887, file: !63, line: 1238, baseType: !444, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !558, file: !553, line: 48, baseType: !901, size: 64, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!348, !550, !755, !884}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !558, file: !553, line: 49, baseType: !905, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!348, !550, !579, !444, !908, !444, !390, !390, !579}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !558, file: !553, line: 50, baseType: !910, size: 64, offset: 896)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!348, !550, !913, !914}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !558, file: !553, line: 52, baseType: !916, size: 64, offset: 960)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!348, !550, !919, !920}
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !922, file: !63, line: 593, baseType: !392, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !922, file: !63, line: 594, baseType: !392, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !922, file: !63, line: 594, baseType: !392, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !922, file: !63, line: 594, baseType: !392, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !922, file: !63, line: 595, baseType: !392, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !922, file: !63, line: 596, baseType: !392, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !922, file: !63, line: 597, baseType: !392, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !922, file: !63, line: 598, baseType: !392, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !922, file: !63, line: 598, baseType: !392, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !922, file: !63, line: 599, baseType: !392, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !558, file: !553, line: 53, baseType: !935, size: 64, offset: 1024)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!348, !550, !550, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !558, file: !553, line: 54, baseType: !940, size: 64, offset: 1088)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!348, !550, !579}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !558, file: !553, line: 55, baseType: !547, size: 64, offset: 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !558, file: !553, line: 56, baseType: !945, size: 64, offset: 1216)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!348, !550, !617, !443}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !558, file: !553, line: 58, baseType: !949, size: 64, offset: 1280)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!348, !550, !952}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !558, file: !553, line: 59, baseType: !949, size: 64, offset: 1344)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !558, file: !553, line: 60, baseType: !955, size: 64, offset: 1408)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!348, !550, !958, !505}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !558, file: !553, line: 61, baseType: !960, size: 64, offset: 1472)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!348, !550}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !558, file: !553, line: 63, baseType: !964, size: 64, offset: 1536)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!348, !550, !390, !564, !453, !579, !579}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !558, file: !553, line: 64, baseType: !968, size: 64, offset: 1600)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!348, !550, !550, !755, !755, !884}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !558, file: !553, line: 65, baseType: !972, size: 64, offset: 1664)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!348, !550, !550, !884}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !558, file: !553, line: 66, baseType: !976, size: 64, offset: 1728)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!348, !550, !550, !755, !884}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !558, file: !553, line: 67, baseType: !972, size: 64, offset: 1792)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !558, file: !553, line: 69, baseType: !960, size: 64, offset: 1856)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !558, file: !553, line: 70, baseType: !968, size: 64, offset: 1920)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !558, file: !553, line: 71, baseType: !976, size: 64, offset: 1984)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !558, file: !553, line: 72, baseType: !984, size: 64, offset: 2048)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!348, !550, !914}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !558, file: !553, line: 73, baseType: !960, size: 64, offset: 2112)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !558, file: !553, line: 75, baseType: !989, size: 64, offset: 2176)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!348, !550, !992, !914}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !558, file: !553, line: 76, baseType: !547, size: 64, offset: 2240)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !558, file: !553, line: 77, baseType: !547, size: 64, offset: 2304)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !558, file: !553, line: 78, baseType: !881, size: 64, offset: 2368)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !558, file: !553, line: 79, baseType: !901, size: 64, offset: 2432)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !558, file: !553, line: 81, baseType: !998, size: 64, offset: 2496)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!348, !550, !453, !550, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !558, file: !553, line: 82, baseType: !1003, size: 64, offset: 2560)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!348, !550, !390, !1006, !1006, !913, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !558, file: !553, line: 83, baseType: !1010, size: 64, offset: 2624)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!348, !550, !390, !799, !390}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !558, file: !553, line: 84, baseType: !1014, size: 64, offset: 2688)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!348, !550, !390, !564, !390, !564, !452}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !558, file: !553, line: 85, baseType: !1018, size: 64, offset: 2752)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!348, !550, !550, !1001}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !558, file: !553, line: 87, baseType: !1022, size: 64, offset: 2816)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!348, !550, !579, !435}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !558, file: !553, line: 88, baseType: !1026, size: 64, offset: 2880)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!348, !550, !453}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !558, file: !553, line: 89, baseType: !1026, size: 64, offset: 2944)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !558, file: !553, line: 90, baseType: !1031, size: 64, offset: 3008)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!348, !550, !579, !568}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !558, file: !553, line: 91, baseType: !964, size: 64, offset: 3072)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !558, file: !553, line: 93, baseType: !1036, size: 64, offset: 3136)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!348, !550, !684}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !558, file: !553, line: 94, baseType: !1040, size: 64, offset: 3200)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!348, !550, !390, !505, !505, !435, !1043, !1043, !938}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !558, file: !553, line: 95, baseType: !1040, size: 64, offset: 3264)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !558, file: !553, line: 96, baseType: !1040, size: 64, offset: 3328)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !558, file: !553, line: 97, baseType: !1040, size: 64, offset: 3392)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !558, file: !553, line: 99, baseType: !1048, size: 64, offset: 3456)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!348, !550, !1051, !1054}
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !716, line: 51, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !716, line: 51, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !553, line: 609, size: 6208, elements: !1057)
!1057 = !{!1058, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1078, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1096, !1097, !1098, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1056, file: !553, line: 610, baseType: !541, size: 4480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1056, file: !553, line: 610, baseType: !1060, size: 32, offset: 4480)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !386)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1056, file: !553, line: 611, baseType: !390, size: 32, offset: 4512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1056, file: !553, line: 611, baseType: !390, size: 32, offset: 4544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1056, file: !553, line: 611, baseType: !390, size: 32, offset: 4576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1056, file: !553, line: 612, baseType: !390, size: 32, offset: 4608)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1056, file: !553, line: 613, baseType: !390, size: 32, offset: 4640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1056, file: !553, line: 614, baseType: !435, size: 64, offset: 4672)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1056, file: !553, line: 615, baseType: !437, size: 64, offset: 4736)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1056, file: !553, line: 616, baseType: !799, size: 64, offset: 4800)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1056, file: !553, line: 617, baseType: !435, size: 64, offset: 4864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1056, file: !553, line: 618, baseType: !1071, size: 64, offset: 4928)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !553, line: 602, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 598, size: 128, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1073, file: !553, line: 599, baseType: !390, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1073, file: !553, line: 600, baseType: !390, size: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1073, file: !553, line: 601, baseType: !452, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1056, file: !553, line: 619, baseType: !1079, size: 64, offset: 4992)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !553, line: 607, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 604, size: 128, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1081, file: !553, line: 605, baseType: !390, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1081, file: !553, line: 606, baseType: !452, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1056, file: !553, line: 620, baseType: !452, size: 64, offset: 5056)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1056, file: !553, line: 621, baseType: !444, size: 64, offset: 5120)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1056, file: !553, line: 622, baseType: !444, size: 64, offset: 5184)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1056, file: !553, line: 623, baseType: !579, size: 64, offset: 5248)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1056, file: !553, line: 623, baseType: !579, size: 64, offset: 5312)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1056, file: !553, line: 623, baseType: !579, size: 64, offset: 5376)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1056, file: !553, line: 624, baseType: !505, size: 32, offset: 5440)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1056, file: !553, line: 625, baseType: !1093, size: 64, offset: 5504)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!348}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1056, file: !553, line: 626, baseType: !331, size: 64, offset: 5568)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1056, file: !553, line: 627, baseType: !579, size: 64, offset: 5632)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1056, file: !553, line: 628, baseType: !390, size: 32, offset: 5696)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1056, file: !553, line: 629, baseType: !367, size: 64, offset: 5760)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1056, file: !553, line: 630, baseType: !1101, size: 32, offset: 5824)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1056, file: !553, line: 631, baseType: !390, size: 32, offset: 5856)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1056, file: !553, line: 631, baseType: !390, size: 32, offset: 5888)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1056, file: !553, line: 632, baseType: !505, size: 32, offset: 5920)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1056, file: !553, line: 633, baseType: !505, size: 32, offset: 5952)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1056, file: !553, line: 634, baseType: !378, size: 64, offset: 6016)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1056, file: !553, line: 634, baseType: !331, size: 64, offset: 6080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1056, file: !553, line: 635, baseType: !398, size: 64, offset: 6144)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !558, file: !553, line: 100, baseType: !1110, size: 64, offset: 3520)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!348, !550, !390, !390, !1113, !1116}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1115)
!1115 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !558, file: !553, line: 101, baseType: !960, size: 64, offset: 3584)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !558, file: !553, line: 102, baseType: !1119, size: 64, offset: 3648)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!348, !550, !755, !755, !914}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !558, file: !553, line: 103, baseType: !561, size: 64, offset: 3712)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !558, file: !553, line: 105, baseType: !1124, size: 64, offset: 3776)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!348, !550, !755, !755, !913, !914}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !558, file: !553, line: 106, baseType: !960, size: 64, offset: 3840)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !558, file: !553, line: 107, baseType: !1129, size: 64, offset: 3904)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!348, !550, !354}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !558, file: !553, line: 108, baseType: !1133, size: 64, offset: 3968)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!348, !550, !1136, !913, !914}
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !367)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !558, file: !553, line: 109, baseType: !1093, size: 64, offset: 4032)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !558, file: !553, line: 111, baseType: !1139, size: 64, offset: 4096)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!348, !550, !550, !550, !444, !550}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !558, file: !553, line: 112, baseType: !1143, size: 64, offset: 4160)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!348, !550, !550, !550, !550}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !558, file: !553, line: 113, baseType: !1147, size: 64, offset: 4224)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!348, !550, !715, !715}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !558, file: !553, line: 114, baseType: !561, size: 64, offset: 4288)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !558, file: !553, line: 115, baseType: !964, size: 64, offset: 4352)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !558, file: !553, line: 117, baseType: !1022, size: 64, offset: 4416)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !558, file: !553, line: 118, baseType: !1022, size: 64, offset: 4480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !558, file: !553, line: 119, baseType: !1133, size: 64, offset: 4544)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !558, file: !553, line: 120, baseType: !1156, size: 64, offset: 4608)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!348, !550, !1159, !938}
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !558, file: !553, line: 121, baseType: !1093, size: 64, offset: 4672)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !558, file: !553, line: 123, baseType: !1162, size: 64, offset: 4736)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!348, !550, !390, !331}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !558, file: !553, line: 124, baseType: !1166, size: 64, offset: 4800)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!348, !550, !1054, !579, !331}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !558, file: !553, line: 125, baseType: !1170, size: 64, offset: 4864)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!348, !481, !550}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !558, file: !553, line: 126, baseType: !547, size: 64, offset: 4928)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !558, file: !553, line: 127, baseType: !547, size: 64, offset: 4992)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !558, file: !553, line: 129, baseType: !1176, size: 64, offset: 5056)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!348, !550, !799}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !558, file: !553, line: 130, baseType: !1180, size: 64, offset: 5120)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!348, !550, !1183, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1185, file: !36, line: 653, baseType: !390, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1185, file: !36, line: 653, baseType: !579, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !558, file: !553, line: 131, baseType: !1180, size: 64, offset: 5184)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !558, file: !553, line: 132, baseType: !1191, size: 64, offset: 5248)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!348, !550, !435, !435, !435}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !558, file: !553, line: 133, baseType: !1129, size: 64, offset: 5312)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !558, file: !553, line: 135, baseType: !1196, size: 64, offset: 5376)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!348, !550, !444, !938}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !558, file: !553, line: 136, baseType: !1196, size: 64, offset: 5440)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !558, file: !553, line: 137, baseType: !1201, size: 64, offset: 5504)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!348, !550, !938}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !558, file: !553, line: 138, baseType: !561, size: 64, offset: 5568)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !558, file: !553, line: 139, baseType: !1206, size: 64, offset: 5632)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!348, !550, !593, !593}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !558, file: !553, line: 141, baseType: !1093, size: 64, offset: 5696)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !558, file: !553, line: 142, baseType: !1211, size: 64, offset: 5760)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!348, !550, !550, !444, !550}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !558, file: !553, line: 143, baseType: !1215, size: 64, offset: 5824)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!348, !550, !550, !550}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !558, file: !553, line: 144, baseType: !1093, size: 64, offset: 5888)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !558, file: !553, line: 145, baseType: !1211, size: 64, offset: 5952)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !558, file: !553, line: 147, baseType: !1215, size: 64, offset: 6016)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !558, file: !553, line: 148, baseType: !1093, size: 64, offset: 6080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !558, file: !553, line: 149, baseType: !1211, size: 64, offset: 6144)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !558, file: !553, line: 150, baseType: !1215, size: 64, offset: 6208)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !558, file: !553, line: 151, baseType: !1225, size: 64, offset: 6272)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!348, !550, !505}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !558, file: !553, line: 153, baseType: !960, size: 64, offset: 6336)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !558, file: !553, line: 154, baseType: !960, size: 64, offset: 6400)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !558, file: !553, line: 155, baseType: !960, size: 64, offset: 6464)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !558, file: !553, line: 156, baseType: !960, size: 64, offset: 6528)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !558, file: !553, line: 157, baseType: !1129, size: 64, offset: 6592)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !558, file: !553, line: 159, baseType: !1234, size: 64, offset: 6656)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!348, !550, !390, !566}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !558, file: !553, line: 160, baseType: !960, size: 64, offset: 6720)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !558, file: !553, line: 161, baseType: !960, size: 64, offset: 6784)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !558, file: !553, line: 162, baseType: !960, size: 64, offset: 6848)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !558, file: !553, line: 163, baseType: !960, size: 64, offset: 6912)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !558, file: !553, line: 165, baseType: !1215, size: 64, offset: 6976)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !558, file: !553, line: 166, baseType: !1215, size: 64, offset: 7040)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !558, file: !553, line: 167, baseType: !1022, size: 64, offset: 7104)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !558, file: !553, line: 168, baseType: !1245, size: 64, offset: 7168)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!348, !550, !579, !390}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !558, file: !553, line: 169, baseType: !1249, size: 64, offset: 7232)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!348, !550, !938, !435}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !558, file: !553, line: 171, baseType: !984, size: 64, offset: 7296)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !558, file: !553, line: 172, baseType: !960, size: 64, offset: 7360)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !558, file: !553, line: 173, baseType: !1255, size: 64, offset: 7424)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!348, !550, !435, !1043}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !558, file: !553, line: 174, baseType: !1119, size: 64, offset: 7488)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !558, file: !553, line: 175, baseType: !1119, size: 64, offset: 7552)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !558, file: !553, line: 177, baseType: !547, size: 64, offset: 7616)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !558, file: !553, line: 178, baseType: !910, size: 64, offset: 7680)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !558, file: !553, line: 179, baseType: !547, size: 64, offset: 7744)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !558, file: !553, line: 180, baseType: !576, size: 64, offset: 7808)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !558, file: !553, line: 181, baseType: !1265, size: 64, offset: 7872)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!348, !550, !327, !913, !914}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !558, file: !553, line: 183, baseType: !1176, size: 64, offset: 7936)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !558, file: !553, line: 184, baseType: !945, size: 64, offset: 8000)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !558, file: !553, line: 185, baseType: !1271, size: 64, offset: 8064)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!348, !550, !763}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !558, file: !553, line: 186, baseType: !1275, size: 64, offset: 8128)
