; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/ftn-custom/zmpiadjf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/ftn-custom/zmpiadjf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !{!301, !302, !305, !308, !312, !313}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !303, line: 100, baseType: !304)
!303 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!304 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !309, line: 330, baseType: !310)
!309 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !309, line: 330, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAdj", file: !315, line: 25, baseType: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/adj/mpi/mpiadj.h", directory: "/home/users/ndemeye/xSDK")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 13, size: 576, elements: !317)
!317 = !{!318, !320, !322, !323, !324, !325, !327, !328, !329, !330, !335}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !316, file: !315, line: 14, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !316, file: !315, line: 15, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !316, file: !315, line: 16, baseType: !321, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !316, file: !315, line: 17, baseType: !321, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !316, file: !315, line: 18, baseType: !321, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "useedgeweights", scope: !316, file: !315, line: 19, baseType: !326, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !316, file: !315, line: 20, baseType: !326, size: 32, offset: 352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "freeaij", scope: !316, file: !315, line: 21, baseType: !326, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "freeaijwithfree", scope: !316, file: !315, line: 22, baseType: !326, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rowvalues", scope: !316, file: !315, line: 23, baseType: !331, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !334)
!334 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rowvalues_alloc", scope: !316, file: !315, line: 24, baseType: !319, size: 32, offset: 512)
!336 = !{i32 7, !"Dwarf Version", i32 4}
!337 = !{i32 2, !"Debug Info Version", i32 3}
!338 = !{i32 1, !"wchar_size", i32 4}
!339 = !{i32 7, !"PIC Level", i32 2}
!340 = !{i32 7, !"uwtable", i32 1}
!341 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!342 = distinct !DISubprogram(name: "matcreatempiadj_", scope: !343, file: !343, line: 13, type: !344, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1310)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/ftn-custom/zmpiadjf.c", directory: "/home/users/ndemeye/xSDK")
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346, !321, !321, !321, !321, !321, !347, !1309}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !351, line: 436, size: 23424, elements: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!352 = !{!353, !546, !1052, !1072, !1073, !1074, !1076, !1077, !1078, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1205, !1206, !1222, !1223, !1224, !1225, !1226, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1261, !1281, !1282, !1284, !1285, !1286, !1287, !1288, !1289, !1307, !1308}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !350, file: !351, line: 437, baseType: !354, size: 4480)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !355, line: 122, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !355, line: 73, size: 4480, elements: !357)
!357 = !{!358, !360, !407, !408, !409, !411, !412, !413, !414, !422, !423, !425, !429, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !446, !447, !448, !450, !451, !452, !454, !455, !456, !457, !458, !460, !462, !463, !464, !465, !466, !467, !469, !470, !471, !481, !483, !484, !488, !489, !536, !541, !543, !544, !545}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !356, file: !355, line: 74, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !356, file: !355, line: 75, baseType: !361, size: 448, offset: 64)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 448, elements: !405)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !355, line: 53, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 45, size: 448, elements: !364)
!364 = !{!365, !372, !380, !385, !392, !396, !400}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !363, file: !355, line: 46, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!369, !370, !346}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !363, file: !355, line: 47, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!369, !370, !376}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !377, line: 16, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !377, line: 16, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !363, file: !355, line: 48, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!369, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !363, file: !355, line: 49, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!369, !370, !389, !370}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !363, file: !355, line: 50, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!369, !370, !389, !384}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !363, file: !355, line: 51, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!369, !370, !389, !305}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !363, file: !355, line: 52, baseType: !401, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!369, !370, !389, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!405 = !{!406}
!406 = !DISubrange(count: 1)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !356, file: !355, line: 76, baseType: !308, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !355, line: 77, baseType: !319, size: 32, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !356, file: !355, line: 78, baseType: !410, size: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !334)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !356, file: !355, line: 78, baseType: !410, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !356, file: !355, line: 78, baseType: !410, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !356, file: !355, line: 78, baseType: !410, size: 64, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !356, file: !355, line: 79, baseType: !415, size: 64, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !418, line: 27, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !420, line: 43, baseType: !421)
!420 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!421 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !356, file: !355, line: 80, baseType: !319, size: 32, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !356, file: !355, line: 81, baseType: !424, size: 32, offset: 992)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !356, file: !355, line: 82, baseType: !426, size: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !356, file: !355, line: 83, baseType: !430, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !356, file: !355, line: 84, baseType: !434, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !356, file: !355, line: 85, baseType: !434, size: 64, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !356, file: !355, line: 86, baseType: !434, size: 64, offset: 1280)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !356, file: !355, line: 87, baseType: !434, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !356, file: !355, line: 88, baseType: !370, size: 64, offset: 1408)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !356, file: !355, line: 89, baseType: !415, size: 64, offset: 1472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !355, line: 90, baseType: !434, size: 64, offset: 1536)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !356, file: !355, line: 91, baseType: !434, size: 64, offset: 1600)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !356, file: !355, line: 92, baseType: !319, size: 32, offset: 1664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !356, file: !355, line: 93, baseType: !301, size: 64, offset: 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !355, line: 94, baseType: !445, size: 64, offset: 1792)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !356, file: !355, line: 95, baseType: !319, size: 32, offset: 1856)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !356, file: !355, line: 95, baseType: !319, size: 32, offset: 1888)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !356, file: !355, line: 96, baseType: !449, size: 64, offset: 1920)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !356, file: !355, line: 96, baseType: !449, size: 64, offset: 1984)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !356, file: !355, line: 97, baseType: !321, size: 64, offset: 2048)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !356, file: !355, line: 97, baseType: !453, size: 64, offset: 2112)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !356, file: !355, line: 98, baseType: !319, size: 32, offset: 2176)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !356, file: !355, line: 98, baseType: !319, size: 32, offset: 2208)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !356, file: !355, line: 99, baseType: !449, size: 64, offset: 2240)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !356, file: !355, line: 99, baseType: !449, size: 64, offset: 2304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !356, file: !355, line: 100, baseType: !459, size: 64, offset: 2368)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !356, file: !355, line: 100, baseType: !461, size: 64, offset: 2432)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !356, file: !355, line: 101, baseType: !319, size: 32, offset: 2496)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !356, file: !355, line: 101, baseType: !319, size: 32, offset: 2528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !356, file: !355, line: 102, baseType: !449, size: 64, offset: 2560)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !356, file: !355, line: 102, baseType: !449, size: 64, offset: 2624)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !356, file: !355, line: 103, baseType: !331, size: 64, offset: 2688)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !356, file: !355, line: 103, baseType: !468, size: 64, offset: 2752)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !356, file: !355, line: 104, baseType: !404, size: 64, offset: 2816)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !356, file: !355, line: 105, baseType: !319, size: 32, offset: 2880)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !356, file: !355, line: 106, baseType: !472, size: 128, offset: 2944)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 128, elements: !479)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !355, line: 64, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 61, size: 128, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !475, file: !355, line: 62, baseType: !305, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !475, file: !355, line: 63, baseType: !301, size: 64, offset: 64)
!479 = !{!480}
!480 = !DISubrange(count: 2)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !356, file: !355, line: 107, baseType: !482, size: 64, offset: 3072)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !479)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !356, file: !355, line: 108, baseType: !301, size: 64, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !356, file: !355, line: 109, baseType: !485, size: 64, offset: 3200)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!369, !301}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !356, file: !355, line: 111, baseType: !319, size: 32, offset: 3264)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !356, file: !355, line: 112, baseType: !490, size: 320, offset: 3328)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 320, elements: !534)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!369, !494, !370, !301}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !497)
!497 = !{!498, !499, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !496, file: !10, line: 100, baseType: !319, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !10, line: 101, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !511, !512, !513, !516, !517, !519, !520, !521}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !502, file: !10, line: 84, baseType: !434, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !502, file: !10, line: 85, baseType: !434, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !502, file: !10, line: 86, baseType: !301, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !502, file: !10, line: 87, baseType: !426, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !502, file: !10, line: 88, baseType: !509, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !502, file: !10, line: 89, baseType: !391, size: 8, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !502, file: !10, line: 90, baseType: !434, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !502, file: !10, line: 91, baseType: !514, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !515, line: 46, baseType: !304)
!515 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!516 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !502, file: !10, line: 92, baseType: !326, size: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !10, line: 93, baseType: !518, size: 32, offset: 544)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !10, line: 94, baseType: !500, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !502, file: !10, line: 95, baseType: !434, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !502, file: !10, line: 96, baseType: !301, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !496, file: !10, line: 102, baseType: !434, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !496, file: !10, line: 102, baseType: !434, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !496, file: !10, line: 103, baseType: !434, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !496, file: !10, line: 104, baseType: !308, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !496, file: !10, line: 105, baseType: !326, size: 32, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !496, file: !10, line: 105, baseType: !326, size: 32, offset: 416)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !496, file: !10, line: 105, baseType: !326, size: 32, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !496, file: !10, line: 106, baseType: !370, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !496, file: !10, line: 107, baseType: !531, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!534 = !{!535}
!535 = !DISubrange(count: 5)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !356, file: !355, line: 113, baseType: !537, size: 320, offset: 3648)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !534)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!369, !370, !301}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !356, file: !355, line: 114, baseType: !542, size: 320, offset: 3968)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 320, elements: !534)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !356, file: !355, line: 115, baseType: !326, size: 32, offset: 4288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !356, file: !355, line: 120, baseType: !531, size: 64, offset: 4352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !356, file: !355, line: 121, baseType: !326, size: 32, offset: 4416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !350, file: !351, line: 437, baseType: !547, size: 9472, offset: 4480)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 9472, elements: !405)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !351, line: 32, size: 9472, elements: !549)
!549 = !{!550, !559, !563, !564, !571, !575, !576, !577, !578, !579, !580, !581, !605, !609, !614, !619, !638, !643, !647, !648, !653, !658, !659, !664, !668, !672, !676, !680, !684, !685, !686, !687, !688, !692, !693, !698, !699, !700, !701, !702, !707, !714, !719, !723, !727, !731, !735, !736, !740, !741, !748, !753, !754, !755, !756, !818, !826, !827, !831, !832, !836, !837, !841, !846, !847, !851, !855, !862, !863, !864, !865, !866, !867, !872, !873, !877, !881, !885, !886, !887, !891, !901, !902, !906, !907, !911, !912, !916, !917, !922, !923, !927, !931, !932, !933, !934, !935, !936, !937, !941, !942, !943, !944, !945, !946, !950, !951, !952, !953, !954, !955, !956, !957, !961, !965, !966, !967, !971, !972, !973, !974, !975, !976, !977, !981, !982, !983, !988, !992, !993, !997, !998, !999, !1000, !1026, !1030, !1031, !1032, !1033, !1034, !1038, !1039, !1040, !1041, !1042, !1046, !1050, !1051}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !548, file: !351, line: 34, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!369, !348, !319, !554, !319, !554, !556, !558}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !548, file: !351, line: 35, baseType: !560, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!369, !348, !319, !321, !453, !468}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !548, file: !351, line: 36, baseType: !560, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !548, file: !351, line: 37, baseType: !565, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!369, !348, !568, !568}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !548, file: !351, line: 38, baseType: !572, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!369, !348, !568, !568, !568}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !548, file: !351, line: 40, baseType: !565, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !548, file: !351, line: 41, baseType: !572, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !548, file: !351, line: 42, baseType: !565, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !548, file: !351, line: 43, baseType: !572, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !548, file: !351, line: 44, baseType: !565, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !548, file: !351, line: 46, baseType: !572, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !548, file: !351, line: 47, baseType: !582, size: 64, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!369, !348, !585, !585, !589}
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !586, line: 11, baseType: !587)
!586 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !586, line: 11, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !592, file: !36, line: 1227, baseType: !333, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !592, file: !36, line: 1228, baseType: !333, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !592, file: !36, line: 1229, baseType: !333, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !592, file: !36, line: 1230, baseType: !333, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !592, file: !36, line: 1231, baseType: !333, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !592, file: !36, line: 1232, baseType: !333, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !592, file: !36, line: 1233, baseType: !333, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !592, file: !36, line: 1234, baseType: !333, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !592, file: !36, line: 1236, baseType: !333, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !592, file: !36, line: 1237, baseType: !333, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !592, file: !36, line: 1238, baseType: !333, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !548, file: !351, line: 48, baseType: !606, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!369, !348, !585, !589}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !548, file: !351, line: 49, baseType: !610, size: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!369, !348, !568, !333, !613, !333, !319, !319, !568}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !548, file: !351, line: 50, baseType: !615, size: 64, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!369, !348, !618, !347}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !548, file: !351, line: 52, baseType: !620, size: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!369, !348, !623, !624}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !626, file: !36, line: 593, baseType: !410, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !626, file: !36, line: 594, baseType: !410, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !626, file: !36, line: 594, baseType: !410, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !626, file: !36, line: 594, baseType: !410, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !626, file: !36, line: 595, baseType: !410, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !626, file: !36, line: 596, baseType: !410, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !626, file: !36, line: 597, baseType: !410, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !626, file: !36, line: 598, baseType: !410, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !626, file: !36, line: 598, baseType: !410, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !626, file: !36, line: 599, baseType: !410, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !548, file: !351, line: 53, baseType: !639, size: 64, offset: 1024)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!369, !348, !348, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !548, file: !351, line: 54, baseType: !644, size: 64, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!369, !348, !568}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !548, file: !351, line: 55, baseType: !565, size: 64, offset: 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !548, file: !351, line: 56, baseType: !649, size: 64, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!369, !348, !652, !459}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !548, file: !351, line: 58, baseType: !654, size: 64, offset: 1280)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!369, !348, !657}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !548, file: !351, line: 59, baseType: !654, size: 64, offset: 1344)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !548, file: !351, line: 60, baseType: !660, size: 64, offset: 1408)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!369, !348, !663, !326}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !548, file: !351, line: 61, baseType: !665, size: 64, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!369, !348}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !548, file: !351, line: 63, baseType: !669, size: 64, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!369, !348, !319, !554, !332, !568, !568}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !548, file: !351, line: 64, baseType: !673, size: 64, offset: 1600)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!369, !348, !348, !585, !585, !589}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !548, file: !351, line: 65, baseType: !677, size: 64, offset: 1664)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!369, !348, !348, !589}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !548, file: !351, line: 66, baseType: !681, size: 64, offset: 1728)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!369, !348, !348, !585, !589}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !548, file: !351, line: 67, baseType: !677, size: 64, offset: 1792)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !548, file: !351, line: 69, baseType: !665, size: 64, offset: 1856)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !548, file: !351, line: 70, baseType: !673, size: 64, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !548, file: !351, line: 71, baseType: !681, size: 64, offset: 1984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !548, file: !351, line: 72, baseType: !689, size: 64, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!369, !348, !347}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !548, file: !351, line: 73, baseType: !665, size: 64, offset: 2112)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !548, file: !351, line: 75, baseType: !694, size: 64, offset: 2176)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!369, !348, !697, !347}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !548, file: !351, line: 76, baseType: !565, size: 64, offset: 2240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !548, file: !351, line: 77, baseType: !565, size: 64, offset: 2304)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !548, file: !351, line: 78, baseType: !582, size: 64, offset: 2368)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !548, file: !351, line: 79, baseType: !606, size: 64, offset: 2432)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !548, file: !351, line: 81, baseType: !703, size: 64, offset: 2496)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!369, !348, !332, !348, !706}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !548, file: !351, line: 82, baseType: !708, size: 64, offset: 2560)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!369, !348, !319, !711, !711, !618, !713}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !548, file: !351, line: 83, baseType: !715, size: 64, offset: 2624)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!369, !348, !319, !718, !319}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !548, file: !351, line: 84, baseType: !720, size: 64, offset: 2688)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!369, !348, !319, !554, !319, !554, !331}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !548, file: !351, line: 85, baseType: !724, size: 64, offset: 2752)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!369, !348, !348, !706}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !548, file: !351, line: 87, baseType: !728, size: 64, offset: 2816)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!369, !348, !568, !321}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !548, file: !351, line: 88, baseType: !732, size: 64, offset: 2880)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!369, !348, !332}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !548, file: !351, line: 89, baseType: !732, size: 64, offset: 2944)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !548, file: !351, line: 90, baseType: !737, size: 64, offset: 3008)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!369, !348, !568, !558}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !548, file: !351, line: 91, baseType: !669, size: 64, offset: 3072)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !548, file: !351, line: 93, baseType: !742, size: 64, offset: 3136)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!369, !348, !745}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !548, file: !351, line: 94, baseType: !749, size: 64, offset: 3200)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!369, !348, !319, !326, !326, !321, !752, !752, !642}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !548, file: !351, line: 95, baseType: !749, size: 64, offset: 3264)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !548, file: !351, line: 96, baseType: !749, size: 64, offset: 3328)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !548, file: !351, line: 97, baseType: !749, size: 64, offset: 3392)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !548, file: !351, line: 99, baseType: !757, size: 64, offset: 3456)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!369, !348, !760, !763}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !586, line: 51, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !586, line: 51, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !351, line: 609, size: 6208, elements: !766)
!766 = !{!767, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !787, !794, !795, !796, !797, !798, !799, !800, !801, !805, !806, !807, !808, !809, !811, !812, !813, !814, !815, !816, !817}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !765, file: !351, line: 610, baseType: !354, size: 4480)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !765, file: !351, line: 610, baseType: !769, size: 32, offset: 4480)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !405)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !765, file: !351, line: 611, baseType: !319, size: 32, offset: 4512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !765, file: !351, line: 611, baseType: !319, size: 32, offset: 4544)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !765, file: !351, line: 611, baseType: !319, size: 32, offset: 4576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !765, file: !351, line: 612, baseType: !319, size: 32, offset: 4608)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !765, file: !351, line: 613, baseType: !319, size: 32, offset: 4640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !765, file: !351, line: 614, baseType: !321, size: 64, offset: 4672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !765, file: !351, line: 615, baseType: !453, size: 64, offset: 4736)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !765, file: !351, line: 616, baseType: !718, size: 64, offset: 4800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !765, file: !351, line: 617, baseType: !321, size: 64, offset: 4864)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !765, file: !351, line: 618, baseType: !780, size: 64, offset: 4928)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !351, line: 602, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 598, size: 128, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !782, file: !351, line: 599, baseType: !319, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !782, file: !351, line: 600, baseType: !319, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !782, file: !351, line: 601, baseType: !331, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !765, file: !351, line: 619, baseType: !788, size: 64, offset: 4992)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !351, line: 607, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 604, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !790, file: !351, line: 605, baseType: !319, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !790, file: !351, line: 606, baseType: !331, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !765, file: !351, line: 620, baseType: !331, size: 64, offset: 5056)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !765, file: !351, line: 621, baseType: !333, size: 64, offset: 5120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !765, file: !351, line: 622, baseType: !333, size: 64, offset: 5184)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !765, file: !351, line: 623, baseType: !568, size: 64, offset: 5248)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !765, file: !351, line: 623, baseType: !568, size: 64, offset: 5312)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !765, file: !351, line: 623, baseType: !568, size: 64, offset: 5376)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !765, file: !351, line: 624, baseType: !326, size: 32, offset: 5440)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !765, file: !351, line: 625, baseType: !802, size: 64, offset: 5504)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!369}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !765, file: !351, line: 626, baseType: !301, size: 64, offset: 5568)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !765, file: !351, line: 627, baseType: !568, size: 64, offset: 5632)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !765, file: !351, line: 628, baseType: !319, size: 32, offset: 5696)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !765, file: !351, line: 629, baseType: !389, size: 64, offset: 5760)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !765, file: !351, line: 630, baseType: !810, size: 32, offset: 5824)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !765, file: !351, line: 631, baseType: !319, size: 32, offset: 5856)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !765, file: !351, line: 631, baseType: !319, size: 32, offset: 5888)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !765, file: !351, line: 632, baseType: !326, size: 32, offset: 5920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !765, file: !351, line: 633, baseType: !326, size: 32, offset: 5952)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !765, file: !351, line: 634, baseType: !305, size: 64, offset: 6016)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !765, file: !351, line: 634, baseType: !301, size: 64, offset: 6080)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !765, file: !351, line: 635, baseType: !415, size: 64, offset: 6144)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !548, file: !351, line: 100, baseType: !819, size: 64, offset: 3520)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!369, !348, !319, !319, !822, !825}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !824)
!824 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !548, file: !351, line: 101, baseType: !665, size: 64, offset: 3584)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !548, file: !351, line: 102, baseType: !828, size: 64, offset: 3648)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!369, !348, !585, !585, !347}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !548, file: !351, line: 103, baseType: !551, size: 64, offset: 3712)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !548, file: !351, line: 105, baseType: !833, size: 64, offset: 3776)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!369, !348, !585, !585, !618, !347}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !548, file: !351, line: 106, baseType: !665, size: 64, offset: 3840)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !548, file: !351, line: 107, baseType: !838, size: 64, offset: 3904)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!369, !348, !376}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !548, file: !351, line: 108, baseType: !842, size: 64, offset: 3968)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!369, !348, !845, !618, !347}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !389)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !548, file: !351, line: 109, baseType: !802, size: 64, offset: 4032)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !548, file: !351, line: 111, baseType: !848, size: 64, offset: 4096)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!369, !348, !348, !348, !333, !348}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !548, file: !351, line: 112, baseType: !852, size: 64, offset: 4160)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!369, !348, !348, !348, !348}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !548, file: !351, line: 113, baseType: !856, size: 64, offset: 4224)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!369, !348, !859, !859}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !586, line: 30, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !586, line: 30, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !548, file: !351, line: 114, baseType: !551, size: 64, offset: 4288)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !548, file: !351, line: 115, baseType: !669, size: 64, offset: 4352)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !548, file: !351, line: 117, baseType: !728, size: 64, offset: 4416)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !548, file: !351, line: 118, baseType: !728, size: 64, offset: 4480)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !548, file: !351, line: 119, baseType: !842, size: 64, offset: 4544)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !548, file: !351, line: 120, baseType: !868, size: 64, offset: 4608)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!369, !348, !871, !642}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !548, file: !351, line: 121, baseType: !802, size: 64, offset: 4672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !548, file: !351, line: 123, baseType: !874, size: 64, offset: 4736)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!369, !348, !319, !301}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !548, file: !351, line: 124, baseType: !878, size: 64, offset: 4800)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!369, !348, !763, !568, !301}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !548, file: !351, line: 125, baseType: !882, size: 64, offset: 4864)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!369, !494, !348}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !548, file: !351, line: 126, baseType: !565, size: 64, offset: 4928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !548, file: !351, line: 127, baseType: !565, size: 64, offset: 4992)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !548, file: !351, line: 129, baseType: !888, size: 64, offset: 5056)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!369, !348, !718}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !548, file: !351, line: 130, baseType: !892, size: 64, offset: 5120)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!369, !348, !895, !895}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !897, file: !60, line: 653, baseType: !319, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !897, file: !60, line: 653, baseType: !568, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !548, file: !351, line: 131, baseType: !892, size: 64, offset: 5184)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !548, file: !351, line: 132, baseType: !903, size: 64, offset: 5248)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!369, !348, !321, !321, !321}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !548, file: !351, line: 133, baseType: !838, size: 64, offset: 5312)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !548, file: !351, line: 135, baseType: !908, size: 64, offset: 5376)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!369, !348, !333, !642}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !548, file: !351, line: 136, baseType: !908, size: 64, offset: 5440)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !548, file: !351, line: 137, baseType: !913, size: 64, offset: 5504)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!369, !348, !642}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !548, file: !351, line: 138, baseType: !551, size: 64, offset: 5568)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !548, file: !351, line: 139, baseType: !918, size: 64, offset: 5632)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!369, !348, !921, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !548, file: !351, line: 141, baseType: !802, size: 64, offset: 5696)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !548, file: !351, line: 142, baseType: !924, size: 64, offset: 5760)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!369, !348, !348, !333, !348}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !548, file: !351, line: 143, baseType: !928, size: 64, offset: 5824)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!369, !348, !348, !348}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !548, file: !351, line: 144, baseType: !802, size: 64, offset: 5888)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !548, file: !351, line: 145, baseType: !924, size: 64, offset: 5952)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !548, file: !351, line: 147, baseType: !928, size: 64, offset: 6016)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !548, file: !351, line: 148, baseType: !802, size: 64, offset: 6080)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !548, file: !351, line: 149, baseType: !924, size: 64, offset: 6144)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !548, file: !351, line: 150, baseType: !928, size: 64, offset: 6208)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !548, file: !351, line: 151, baseType: !938, size: 64, offset: 6272)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!369, !348, !326}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !548, file: !351, line: 153, baseType: !665, size: 64, offset: 6336)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !548, file: !351, line: 154, baseType: !665, size: 64, offset: 6400)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !548, file: !351, line: 155, baseType: !665, size: 64, offset: 6464)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !548, file: !351, line: 156, baseType: !665, size: 64, offset: 6528)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !548, file: !351, line: 157, baseType: !838, size: 64, offset: 6592)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !548, file: !351, line: 159, baseType: !947, size: 64, offset: 6656)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!369, !348, !319, !556}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !548, file: !351, line: 160, baseType: !665, size: 64, offset: 6720)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !548, file: !351, line: 161, baseType: !665, size: 64, offset: 6784)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !548, file: !351, line: 162, baseType: !665, size: 64, offset: 6848)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !548, file: !351, line: 163, baseType: !665, size: 64, offset: 6912)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !548, file: !351, line: 165, baseType: !928, size: 64, offset: 6976)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !548, file: !351, line: 166, baseType: !928, size: 64, offset: 7040)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !548, file: !351, line: 167, baseType: !728, size: 64, offset: 7104)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !548, file: !351, line: 168, baseType: !958, size: 64, offset: 7168)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!369, !348, !568, !319}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !548, file: !351, line: 169, baseType: !962, size: 64, offset: 7232)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!369, !348, !642, !321}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !548, file: !351, line: 171, baseType: !689, size: 64, offset: 7296)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !548, file: !351, line: 172, baseType: !665, size: 64, offset: 7360)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !548, file: !351, line: 173, baseType: !968, size: 64, offset: 7424)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!369, !348, !321, !752}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !548, file: !351, line: 174, baseType: !828, size: 64, offset: 7488)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !548, file: !351, line: 175, baseType: !828, size: 64, offset: 7552)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !548, file: !351, line: 177, baseType: !565, size: 64, offset: 7616)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !548, file: !351, line: 178, baseType: !615, size: 64, offset: 7680)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !548, file: !351, line: 179, baseType: !565, size: 64, offset: 7744)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !548, file: !351, line: 180, baseType: !572, size: 64, offset: 7808)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !548, file: !351, line: 181, baseType: !978, size: 64, offset: 7872)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!369, !348, !308, !618, !347}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !548, file: !351, line: 183, baseType: !888, size: 64, offset: 7936)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !548, file: !351, line: 184, baseType: !649, size: 64, offset: 8000)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !548, file: !351, line: 185, baseType: !984, size: 64, offset: 8064)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!369, !348, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !548, file: !351, line: 186, baseType: !989, size: 64, offset: 8128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!369, !348, !319, !554, !331}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !548, file: !351, line: 187, baseType: !708, size: 64, offset: 8192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !548, file: !351, line: 189, baseType: !994, size: 64, offset: 8256)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!369, !348, !319, !319, !321, !556}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !548, file: !351, line: 190, baseType: !802, size: 64, offset: 8320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !548, file: !351, line: 191, baseType: !924, size: 64, offset: 8384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !548, file: !351, line: 192, baseType: !928, size: 64, offset: 8448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !548, file: !351, line: 193, baseType: !1001, size: 64, offset: 8512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!369, !348, !760, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !351, line: 660, size: 5312, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1006, file: !351, line: 661, baseType: !354, size: 4480)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1006, file: !351, line: 661, baseType: !769, size: 32, offset: 4480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1006, file: !351, line: 662, baseType: !319, size: 32, offset: 4512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1006, file: !351, line: 662, baseType: !319, size: 32, offset: 4544)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1006, file: !351, line: 662, baseType: !319, size: 32, offset: 4576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1006, file: !351, line: 663, baseType: !319, size: 32, offset: 4608)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1006, file: !351, line: 664, baseType: !319, size: 32, offset: 4640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1006, file: !351, line: 665, baseType: !321, size: 64, offset: 4672)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1006, file: !351, line: 666, baseType: !321, size: 64, offset: 4736)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1006, file: !351, line: 667, baseType: !319, size: 32, offset: 4800)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1006, file: !351, line: 668, baseType: !810, size: 32, offset: 4832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1006, file: !351, line: 670, baseType: !321, size: 64, offset: 4864)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1006, file: !351, line: 670, baseType: !321, size: 64, offset: 4928)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1006, file: !351, line: 671, baseType: !321, size: 64, offset: 4992)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1006, file: !351, line: 672, baseType: !321, size: 64, offset: 5056)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1006, file: !351, line: 673, baseType: !321, size: 64, offset: 5120)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1006, file: !351, line: 674, baseType: !319, size: 32, offset: 5184)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1006, file: !351, line: 675, baseType: !321, size: 64, offset: 5248)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !548, file: !351, line: 195, baseType: !1027, size: 64, offset: 8576)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!369, !1004, !348, !348}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !548, file: !351, line: 196, baseType: !1027, size: 64, offset: 8640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !548, file: !351, line: 197, baseType: !802, size: 64, offset: 8704)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !548, file: !351, line: 198, baseType: !924, size: 64, offset: 8768)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !548, file: !351, line: 199, baseType: !928, size: 64, offset: 8832)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !548, file: !351, line: 201, baseType: !1035, size: 64, offset: 8896)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!369, !348, !319, !319}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !548, file: !351, line: 202, baseType: !703, size: 64, offset: 8960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !548, file: !351, line: 203, baseType: !572, size: 64, offset: 9024)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !548, file: !351, line: 204, baseType: !757, size: 64, offset: 9088)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !548, file: !351, line: 205, baseType: !888, size: 64, offset: 9152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !548, file: !351, line: 206, baseType: !1043, size: 64, offset: 9216)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!369, !308, !348, !319, !618, !347}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !548, file: !351, line: 208, baseType: !1047, size: 64, offset: 9280)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!369, !319, !713}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !548, file: !351, line: 209, baseType: !928, size: 64, offset: 9344)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !548, file: !351, line: 210, baseType: !720, size: 64, offset: 9408)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !350, file: !351, line: 438, baseType: !1053, size: 64, offset: 13952)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !586, line: 60, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1055, file: !114, line: 241, baseType: !308, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !114, line: 242, baseType: !424, size: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1055, file: !114, line: 243, baseType: !319, size: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1055, file: !114, line: 243, baseType: !319, size: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1055, file: !114, line: 244, baseType: !319, size: 32, offset: 160)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1055, file: !114, line: 244, baseType: !319, size: 32, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1055, file: !114, line: 245, baseType: !321, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1055, file: !114, line: 246, baseType: !326, size: 32, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1055, file: !114, line: 247, baseType: !319, size: 32, offset: 352)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1055, file: !114, line: 251, baseType: !319, size: 32, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1055, file: !114, line: 252, baseType: !859, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1055, file: !114, line: 253, baseType: !326, size: 32, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1055, file: !114, line: 254, baseType: !319, size: 32, offset: 544)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1055, file: !114, line: 254, baseType: !319, size: 32, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1055, file: !114, line: 255, baseType: !319, size: 32, offset: 608)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !350, file: !351, line: 438, baseType: !1053, size: 64, offset: 14016)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !351, line: 439, baseType: !301, size: 64, offset: 14080)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !350, file: !351, line: 440, baseType: !1075, size: 32, offset: 14144)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !350, file: !351, line: 441, baseType: !326, size: 32, offset: 14176)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !350, file: !351, line: 442, baseType: !326, size: 32, offset: 14208)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !350, file: !351, line: 443, baseType: !1079, size: 448, offset: 14272)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 448, elements: !1081)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !389)
!1081 = !{!1082}
!1082 = !DISubrange(count: 7)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !350, file: !351, line: 444, baseType: !326, size: 32, offset: 14720)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !350, file: !351, line: 445, baseType: !326, size: 32, offset: 14752)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !350, file: !351, line: 446, baseType: !319, size: 32, offset: 14784)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !350, file: !351, line: 447, baseType: !445, size: 64, offset: 14848)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !350, file: !351, line: 448, baseType: !445, size: 64, offset: 14912)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !350, file: !351, line: 449, baseType: !625, size: 640, offset: 14976)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !350, file: !351, line: 450, baseType: !558, size: 32, offset: 15616)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !350, file: !351, line: 451, baseType: !1091, size: 2880, offset: 15680)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !351, line: 318, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !351, line: 319, size: 2880, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1113, !1114, !1119, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1139, !1140, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1172, !1173, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1196, !1197, !1198, !1202, !1203}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1092, file: !351, line: 320, baseType: !319, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1092, file: !351, line: 321, baseType: !319, size: 32, offset: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1092, file: !351, line: 322, baseType: !319, size: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1092, file: !351, line: 323, baseType: !319, size: 32, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1092, file: !351, line: 324, baseType: !319, size: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1092, file: !351, line: 325, baseType: !319, size: 32, offset: 160)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1092, file: !351, line: 326, baseType: !1101, size: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !351, line: 293, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !351, line: 295, size: 448, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !351, line: 296, baseType: !1101, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1103, file: !351, line: 297, baseType: !331, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1103, file: !351, line: 297, baseType: !331, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1103, file: !351, line: 298, baseType: !321, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1103, file: !351, line: 298, baseType: !321, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1103, file: !351, line: 299, baseType: !319, size: 32, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1103, file: !351, line: 300, baseType: !319, size: 32, offset: 352)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1103, file: !351, line: 301, baseType: !319, size: 32, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1092, file: !351, line: 326, baseType: !1101, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1092, file: !351, line: 328, baseType: !1115, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!369, !348, !1118, !321}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1092, file: !351, line: 329, baseType: !1120, size: 64, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!369, !1118, !1123, !453, !453, !468, !321}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1092, file: !351, line: 330, baseType: !1125, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!369, !1118}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1092, file: !351, line: 331, baseType: !1125, size: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1092, file: !351, line: 334, baseType: !308, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !351, line: 335, baseType: !424, size: 32, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1092, file: !351, line: 335, baseType: !424, size: 32, offset: 672)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1092, file: !351, line: 336, baseType: !424, size: 32, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1092, file: !351, line: 336, baseType: !424, size: 32, offset: 736)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1092, file: !351, line: 337, baseType: !1135, size: 64, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !309, line: 339, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !309, line: 339, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1092, file: !351, line: 338, baseType: !1135, size: 64, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1092, file: !351, line: 339, baseType: !1141, size: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !309, line: 341, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !309, line: 351, size: 192, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1143, file: !309, line: 354, baseType: !72, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1143, file: !309, line: 355, baseType: !72, size: 32, offset: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1143, file: !309, line: 356, baseType: !72, size: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1143, file: !309, line: 361, baseType: !72, size: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1143, file: !309, line: 362, baseType: !514, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1092, file: !351, line: 340, baseType: !319, size: 32, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1092, file: !351, line: 340, baseType: !319, size: 32, offset: 992)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1092, file: !351, line: 341, baseType: !331, size: 64, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1092, file: !351, line: 342, baseType: !321, size: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1092, file: !351, line: 343, baseType: !468, size: 64, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1092, file: !351, line: 344, baseType: !453, size: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1092, file: !351, line: 345, baseType: !319, size: 32, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1092, file: !351, line: 346, baseType: !1123, size: 64, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1092, file: !351, line: 347, baseType: !326, size: 32, offset: 1408)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1092, file: !351, line: 348, baseType: !319, size: 32, offset: 1440)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1092, file: !351, line: 351, baseType: !326, size: 32, offset: 1472)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1092, file: !351, line: 352, baseType: !326, size: 32, offset: 1504)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1092, file: !351, line: 353, baseType: !424, size: 32, offset: 1536)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1092, file: !351, line: 354, baseType: !424, size: 32, offset: 1568)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1092, file: !351, line: 355, baseType: !1123, size: 64, offset: 1600)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1092, file: !351, line: 356, baseType: !1123, size: 64, offset: 1664)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1092, file: !351, line: 357, baseType: !1167, size: 64, offset: 1728)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !351, line: 310, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 308, size: 32, elements: !1170)
!1170 = !{!1171}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1169, file: !351, line: 309, baseType: !319, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1092, file: !351, line: 357, baseType: !1167, size: 64, offset: 1792)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1092, file: !351, line: 358, baseType: !1174, size: 64, offset: 1856)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !351, line: 316, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 312, size: 128, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1176, file: !351, line: 313, baseType: !301, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1176, file: !351, line: 314, baseType: !319, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1176, file: !351, line: 315, baseType: !391, size: 8, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1092, file: !351, line: 359, baseType: !1174, size: 64, offset: 1920)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1092, file: !351, line: 360, baseType: !1174, size: 64, offset: 1984)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1092, file: !351, line: 361, baseType: !319, size: 32, offset: 2048)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1092, file: !351, line: 362, baseType: !424, size: 32, offset: 2080)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1092, file: !351, line: 363, baseType: !319, size: 32, offset: 2112)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1092, file: !351, line: 364, baseType: !1123, size: 64, offset: 2176)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1092, file: !351, line: 365, baseType: !1141, size: 64, offset: 2240)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1092, file: !351, line: 366, baseType: !424, size: 32, offset: 2304)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1092, file: !351, line: 367, baseType: !424, size: 32, offset: 2336)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1092, file: !351, line: 368, baseType: !1135, size: 64, offset: 2368)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1092, file: !351, line: 369, baseType: !1135, size: 64, offset: 2432)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1092, file: !351, line: 370, baseType: !1193, size: 64, offset: 2496)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1092, file: !351, line: 371, baseType: !1193, size: 64, offset: 2560)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1092, file: !351, line: 372, baseType: !1193, size: 64, offset: 2624)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1092, file: !351, line: 373, baseType: !1199, size: 64, offset: 2688)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !309, line: 331, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !309, line: 331, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1092, file: !351, line: 374, baseType: !514, size: 64, offset: 2752)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1092, file: !351, line: 375, baseType: !1204, size: 64, offset: 2816)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !350, file: !351, line: 451, baseType: !1091, size: 2880, offset: 18560)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !350, file: !351, line: 452, baseType: !1207, size: 64, offset: 21440)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !351, line: 681, size: 4864, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1209, file: !351, line: 682, baseType: !354, size: 4480)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1209, file: !351, line: 682, baseType: !769, size: 32, offset: 4480)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1209, file: !351, line: 683, baseType: !326, size: 32, offset: 4512)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1209, file: !351, line: 684, baseType: !319, size: 32, offset: 4544)
