; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/interface/matregis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/interface/matregis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!623 = distinct !DILexicalBlock(scope: !389, file: !316, line: 175, column: 61)
!624 = !DILocation(line: 175, column: 61, scope: !389)
!625 = !DILocation(line: 176, column: 10, scope: !315)
!626 = !DILocation(line: 0, scope: !391)
!627 = !DILocation(line: 176, column: 57, scope: !628)
!628 = distinct !DILexicalBlock(scope: !391, file: !316, line: 176, column: 57)
!629 = !DILocation(line: 176, column: 57, scope: !391)
!630 = !DILocation(line: 178, column: 10, scope: !315)
!631 = !DILocation(line: 0, scope: !393)
!632 = !DILocation(line: 178, column: 61, scope: !633)
!633 = distinct !DILexicalBlock(scope: !393, file: !316, line: 178, column: 61)
!634 = !DILocation(line: 178, column: 61, scope: !393)
!635 = !DILocation(line: 179, column: 10, scope: !315)
!636 = !DILocation(line: 0, scope: !395)
!637 = !DILocation(line: 179, column: 61, scope: !638)
!638 = distinct !DILexicalBlock(scope: !395, file: !316, line: 179, column: 61)
!639 = !DILocation(line: 179, column: 61, scope: !395)
!640 = !DILocation(line: 180, column: 10, scope: !315)
!641 = !DILocation(line: 0, scope: !397)
!642 = !DILocation(line: 180, column: 61, scope: !643)
!643 = distinct !DILexicalBlock(scope: !397, file: !316, line: 180, column: 61)
!644 = !DILocation(line: 180, column: 61, scope: !397)
!645 = !DILocation(line: 210, column: 10, scope: !315)
!646 = !DILocation(line: 0, scope: !399)
!647 = !DILocation(line: 210, column: 65, scope: !648)
!648 = distinct !DILexicalBlock(scope: !399, file: !316, line: 210, column: 65)
!649 = !DILocation(line: 210, column: 65, scope: !399)
!650 = !DILocation(line: 211, column: 10, scope: !315)
!651 = !DILocation(line: 0, scope: !401)
!652 = !DILocation(line: 211, column: 58, scope: !653)
!653 = distinct !DILexicalBlock(scope: !401, file: !316, line: 211, column: 58)
!654 = !DILocation(line: 211, column: 58, scope: !401)
!655 = !DILocation(line: 213, column: 10, scope: !315)
!656 = !DILocation(line: 0, scope: !403)
!657 = !DILocation(line: 213, column: 70, scope: !658)
!658 = distinct !DILexicalBlock(scope: !403, file: !316, line: 213, column: 70)
!659 = !DILocation(line: 213, column: 70, scope: !403)
!660 = !DILocation(line: 226, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !316, line: 226, column: 3)
!662 = distinct !DILexicalBlock(scope: !663, file: !316, line: 226, column: 3)
!663 = distinct !DILexicalBlock(scope: !315, file: !316, line: 226, column: 3)
!664 = !DILocation(line: 226, column: 3, scope: !662)
!665 = !DILocation(line: 226, column: 3, scope: !666)
!666 = distinct !DILexicalBlock(scope: !667, file: !316, line: 226, column: 3)
!667 = distinct !DILexicalBlock(scope: !661, file: !316, line: 226, column: 3)
!668 = !DILocation(line: 226, column: 3, scope: !667)
!669 = !DILocation(line: 226, column: 3, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !316, line: 226, column: 3)
!671 = distinct !DILexicalBlock(scope: !666, file: !316, line: 226, column: 3)
!672 = !DILocation(line: 226, column: 3, scope: !671)
!673 = !DILocation(line: 226, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !670, file: !316, line: 226, column: 3)
!675 = !DILocation(line: 226, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !666, file: !316, line: 226, column: 3)
!677 = !DILocation(line: 226, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !676, file: !316, line: 226, column: 3)
!679 = !DILocation(line: 226, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !316, line: 226, column: 3)
!681 = distinct !DILexicalBlock(scope: !678, file: !316, line: 226, column: 3)
!682 = !DILocation(line: 226, column: 3, scope: !681)
!683 = !DILocation(line: 226, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !680, file: !316, line: 226, column: 3)
!685 = !DILocation(line: 227, column: 1, scope: !315)
!686 = !DISubprogram(name: "MatRegister", scope: !36, file: !36, line: 259, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1660)
!687 = !DISubroutineType(types: !688)
!688 = !{!72, !301, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!72, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !694, line: 436, size: 23424, elements: !695)
!694 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!695 = !{!696, !897, !1403, !1423, !1424, !1425, !1427, !1428, !1429, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1556, !1557, !1573, !1574, !1575, !1576, !1577, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1612, !1632, !1633, !1635, !1636, !1637, !1638, !1639, !1640, !1658, !1659}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !693, file: !694, line: 437, baseType: !697, size: 4480)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !698, line: 122, baseType: !699)
!698 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !698, line: 73, size: 4480, elements: !700)
!700 = !{!701, !703, !750, !751, !753, !756, !757, !758, !759, !767, !768, !770, !774, !778, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !791, !792, !793, !795, !796, !798, !800, !801, !802, !803, !804, !807, !809, !810, !811, !812, !813, !816, !818, !819, !820, !830, !832, !833, !837, !838, !887, !892, !894, !895, !896}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !699, file: !698, line: 74, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !699, file: !698, line: 75, baseType: !704, size: 448, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 448, elements: !748)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !698, line: 53, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 45, size: 448, elements: !707)
!707 = !{!708, !715, !723, !728, !732, !736, !743}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !706, file: !698, line: 46, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!319, !712, !714}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !706, file: !698, line: 47, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!319, !712, !719}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !720, line: 16, baseType: !721)
!720 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !720, line: 16, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !706, file: !698, line: 48, baseType: !724, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!319, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !706, file: !698, line: 49, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!319, !712, !301, !712}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !706, file: !698, line: 50, baseType: !733, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!319, !712, !301, !727}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !706, file: !698, line: 51, baseType: !737, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!319, !712, !301, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !706, file: !698, line: 52, baseType: !744, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!319, !712, !301, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!748 = !{!749}
!749 = !DISubrange(count: 1)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !699, file: !698, line: 76, baseType: !304, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !698, line: 77, baseType: !752, size: 32, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !699, file: !698, line: 78, baseType: !754, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !755)
!755 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !699, file: !698, line: 78, baseType: !754, size: 64, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !699, file: !698, line: 78, baseType: !754, size: 64, offset: 768)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !699, file: !698, line: 78, baseType: !754, size: 64, offset: 832)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !699, file: !698, line: 79, baseType: !760, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !763, line: 27, baseType: !764)
!763 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !765, line: 43, baseType: !766)
!765 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!766 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !699, file: !698, line: 80, baseType: !752, size: 32, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !699, file: !698, line: 81, baseType: !769, size: 32, offset: 992)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !699, file: !698, line: 82, baseType: !771, size: 64, offset: 1024)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !699, file: !698, line: 83, baseType: !775, size: 64, offset: 1088)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !699, file: !698, line: 84, baseType: !779, size: 64, offset: 1152)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !699, file: !698, line: 85, baseType: !779, size: 64, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !699, file: !698, line: 86, baseType: !779, size: 64, offset: 1280)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !699, file: !698, line: 87, baseType: !779, size: 64, offset: 1344)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !699, file: !698, line: 88, baseType: !712, size: 64, offset: 1408)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !699, file: !698, line: 89, baseType: !760, size: 64, offset: 1472)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !698, line: 90, baseType: !779, size: 64, offset: 1536)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !699, file: !698, line: 91, baseType: !779, size: 64, offset: 1600)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !699, file: !698, line: 92, baseType: !752, size: 32, offset: 1664)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !699, file: !698, line: 93, baseType: !308, size: 64, offset: 1728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !699, file: !698, line: 94, baseType: !790, size: 64, offset: 1792)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !761)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !699, file: !698, line: 95, baseType: !752, size: 32, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !699, file: !698, line: 95, baseType: !752, size: 32, offset: 1888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !699, file: !698, line: 96, baseType: !794, size: 64, offset: 1920)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !699, file: !698, line: 96, baseType: !794, size: 64, offset: 1984)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !699, file: !698, line: 97, baseType: !797, size: 64, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !699, file: !698, line: 97, baseType: !799, size: 64, offset: 2112)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !699, file: !698, line: 98, baseType: !752, size: 32, offset: 2176)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !699, file: !698, line: 98, baseType: !752, size: 32, offset: 2208)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !699, file: !698, line: 99, baseType: !794, size: 64, offset: 2240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !699, file: !698, line: 99, baseType: !794, size: 64, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !699, file: !698, line: 100, baseType: !805, size: 64, offset: 2368)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !755)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !699, file: !698, line: 100, baseType: !808, size: 64, offset: 2432)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !699, file: !698, line: 101, baseType: !752, size: 32, offset: 2496)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !699, file: !698, line: 101, baseType: !752, size: 32, offset: 2528)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !699, file: !698, line: 102, baseType: !794, size: 64, offset: 2560)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !699, file: !698, line: 102, baseType: !794, size: 64, offset: 2624)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !699, file: !698, line: 103, baseType: !814, size: 64, offset: 2688)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !806)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !699, file: !698, line: 103, baseType: !817, size: 64, offset: 2752)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !699, file: !698, line: 104, baseType: !747, size: 64, offset: 2816)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !699, file: !698, line: 105, baseType: !752, size: 32, offset: 2880)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !699, file: !698, line: 106, baseType: !821, size: 128, offset: 2944)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 128, elements: !828)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !698, line: 64, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 61, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !824, file: !698, line: 62, baseType: !740, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !824, file: !698, line: 63, baseType: !308, size: 64, offset: 64)
!828 = !{!829}
!829 = !DISubrange(count: 2)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !699, file: !698, line: 107, baseType: !831, size: 64, offset: 3072)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 64, elements: !828)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !699, file: !698, line: 108, baseType: !308, size: 64, offset: 3136)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !699, file: !698, line: 109, baseType: !834, size: 64, offset: 3200)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!319, !308}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !699, file: !698, line: 111, baseType: !752, size: 32, offset: 3264)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !699, file: !698, line: 112, baseType: !839, size: 320, offset: 3328)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 320, elements: !885)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!319, !843, !712, !308}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !846)
!846 = !{!847, !848, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !845, file: !10, line: 100, baseType: !752, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !845, file: !10, line: 101, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !860, !861, !862, !866, !868, !870, !871, !872}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !851, file: !10, line: 84, baseType: !779, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !851, file: !10, line: 85, baseType: !779, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !851, file: !10, line: 86, baseType: !308, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !851, file: !10, line: 87, baseType: !771, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !851, file: !10, line: 88, baseType: !858, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !851, file: !10, line: 89, baseType: !303, size: 8, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !851, file: !10, line: 90, baseType: !779, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !851, file: !10, line: 91, baseType: !863, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !864, line: 46, baseType: !865)
!864 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!865 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !851, file: !10, line: 92, baseType: !867, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !851, file: !10, line: 93, baseType: !869, size: 32, offset: 544)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !10, line: 94, baseType: !849, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !851, file: !10, line: 95, baseType: !779, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !851, file: !10, line: 96, baseType: !308, size: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !845, file: !10, line: 102, baseType: !779, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !845, file: !10, line: 102, baseType: !779, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !845, file: !10, line: 103, baseType: !779, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !845, file: !10, line: 104, baseType: !304, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !845, file: !10, line: 105, baseType: !867, size: 32, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !845, file: !10, line: 105, baseType: !867, size: 32, offset: 416)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !845, file: !10, line: 105, baseType: !867, size: 32, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !845, file: !10, line: 106, baseType: !712, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !845, file: !10, line: 107, baseType: !882, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!885 = !{!886}
!886 = !DISubrange(count: 5)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !699, file: !698, line: 113, baseType: !888, size: 320, offset: 3648)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 320, elements: !885)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!319, !712, !308}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !699, file: !698, line: 114, baseType: !893, size: 320, offset: 3968)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !885)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !699, file: !698, line: 115, baseType: !867, size: 32, offset: 4288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !699, file: !698, line: 120, baseType: !882, size: 64, offset: 4352)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !699, file: !698, line: 121, baseType: !867, size: 32, offset: 4416)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !693, file: !694, line: 437, baseType: !898, size: 9472, offset: 4480)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 9472, elements: !748)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !694, line: 32, size: 9472, elements: !900)
!900 = !{!901, !911, !915, !916, !923, !927, !928, !929, !930, !931, !932, !933, !957, !961, !966, !972, !991, !996, !1000, !1001, !1006, !1011, !1012, !1017, !1021, !1025, !1029, !1033, !1037, !1038, !1039, !1040, !1041, !1045, !1046, !1051, !1052, !1053, !1054, !1055, !1060, !1067, !1072, !1076, !1080, !1084, !1088, !1089, !1093, !1094, !1101, !1106, !1107, !1108, !1109, !1169, !1177, !1178, !1182, !1183, !1187, !1188, !1192, !1197, !1198, !1202, !1206, !1213, !1214, !1215, !1216, !1217, !1218, !1223, !1224, !1228, !1232, !1236, !1237, !1238, !1242, !1252, !1253, !1257, !1258, !1262, !1263, !1267, !1268, !1273, !1274, !1278, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1316, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1339, !1343, !1344, !1348, !1349, !1350, !1351, !1377, !1381, !1382, !1383, !1384, !1385, !1389, !1390, !1391, !1392, !1393, !1397, !1401, !1402}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !899, file: !694, line: 34, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!319, !905, !752, !906, !752, !906, !908, !910}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !692)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !899, file: !694, line: 35, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!319, !905, !752, !797, !799, !817}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !899, file: !694, line: 36, baseType: !912, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !899, file: !694, line: 37, baseType: !917, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!319, !905, !920, !920}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !899, file: !694, line: 38, baseType: !924, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!319, !905, !920, !920, !920}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !899, file: !694, line: 40, baseType: !917, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !899, file: !694, line: 41, baseType: !924, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !899, file: !694, line: 42, baseType: !917, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !899, file: !694, line: 43, baseType: !924, size: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !899, file: !694, line: 44, baseType: !917, size: 64, offset: 576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !899, file: !694, line: 46, baseType: !924, size: 64, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !899, file: !694, line: 47, baseType: !934, size: 64, offset: 704)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!319, !905, !937, !937, !941}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !938, line: 11, baseType: !939)
!938 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !938, line: 11, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !944, file: !36, line: 1227, baseType: !806, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !944, file: !36, line: 1228, baseType: !806, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !944, file: !36, line: 1229, baseType: !806, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !944, file: !36, line: 1230, baseType: !806, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !944, file: !36, line: 1231, baseType: !806, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !944, file: !36, line: 1232, baseType: !806, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !944, file: !36, line: 1233, baseType: !806, size: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !944, file: !36, line: 1234, baseType: !806, size: 64, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !944, file: !36, line: 1236, baseType: !806, size: 64, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !944, file: !36, line: 1237, baseType: !806, size: 64, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !944, file: !36, line: 1238, baseType: !806, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !899, file: !694, line: 48, baseType: !958, size: 64, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!319, !905, !937, !941}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !899, file: !694, line: 49, baseType: !962, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!319, !905, !920, !806, !965, !806, !752, !752, !920}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !899, file: !694, line: 50, baseType: !967, size: 64, offset: 896)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!319, !905, !970, !971}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !899, file: !694, line: 52, baseType: !973, size: 64, offset: 960)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!319, !905, !976, !977}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !979, file: !36, line: 593, baseType: !754, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !979, file: !36, line: 594, baseType: !754, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !979, file: !36, line: 594, baseType: !754, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !979, file: !36, line: 594, baseType: !754, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !979, file: !36, line: 595, baseType: !754, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !979, file: !36, line: 596, baseType: !754, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !979, file: !36, line: 597, baseType: !754, size: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !979, file: !36, line: 598, baseType: !754, size: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !979, file: !36, line: 598, baseType: !754, size: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !979, file: !36, line: 599, baseType: !754, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !899, file: !694, line: 53, baseType: !992, size: 64, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!319, !905, !905, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !899, file: !694, line: 54, baseType: !997, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!319, !905, !920}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !899, file: !694, line: 55, baseType: !917, size: 64, offset: 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !899, file: !694, line: 56, baseType: !1002, size: 64, offset: 1216)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!319, !905, !1005, !805}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !899, file: !694, line: 58, baseType: !1007, size: 64, offset: 1280)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!319, !905, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !899, file: !694, line: 59, baseType: !1007, size: 64, offset: 1344)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !899, file: !694, line: 60, baseType: !1013, size: 64, offset: 1408)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!319, !905, !1016, !867}
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !899, file: !694, line: 61, baseType: !1018, size: 64, offset: 1472)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!319, !905}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !899, file: !694, line: 63, baseType: !1022, size: 64, offset: 1536)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!319, !905, !752, !906, !815, !920, !920}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !899, file: !694, line: 64, baseType: !1026, size: 64, offset: 1600)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!319, !905, !905, !937, !937, !941}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !899, file: !694, line: 65, baseType: !1030, size: 64, offset: 1664)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!319, !905, !905, !941}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !899, file: !694, line: 66, baseType: !1034, size: 64, offset: 1728)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!319, !905, !905, !937, !941}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !899, file: !694, line: 67, baseType: !1030, size: 64, offset: 1792)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !899, file: !694, line: 69, baseType: !1018, size: 64, offset: 1856)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !899, file: !694, line: 70, baseType: !1026, size: 64, offset: 1920)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !899, file: !694, line: 71, baseType: !1034, size: 64, offset: 1984)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !899, file: !694, line: 72, baseType: !1042, size: 64, offset: 2048)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!319, !905, !971}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !899, file: !694, line: 73, baseType: !1018, size: 64, offset: 2112)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !899, file: !694, line: 75, baseType: !1047, size: 64, offset: 2176)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!319, !905, !1050, !971}
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !899, file: !694, line: 76, baseType: !917, size: 64, offset: 2240)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !899, file: !694, line: 77, baseType: !917, size: 64, offset: 2304)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !899, file: !694, line: 78, baseType: !934, size: 64, offset: 2368)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !899, file: !694, line: 79, baseType: !958, size: 64, offset: 2432)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !899, file: !694, line: 81, baseType: !1056, size: 64, offset: 2496)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!319, !905, !815, !905, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !899, file: !694, line: 82, baseType: !1061, size: 64, offset: 2560)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!319, !905, !752, !1064, !1064, !970, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !899, file: !694, line: 83, baseType: !1068, size: 64, offset: 2624)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!319, !905, !752, !1071, !752}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !899, file: !694, line: 84, baseType: !1073, size: 64, offset: 2688)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!319, !905, !752, !906, !752, !906, !814}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !899, file: !694, line: 85, baseType: !1077, size: 64, offset: 2752)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!319, !905, !905, !1059}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !899, file: !694, line: 87, baseType: !1081, size: 64, offset: 2816)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!319, !905, !920, !797}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !899, file: !694, line: 88, baseType: !1085, size: 64, offset: 2880)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!319, !905, !815}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !899, file: !694, line: 89, baseType: !1085, size: 64, offset: 2944)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !899, file: !694, line: 90, baseType: !1090, size: 64, offset: 3008)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!319, !905, !920, !910}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !899, file: !694, line: 91, baseType: !1022, size: 64, offset: 3072)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !899, file: !694, line: 93, baseType: !1095, size: 64, offset: 3136)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!319, !905, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !899, file: !694, line: 94, baseType: !1102, size: 64, offset: 3200)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!319, !905, !752, !867, !867, !797, !1105, !1105, !995}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !899, file: !694, line: 95, baseType: !1102, size: 64, offset: 3264)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !899, file: !694, line: 96, baseType: !1102, size: 64, offset: 3328)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !899, file: !694, line: 97, baseType: !1102, size: 64, offset: 3392)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !899, file: !694, line: 99, baseType: !1110, size: 64, offset: 3456)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!319, !905, !1113, !1116}
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !938, line: 51, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !938, line: 51, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !694, line: 609, size: 6208, elements: !1119)
!1119 = !{!1120, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1140, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1157, !1158, !1159, !1160, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1118, file: !694, line: 610, baseType: !697, size: 4480)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1118, file: !694, line: 610, baseType: !1122, size: 32, offset: 4480)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !748)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1118, file: !694, line: 611, baseType: !752, size: 32, offset: 4512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1118, file: !694, line: 611, baseType: !752, size: 32, offset: 4544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1118, file: !694, line: 611, baseType: !752, size: 32, offset: 4576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1118, file: !694, line: 612, baseType: !752, size: 32, offset: 4608)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1118, file: !694, line: 613, baseType: !752, size: 32, offset: 4640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1118, file: !694, line: 614, baseType: !797, size: 64, offset: 4672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1118, file: !694, line: 615, baseType: !799, size: 64, offset: 4736)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1118, file: !694, line: 616, baseType: !1071, size: 64, offset: 4800)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1118, file: !694, line: 617, baseType: !797, size: 64, offset: 4864)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1118, file: !694, line: 618, baseType: !1133, size: 64, offset: 4928)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !694, line: 602, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 598, size: 128, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1135, file: !694, line: 599, baseType: !752, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1135, file: !694, line: 600, baseType: !752, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1135, file: !694, line: 601, baseType: !814, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1118, file: !694, line: 619, baseType: !1141, size: 64, offset: 4992)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !694, line: 607, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 604, size: 128, elements: !1144)
!1144 = !{!1145, !1146}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1143, file: !694, line: 605, baseType: !752, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1143, file: !694, line: 606, baseType: !814, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1118, file: !694, line: 620, baseType: !814, size: 64, offset: 5056)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1118, file: !694, line: 621, baseType: !806, size: 64, offset: 5120)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1118, file: !694, line: 622, baseType: !806, size: 64, offset: 5184)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1118, file: !694, line: 623, baseType: !920, size: 64, offset: 5248)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1118, file: !694, line: 623, baseType: !920, size: 64, offset: 5312)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1118, file: !694, line: 623, baseType: !920, size: 64, offset: 5376)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1118, file: !694, line: 624, baseType: !867, size: 32, offset: 5440)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1118, file: !694, line: 625, baseType: !1155, size: 64, offset: 5504)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1118, file: !694, line: 626, baseType: !308, size: 64, offset: 5568)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1118, file: !694, line: 627, baseType: !920, size: 64, offset: 5632)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1118, file: !694, line: 628, baseType: !752, size: 32, offset: 5696)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1118, file: !694, line: 629, baseType: !301, size: 64, offset: 5760)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1118, file: !694, line: 630, baseType: !1161, size: 32, offset: 5824)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1118, file: !694, line: 631, baseType: !752, size: 32, offset: 5856)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1118, file: !694, line: 631, baseType: !752, size: 32, offset: 5888)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1118, file: !694, line: 632, baseType: !867, size: 32, offset: 5920)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1118, file: !694, line: 633, baseType: !867, size: 32, offset: 5952)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1118, file: !694, line: 634, baseType: !740, size: 64, offset: 6016)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1118, file: !694, line: 634, baseType: !308, size: 64, offset: 6080)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1118, file: !694, line: 635, baseType: !760, size: 64, offset: 6144)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !899, file: !694, line: 100, baseType: !1170, size: 64, offset: 3520)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!319, !905, !752, !752, !1173, !1176}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !1175)
!1175 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !899, file: !694, line: 101, baseType: !1018, size: 64, offset: 3584)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !899, file: !694, line: 102, baseType: !1179, size: 64, offset: 3648)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!319, !905, !937, !937, !971}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !899, file: !694, line: 103, baseType: !902, size: 64, offset: 3712)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !899, file: !694, line: 105, baseType: !1184, size: 64, offset: 3776)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!319, !905, !937, !937, !970, !971}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !899, file: !694, line: 106, baseType: !1018, size: 64, offset: 3840)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !899, file: !694, line: 107, baseType: !1189, size: 64, offset: 3904)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!319, !905, !719}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !899, file: !694, line: 108, baseType: !1193, size: 64, offset: 3968)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!319, !905, !1196, !970, !971}
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !301)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !899, file: !694, line: 109, baseType: !1155, size: 64, offset: 4032)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !899, file: !694, line: 111, baseType: !1199, size: 64, offset: 4096)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!319, !905, !905, !905, !806, !905}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !899, file: !694, line: 112, baseType: !1203, size: 64, offset: 4160)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!319, !905, !905, !905, !905}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !899, file: !694, line: 113, baseType: !1207, size: 64, offset: 4224)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!319, !905, !1210, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !938, line: 30, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !938, line: 30, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !899, file: !694, line: 114, baseType: !902, size: 64, offset: 4288)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !899, file: !694, line: 115, baseType: !1022, size: 64, offset: 4352)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !899, file: !694, line: 117, baseType: !1081, size: 64, offset: 4416)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !899, file: !694, line: 118, baseType: !1081, size: 64, offset: 4480)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !899, file: !694, line: 119, baseType: !1193, size: 64, offset: 4544)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !899, file: !694, line: 120, baseType: !1219, size: 64, offset: 4608)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!319, !905, !1222, !995}
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !899, file: !694, line: 121, baseType: !1155, size: 64, offset: 4672)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !899, file: !694, line: 123, baseType: !1225, size: 64, offset: 4736)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!319, !905, !752, !308}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !899, file: !694, line: 124, baseType: !1229, size: 64, offset: 4800)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!319, !905, !1116, !920, !308}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !899, file: !694, line: 125, baseType: !1233, size: 64, offset: 4864)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!319, !843, !905}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !899, file: !694, line: 126, baseType: !917, size: 64, offset: 4928)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !899, file: !694, line: 127, baseType: !917, size: 64, offset: 4992)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !899, file: !694, line: 129, baseType: !1239, size: 64, offset: 5056)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!319, !905, !1071}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !899, file: !694, line: 130, baseType: !1243, size: 64, offset: 5120)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!319, !905, !1246, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1249)
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1248, file: !60, line: 653, baseType: !752, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1248, file: !60, line: 653, baseType: !920, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !899, file: !694, line: 131, baseType: !1243, size: 64, offset: 5184)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !899, file: !694, line: 132, baseType: !1254, size: 64, offset: 5248)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!319, !905, !797, !797, !797}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !899, file: !694, line: 133, baseType: !1189, size: 64, offset: 5312)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !899, file: !694, line: 135, baseType: !1259, size: 64, offset: 5376)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!319, !905, !806, !995}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !899, file: !694, line: 136, baseType: !1259, size: 64, offset: 5440)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !899, file: !694, line: 137, baseType: !1264, size: 64, offset: 5504)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!319, !905, !995}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !899, file: !694, line: 138, baseType: !902, size: 64, offset: 5568)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !899, file: !694, line: 139, baseType: !1269, size: 64, offset: 5632)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!319, !905, !1272, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !899, file: !694, line: 141, baseType: !1155, size: 64, offset: 5696)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !899, file: !694, line: 142, baseType: !1275, size: 64, offset: 5760)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!319, !905, !905, !806, !905}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !899, file: !694, line: 143, baseType: !1279, size: 64, offset: 5824)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!319, !905, !905, !905}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !899, file: !694, line: 144, baseType: !1155, size: 64, offset: 5888)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !899, file: !694, line: 145, baseType: !1275, size: 64, offset: 5952)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !899, file: !694, line: 147, baseType: !1279, size: 64, offset: 6016)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !899, file: !694, line: 148, baseType: !1155, size: 64, offset: 6080)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !899, file: !694, line: 149, baseType: !1275, size: 64, offset: 6144)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !899, file: !694, line: 150, baseType: !1279, size: 64, offset: 6208)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !899, file: !694, line: 151, baseType: !1289, size: 64, offset: 6272)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!319, !905, !867}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !899, file: !694, line: 153, baseType: !1018, size: 64, offset: 6336)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !899, file: !694, line: 154, baseType: !1018, size: 64, offset: 6400)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !899, file: !694, line: 155, baseType: !1018, size: 64, offset: 6464)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !899, file: !694, line: 156, baseType: !1018, size: 64, offset: 6528)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !899, file: !694, line: 157, baseType: !1189, size: 64, offset: 6592)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !899, file: !694, line: 159, baseType: !1298, size: 64, offset: 6656)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!319, !905, !752, !908}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !899, file: !694, line: 160, baseType: !1018, size: 64, offset: 6720)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !899, file: !694, line: 161, baseType: !1018, size: 64, offset: 6784)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !899, file: !694, line: 162, baseType: !1018, size: 64, offset: 6848)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !899, file: !694, line: 163, baseType: !1018, size: 64, offset: 6912)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !899, file: !694, line: 165, baseType: !1279, size: 64, offset: 6976)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !899, file: !694, line: 166, baseType: !1279, size: 64, offset: 7040)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !899, file: !694, line: 167, baseType: !1081, size: 64, offset: 7104)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !899, file: !694, line: 168, baseType: !1309, size: 64, offset: 7168)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!319, !905, !920, !752}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !899, file: !694, line: 169, baseType: !1313, size: 64, offset: 7232)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!319, !905, !995, !797}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !899, file: !694, line: 171, baseType: !1042, size: 64, offset: 7296)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !899, file: !694, line: 172, baseType: !1018, size: 64, offset: 7360)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !899, file: !694, line: 173, baseType: !1319, size: 64, offset: 7424)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!319, !905, !797, !1105}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !899, file: !694, line: 174, baseType: !1179, size: 64, offset: 7488)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !899, file: !694, line: 175, baseType: !1179, size: 64, offset: 7552)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !899, file: !694, line: 177, baseType: !917, size: 64, offset: 7616)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !899, file: !694, line: 178, baseType: !967, size: 64, offset: 7680)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !899, file: !694, line: 179, baseType: !917, size: 64, offset: 7744)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !899, file: !694, line: 180, baseType: !924, size: 64, offset: 7808)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !899, file: !694, line: 181, baseType: !1329, size: 64, offset: 7872)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!319, !905, !304, !970, !971}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !899, file: !694, line: 183, baseType: !1239, size: 64, offset: 7936)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !899, file: !694, line: 184, baseType: !1002, size: 64, offset: 8000)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !899, file: !694, line: 185, baseType: !1335, size: 64, offset: 8064)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!319, !905, !1338}
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !899, file: !694, line: 186, baseType: !1340, size: 64, offset: 8128)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!319, !905, !752, !906, !814}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !899, file: !694, line: 187, baseType: !1061, size: 64, offset: 8192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !899, file: !694, line: 189, baseType: !1345, size: 64, offset: 8256)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!319, !905, !752, !752, !797, !908}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !899, file: !694, line: 190, baseType: !1155, size: 64, offset: 8320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !899, file: !694, line: 191, baseType: !1275, size: 64, offset: 8384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !899, file: !694, line: 192, baseType: !1279, size: 64, offset: 8448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !899, file: !694, line: 193, baseType: !1352, size: 64, offset: 8512)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!319, !905, !1113, !1355}
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !694, line: 660, size: 5312, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1357, file: !694, line: 661, baseType: !697, size: 4480)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1357, file: !694, line: 661, baseType: !1122, size: 32, offset: 4480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1357, file: !694, line: 662, baseType: !752, size: 32, offset: 4512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1357, file: !694, line: 662, baseType: !752, size: 32, offset: 4544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1357, file: !694, line: 662, baseType: !752, size: 32, offset: 4576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1357, file: !694, line: 663, baseType: !752, size: 32, offset: 4608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1357, file: !694, line: 664, baseType: !752, size: 32, offset: 4640)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1357, file: !694, line: 665, baseType: !797, size: 64, offset: 4672)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1357, file: !694, line: 666, baseType: !797, size: 64, offset: 4736)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1357, file: !694, line: 667, baseType: !752, size: 32, offset: 4800)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1357, file: !694, line: 668, baseType: !1161, size: 32, offset: 4832)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1357, file: !694, line: 670, baseType: !797, size: 64, offset: 4864)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1357, file: !694, line: 670, baseType: !797, size: 64, offset: 4928)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1357, file: !694, line: 671, baseType: !797, size: 64, offset: 4992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1357, file: !694, line: 672, baseType: !797, size: 64, offset: 5056)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1357, file: !694, line: 673, baseType: !797, size: 64, offset: 5120)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1357, file: !694, line: 674, baseType: !752, size: 32, offset: 5184)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1357, file: !694, line: 675, baseType: !797, size: 64, offset: 5248)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !899, file: !694, line: 195, baseType: !1378, size: 64, offset: 8576)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!319, !1355, !905, !905}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !899, file: !694, line: 196, baseType: !1378, size: 64, offset: 8640)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !899, file: !694, line: 197, baseType: !1155, size: 64, offset: 8704)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !899, file: !694, line: 198, baseType: !1275, size: 64, offset: 8768)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !899, file: !694, line: 199, baseType: !1279, size: 64, offset: 8832)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !899, file: !694, line: 201, baseType: !1386, size: 64, offset: 8896)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!319, !905, !752, !752}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !899, file: !694, line: 202, baseType: !1056, size: 64, offset: 8960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !899, file: !694, line: 203, baseType: !924, size: 64, offset: 9024)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !899, file: !694, line: 204, baseType: !1110, size: 64, offset: 9088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !899, file: !694, line: 205, baseType: !1239, size: 64, offset: 9152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !899, file: !694, line: 206, baseType: !1394, size: 64, offset: 9216)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!319, !304, !905, !752, !970, !971}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !899, file: !694, line: 208, baseType: !1398, size: 64, offset: 9280)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!319, !752, !1066}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !899, file: !694, line: 209, baseType: !1279, size: 64, offset: 9344)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !899, file: !694, line: 210, baseType: !1073, size: 64, offset: 9408)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !693, file: !694, line: 438, baseType: !1404, size: 64, offset: 13952)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !938, line: 60, baseType: !1405)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1407)
!1407 = !{!1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1406, file: !114, line: 241, baseType: !304, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1406, file: !114, line: 242, baseType: !769, size: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1406, file: !114, line: 243, baseType: !752, size: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1406, file: !114, line: 243, baseType: !752, size: 32, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1406, file: !114, line: 244, baseType: !752, size: 32, offset: 160)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1406, file: !114, line: 244, baseType: !752, size: 32, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1406, file: !114, line: 245, baseType: !797, size: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1406, file: !114, line: 246, baseType: !867, size: 32, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1406, file: !114, line: 247, baseType: !752, size: 32, offset: 352)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1406, file: !114, line: 251, baseType: !752, size: 32, offset: 384)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1406, file: !114, line: 252, baseType: !1210, size: 64, offset: 448)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1406, file: !114, line: 253, baseType: !867, size: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1406, file: !114, line: 254, baseType: !752, size: 32, offset: 544)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1406, file: !114, line: 254, baseType: !752, size: 32, offset: 576)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1406, file: !114, line: 255, baseType: !752, size: 32, offset: 608)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !693, file: !694, line: 438, baseType: !1404, size: 64, offset: 14016)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !693, file: !694, line: 439, baseType: !308, size: 64, offset: 14080)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !693, file: !694, line: 440, baseType: !1426, size: 32, offset: 14144)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !693, file: !694, line: 441, baseType: !867, size: 32, offset: 14176)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !693, file: !694, line: 442, baseType: !867, size: 32, offset: 14208)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !693, file: !694, line: 443, baseType: !1430, size: 448, offset: 14272)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1431, size: 448, elements: !1432)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !301)
!1432 = !{!1433}
!1433 = !DISubrange(count: 7)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !693, file: !694, line: 444, baseType: !867, size: 32, offset: 14720)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !693, file: !694, line: 445, baseType: !867, size: 32, offset: 14752)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !693, file: !694, line: 446, baseType: !752, size: 32, offset: 14784)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !693, file: !694, line: 447, baseType: !790, size: 64, offset: 14848)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !693, file: !694, line: 448, baseType: !790, size: 64, offset: 14912)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !693, file: !694, line: 449, baseType: !978, size: 640, offset: 14976)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !693, file: !694, line: 450, baseType: !910, size: 32, offset: 15616)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !693, file: !694, line: 451, baseType: !1442, size: 2880, offset: 15680)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !694, line: 318, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !694, line: 319, size: 2880, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448, !1449, !1450, !1451, !1464, !1465, !1470, !1475, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1490, !1491, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1523, !1524, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1547, !1548, !1549, !1553, !1554}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1443, file: !694, line: 320, baseType: !752, size: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1443, file: !694, line: 321, baseType: !752, size: 32, offset: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1443, file: !694, line: 322, baseType: !752, size: 32, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1443, file: !694, line: 323, baseType: !752, size: 32, offset: 96)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1443, file: !694, line: 324, baseType: !752, size: 32, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1443, file: !694, line: 325, baseType: !752, size: 32, offset: 160)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1443, file: !694, line: 326, baseType: !1452, size: 64, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !694, line: 293, baseType: !1453)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !694, line: 295, size: 448, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1454, file: !694, line: 296, baseType: !1452, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1454, file: !694, line: 297, baseType: !814, size: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1454, file: !694, line: 297, baseType: !814, size: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1454, file: !694, line: 298, baseType: !797, size: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1454, file: !694, line: 298, baseType: !797, size: 64, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1454, file: !694, line: 299, baseType: !752, size: 32, offset: 320)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1454, file: !694, line: 300, baseType: !752, size: 32, offset: 352)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1454, file: !694, line: 301, baseType: !752, size: 32, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1443, file: !694, line: 326, baseType: !1452, size: 64, offset: 256)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1443, file: !694, line: 328, baseType: !1466, size: 64, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!319, !905, !1469, !797}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1443, file: !694, line: 329, baseType: !1471, size: 64, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!319, !1469, !1474, !799, !799, !817, !797}
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1443, file: !694, line: 330, baseType: !1476, size: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!319, !1469}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1443, file: !694, line: 331, baseType: !1476, size: 64, offset: 512)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1443, file: !694, line: 334, baseType: !304, size: 64, offset: 576)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1443, file: !694, line: 335, baseType: !769, size: 32, offset: 640)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1443, file: !694, line: 335, baseType: !769, size: 32, offset: 672)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1443, file: !694, line: 336, baseType: !769, size: 32, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1443, file: !694, line: 336, baseType: !769, size: 32, offset: 736)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1443, file: !694, line: 337, baseType: !1486, size: 64, offset: 768)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !305, line: 339, baseType: !1488)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64)
!1489 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !305, line: 339, flags: DIFlagFwdDecl)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1443, file: !694, line: 338, baseType: !1486, size: 64, offset: 832)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1443, file: !694, line: 339, baseType: !1492, size: 64, offset: 896)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !305, line: 341, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !305, line: 351, size: 192, elements: !1495)
!1495 = !{!1496, !1497, !1498, !1499, !1500}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1494, file: !305, line: 354, baseType: !72, size: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1494, file: !305, line: 355, baseType: !72, size: 32, offset: 32)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1494, file: !305, line: 356, baseType: !72, size: 32, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1494, file: !305, line: 361, baseType: !72, size: 32, offset: 96)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1494, file: !305, line: 362, baseType: !863, size: 64, offset: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1443, file: !694, line: 340, baseType: !752, size: 32, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1443, file: !694, line: 340, baseType: !752, size: 32, offset: 992)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1443, file: !694, line: 341, baseType: !814, size: 64, offset: 1024)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1443, file: !694, line: 342, baseType: !797, size: 64, offset: 1088)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1443, file: !694, line: 343, baseType: !817, size: 64, offset: 1152)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1443, file: !694, line: 344, baseType: !799, size: 64, offset: 1216)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1443, file: !694, line: 345, baseType: !752, size: 32, offset: 1280)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1443, file: !694, line: 346, baseType: !1474, size: 64, offset: 1344)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1443, file: !694, line: 347, baseType: !867, size: 32, offset: 1408)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1443, file: !694, line: 348, baseType: !752, size: 32, offset: 1440)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1443, file: !694, line: 351, baseType: !867, size: 32, offset: 1472)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1443, file: !694, line: 352, baseType: !867, size: 32, offset: 1504)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1443, file: !694, line: 353, baseType: !769, size: 32, offset: 1536)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1443, file: !694, line: 354, baseType: !769, size: 32, offset: 1568)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1443, file: !694, line: 355, baseType: !1474, size: 64, offset: 1600)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1443, file: !694, line: 356, baseType: !1474, size: 64, offset: 1664)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1443, file: !694, line: 357, baseType: !1518, size: 64, offset: 1728)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !694, line: 310, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 308, size: 32, elements: !1521)
!1521 = !{!1522}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1520, file: !694, line: 309, baseType: !752, size: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1443, file: !694, line: 357, baseType: !1518, size: 64, offset: 1792)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1443, file: !694, line: 358, baseType: !1525, size: 64, offset: 1856)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !694, line: 316, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 312, size: 128, elements: !1528)
!1528 = !{!1529, !1530, !1531}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1527, file: !694, line: 313, baseType: !308, size: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1527, file: !694, line: 314, baseType: !752, size: 32, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1527, file: !694, line: 315, baseType: !303, size: 8, offset: 96)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1443, file: !694, line: 359, baseType: !1525, size: 64, offset: 1920)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1443, file: !694, line: 360, baseType: !1525, size: 64, offset: 1984)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1443, file: !694, line: 361, baseType: !752, size: 32, offset: 2048)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1443, file: !694, line: 362, baseType: !769, size: 32, offset: 2080)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1443, file: !694, line: 363, baseType: !752, size: 32, offset: 2112)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1443, file: !694, line: 364, baseType: !1474, size: 64, offset: 2176)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1443, file: !694, line: 365, baseType: !1492, size: 64, offset: 2240)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1443, file: !694, line: 366, baseType: !769, size: 32, offset: 2304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1443, file: !694, line: 367, baseType: !769, size: 32, offset: 2336)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1443, file: !694, line: 368, baseType: !1486, size: 64, offset: 2368)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1443, file: !694, line: 369, baseType: !1486, size: 64, offset: 2432)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1443, file: !694, line: 370, baseType: !1544, size: 64, offset: 2496)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1545)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1443, file: !694, line: 371, baseType: !1544, size: 64, offset: 2560)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1443, file: !694, line: 372, baseType: !1544, size: 64, offset: 2624)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1443, file: !694, line: 373, baseType: !1550, size: 64, offset: 2688)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !305, line: 331, baseType: !1551)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !305, line: 331, flags: DIFlagFwdDecl)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1443, file: !694, line: 374, baseType: !863, size: 64, offset: 2752)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1443, file: !694, line: 375, baseType: !1555, size: 64, offset: 2816)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !693, file: !694, line: 451, baseType: !1442, size: 2880, offset: 18560)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !693, file: !694, line: 452, baseType: !1558, size: 64, offset: 21440)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1559)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !694, line: 681, size: 4864, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565, !1566, !1567, !1568, !1572}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1560, file: !694, line: 682, baseType: !697, size: 4480)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1560, file: !694, line: 682, baseType: !1122, size: 32, offset: 4480)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1560, file: !694, line: 683, baseType: !867, size: 32, offset: 4512)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1560, file: !694, line: 684, baseType: !752, size: 32, offset: 4544)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1560, file: !694, line: 685, baseType: !1272, size: 64, offset: 4608)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1560, file: !694, line: 686, baseType: !814, size: 64, offset: 4672)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1560, file: !694, line: 687, baseType: !1569, size: 64, offset: 4736)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!319, !1558, !920, !308}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1560, file: !694, line: 688, baseType: !308, size: 64, offset: 4800)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !693, file: !694, line: 453, baseType: !1558, size: 64, offset: 21504)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !693, file: !694, line: 454, baseType: !1558, size: 64, offset: 21568)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !693, file: !694, line: 455, baseType: !752, size: 32, offset: 21632)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !693, file: !694, line: 456, baseType: !867, size: 32, offset: 21664)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !693, file: !694, line: 457, baseType: !1578, size: 320, offset: 21696)
!1578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !694, line: 399, baseType: !1579)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 394, size: 320, elements: !1580)
!1580 = !{!1581, !1582, !1586, !1587}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1579, file: !694, line: 395, baseType: !752, size: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1579, file: !694, line: 396, baseType: !1583, size: 128, offset: 32)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, elements: !1584)
!1584 = !{!1585}
!1585 = !DISubrange(count: 4)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1579, file: !694, line: 397, baseType: !1583, size: 128, offset: 160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1579, file: !694, line: 398, baseType: !867, size: 32, offset: 288)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !693, file: !694, line: 458, baseType: !867, size: 32, offset: 22016)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !693, file: !694, line: 458, baseType: !867, size: 32, offset: 22048)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !693, file: !694, line: 458, baseType: !867, size: 32, offset: 22080)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !693, file: !694, line: 458, baseType: !867, size: 32, offset: 22112)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !693, file: !694, line: 459, baseType: !867, size: 32, offset: 22144)
