; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexorient.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexorient.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque

!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 424, baseType: !5, size: 32, elements: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!97 = !{!98, !102, !103, !139, !307, !189, !110, !273, !310, !141, !164}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !106, line: 73, size: 4480, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !111, !160, !161, !163, !166, !167, !168, !169, !177, !178, !180, !184, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !201, !202, !203, !205, !206, !208, !210, !211, !212, !213, !214, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !240, !242, !243, !247, !248, !297, !302, !304, !305, !306}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !105, file: !106, line: 74, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !105, file: !106, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !158)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !106, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 45, size: 448, elements: !115)
!115 = !{!116, !122, !130, !135, !142, !146, !153}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !106, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !103, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !110)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !106, line: 47, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!120, !103, !126}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !127, line: 16, baseType: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !127, line: 16, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !106, line: 48, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!120, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !106, line: 49, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!120, !103, !139, !103}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !106, line: 50, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!120, !103, !139, !134}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !106, line: 51, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !103, !139, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !106, line: 52, baseType: !154, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!120, !103, !139, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!158 = !{!159}
!159 = !DISubrange(count: 1)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !105, file: !106, line: 76, baseType: !98, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !106, line: 77, baseType: !162, size: 32, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !110)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !165)
!165 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !106, line: 79, baseType: !170, size: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !173, line: 27, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !175, line: 43, baseType: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !105, file: !106, line: 80, baseType: !162, size: 32, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !105, file: !106, line: 81, baseType: !179, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !110)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !105, file: !106, line: 82, baseType: !181, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !105, file: !106, line: 83, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !105, file: !106, line: 84, baseType: !189, size: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !105, file: !106, line: 85, baseType: !189, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !105, file: !106, line: 86, baseType: !189, size: 64, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !105, file: !106, line: 87, baseType: !189, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !106, line: 88, baseType: !103, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !105, file: !106, line: 89, baseType: !170, size: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 90, baseType: !189, size: 64, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !105, file: !106, line: 91, baseType: !189, size: 64, offset: 1600)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !105, file: !106, line: 92, baseType: !162, size: 32, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !105, file: !106, line: 93, baseType: !102, size: 64, offset: 1728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !105, file: !106, line: 94, baseType: !200, size: 64, offset: 1792)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !171)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !105, file: !106, line: 95, baseType: !162, size: 32, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !105, file: !106, line: 95, baseType: !162, size: 32, offset: 1888)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !105, file: !106, line: 96, baseType: !204, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !105, file: !106, line: 96, baseType: !204, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !105, file: !106, line: 97, baseType: !207, size: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !105, file: !106, line: 97, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !105, file: !106, line: 98, baseType: !162, size: 32, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !105, file: !106, line: 98, baseType: !162, size: 32, offset: 2208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !105, file: !106, line: 99, baseType: !204, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !105, file: !106, line: 99, baseType: !204, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !105, file: !106, line: 100, baseType: !215, size: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !165)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !105, file: !106, line: 100, baseType: !218, size: 64, offset: 2432)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !105, file: !106, line: 101, baseType: !162, size: 32, offset: 2496)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !105, file: !106, line: 101, baseType: !162, size: 32, offset: 2528)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !105, file: !106, line: 102, baseType: !204, size: 64, offset: 2560)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !105, file: !106, line: 102, baseType: !204, size: 64, offset: 2624)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !105, file: !106, line: 103, baseType: !224, size: 64, offset: 2688)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !105, file: !106, line: 103, baseType: !227, size: 64, offset: 2752)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !105, file: !106, line: 104, baseType: !157, size: 64, offset: 2816)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !105, file: !106, line: 105, baseType: !162, size: 32, offset: 2880)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !105, file: !106, line: 106, baseType: !231, size: 128, offset: 2944)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !238)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !106, line: 64, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 61, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !106, line: 62, baseType: !150, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !234, file: !106, line: 63, baseType: !102, size: 64, offset: 64)
!238 = !{!239}
!239 = !DISubrange(count: 2)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !105, file: !106, line: 107, baseType: !241, size: 64, offset: 3072)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, elements: !238)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !105, file: !106, line: 108, baseType: !102, size: 64, offset: 3136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !105, file: !106, line: 109, baseType: !244, size: 64, offset: 3200)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!120, !102}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !105, file: !106, line: 111, baseType: !162, size: 32, offset: 3264)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !105, file: !106, line: 112, baseType: !249, size: 320, offset: 3328)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !295)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!120, !253, !103, !102}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !256)
!256 = !{!257, !258, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !255, file: !10, line: 100, baseType: !162, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !10, line: 101, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !270, !271, !272, !276, !278, !280, !281, !282}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !261, file: !10, line: 84, baseType: !189, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !10, line: 85, baseType: !189, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !10, line: 86, baseType: !102, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !261, file: !10, line: 87, baseType: !181, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !261, file: !10, line: 88, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !261, file: !10, line: 89, baseType: !141, size: 8, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !261, file: !10, line: 90, baseType: !189, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !261, file: !10, line: 91, baseType: !273, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 46, baseType: !275)
!274 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!275 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !261, file: !10, line: 92, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !10, line: 93, baseType: !279, size: 32, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !10, line: 94, baseType: !259, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !261, file: !10, line: 95, baseType: !189, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !261, file: !10, line: 96, baseType: !102, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !255, file: !10, line: 103, baseType: !189, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !255, file: !10, line: 104, baseType: !98, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !255, file: !10, line: 106, baseType: !103, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !255, file: !10, line: 107, baseType: !292, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!295 = !{!296}
!296 = !DISubrange(count: 5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !105, file: !106, line: 113, baseType: !298, size: 320, offset: 3648)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!120, !103, !102}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !105, file: !106, line: 114, baseType: !303, size: 320, offset: 3968)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 320, elements: !295)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !105, file: !106, line: 115, baseType: !277, size: 32, offset: 4288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !105, file: !106, line: 120, baseType: !292, size: 64, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !105, file: !106, line: 121, baseType: !277, size: 32, offset: 4416)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !99, line: 331, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !99, line: 331, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !99, line: 338, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !99, line: 338, flags: DIFlagFwdDecl)
!313 = !{i32 7, !"Dwarf Version", i32 4}
!314 = !{i32 2, !"Debug Info Version", i32 3}
!315 = !{i32 1, !"wchar_size", i32 4}
!316 = !{i32 7, !"PIC Level", i32 2}
!317 = !{i32 7, !"uwtable", i32 1}
!318 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!319 = distinct !DISubprogram(name: "DMPlexCompareOrientations", scope: !320, file: !320, line: 23, type: !321, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1070)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexorient.c", directory: "/home/users/ndemeye/xSDK")
!321 = !DISubroutineType(types: !322)
!322 = !{!120, !323, !162, !162, !458, !207, !415}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !326)
!326 = !{!327, !329, !565, !569, !570, !571, !572, !582, !583, !591, !592, !600, !601, !602, !603, !607, !608, !612, !614, !616, !617, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !645, !657, !669, !681, !690, !691, !714, !715, !716, !717, !718, !719, !721, !812, !813, !833, !834, !835, !836, !837, !838, !842, !843, !847, !848, !849, !850, !851, !852, !853, !854, !855, !858, !870, !871, !872, !881, !969, !970, !1058, !1059, !1060, !1061, !1063, !1065, !1066, !1067, !1068, !1069}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !325, file: !47, line: 203, baseType: !328, size: 4480)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !106, line: 122, baseType: !105)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !325, file: !47, line: 203, baseType: !330, size: 3456, offset: 4480)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 3456, elements: !158)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !332)
!332 = !{!333, !337, !338, !343, !347, !351, !352, !353, !362, !363, !364, !376, !377, !385, !394, !402, !406, !410, !411, !416, !417, !421, !422, !426, !427, !435, !439, !444, !445, !446, !447, !448, !449, !450, !454, !460, !464, !469, !473, !484, !488, !493, !500, !504, !505, !511, !522, !526, !536, !540, !548, !552, !560, !561}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !331, file: !47, line: 31, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!120, !323, !126}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !331, file: !47, line: 32, baseType: !334, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !331, file: !47, line: 33, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!120, !323, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !331, file: !47, line: 34, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!120, !253, !323}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !331, file: !47, line: 35, baseType: !348, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!120, !323}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !331, file: !47, line: 36, baseType: !348, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !331, file: !47, line: 37, baseType: !348, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !331, file: !47, line: 38, baseType: !354, size: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!120, !323, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !359, line: 21, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !359, line: 21, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !331, file: !47, line: 39, baseType: !354, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !331, file: !47, line: 40, baseType: !348, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !331, file: !47, line: 41, baseType: !365, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!120, !323, !207, !368, !370}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !373, line: 11, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !373, line: 11, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !331, file: !47, line: 42, baseType: !339, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !331, file: !47, line: 43, baseType: !378, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!120, !323, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !331, file: !47, line: 45, baseType: !386, size: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!120, !323, !389, !390}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !373, line: 51, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !373, line: 51, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !331, file: !47, line: 46, baseType: !395, size: 64, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!120, !323, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !93, line: 16, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !93, line: 16, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !331, file: !47, line: 47, baseType: !403, size: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!120, !323, !323, !398, !357}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !331, file: !47, line: 48, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!120, !323, !323, !398}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !331, file: !47, line: 49, baseType: !407, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !331, file: !47, line: 50, baseType: !412, size: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!120, !323, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !331, file: !47, line: 51, baseType: !407, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !331, file: !47, line: 53, baseType: !418, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!120, !323, !98, !342}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !331, file: !47, line: 54, baseType: !418, size: 64, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !331, file: !47, line: 55, baseType: !423, size: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!120, !323, !162, !342}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !331, file: !47, line: 56, baseType: !423, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !331, file: !47, line: 57, baseType: !428, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!120, !323, !431, !342}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !432, line: 12, baseType: !433)
!432 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !432, line: 12, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !331, file: !47, line: 58, baseType: !436, size: 64, offset: 1600)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!120, !323, !358, !431, !342}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !331, file: !47, line: 60, baseType: !440, size: 64, offset: 1664)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!120, !323, !358, !443, !358}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !331, file: !47, line: 61, baseType: !440, size: 64, offset: 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !331, file: !47, line: 62, baseType: !440, size: 64, offset: 1792)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !331, file: !47, line: 63, baseType: !440, size: 64, offset: 1856)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !331, file: !47, line: 64, baseType: !440, size: 64, offset: 1920)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !331, file: !47, line: 65, baseType: !440, size: 64, offset: 1984)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !331, file: !47, line: 67, baseType: !348, size: 64, offset: 2048)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !331, file: !47, line: 69, baseType: !451, size: 64, offset: 2112)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!120, !323, !358, !358}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !331, file: !47, line: 71, baseType: !455, size: 64, offset: 2176)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!120, !323, !162, !458, !371, !342}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !331, file: !47, line: 72, baseType: !461, size: 64, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!120, !342, !162, !370, !342}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !331, file: !47, line: 73, baseType: !465, size: 64, offset: 2304)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!120, !323, !207, !368, !370, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !331, file: !47, line: 74, baseType: !470, size: 64, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!120, !323, !207, !368, !370, !370, !468}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !331, file: !47, line: 75, baseType: !474, size: 64, offset: 2432)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!120, !323, !162, !342, !477, !477, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !480, line: 59, baseType: !481)
!480 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !480, line: 15, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !480, line: 15, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !331, file: !47, line: 77, baseType: !485, size: 64, offset: 2496)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!120, !323, !162, !207, !207}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !331, file: !47, line: 78, baseType: !489, size: 64, offset: 2560)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!120, !323, !358, !492, !481}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !331, file: !47, line: 79, baseType: !494, size: 64, offset: 2624)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!120, !323, !207, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !331, file: !47, line: 80, baseType: !501, size: 64, offset: 2688)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!120, !323, !215, !215}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !331, file: !47, line: 81, baseType: !501, size: 64, offset: 2752)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !331, file: !47, line: 82, baseType: !506, size: 64, offset: 2816)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!120, !323, !358, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !331, file: !47, line: 84, baseType: !512, size: 64, offset: 2880)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!120, !323, !216, !515, !521, !443, !358}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!120, !162, !216, !519, !162, !224, !102}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !331, file: !47, line: 85, baseType: !523, size: 64, offset: 2944)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!120, !323, !216, !431, !162, !458, !162, !458, !515, !521, !443, !358}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !331, file: !47, line: 86, baseType: !527, size: 64, offset: 3008)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!120, !323, !216, !358, !530, !443, !358}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !162, !162, !162, !458, !458, !534, !534, !534, !458, !458, !534, !534, !534, !216, !519, !162, !534, !224}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !331, file: !47, line: 87, baseType: !537, size: 64, offset: 3072)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!120, !323, !216, !431, !162, !458, !162, !458, !358, !530, !443, !358}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !331, file: !47, line: 88, baseType: !541, size: 64, offset: 3136)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!120, !323, !216, !431, !162, !458, !162, !458, !358, !544, !443, !358}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !162, !162, !162, !458, !458, !534, !534, !534, !458, !458, !534, !534, !534, !216, !519, !519, !162, !534, !224}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !331, file: !47, line: 89, baseType: !549, size: 64, offset: 3200)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!120, !323, !216, !515, !521, !358, !215}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !331, file: !47, line: 90, baseType: !553, size: 64, offset: 3264)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!120, !323, !216, !556, !521, !358, !519, !215}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!120, !162, !216, !519, !519, !162, !224, !102}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !331, file: !47, line: 91, baseType: !549, size: 64, offset: 3328)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !331, file: !47, line: 93, baseType: !562, size: 64, offset: 3392)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!120, !323, !323, !415, !415}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !325, file: !47, line: 204, baseType: !566, size: 6400, offset: 7936)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 6400, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 100)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !325, file: !47, line: 204, baseType: !566, size: 6400, offset: 14336)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !325, file: !47, line: 205, baseType: !566, size: 6400, offset: 20736)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !325, file: !47, line: 205, baseType: !566, size: 6400, offset: 27136)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !325, file: !47, line: 206, baseType: !573, size: 64, offset: 33536)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !576)
!576 = !{!577, !578, !579, !581}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !575, file: !47, line: 143, baseType: !358, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !575, file: !47, line: 144, baseType: !189, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !575, file: !47, line: 145, baseType: !580, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !47, line: 146, baseType: !573, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !325, file: !47, line: 207, baseType: !573, size: 64, offset: 33600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !325, file: !47, line: 208, baseType: !584, size: 64, offset: 33664)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !586, file: !47, line: 151, baseType: !273, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !586, file: !47, line: 152, baseType: !102, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !47, line: 153, baseType: !584, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !325, file: !47, line: 208, baseType: !584, size: 64, offset: 33728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !325, file: !47, line: 209, baseType: !593, size: 64, offset: 33792)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !595, file: !47, line: 159, baseType: !431, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !595, file: !47, line: 160, baseType: !277, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !47, line: 161, baseType: !594, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !325, file: !47, line: 210, baseType: !431, size: 64, offset: 33856)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !325, file: !47, line: 211, baseType: !431, size: 64, offset: 33920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !325, file: !47, line: 212, baseType: !102, size: 64, offset: 33984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !325, file: !47, line: 213, baseType: !604, size: 64, offset: 34048)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!120, !521}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !325, file: !47, line: 214, baseType: !389, size: 32, offset: 34112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !325, file: !47, line: 215, baseType: !609, size: 64, offset: 34176)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !93, line: 1378, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !93, line: 1378, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !325, file: !47, line: 216, baseType: !613, size: 64, offset: 34240)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !359, line: 83, baseType: !139)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !325, file: !47, line: 217, baseType: !615, size: 64, offset: 34304)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !93, line: 25, baseType: !139)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !325, file: !47, line: 218, baseType: !162, size: 32, offset: 34368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !325, file: !47, line: 219, baseType: !618, size: 64, offset: 34432)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !373, line: 30, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !373, line: 30, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !325, file: !47, line: 220, baseType: !277, size: 32, offset: 34496)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !325, file: !47, line: 221, baseType: !277, size: 32, offset: 34528)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !325, file: !47, line: 222, baseType: !162, size: 32, offset: 34560)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !325, file: !47, line: 222, baseType: !162, size: 32, offset: 34592)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !325, file: !47, line: 223, baseType: !277, size: 32, offset: 34624)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !325, file: !47, line: 224, baseType: !277, size: 32, offset: 34656)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !47, line: 225, baseType: !102, size: 64, offset: 34688)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !325, file: !47, line: 227, baseType: !323, size: 64, offset: 34752)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !325, file: !47, line: 228, baseType: !323, size: 64, offset: 34816)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !325, file: !47, line: 229, baseType: !631, size: 64, offset: 34880)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !634)
!634 = !{!635, !639, !643, !644}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !633, file: !47, line: 102, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!120, !323, !323, !102}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !633, file: !47, line: 103, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!120, !323, !399, !358, !399, !323, !102}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !633, file: !47, line: 104, baseType: !102, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !633, file: !47, line: 105, baseType: !631, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !325, file: !47, line: 230, baseType: !646, size: 64, offset: 34944)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !649)
!649 = !{!650, !651, !655, !656}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !648, file: !47, line: 110, baseType: !636, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !648, file: !47, line: 111, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!120, !323, !399, !323, !102}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !648, file: !47, line: 112, baseType: !102, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !47, line: 113, baseType: !646, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !325, file: !47, line: 231, baseType: !658, size: 64, offset: 35008)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !661)
!661 = !{!662, !663, !667, !668}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !660, file: !47, line: 118, baseType: !636, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !660, file: !47, line: 119, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!120, !323, !479, !479, !323, !102}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !660, file: !47, line: 120, baseType: !102, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !47, line: 121, baseType: !658, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !325, file: !47, line: 232, baseType: !670, size: 64, offset: 35072)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !673)
!673 = !{!674, !678, !679, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !672, file: !47, line: 126, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!120, !323, !358, !443, !358, !102}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !672, file: !47, line: 127, baseType: !675, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !672, file: !47, line: 128, baseType: !102, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !47, line: 129, baseType: !670, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !325, file: !47, line: 233, baseType: !682, size: 64, offset: 35136)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !684, file: !47, line: 134, baseType: !675, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !684, file: !47, line: 135, baseType: !675, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !684, file: !47, line: 136, baseType: !102, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !47, line: 137, baseType: !682, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !325, file: !47, line: 235, baseType: !162, size: 32, offset: 35200)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !325, file: !47, line: 237, baseType: !692, size: 64, offset: 35264)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !696)
!696 = !{!697, !701, !702, !703, !704, !706, !713}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !695, file: !47, line: 27, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !699, line: 166, baseType: !700)
!699 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !699, line: 139, baseType: !5)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !695, file: !47, line: 27, baseType: !698, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !695, file: !47, line: 27, baseType: !698, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !695, file: !47, line: 27, baseType: !698, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !695, file: !47, line: 27, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !695, file: !47, line: 27, baseType: !707, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !709, file: !47, line: 19, baseType: !431, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !709, file: !47, line: 20, baseType: !162, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !695, file: !47, line: 27, baseType: !357, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !325, file: !47, line: 239, baseType: !481, size: 64, offset: 35328)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !325, file: !47, line: 240, baseType: !481, size: 64, offset: 35392)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !325, file: !47, line: 241, baseType: !481, size: 64, offset: 35456)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !325, file: !47, line: 242, baseType: !481, size: 64, offset: 35520)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !325, file: !47, line: 243, baseType: !277, size: 32, offset: 35584)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !325, file: !47, line: 245, baseType: !720, size: 64, offset: 35616)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 64, elements: !238)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !325, file: !47, line: 246, baseType: !722, size: 64, offset: 35712)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !723, line: 18, baseType: !724)
!723 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !726, line: 29, size: 5760, elements: !727)
!726 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!727 = !{!728, !729, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !747, !748, !749, !750, !775, !776, !777}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !725, file: !726, line: 30, baseType: !328, size: 4480)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !725, file: !726, line: 30, baseType: !730, size: 32, offset: 4480)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !158)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !725, file: !726, line: 31, baseType: !162, size: 32, offset: 4512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !725, file: !726, line: 31, baseType: !162, size: 32, offset: 4544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !725, file: !726, line: 32, baseType: !372, size: 64, offset: 4608)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !725, file: !726, line: 33, baseType: !277, size: 32, offset: 4672)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !725, file: !726, line: 34, baseType: !277, size: 32, offset: 4704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !725, file: !726, line: 35, baseType: !207, size: 64, offset: 4736)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !725, file: !726, line: 36, baseType: !207, size: 64, offset: 4800)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !725, file: !726, line: 37, baseType: !162, size: 32, offset: 4864)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !725, file: !726, line: 38, baseType: !722, size: 64, offset: 4928)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !725, file: !726, line: 39, baseType: !207, size: 64, offset: 4992)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !725, file: !726, line: 40, baseType: !277, size: 32, offset: 5056)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !725, file: !726, line: 42, baseType: !162, size: 32, offset: 5088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !725, file: !726, line: 43, baseType: !369, size: 64, offset: 5120)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !725, file: !726, line: 44, baseType: !207, size: 64, offset: 5184)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !725, file: !726, line: 45, baseType: !746, size: 64, offset: 5248)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !725, file: !726, line: 46, baseType: !277, size: 32, offset: 5312)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !725, file: !726, line: 47, baseType: !368, size: 64, offset: 5376)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !725, file: !726, line: 49, baseType: !103, size: 64, offset: 5440)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !725, file: !726, line: 50, baseType: !751, size: 64, offset: 5504)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !726, line: 27, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !726, line: 27, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !726, line: 27, size: 320, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !768}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !754, file: !726, line: 27, baseType: !698, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !754, file: !726, line: 27, baseType: !698, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !754, file: !726, line: 27, baseType: !698, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !754, file: !726, line: 27, baseType: !698, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !754, file: !726, line: 27, baseType: !705, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !754, file: !726, line: 27, baseType: !762, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !726, line: 10, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !726, line: 8, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !764, file: !726, line: 9, baseType: !162, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !764, file: !726, line: 9, baseType: !162, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !754, file: !726, line: 27, baseType: !769, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !726, line: 14, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 12, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !771, file: !726, line: 13, baseType: !207, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !771, file: !726, line: 13, baseType: !207, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !725, file: !726, line: 51, baseType: !722, size: 64, offset: 5568)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !725, file: !726, line: 52, baseType: !372, size: 64, offset: 5632)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !725, file: !726, line: 53, baseType: !778, size: 64, offset: 5696)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !723, line: 33, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !726, line: 72, size: 4864, elements: !781)
!781 = !{!782, !783, !801, !802, !811}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !780, file: !726, line: 73, baseType: !328, size: 4480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !780, file: !726, line: 73, baseType: !784, size: 192, offset: 4480)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 192, elements: !158)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !726, line: 56, size: 192, elements: !786)
!786 = !{!787, !793, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !785, file: !726, line: 57, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!120, !778, !722, !162, !458, !791, !792}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !785, file: !726, line: 58, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!120, !778}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !785, file: !726, line: 59, baseType: !798, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!120, !778, !126}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !780, file: !726, line: 74, baseType: !102, size: 64, offset: 4672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !780, file: !726, line: 75, baseType: !803, size: 64, offset: 4736)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !726, line: 62, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !726, line: 64, size: 256, elements: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !805, file: !726, line: 66, baseType: !803, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !805, file: !726, line: 67, baseType: !791, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !805, file: !726, line: 68, baseType: !792, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !805, file: !726, line: 69, baseType: !162, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !780, file: !726, line: 76, baseType: !803, size: 64, offset: 4800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !325, file: !47, line: 247, baseType: !722, size: 64, offset: 35776)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !325, file: !47, line: 248, baseType: !814, size: 64, offset: 35840)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !373, line: 60, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !816, file: !25, line: 241, baseType: !98, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !25, line: 242, baseType: !179, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !816, file: !25, line: 243, baseType: !162, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !816, file: !25, line: 243, baseType: !162, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !816, file: !25, line: 244, baseType: !162, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !816, file: !25, line: 244, baseType: !162, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !816, file: !25, line: 245, baseType: !207, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !816, file: !25, line: 246, baseType: !277, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !816, file: !25, line: 247, baseType: !162, size: 32, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !816, file: !25, line: 251, baseType: !162, size: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !816, file: !25, line: 252, baseType: !618, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !816, file: !25, line: 253, baseType: !277, size: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !816, file: !25, line: 254, baseType: !162, size: 32, offset: 544)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !816, file: !25, line: 254, baseType: !162, size: 32, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !816, file: !25, line: 255, baseType: !162, size: 32, offset: 608)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !325, file: !47, line: 250, baseType: !722, size: 64, offset: 35904)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !325, file: !47, line: 251, baseType: !399, size: 64, offset: 35968)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !325, file: !47, line: 253, baseType: !323, size: 64, offset: 36032)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !325, file: !47, line: 254, baseType: !358, size: 64, offset: 36096)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !325, file: !47, line: 255, baseType: !102, size: 64, offset: 36160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !325, file: !47, line: 256, baseType: !839, size: 64, offset: 36224)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!120, !323, !102}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !325, file: !47, line: 257, baseType: !839, size: 64, offset: 36288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !325, file: !47, line: 258, baseType: !844, size: 64, offset: 36352)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!120, !323, !519, !277, !792, !102}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !325, file: !47, line: 260, baseType: !162, size: 32, offset: 36416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !325, file: !47, line: 261, baseType: !323, size: 64, offset: 36480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !325, file: !47, line: 262, baseType: !358, size: 64, offset: 36544)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !325, file: !47, line: 263, baseType: !358, size: 64, offset: 36608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !325, file: !47, line: 264, baseType: !277, size: 32, offset: 36672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !325, file: !47, line: 265, baseType: !382, size: 64, offset: 36736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !325, file: !47, line: 266, baseType: !215, size: 64, offset: 36800)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !325, file: !47, line: 266, baseType: !215, size: 64, offset: 36864)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !325, file: !47, line: 267, baseType: !856, size: 64, offset: 36928)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !325, file: !47, line: 269, baseType: !859, size: 640, offset: 36992)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 640, elements: !868)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!120, !323, !162, !162, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !93, line: 1723, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !93, line: 1723, flags: DIFlagFwdDecl)
!868 = !{!869}
!869 = !DISubrange(count: 10)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !325, file: !47, line: 270, baseType: !859, size: 640, offset: 37632)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !325, file: !47, line: 272, baseType: !162, size: 32, offset: 38272)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !325, file: !47, line: 273, baseType: !873, size: 64, offset: 38336)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !876)
!876 = !{!877, !878, !879, !880}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !875, file: !47, line: 174, baseType: !103, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !875, file: !47, line: 175, baseType: !431, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !875, file: !47, line: 176, baseType: !720, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !875, file: !47, line: 177, baseType: !277, size: 32, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !325, file: !47, line: 274, baseType: !882, size: 64, offset: 38400)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !885)
!885 = !{!886, !967, !968}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !884, file: !47, line: 168, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !888, line: 11, baseType: !889)
!888 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !888, line: 13, size: 832, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !958, !960, !961, !962, !963, !964, !965, !966}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !890, file: !888, line: 14, baseType: !139, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !890, file: !888, line: 15, baseType: !431, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !890, file: !888, line: 16, baseType: !139, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !890, file: !888, line: 17, baseType: !162, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !890, file: !888, line: 18, baseType: !207, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !890, file: !888, line: 19, baseType: !898, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !899, line: 22, baseType: !900)
!899 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !888, line: 81, size: 4992, elements: !902)
!902 = !{!903, !904, !918, !919, !920, !929}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !901, file: !888, line: 82, baseType: !328, size: 4480)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !901, file: !888, line: 82, baseType: !905, size: 256, offset: 4480)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 256, elements: !158)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !888, line: 74, size: 256, elements: !907)
!907 = !{!908, !912, !913, !917}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !906, file: !888, line: 75, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!120, !898}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !906, file: !888, line: 76, baseType: !909, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !906, file: !888, line: 77, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!120, !898, !126}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !906, file: !888, line: 78, baseType: !909, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !901, file: !888, line: 83, baseType: !102, size: 64, offset: 4736)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !901, file: !888, line: 85, baseType: !162, size: 32, offset: 4800)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !901, file: !888, line: 86, baseType: !921, size: 64, offset: 4864)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !888, line: 41, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 36, size: 256, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !923, file: !888, line: 37, baseType: !273, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !923, file: !888, line: 38, baseType: !273, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !923, file: !888, line: 39, baseType: !273, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !923, file: !888, line: 40, baseType: !189, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !901, file: !888, line: 87, baseType: !930, size: 64, offset: 4928)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !888, line: 54, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !888, line: 54, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !888, line: 54, size: 320, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !950}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !934, file: !888, line: 54, baseType: !698, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !934, file: !888, line: 54, baseType: !698, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !934, file: !888, line: 54, baseType: !698, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !934, file: !888, line: 54, baseType: !698, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !934, file: !888, line: 54, baseType: !705, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !934, file: !888, line: 54, baseType: !942, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !899, line: 41, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !899, line: 35, size: 192, elements: !945)
!945 = !{!946, !947, !948, !949}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !944, file: !899, line: 37, baseType: !431, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !944, file: !899, line: 38, baseType: !162, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !944, file: !899, line: 39, baseType: !162, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !944, file: !899, line: 40, baseType: !162, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !934, file: !888, line: 54, baseType: !951, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !888, line: 34, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 30, size: 96, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !953, file: !888, line: 31, baseType: !162, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !953, file: !888, line: 32, baseType: !162, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !953, file: !888, line: 33, baseType: !162, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !890, file: !888, line: 20, baseType: !959, size: 32, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !890, file: !888, line: 21, baseType: !162, size: 32, offset: 416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !890, file: !888, line: 22, baseType: !162, size: 32, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !890, file: !888, line: 23, baseType: !207, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !890, file: !888, line: 24, baseType: !150, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !890, file: !888, line: 25, baseType: !150, size: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !890, file: !888, line: 26, baseType: !102, size: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !890, file: !888, line: 27, baseType: !887, size: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !884, file: !47, line: 169, baseType: !431, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !47, line: 170, baseType: !882, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !325, file: !47, line: 275, baseType: !162, size: 32, offset: 38464)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !325, file: !47, line: 276, baseType: !971, size: 64, offset: 38528)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !974)
!974 = !{!975, !1056, !1057}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !973, file: !47, line: 181, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !899, line: 13, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !888, line: 98, size: 7232, elements: !979)
!979 = !{!980, !981, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !978, file: !888, line: 99, baseType: !328, size: 4480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !978, file: !888, line: 99, baseType: !982, size: 256, offset: 4480)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 256, elements: !158)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !888, line: 91, size: 256, elements: !984)
!984 = !{!985, !989, !990, !994}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !983, file: !888, line: 92, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!120, !976}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !983, file: !888, line: 93, baseType: !986, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !983, file: !888, line: 94, baseType: !991, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!120, !976, !126}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !983, file: !888, line: 95, baseType: !986, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !978, file: !888, line: 100, baseType: !102, size: 64, offset: 4736)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !978, file: !888, line: 101, baseType: !997, size: 64, offset: 4800)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !978, file: !888, line: 102, baseType: !277, size: 32, offset: 4864)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !978, file: !888, line: 103, baseType: !277, size: 32, offset: 4896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !978, file: !888, line: 104, baseType: !162, size: 32, offset: 4928)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !978, file: !888, line: 105, baseType: !162, size: 32, offset: 4960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !978, file: !888, line: 106, baseType: !134, size: 64, offset: 4992)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !978, file: !888, line: 108, baseType: !887, size: 64, offset: 5056)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !978, file: !888, line: 109, baseType: !277, size: 32, offset: 5120)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !978, file: !888, line: 110, baseType: !415, size: 64, offset: 5184)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !978, file: !888, line: 111, baseType: !207, size: 64, offset: 5248)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !978, file: !888, line: 112, baseType: !898, size: 64, offset: 5312)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !978, file: !888, line: 113, baseType: !1009, size: 64, offset: 5376)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !1011, line: 563, baseType: !531)
!1011 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !978, file: !888, line: 114, baseType: !1013, size: 64, offset: 5440)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !1011, line: 580, baseType: !516)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !978, file: !888, line: 115, baseType: !521, size: 64, offset: 5504)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !978, file: !888, line: 116, baseType: !1013, size: 64, offset: 5568)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !978, file: !888, line: 117, baseType: !521, size: 64, offset: 5632)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !978, file: !888, line: 118, baseType: !162, size: 32, offset: 5696)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !978, file: !888, line: 119, baseType: !224, size: 64, offset: 5760)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !978, file: !888, line: 120, baseType: !521, size: 64, offset: 5824)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !978, file: !888, line: 122, baseType: !162, size: 32, offset: 5888)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !978, file: !888, line: 123, baseType: !162, size: 32, offset: 5920)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !978, file: !888, line: 124, baseType: !207, size: 64, offset: 5952)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !978, file: !888, line: 125, baseType: !207, size: 64, offset: 6016)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !978, file: !888, line: 126, baseType: !207, size: 64, offset: 6080)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !978, file: !888, line: 127, baseType: !207, size: 64, offset: 6144)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !978, file: !888, line: 128, baseType: !1028, size: 64, offset: 6208)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1030, line: 481, baseType: !1031)
!1030 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1030, line: 469, size: 256, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1032, file: !1030, line: 470, baseType: !162, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1032, file: !1030, line: 471, baseType: !162, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1032, file: !1030, line: 472, baseType: !162, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1032, file: !1030, line: 473, baseType: !162, size: 32, offset: 96)
