; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/field/impls/shell/dmfieldshell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/field/impls/shell/dmfieldshell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_DMField = type { %struct._p_PetscObject, [1 x %struct._DMFieldOps], %struct._p_DM*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/field/impls/shell/dmfieldshell.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !44, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!26 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 27, baseType: !5, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmfield.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "DMFIELD_VERTEX", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "DMFIELD_EDGE", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "DMFIELD_FACET", value: 2, isUnsigned: true)
!50 = !DIEnumerator(name: "DMFIELD_CELL", value: 3, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 663, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!57 = !{!58, !62, !63, !267, !371, !99, !233, !185, !184, !175}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !59, line: 330, baseType: !60)
!59 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !59, line: 330, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !66, line: 73, size: 4480, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !71, !120, !121, !123, !126, !127, !128, !129, !137, !138, !140, !144, !148, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !161, !162, !163, !165, !166, !168, !170, !171, !172, !173, !174, !177, !179, !180, !181, !182, !183, !186, !188, !189, !190, !200, !202, !203, !207, !208, !257, !262, !264, !265, !266}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !65, file: !66, line: 74, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !70)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !65, file: !66, line: 75, baseType: !72, size: 448, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 448, elements: !118)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !66, line: 53, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 45, size: 448, elements: !75)
!75 = !{!76, !82, !90, !95, !102, !106, !113}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !74, file: !66, line: 46, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !63, !81}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !70)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !74, file: !66, line: 47, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!80, !63, !86}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !87, line: 16, baseType: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !87, line: 16, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !74, file: !66, line: 48, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!80, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !74, file: !66, line: 49, baseType: !96, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!80, !63, !99, !63}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !74, file: !66, line: 50, baseType: !103, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!80, !63, !99, !94}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !74, file: !66, line: 51, baseType: !107, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!80, !63, !99, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !74, file: !66, line: 52, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!80, !63, !99, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !65, file: !66, line: 76, baseType: !58, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !66, line: 77, baseType: !122, size: 32, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !70)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !65, file: !66, line: 78, baseType: !124, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !125)
!125 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !65, file: !66, line: 78, baseType: !124, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !65, file: !66, line: 78, baseType: !124, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !65, file: !66, line: 78, baseType: !124, size: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !66, line: 79, baseType: !130, size: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !133, line: 27, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !135, line: 43, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!136 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !65, file: !66, line: 80, baseType: !122, size: 32, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !65, file: !66, line: 81, baseType: !139, size: 32, offset: 992)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !70)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !65, file: !66, line: 82, baseType: !141, size: 64, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !65, file: !66, line: 83, baseType: !145, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !65, file: !66, line: 84, baseType: !149, size: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !65, file: !66, line: 85, baseType: !149, size: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !65, file: !66, line: 86, baseType: !149, size: 64, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !65, file: !66, line: 87, baseType: !149, size: 64, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !65, file: !66, line: 88, baseType: !63, size: 64, offset: 1408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !65, file: !66, line: 89, baseType: !130, size: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 90, baseType: !149, size: 64, offset: 1536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !65, file: !66, line: 91, baseType: !149, size: 64, offset: 1600)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !65, file: !66, line: 92, baseType: !122, size: 32, offset: 1664)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !65, file: !66, line: 93, baseType: !62, size: 64, offset: 1728)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !65, file: !66, line: 94, baseType: !160, size: 64, offset: 1792)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !131)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !65, file: !66, line: 95, baseType: !122, size: 32, offset: 1856)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !65, file: !66, line: 95, baseType: !122, size: 32, offset: 1888)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !65, file: !66, line: 96, baseType: !164, size: 64, offset: 1920)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !65, file: !66, line: 96, baseType: !164, size: 64, offset: 1984)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !65, file: !66, line: 97, baseType: !167, size: 64, offset: 2048)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !65, file: !66, line: 97, baseType: !169, size: 64, offset: 2112)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !65, file: !66, line: 98, baseType: !122, size: 32, offset: 2176)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !65, file: !66, line: 98, baseType: !122, size: 32, offset: 2208)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !65, file: !66, line: 99, baseType: !164, size: 64, offset: 2240)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !65, file: !66, line: 99, baseType: !164, size: 64, offset: 2304)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !65, file: !66, line: 100, baseType: !175, size: 64, offset: 2368)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !125)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !65, file: !66, line: 100, baseType: !178, size: 64, offset: 2432)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !65, file: !66, line: 101, baseType: !122, size: 32, offset: 2496)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !65, file: !66, line: 101, baseType: !122, size: 32, offset: 2528)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !65, file: !66, line: 102, baseType: !164, size: 64, offset: 2560)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !65, file: !66, line: 102, baseType: !164, size: 64, offset: 2624)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !65, file: !66, line: 103, baseType: !184, size: 64, offset: 2688)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !65, file: !66, line: 103, baseType: !187, size: 64, offset: 2752)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !65, file: !66, line: 104, baseType: !117, size: 64, offset: 2816)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !65, file: !66, line: 105, baseType: !122, size: 32, offset: 2880)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !65, file: !66, line: 106, baseType: !191, size: 128, offset: 2944)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !198)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !66, line: 64, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 61, size: 128, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !194, file: !66, line: 62, baseType: !110, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !194, file: !66, line: 63, baseType: !62, size: 64, offset: 64)
!198 = !{!199}
!199 = !DISubrange(count: 2)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !65, file: !66, line: 107, baseType: !201, size: 64, offset: 3072)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !198)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !65, file: !66, line: 108, baseType: !62, size: 64, offset: 3136)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !65, file: !66, line: 109, baseType: !204, size: 64, offset: 3200)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!80, !62}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !65, file: !66, line: 111, baseType: !122, size: 32, offset: 3264)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !65, file: !66, line: 112, baseType: !209, size: 320, offset: 3328)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 320, elements: !255)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!80, !213, !63, !62}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !216)
!216 = !{!217, !218, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !215, file: !10, line: 100, baseType: !122, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !10, line: 101, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !230, !231, !232, !236, !238, !240, !241, !242}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !221, file: !10, line: 84, baseType: !149, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !221, file: !10, line: 85, baseType: !149, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !10, line: 86, baseType: !62, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !221, file: !10, line: 87, baseType: !141, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !221, file: !10, line: 88, baseType: !228, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !221, file: !10, line: 89, baseType: !101, size: 8, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !221, file: !10, line: 90, baseType: !149, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !221, file: !10, line: 91, baseType: !233, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!235 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !221, file: !10, line: 92, baseType: !237, size: 32, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !10, line: 93, baseType: !239, size: 32, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !10, line: 94, baseType: !219, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !221, file: !10, line: 95, baseType: !149, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !221, file: !10, line: 96, baseType: !62, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !215, file: !10, line: 102, baseType: !149, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !215, file: !10, line: 102, baseType: !149, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !215, file: !10, line: 103, baseType: !149, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !215, file: !10, line: 104, baseType: !58, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !215, file: !10, line: 105, baseType: !237, size: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !215, file: !10, line: 105, baseType: !237, size: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !215, file: !10, line: 105, baseType: !237, size: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !215, file: !10, line: 106, baseType: !63, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !215, file: !10, line: 107, baseType: !252, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!255 = !{!256}
!256 = !DISubrange(count: 5)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !65, file: !66, line: 113, baseType: !258, size: 320, offset: 3648)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 320, elements: !255)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!80, !63, !62}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !65, file: !66, line: 114, baseType: !263, size: 320, offset: 3968)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 320, elements: !255)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !65, file: !66, line: 115, baseType: !237, size: 32, offset: 4288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !65, file: !66, line: 120, baseType: !252, size: 64, offset: 4352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !65, file: !66, line: 121, baseType: !237, size: 32, offset: 4416)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField_Shell", file: !269, line: 8, baseType: !270)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/field/impls/shell/dmfieldshell.c", directory: "/home/users/ndemeye/xSDK")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMField_Shell", file: !269, line: 3, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !270, file: !269, line: 5, baseType: !62, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !270, file: !269, line: 6, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!80, !277}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !278, line: 165, baseType: !279)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !281, line: 24, size: 5376, elements: !282)
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmfieldimpl.h", directory: "/home/users/ndemeye/xSDK")
!282 = !{!283, !285, !363, !367, !369, !370}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !280, file: !281, line: 25, baseType: !284, size: 4480)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !66, line: 122, baseType: !65)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !280, file: !281, line: 25, baseType: !286, size: 704, offset: 4480)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 704, elements: !118)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMFieldOps", file: !281, line: 11, size: 704, elements: !288)
!288 = !{!289, !290, !291, !295, !296, !300, !309, !321, !325, !329, !334}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !287, file: !281, line: 12, baseType: !274, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !287, file: !281, line: 13, baseType: !274, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !287, file: !281, line: 14, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!80, !213, !277}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !287, file: !281, line: 15, baseType: !274, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !287, file: !281, line: 16, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!80, !277, !86}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate", scope: !287, file: !281, line: 17, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!80, !277, !304, !308, !62, !62, !62}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !305, line: 21, baseType: !306)
!305 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !305, line: 21, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !4, line: 389, baseType: !24)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "evaluateFE", scope: !287, file: !281, line: 18, baseType: !310, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!80, !277, !313, !317, !308, !62, !62, !62}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !314, line: 11, baseType: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !314, line: 11, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscQuadrature", file: !318, line: 18, baseType: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscQuadrature", file: !318, line: 18, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "evaluateFV", scope: !287, file: !281, line: 19, baseType: !322, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!80, !277, !313, !308, !62, !62, !62}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "getDegree", scope: !287, file: !281, line: 20, baseType: !326, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!80, !277, !313, !167, !167}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "createDefaultQuadrature", scope: !287, file: !281, line: 21, baseType: !330, size: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!80, !277, !313, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "computeFaceData", scope: !287, file: !281, line: 22, baseType: !335, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!80, !277, !313, !317, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFEGeom", file: !340, line: 28, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfe.h", directory: "/home/users/ndemeye/xSDK")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFEGeom", file: !340, line: 11, size: 1024, elements: !342)
!342 = !{!343, !346, !347, !348, !349, !350, !351, !353, !355, !356, !357, !358, !359, !360, !361, !362}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !341, file: !340, line: 12, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !341, file: !340, line: 13, baseType: !175, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "J", scope: !341, file: !340, line: 14, baseType: !175, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "invJ", scope: !341, file: !340, line: 15, baseType: !175, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "detJ", scope: !341, file: !340, line: 16, baseType: !175, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !341, file: !340, line: 17, baseType: !175, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !341, file: !340, line: 18, baseType: !352, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "suppJ", scope: !341, file: !340, line: 19, baseType: !354, size: 128, offset: 448)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, elements: !198)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "suppInvJ", scope: !341, file: !340, line: 20, baseType: !354, size: 128, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "suppDetJ", scope: !341, file: !340, line: 21, baseType: !354, size: 128, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !341, file: !340, line: 22, baseType: !122, size: 32, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !341, file: !340, line: 23, baseType: !122, size: 32, offset: 864)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "numCells", scope: !341, file: !340, line: 24, baseType: !122, size: 32, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !341, file: !340, line: 25, baseType: !122, size: 32, offset: 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "isAffine", scope: !341, file: !340, line: 26, baseType: !237, size: 32, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !341, file: !340, line: 27, baseType: !237, size: 32, offset: 992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !280, file: !281, line: 26, baseType: !364, size: 64, offset: 5184)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !278, line: 14, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !278, line: 14, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "continuity", scope: !280, file: !281, line: 27, baseType: !368, size: 32, offset: 5248)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFieldContinuity", file: !45, line: 27, baseType: !44)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "numComponents", scope: !280, file: !281, line: 28, baseType: !122, size: 32, offset: 5280)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !281, line: 29, baseType: !62, size: 64, offset: 5312)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!372 = !{i32 7, !"Dwarf Version", i32 4}
!373 = !{i32 2, !"Debug Info Version", i32 3}
!374 = !{i32 1, !"wchar_size", i32 4}
!375 = !{i32 7, !"PIC Level", i32 2}
!376 = !{i32 7, !"uwtable", i32 1}
!377 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!378 = distinct !DISubprogram(name: "DMFieldShellGetContext", scope: !269, file: !269, line: 10, type: !379, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{!80, !277, !62}
!381 = !{!382, !383, !384, !385, !386}
!382 = !DILocalVariable(name: "field", arg: 1, scope: !378, file: !269, line: 10, type: !277)
!383 = !DILocalVariable(name: "ctx", arg: 2, scope: !378, file: !269, line: 10, type: !62)
!384 = !DILocalVariable(name: "flg", scope: !378, file: !269, line: 12, type: !237)
!385 = !DILocalVariable(name: "ierr", scope: !378, file: !269, line: 13, type: !80)
!386 = !DILocalVariable(name: "ierr__", scope: !387, file: !269, line: 18, type: !80)
!387 = distinct !DILexicalBlock(scope: !378, file: !269, line: 18, column: 71)
!388 = !DILocation(line: 0, scope: !378)
!389 = !DILocation(line: 12, column: 3, scope: !378)
!390 = !DILocation(line: 15, column: 3, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !269, line: 15, column: 3)
!392 = distinct !DILexicalBlock(scope: !393, file: !269, line: 15, column: 3)
!393 = distinct !DILexicalBlock(scope: !378, file: !269, line: 15, column: 3)
!394 = !{!395, !395, i64 0}
!395 = !{!"any pointer", !396, i64 0}
!396 = !{!"omnipotent char", !397, i64 0}
!397 = !{!"Simple C/C++ TBAA"}
!398 = !DILocation(line: 15, column: 3, scope: !392)
!399 = !DILocation(line: 15, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !269, line: 15, column: 3)
!401 = distinct !DILexicalBlock(scope: !391, file: !269, line: 15, column: 3)
!402 = !{!403, !404, i64 1536}
!403 = !{!"", !396, i64 0, !396, i64 512, !396, i64 1024, !396, i64 1280, !404, i64 1536, !404, i64 1540, !396, i64 1544}
!404 = !{!"int", !396, i64 0}
!405 = !DILocation(line: 15, column: 3, scope: !401)
!406 = !DILocation(line: 15, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !400, file: !269, line: 15, column: 3)
!408 = !{!404, !404, i64 0}
!409 = !{!403, !404, i64 1540}
!410 = !DILocation(line: 16, column: 3, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !269, line: 16, column: 3)
!412 = distinct !DILexicalBlock(scope: !378, file: !269, line: 16, column: 3)
!413 = !DILocation(line: 16, column: 3, scope: !412)
!414 = !DILocation(line: 16, column: 3, scope: !415)
!415 = distinct !DILexicalBlock(scope: !412, file: !269, line: 16, column: 3)
!416 = !DILocation(line: 16, column: 3, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !269, line: 16, column: 3)
!418 = !{!419, !404, i64 0}
!419 = !{!"_p_PetscObject", !404, i64 0, !396, i64 8, !395, i64 64, !404, i64 72, !420, i64 80, !420, i64 88, !420, i64 96, !420, i64 104, !421, i64 112, !404, i64 120, !404, i64 124, !395, i64 128, !395, i64 136, !395, i64 144, !395, i64 152, !395, i64 160, !395, i64 168, !395, i64 176, !421, i64 184, !395, i64 192, !395, i64 200, !404, i64 208, !395, i64 216, !421, i64 224, !404, i64 232, !404, i64 236, !395, i64 240, !395, i64 248, !395, i64 256, !395, i64 264, !404, i64 272, !404, i64 276, !395, i64 280, !395, i64 288, !395, i64 296, !395, i64 304, !404, i64 312, !404, i64 316, !395, i64 320, !395, i64 328, !395, i64 336, !395, i64 344, !395, i64 352, !404, i64 360, !396, i64 368, !396, i64 384, !395, i64 392, !395, i64 400, !404, i64 408, !396, i64 416, !396, i64 456, !396, i64 496, !396, i64 536, !395, i64 544, !396, i64 552}
