; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cr/pipecr/pipecr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cr/pipecr/pipecr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !{!129, !133, !134, !137}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !130, line: 330, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !130, line: 330, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !140, line: 73, size: 4480, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !144, !190, !191, !193, !196, !197, !198, !199, !207, !208, !210, !214, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !231, !232, !233, !235, !236, !238, !240, !241, !242, !243, !244, !247, !249, !250, !251, !252, !253, !256, !258, !259, !260, !270, !272, !273, !277, !278, !327, !332, !334, !335, !336}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !139, file: !140, line: 74, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !139, file: !140, line: 75, baseType: !145, size: 448, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 448, elements: !188)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !140, line: 53, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 45, size: 448, elements: !148)
!148 = !{!149, !155, !163, !168, !172, !176, !183}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !147, file: !140, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !147, file: !140, line: 47, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!153, !137, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !160, line: 16, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !160, line: 16, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !140, line: 48, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!153, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !147, file: !140, line: 49, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!153, !137, !134, !137}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !147, file: !140, line: 50, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!153, !137, !134, !167}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !147, file: !140, line: 51, baseType: !177, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!153, !137, !134, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !147, file: !140, line: 52, baseType: !184, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!153, !137, !134, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!188 = !{!189}
!189 = !DISubrange(count: 1)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !139, file: !140, line: 76, baseType: !129, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !140, line: 77, baseType: !192, size: 32, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !139, file: !140, line: 78, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !195)
!195 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !139, file: !140, line: 78, baseType: !194, size: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !139, file: !140, line: 78, baseType: !194, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !139, file: !140, line: 78, baseType: !194, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 79, baseType: !200, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !203, line: 27, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !205, line: 43, baseType: !206)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!206 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !139, file: !140, line: 80, baseType: !192, size: 32, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !140, line: 81, baseType: !209, size: 32, offset: 992)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !139, file: !140, line: 82, baseType: !211, size: 64, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !139, file: !140, line: 83, baseType: !215, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !140, line: 84, baseType: !219, size: 64, offset: 1152)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !140, line: 85, baseType: !219, size: 64, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !139, file: !140, line: 86, baseType: !219, size: 64, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !139, file: !140, line: 87, baseType: !219, size: 64, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 88, baseType: !137, size: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !139, file: !140, line: 89, baseType: !200, size: 64, offset: 1472)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 90, baseType: !219, size: 64, offset: 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !139, file: !140, line: 91, baseType: !219, size: 64, offset: 1600)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !139, file: !140, line: 92, baseType: !192, size: 32, offset: 1664)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !139, file: !140, line: 93, baseType: !133, size: 64, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 94, baseType: !230, size: 64, offset: 1792)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !201)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !139, file: !140, line: 95, baseType: !192, size: 32, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !139, file: !140, line: 95, baseType: !192, size: 32, offset: 1888)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !139, file: !140, line: 96, baseType: !234, size: 64, offset: 1920)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !139, file: !140, line: 96, baseType: !234, size: 64, offset: 1984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !139, file: !140, line: 97, baseType: !237, size: 64, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !139, file: !140, line: 97, baseType: !239, size: 64, offset: 2112)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !139, file: !140, line: 98, baseType: !192, size: 32, offset: 2176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !139, file: !140, line: 98, baseType: !192, size: 32, offset: 2208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !139, file: !140, line: 99, baseType: !234, size: 64, offset: 2240)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !139, file: !140, line: 99, baseType: !234, size: 64, offset: 2304)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !139, file: !140, line: 100, baseType: !245, size: 64, offset: 2368)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !195)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !139, file: !140, line: 100, baseType: !248, size: 64, offset: 2432)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !139, file: !140, line: 101, baseType: !192, size: 32, offset: 2496)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !139, file: !140, line: 101, baseType: !192, size: 32, offset: 2528)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !139, file: !140, line: 102, baseType: !234, size: 64, offset: 2560)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !139, file: !140, line: 102, baseType: !234, size: 64, offset: 2624)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !139, file: !140, line: 103, baseType: !254, size: 64, offset: 2688)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !246)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !139, file: !140, line: 103, baseType: !257, size: 64, offset: 2752)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !139, file: !140, line: 104, baseType: !187, size: 64, offset: 2816)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !139, file: !140, line: 105, baseType: !192, size: 32, offset: 2880)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !139, file: !140, line: 106, baseType: !261, size: 128, offset: 2944)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 128, elements: !268)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !140, line: 64, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 61, size: 128, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !264, file: !140, line: 62, baseType: !180, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !264, file: !140, line: 63, baseType: !133, size: 64, offset: 64)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !139, file: !140, line: 107, baseType: !271, size: 64, offset: 3072)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !268)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !139, file: !140, line: 108, baseType: !133, size: 64, offset: 3136)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !139, file: !140, line: 109, baseType: !274, size: 64, offset: 3200)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!153, !133}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !139, file: !140, line: 111, baseType: !192, size: 32, offset: 3264)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !139, file: !140, line: 112, baseType: !279, size: 320, offset: 3328)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 320, elements: !325)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!153, !283, !137, !133}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !286)
!286 = !{!287, !288, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !285, file: !10, line: 100, baseType: !192, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !10, line: 101, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !300, !301, !302, !306, !308, !310, !311, !312}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !291, file: !10, line: 84, baseType: !219, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !291, file: !10, line: 85, baseType: !219, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !10, line: 86, baseType: !133, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !291, file: !10, line: 87, baseType: !211, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !291, file: !10, line: 88, baseType: !298, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !291, file: !10, line: 89, baseType: !136, size: 8, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !291, file: !10, line: 90, baseType: !219, size: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !291, file: !10, line: 91, baseType: !303, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !304, line: 46, baseType: !305)
!304 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!305 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !291, file: !10, line: 92, baseType: !307, size: 32, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !10, line: 93, baseType: !309, size: 32, offset: 544)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !10, line: 94, baseType: !289, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !291, file: !10, line: 95, baseType: !219, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !291, file: !10, line: 96, baseType: !133, size: 64, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !285, file: !10, line: 102, baseType: !219, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !285, file: !10, line: 102, baseType: !219, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !285, file: !10, line: 103, baseType: !219, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !285, file: !10, line: 104, baseType: !129, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !285, file: !10, line: 105, baseType: !307, size: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !285, file: !10, line: 105, baseType: !307, size: 32, offset: 416)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !285, file: !10, line: 105, baseType: !307, size: 32, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !285, file: !10, line: 106, baseType: !137, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !285, file: !10, line: 107, baseType: !322, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!325 = !{!326}
!326 = !DISubrange(count: 5)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !139, file: !140, line: 113, baseType: !328, size: 320, offset: 3648)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !325)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!153, !137, !133}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !139, file: !140, line: 114, baseType: !333, size: 320, offset: 3968)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 320, elements: !325)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !139, file: !140, line: 115, baseType: !307, size: 32, offset: 4288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 120, baseType: !322, size: 64, offset: 4352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !139, file: !140, line: 121, baseType: !307, size: 32, offset: 4416)
!337 = !{i32 7, !"Dwarf Version", i32 4}
!338 = !{i32 2, !"Debug Info Version", i32 3}
!339 = !{i32 1, !"wchar_size", i32 4}
!340 = !{i32 7, !"PIC Level", i32 2}
!341 = !{i32 7, !"uwtable", i32 1}
!342 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!343 = distinct !DISubprogram(name: "KSPCreate_PIPECR", scope: !344, file: !344, line: 160, type: !345, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !589)
!344 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cr/pipecr/pipecr.c", directory: "/home/users/ndemeye/xSDK")
!345 = !DISubroutineType(types: !346)
!346 = !{!153, !347}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !350)
!350 = !{!351, !353, !404, !409, !410, !411, !412, !442, !443, !444, !445, !446, !448, !453, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !482, !488, !489, !490, !491, !496, !497, !498, !499, !504, !505, !506, !507, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !559, !560, !561, !562, !563, !570, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !587, !588}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !349, file: !102, line: 76, baseType: !352, size: 4480)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !140, line: 122, baseType: !139)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !349, file: !102, line: 76, baseType: !354, size: 896, offset: 4480)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 896, elements: !188)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !356)
!356 = !{!357, !365, !369, !371, !379, !380, !384, !385, !389, !393, !397, !398, !402, !403}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !355, file: !102, line: 19, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!153, !347, !361, !364}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !355, file: !102, line: 22, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!153, !347, !361, !361, !364}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !355, file: !102, line: 25, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !355, file: !102, line: 26, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!153, !347, !375, !375}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !376, line: 16, baseType: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !376, line: 16, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !355, file: !102, line: 27, baseType: !370, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !355, file: !102, line: 28, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!153, !283, !347}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !355, file: !102, line: 29, baseType: !370, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !355, file: !102, line: 30, baseType: !386, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!153, !347, !245, !245}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !355, file: !102, line: 31, baseType: !390, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!153, !347, !192, !245, !245, !237}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !355, file: !102, line: 32, baseType: !394, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!153, !347, !307, !307, !237, !364, !245, !245}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !355, file: !102, line: 33, baseType: !370, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !355, file: !102, line: 34, baseType: !399, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!153, !347, !159}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !355, file: !102, line: 35, baseType: !370, size: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !355, file: !102, line: 36, baseType: !399, size: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !349, file: !102, line: 77, baseType: !405, size: 64, offset: 5376)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !406, line: 14, baseType: !407)
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !406, line: 14, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !349, file: !102, line: 78, baseType: !307, size: 32, offset: 5440)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !349, file: !102, line: 79, baseType: !307, size: 32, offset: 5472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !349, file: !102, line: 81, baseType: !192, size: 32, offset: 5504)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !349, file: !102, line: 82, baseType: !413, size: 64, offset: 5568)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !416)
!416 = !{!417, !418, !438, !439, !440, !441}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !415, file: !102, line: 55, baseType: !352, size: 4480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !415, file: !102, line: 55, baseType: !419, size: 448, offset: 4480)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 448, elements: !188)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !421)
!421 = !{!422, !426, !427, !431, !432, !433, !437}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !420, file: !102, line: 42, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!153, !413, !361, !361}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !420, file: !102, line: 43, baseType: !423, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !420, file: !102, line: 44, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!153, !413}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !420, file: !102, line: 45, baseType: !428, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !420, file: !102, line: 46, baseType: !428, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !420, file: !102, line: 47, baseType: !434, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!153, !413, !159}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !420, file: !102, line: 48, baseType: !428, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !415, file: !102, line: 56, baseType: !347, size: 64, offset: 4928)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !415, file: !102, line: 57, baseType: !375, size: 64, offset: 4992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !415, file: !102, line: 58, baseType: !230, size: 64, offset: 5056)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !102, line: 59, baseType: !133, size: 64, offset: 5120)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !349, file: !102, line: 83, baseType: !307, size: 32, offset: 5632)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !349, file: !102, line: 84, baseType: !307, size: 32, offset: 5664)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !349, file: !102, line: 85, baseType: !307, size: 32, offset: 5696)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !349, file: !102, line: 86, baseType: !307, size: 32, offset: 5728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !349, file: !102, line: 87, baseType: !447, size: 32, offset: 5760)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !349, file: !102, line: 88, baseType: !449, size: 384, offset: 5792)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 384, elements: !450)
!450 = !{!451, !452}
!451 = !DISubrange(count: 4)
!452 = !DISubrange(count: 3)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !349, file: !102, line: 89, baseType: !246, size: 64, offset: 6208)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !349, file: !102, line: 90, baseType: !246, size: 64, offset: 6272)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !349, file: !102, line: 91, baseType: !246, size: 64, offset: 6336)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !349, file: !102, line: 92, baseType: !246, size: 64, offset: 6400)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !349, file: !102, line: 93, baseType: !246, size: 64, offset: 6464)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !349, file: !102, line: 94, baseType: !246, size: 64, offset: 6528)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !349, file: !102, line: 95, baseType: !460, size: 32, offset: 6592)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !349, file: !102, line: 96, baseType: !307, size: 32, offset: 6624)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !349, file: !102, line: 98, baseType: !361, size: 64, offset: 6656)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !349, file: !102, line: 98, baseType: !361, size: 64, offset: 6720)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !349, file: !102, line: 102, baseType: !245, size: 64, offset: 6784)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !349, file: !102, line: 103, baseType: !245, size: 64, offset: 6848)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !349, file: !102, line: 104, baseType: !192, size: 32, offset: 6912)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !349, file: !102, line: 105, baseType: !192, size: 32, offset: 6944)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !349, file: !102, line: 106, baseType: !307, size: 32, offset: 6976)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !349, file: !102, line: 107, baseType: !245, size: 64, offset: 7040)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !349, file: !102, line: 108, baseType: !245, size: 64, offset: 7104)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !349, file: !102, line: 109, baseType: !192, size: 32, offset: 7168)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !349, file: !102, line: 110, baseType: !192, size: 32, offset: 7200)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !349, file: !102, line: 111, baseType: !307, size: 32, offset: 7232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !349, file: !102, line: 113, baseType: !192, size: 32, offset: 7264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !349, file: !102, line: 114, baseType: !307, size: 32, offset: 7296)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !349, file: !102, line: 117, baseType: !192, size: 32, offset: 7328)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !349, file: !102, line: 120, baseType: !478, size: 320, offset: 7360)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !325)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!153, !347, !192, !246, !133}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !349, file: !102, line: 121, baseType: !483, size: 320, offset: 7680)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 320, elements: !325)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!153, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !349, file: !102, line: 122, baseType: !333, size: 320, offset: 8000)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !349, file: !102, line: 123, baseType: !192, size: 32, offset: 8320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !349, file: !102, line: 124, baseType: !307, size: 32, offset: 8352)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !349, file: !102, line: 126, baseType: !492, size: 320, offset: 8384)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 320, elements: !325)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!153, !347, !133}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !349, file: !102, line: 127, baseType: !483, size: 320, offset: 8704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !349, file: !102, line: 128, baseType: !333, size: 320, offset: 9024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !349, file: !102, line: 129, baseType: !192, size: 32, offset: 9344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !349, file: !102, line: 131, baseType: !500, size: 64, offset: 9408)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!153, !347, !192, !246, !503, !133}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !349, file: !102, line: 132, baseType: !274, size: 64, offset: 9472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !349, file: !102, line: 133, baseType: !133, size: 64, offset: 9536)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !349, file: !102, line: 135, baseType: !133, size: 64, offset: 9600)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !349, file: !102, line: 137, baseType: !508, size: 64, offset: 9664)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !102, line: 139, baseType: !133, size: 64, offset: 9728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9824)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9888)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9920)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9952)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 9984)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10048)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10080)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10112)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10144)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !349, file: !102, line: 142, baseType: !307, size: 32, offset: 10208)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10240)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10304)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10368)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10432)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10496)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10560)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10624)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10688)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10752)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10816)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10880)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 10944)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 11008)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !349, file: !102, line: 143, baseType: !159, size: 64, offset: 11072)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11136)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11168)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11200)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11232)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11264)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11296)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11328)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11360)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11392)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11424)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11456)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11488)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11520)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !349, file: !102, line: 144, baseType: !541, size: 32, offset: 11552)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !349, file: !102, line: 147, baseType: !192, size: 32, offset: 11584)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !349, file: !102, line: 148, baseType: !364, size: 64, offset: 11648)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !349, file: !102, line: 150, baseType: !558, size: 32, offset: 11712)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !349, file: !102, line: 151, baseType: !307, size: 32, offset: 11744)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !349, file: !102, line: 153, baseType: !192, size: 32, offset: 11776)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !349, file: !102, line: 154, baseType: !192, size: 32, offset: 11808)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !349, file: !102, line: 156, baseType: !307, size: 32, offset: 11840)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !349, file: !102, line: 161, baseType: !564, size: 192, offset: 11904)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !102, line: 157, size: 192, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !564, file: !102, line: 158, baseType: !375, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !564, file: !102, line: 158, baseType: !375, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !564, file: !102, line: 159, baseType: !307, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !564, file: !102, line: 160, baseType: !307, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !349, file: !102, line: 163, baseType: !571, size: 32, offset: 12096)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !349, file: !102, line: 165, baseType: !447, size: 32, offset: 12128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !349, file: !102, line: 166, baseType: !571, size: 32, offset: 12160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !349, file: !102, line: 171, baseType: !307, size: 32, offset: 12192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !349, file: !102, line: 172, baseType: !307, size: 32, offset: 12224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !349, file: !102, line: 173, baseType: !307, size: 32, offset: 12256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !349, file: !102, line: 174, baseType: !361, size: 64, offset: 12288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !349, file: !102, line: 175, baseType: !361, size: 64, offset: 12352)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !349, file: !102, line: 177, baseType: !192, size: 32, offset: 12416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !349, file: !102, line: 178, baseType: !307, size: 32, offset: 12448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !349, file: !102, line: 180, baseType: !159, size: 64, offset: 12480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !349, file: !102, line: 182, baseType: !583, size: 64, offset: 12544)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!153, !347, !361, !361, !133}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !349, file: !102, line: 183, baseType: !583, size: 64, offset: 12608)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !349, file: !102, line: 184, baseType: !133, size: 64, offset: 12672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !349, file: !102, line: 184, baseType: !133, size: 64, offset: 12736)
!589 = !{!590, !591, !592, !594}
!590 = !DILocalVariable(name: "ksp", arg: 1, scope: !343, file: !344, line: 160, type: !347)
!591 = !DILocalVariable(name: "ierr", scope: !343, file: !344, line: 162, type: !153)
!592 = !DILocalVariable(name: "ierr__", scope: !593, file: !344, line: 165, type: !153)
!593 = distinct !DILexicalBlock(scope: !343, file: !344, line: 165, column: 69)
!594 = !DILocalVariable(name: "ierr__", scope: !595, file: !344, line: 166, type: !153)
!595 = distinct !DILexicalBlock(scope: !343, file: !344, line: 166, column: 59)
!596 = !DILocation(line: 0, scope: !343)
!597 = !DILocation(line: 164, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !344, line: 164, column: 3)
!599 = distinct !DILexicalBlock(scope: !600, file: !344, line: 164, column: 3)
!600 = distinct !DILexicalBlock(scope: !343, file: !344, line: 164, column: 3)
!601 = !{!602, !602, i64 0}
!602 = !{!"any pointer", !603, i64 0}
!603 = !{!"omnipotent char", !604, i64 0}
!604 = !{!"Simple C/C++ TBAA"}
!605 = !DILocation(line: 164, column: 3, scope: !599)
!606 = !DILocation(line: 164, column: 3, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !344, line: 164, column: 3)
!608 = distinct !DILexicalBlock(scope: !598, file: !344, line: 164, column: 3)
!609 = !{!610, !611, i64 1536}
!610 = !{!"", !603, i64 0, !603, i64 512, !603, i64 1024, !603, i64 1280, !611, i64 1536, !611, i64 1540, !603, i64 1544}
!611 = !{!"int", !603, i64 0}
!612 = !DILocation(line: 164, column: 3, scope: !608)
!613 = !DILocation(line: 164, column: 3, scope: !614)
!614 = distinct !DILexicalBlock(scope: !607, file: !344, line: 164, column: 3)
!615 = !{!611, !611, i64 0}
!616 = !{!610, !611, i64 1540}
!617 = !DILocation(line: 165, column: 10, scope: !343)
!618 = !DILocation(line: 0, scope: !593)
!619 = !DILocation(line: 165, column: 69, scope: !620)
!620 = distinct !DILexicalBlock(scope: !593, file: !344, line: 165, column: 69)
!621 = !DILocation(line: 165, column: 69, scope: !593)
!622 = !{!"branch_weights", i32 2000, i32 1}
!623 = !DILocation(line: 166, column: 10, scope: !343)
!624 = !DILocation(line: 0, scope: !595)
!625 = !DILocation(line: 166, column: 59, scope: !626)
!626 = distinct !DILexicalBlock(scope: !595, file: !344, line: 166, column: 59)
!627 = !DILocation(line: 166, column: 59, scope: !595)
!628 = !DILocation(line: 168, column: 13, scope: !343)
!629 = !DILocation(line: 168, column: 28, scope: !343)
!630 = !{!631, !602, i64 32}
!631 = !{!"_KSPOps", !602, i64 0, !602, i64 8, !602, i64 16, !602, i64 24, !602, i64 32, !602, i64 40, !602, i64 48, !602, i64 56, !602, i64 64, !602, i64 72, !602, i64 80, !602, i64 88, !602, i64 96, !602, i64 104}
!632 = !DILocation(line: 169, column: 13, scope: !343)
!633 = !DILocation(line: 169, column: 28, scope: !343)
!634 = !{!631, !602, i64 16}
!635 = !DILocation(line: 170, column: 13, scope: !343)
!636 = !DILocation(line: 170, column: 28, scope: !343)
!637 = !{!631, !602, i64 80}
!638 = !DILocation(line: 171, column: 13, scope: !343)
!639 = !DILocation(line: 171, column: 28, scope: !343)
!640 = !{!631, !602, i64 88}
!641 = !DILocation(line: 172, column: 13, scope: !343)
!642 = !DILocation(line: 172, column: 28, scope: !343)
!643 = !{!631, !602, i64 40}
!644 = !DILocation(line: 173, column: 13, scope: !343)
!645 = !DILocation(line: 173, column: 28, scope: !343)
!646 = !{!631, !602, i64 0}
!647 = !DILocation(line: 174, column: 13, scope: !343)
!648 = !DILocation(line: 174, column: 28, scope: !343)
!649 = !{!631, !602, i64 8}
!650 = !DILocation(line: 175, column: 3, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !344, line: 175, column: 3)
!652 = distinct !DILexicalBlock(scope: !653, file: !344, line: 175, column: 3)
!653 = distinct !DILexicalBlock(scope: !343, file: !344, line: 175, column: 3)
!654 = !DILocation(line: 175, column: 3, scope: !652)
