; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xinit.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xinit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.PetscDraw_X = type { %struct._XDisplay*, i32, %struct.Visual*, i32, %struct.PetscDrawXiGC, %struct.PetscDrawXiFont*, i64, i64, i64, i32, i64, i64, [256 x i64], [256 x [3 x i8]], i32, i32, i32, i32 }
%struct._XDisplay = type opaque
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.PetscDrawXiGC = type { %struct._XGC*, i64 }
%struct._XGC = type opaque
%struct.PetscDrawXiFont = type { i64, i32, i32, i32, i64 }
%struct.ompi_communicator_t = type opaque
%struct.XGCValues = type { i32, i64, i64, i64, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i64, i32, i32, i32, i32, i64, i32, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xinit.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !{!11, !14, !15, !19, !23, !5, !34, !156, !43}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !16, line: 330, baseType: !17)
!16 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !16, line: 330, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !20, line: 104, baseType: !21)
!20 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !20, line: 66, baseType: !22)
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !24, line: 550, baseType: !25)
!24 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 493, size: 2368, elements: !27)
!27 = !{!28, !44, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !62, !63, !64, !65, !66, !67, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !91, !95, !96, !97, !98, !148, !149, !150, !151, !152, !153, !154, !155}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !26, file: !24, line: 498, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !24, line: 155, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !24, line: 148, size: 256, elements: !32)
!32 = !{!33, !35, !37, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !31, file: !24, line: 149, baseType: !34, size: 32)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !24, line: 150, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !31, file: !24, line: 151, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!34, !36}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !31, file: !24, line: 154, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !24, line: 80, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !26, file: !24, line: 499, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !24, line: 490, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !26, file: !24, line: 500, baseType: !34, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !26, file: !24, line: 501, baseType: !34, size: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !26, file: !24, line: 502, baseType: !34, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !26, file: !24, line: 503, baseType: !34, size: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !26, file: !24, line: 504, baseType: !43, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !26, file: !24, line: 505, baseType: !21, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !26, file: !24, line: 506, baseType: !21, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !26, file: !24, line: 507, baseType: !21, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !26, file: !24, line: 508, baseType: !34, size: 32, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !26, file: !24, line: 509, baseType: !57, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!21, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !24, line: 255, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !26, file: !24, line: 512, baseType: !34, size: 32, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !26, file: !24, line: 513, baseType: !34, size: 32, offset: 672)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !26, file: !24, line: 514, baseType: !34, size: 32, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !26, file: !24, line: 515, baseType: !34, size: 32, offset: 736)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !26, file: !24, line: 516, baseType: !34, size: 32, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !26, file: !24, line: 517, baseType: !68, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !24, line: 285, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 280, size: 192, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !70, file: !24, line: 281, baseType: !29, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !70, file: !24, line: 282, baseType: !34, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !70, file: !24, line: 283, baseType: !34, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !70, file: !24, line: 284, baseType: !34, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !26, file: !24, line: 518, baseType: !34, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !26, file: !24, line: 519, baseType: !34, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !26, file: !24, line: 520, baseType: !45, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !26, file: !24, line: 520, baseType: !45, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !26, file: !24, line: 521, baseType: !34, size: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !26, file: !24, line: 522, baseType: !22, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !26, file: !24, line: 523, baseType: !22, size: 64, offset: 1216)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !26, file: !24, line: 524, baseType: !42, size: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !26, file: !24, line: 525, baseType: !42, size: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !26, file: !24, line: 526, baseType: !42, size: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !26, file: !24, line: 527, baseType: !42, size: 64, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !26, file: !24, line: 528, baseType: !5, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !26, file: !24, line: 529, baseType: !89, size: 64, offset: 1600)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !24, line: 491, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !26, file: !24, line: 530, baseType: !92, size: 64, offset: 1664)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!34, !60}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !26, file: !24, line: 533, baseType: !43, size: 64, offset: 1728)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !26, file: !24, line: 534, baseType: !34, size: 32, offset: 1792)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !26, file: !24, line: 535, baseType: !34, size: 32, offset: 1824)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !26, file: !24, line: 536, baseType: !99, size: 64, offset: 1856)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !24, line: 275, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 257, size: 1024, elements: !102)
!102 = !{!103, !104, !105, !107, !108, !109, !110, !111, !112, !133, !134, !135, !139, !140, !141, !142, !143, !144, !145, !146}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !101, file: !24, line: 258, baseType: !29, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !101, file: !24, line: 259, baseType: !60, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !101, file: !24, line: 260, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !20, line: 96, baseType: !21)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !101, file: !24, line: 261, baseType: !34, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !101, file: !24, line: 261, baseType: !34, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !101, file: !24, line: 262, baseType: !34, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !101, file: !24, line: 262, baseType: !34, size: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !101, file: !24, line: 263, baseType: !34, size: 32, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !101, file: !24, line: 264, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !24, line: 247, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 243, size: 128, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !115, file: !24, line: 244, baseType: !34, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !115, file: !24, line: 245, baseType: !34, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !115, file: !24, line: 246, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !24, line: 238, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 227, size: 448, elements: !123)
!123 = !{!124, !125, !127, !128, !129, !130, !131, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !122, file: !24, line: 228, baseType: !29, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !122, file: !24, line: 229, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !20, line: 76, baseType: !22)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !122, file: !24, line: 233, baseType: !34, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !122, file: !24, line: 235, baseType: !22, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !122, file: !24, line: 235, baseType: !22, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !122, file: !24, line: 235, baseType: !22, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !122, file: !24, line: 236, baseType: !34, size: 32, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !122, file: !24, line: 237, baseType: !34, size: 32, offset: 416)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !101, file: !24, line: 265, baseType: !34, size: 32, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !101, file: !24, line: 266, baseType: !120, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !101, file: !24, line: 267, baseType: !136, size: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !24, line: 222, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !24, line: 214, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !101, file: !24, line: 268, baseType: !19, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !101, file: !24, line: 269, baseType: !22, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !101, file: !24, line: 270, baseType: !22, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !101, file: !24, line: 271, baseType: !34, size: 32, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !101, file: !24, line: 271, baseType: !34, size: 32, offset: 864)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !101, file: !24, line: 272, baseType: !34, size: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !101, file: !24, line: 273, baseType: !34, size: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !101, file: !24, line: 274, baseType: !147, size: 64, offset: 960)
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !26, file: !24, line: 537, baseType: !22, size: 64, offset: 1920)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !26, file: !24, line: 538, baseType: !22, size: 64, offset: 1984)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !26, file: !24, line: 539, baseType: !34, size: 32, offset: 2048)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !26, file: !24, line: 540, baseType: !34, size: 32, offset: 2080)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !26, file: !24, line: 541, baseType: !42, size: 64, offset: 2112)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !26, file: !24, line: 542, baseType: !42, size: 64, offset: 2176)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !26, file: !24, line: 543, baseType: !34, size: 32, offset: 2240)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !26, file: !24, line: 544, baseType: !43, size: 64, offset: 2304)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 46, baseType: !22)
!157 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!158 = !{i32 7, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{i32 1, !"wchar_size", i32 4}
!161 = !{i32 7, !"PIC Level", i32 2}
!162 = !{i32 7, !"uwtable", i32 1}
!163 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!164 = distinct !DISubprogram(name: "PetscDrawXiClose", scope: !165, file: !165, line: 40, type: !166, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !219)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xinit.c", directory: "/home/users/ndemeye/xSDK")
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !170}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !169, line: 14, baseType: !34)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_X", file: !172, line: 43, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/x/ximpl.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 27, size: 23488, elements: !174)
!174 = !{!175, !178, !179, !180, !181, !188, !199, !200, !202, !203, !204, !205, !206, !210, !215, !216, !217, !218}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !173, file: !172, line: 28, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !24, line: 487, baseType: !61)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !173, file: !172, line: 29, baseType: !34, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !173, file: !172, line: 30, baseType: !120, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !173, file: !172, line: 31, baseType: !34, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !173, file: !172, line: 32, baseType: !182, size: 128, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiGC", file: !172, line: 18, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 15, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !183, file: !172, line: 16, baseType: !136, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pix", scope: !183, file: !172, line: 17, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiPixVal", file: !172, line: 13, baseType: !22)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !173, file: !172, line: 33, baseType: !189, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiFont", file: !172, line: 25, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 20, size: 256, elements: !192)
!192 = !{!193, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fnt", scope: !191, file: !172, line: 21, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "Font", file: !20, line: 100, baseType: !21)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "font_w", scope: !191, file: !172, line: 22, baseType: !34, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "font_h", scope: !191, file: !172, line: 22, baseType: !34, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "font_descent", scope: !191, file: !172, line: 23, baseType: !34, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "font_pix", scope: !191, file: !172, line: 24, baseType: !187, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !173, file: !172, line: 34, baseType: !106, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "drw", scope: !173, file: !172, line: 35, baseType: !201, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !20, line: 97, baseType: !21)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !173, file: !172, line: 36, baseType: !19, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cmapsize", scope: !173, file: !172, line: 37, baseType: !34, size: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !173, file: !172, line: 38, baseType: !187, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !173, file: !172, line: 39, baseType: !187, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cmapping", scope: !173, file: !172, line: 40, baseType: !207, size: 16384, offset: 832)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 16384, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpalette", scope: !173, file: !172, line: 41, baseType: !211, size: 6144, offset: 17216)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 6144, elements: !213)
!212 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!213 = !{!209, !214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !173, file: !172, line: 42, baseType: !34, size: 32, offset: 23360)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !173, file: !172, line: 42, baseType: !34, size: 32, offset: 23392)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !173, file: !172, line: 42, baseType: !34, size: 32, offset: 23424)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !173, file: !172, line: 42, baseType: !34, size: 32, offset: 23456)
!219 = !{!220, !221, !222, !224, !250, !256, !258}
!220 = !DILocalVariable(name: "XiWin", arg: 1, scope: !164, file: !165, line: 40, type: !170)
!221 = !DILocalVariable(name: "ierr", scope: !164, file: !165, line: 42, type: !168)
!222 = !DILocalVariable(name: "ierr__", scope: !223, file: !165, line: 46, type: !168)
!223 = distinct !DILexicalBlock(scope: !164, file: !165, line: 46, column: 33)
!224 = !DILocalVariable(name: "jmpbuf", scope: !225, file: !165, line: 49, type: !227)
!225 = distinct !DILexicalBlock(scope: !226, file: !165, line: 47, column: 20)
!226 = distinct !DILexicalBlock(scope: !164, file: !165, line: 47, column: 7)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !228, line: 45, baseType: !229)
!228 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 1600, elements: !248)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !228, line: 33, size: 1600, elements: !231)
!231 = !{!232, !238, !239}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !230, file: !228, line: 39, baseType: !233, size: 512)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !234, line: 31, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !230, file: !228, line: 40, baseType: !34, size: 32, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !230, file: !228, line: 41, baseType: !240, size: 1024, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !241, line: 8, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 5, size: 1024, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !242, file: !241, line: 7, baseType: !245, size: 1024)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 16)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DILocalVariable(name: "xioerrhdl", scope: !225, file: !165, line: 50, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscXIOErrorHandler", file: !252, line: 325, baseType: !253)
!252 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !14}
!256 = !DILocalVariable(name: "ierr__", scope: !257, file: !165, line: 51, type: !168)
!257 = distinct !DILexicalBlock(scope: !225, file: !165, line: 51, column: 77)
!258 = !DILocalVariable(name: "ierr__", scope: !259, file: !165, line: 62, type: !168)
!259 = distinct !DILexicalBlock(scope: !225, file: !165, line: 62, column: 77)
!260 = !DILocation(line: 0, scope: !164)
!261 = !DILocation(line: 44, column: 3, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !165, line: 44, column: 3)
!263 = distinct !DILexicalBlock(scope: !264, file: !165, line: 44, column: 3)
!264 = distinct !DILexicalBlock(scope: !164, file: !165, line: 44, column: 3)
!265 = !{!266, !266, i64 0}
!266 = !{!"any pointer", !267, i64 0}
!267 = !{!"omnipotent char", !268, i64 0}
!268 = !{!"Simple C/C++ TBAA"}
!269 = !DILocation(line: 44, column: 3, scope: !263)
!270 = !DILocation(line: 44, column: 3, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !165, line: 44, column: 3)
!272 = distinct !DILexicalBlock(scope: !262, file: !165, line: 44, column: 3)
!273 = !{!274, !275, i64 1536}
!274 = !{!"", !267, i64 0, !267, i64 512, !267, i64 1024, !267, i64 1280, !275, i64 1536, !275, i64 1540, !267, i64 1544}
!275 = !{!"int", !267, i64 0}
!276 = !DILocation(line: 44, column: 3, scope: !272)
!277 = !DILocation(line: 44, column: 3, scope: !278)
!278 = distinct !DILexicalBlock(scope: !271, file: !165, line: 44, column: 3)
!279 = !{!275, !275, i64 0}
!280 = !{!274, !275, i64 1540}
!281 = !DILocation(line: 45, column: 8, scope: !282)
!282 = distinct !DILexicalBlock(scope: !164, file: !165, line: 45, column: 7)
!283 = !DILocation(line: 45, column: 7, scope: !164)
!284 = !DILocation(line: 45, column: 15, scope: !285)
!285 = distinct !DILexicalBlock(scope: !286, file: !165, line: 45, column: 15)
!286 = distinct !DILexicalBlock(scope: !287, file: !165, line: 45, column: 15)
!287 = distinct !DILexicalBlock(scope: !288, file: !165, line: 45, column: 15)
!288 = distinct !DILexicalBlock(scope: !289, file: !165, line: 45, column: 15)
!289 = distinct !DILexicalBlock(scope: !282, file: !165, line: 45, column: 15)
!290 = !DILocation(line: 45, column: 15, scope: !286)
!291 = !DILocation(line: 45, column: 15, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !165, line: 45, column: 15)
!293 = distinct !DILexicalBlock(scope: !285, file: !165, line: 45, column: 15)
!294 = !{!274, !267, i64 1544}
!295 = !DILocation(line: 45, column: 15, scope: !293)
!296 = !DILocation(line: 45, column: 15, scope: !297)
!297 = distinct !DILexicalBlock(scope: !292, file: !165, line: 45, column: 15)
!298 = !DILocation(line: 45, column: 15, scope: !299)
!299 = distinct !DILexicalBlock(scope: !285, file: !165, line: 45, column: 15)
!300 = !DILocation(line: 45, column: 15, scope: !301)
!301 = distinct !DILexicalBlock(scope: !299, file: !165, line: 45, column: 15)
!302 = !DILocation(line: 45, column: 15, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !165, line: 45, column: 15)
!304 = distinct !DILexicalBlock(scope: !301, file: !165, line: 45, column: 15)
!305 = !DILocation(line: 45, column: 15, scope: !304)
!306 = !DILocation(line: 45, column: 15, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !165, line: 45, column: 15)
!308 = !DILocation(line: 46, column: 10, scope: !164)
!309 = !{!310, !266, i64 48}
!310 = !{!"", !266, i64 0, !275, i64 8, !266, i64 16, !275, i64 24, !311, i64 32, !266, i64 48, !312, i64 56, !312, i64 64, !312, i64 72, !275, i64 80, !312, i64 88, !312, i64 96, !267, i64 104, !267, i64 2152, !275, i64 2920, !275, i64 2924, !275, i64 2928, !275, i64 2932}
!311 = !{!"", !266, i64 0, !312, i64 8}
!312 = !{!"long", !267, i64 0}
!313 = !DILocation(line: 0, scope: !223)
!314 = !DILocation(line: 46, column: 33, scope: !315)
!315 = distinct !DILexicalBlock(scope: !223, file: !165, line: 46, column: 33)
!316 = !DILocation(line: 47, column: 14, scope: !226)
!317 = !{!310, !266, i64 0}
!318 = !DILocation(line: 47, column: 7, scope: !226)
!319 = !DILocation(line: 47, column: 7, scope: !164)
!320 = !DILocation(line: 49, column: 5, scope: !225)
!321 = !DILocation(line: 49, column: 26, scope: !225)
!322 = !DILocation(line: 51, column: 12, scope: !225)
!323 = !DILocation(line: 0, scope: !257)
!324 = !DILocation(line: 51, column: 77, scope: !325)
!325 = distinct !DILexicalBlock(scope: !257, file: !165, line: 51, column: 77)
!326 = !DILocation(line: 51, column: 77, scope: !257)
!327 = !{!"branch_weights", i32 2000, i32 1}
!328 = !DILocation(line: 52, column: 17, scope: !225)
!329 = !DILocation(line: 0, scope: !225)
!330 = !DILocation(line: 53, column: 10, scope: !331)
!331 = distinct !DILexicalBlock(scope: !225, file: !165, line: 53, column: 9)
!332 = !DILocation(line: 53, column: 9, scope: !225)
!333 = !DILocation(line: 56, column: 22, scope: !334)
!334 = distinct !DILexicalBlock(scope: !331, file: !165, line: 55, column: 5)
!335 = !DILocation(line: 56, column: 37, scope: !334)
!336 = !{!310, !266, i64 32}
!337 = !DILocation(line: 56, column: 7, scope: !334)
!338 = !DILocation(line: 57, column: 28, scope: !334)
!339 = !DILocation(line: 57, column: 7, scope: !334)
!340 = !DILocation(line: 58, column: 5, scope: !334)
!341 = !DILocation(line: 59, column: 17, scope: !225)
!342 = !DILocation(line: 61, column: 11, scope: !225)
!343 = !DILocation(line: 62, column: 12, scope: !225)
!344 = !DILocation(line: 0, scope: !259)
!345 = !DILocation(line: 62, column: 77, scope: !346)
!346 = distinct !DILexicalBlock(scope: !259, file: !165, line: 62, column: 77)
!347 = !DILocation(line: 62, column: 77, scope: !259)
!348 = !DILocation(line: 64, column: 3, scope: !226)
!349 = !DILocation(line: 65, column: 3, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !165, line: 65, column: 3)
!351 = distinct !DILexicalBlock(scope: !352, file: !165, line: 65, column: 3)
!352 = distinct !DILexicalBlock(scope: !164, file: !165, line: 65, column: 3)
!353 = !DILocation(line: 65, column: 3, scope: !351)
!354 = !DILocation(line: 65, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !165, line: 65, column: 3)
!356 = distinct !DILexicalBlock(scope: !350, file: !165, line: 65, column: 3)
!357 = !DILocation(line: 65, column: 3, scope: !356)
!358 = !DILocation(line: 65, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !165, line: 65, column: 3)
!360 = distinct !DILexicalBlock(scope: !355, file: !165, line: 65, column: 3)
!361 = !DILocation(line: 65, column: 3, scope: !360)
!362 = !DILocation(line: 65, column: 3, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !165, line: 65, column: 3)
!364 = !DILocation(line: 65, column: 3, scope: !365)
!365 = distinct !DILexicalBlock(scope: !355, file: !165, line: 65, column: 3)
!366 = !DILocation(line: 65, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !365, file: !165, line: 65, column: 3)
!368 = !DILocation(line: 65, column: 3, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !165, line: 65, column: 3)
!370 = distinct !DILexicalBlock(scope: !367, file: !165, line: 65, column: 3)
!371 = !DILocation(line: 65, column: 3, scope: !370)
!372 = !DILocation(line: 65, column: 3, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !165, line: 65, column: 3)
!374 = !DILocation(line: 66, column: 1, scope: !164)
!375 = !DISubprogram(name: "PetscError", scope: !4, file: !4, line: 668, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!168, !17, !34, !11, !11, !34, !3, !11, null}
!378 = !{}
!379 = distinct !DISubprogram(name: "PetscMemcpy", scope: !380, file: !380, line: 1792, type: !381, scopeLine: 1793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !385)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!381 = !DISubroutineType(types: !382)
!382 = !{!168, !14, !383, !156}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DILocalVariable(name: "a", arg: 1, scope: !379, file: !380, line: 1792, type: !14)
!387 = !DILocalVariable(name: "b", arg: 2, scope: !379, file: !380, line: 1792, type: !383)
!388 = !DILocalVariable(name: "n", arg: 3, scope: !379, file: !380, line: 1792, type: !156)
!389 = !DILocalVariable(name: "al", scope: !379, file: !380, line: 1795, type: !156)
!390 = !DILocalVariable(name: "bl", scope: !379, file: !380, line: 1795, type: !156)
!391 = !DILocalVariable(name: "nl", scope: !379, file: !380, line: 1796, type: !156)
!392 = !DILocation(line: 0, scope: !379)
!393 = !DILocation(line: 1795, column: 15, scope: !379)
!394 = !DILocation(line: 1795, column: 31, scope: !379)
!395 = !DILocation(line: 1797, column: 3, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !380, line: 1797, column: 3)
!397 = distinct !DILexicalBlock(scope: !398, file: !380, line: 1797, column: 3)
!398 = distinct !DILexicalBlock(scope: !379, file: !380, line: 1797, column: 3)
!399 = !DILocation(line: 1797, column: 3, scope: !397)
!400 = !DILocation(line: 1797, column: 3, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !380, line: 1797, column: 3)
!402 = distinct !DILexicalBlock(scope: !396, file: !380, line: 1797, column: 3)
!403 = !DILocation(line: 1797, column: 3, scope: !402)
!404 = !DILocation(line: 1797, column: 3, scope: !405)
!405 = distinct !DILexicalBlock(scope: !401, file: !380, line: 1797, column: 3)
!406 = !DILocation(line: 1798, column: 13, scope: !407)
!407 = distinct !DILexicalBlock(scope: !379, file: !380, line: 1798, column: 7)
!408 = !DILocation(line: 1798, column: 20, scope: !407)
!409 = !DILocation(line: 1799, column: 13, scope: !410)
!410 = distinct !DILexicalBlock(scope: !379, file: !380, line: 1799, column: 7)
!411 = !DILocation(line: 1799, column: 20, scope: !410)
!412 = !DILocation(line: 1803, column: 9, scope: !413)
!413 = distinct !DILexicalBlock(scope: !379, file: !380, line: 1803, column: 7)
!414 = !DILocation(line: 1803, column: 14, scope: !413)
!415 = !DILocation(line: 1805, column: 13, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !380, line: 1805, column: 9)
!417 = distinct !DILexicalBlock(scope: !413, file: !380, line: 1803, column: 24)
!418 = !DILocation(line: 1805, column: 18, scope: !416)
!419 = !DILocation(line: 1805, column: 57, scope: !416)
!420 = !DILocation(line: 1828, column: 5, scope: !417)
!421 = !DILocation(line: 1831, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !380, line: 1831, column: 3)
!423 = distinct !DILexicalBlock(scope: !424, file: !380, line: 1831, column: 3)
!424 = distinct !DILexicalBlock(scope: !379, file: !380, line: 1831, column: 3)
!425 = !DILocation(line: 1830, column: 3, scope: !417)
!426 = !DILocation(line: 1831, column: 3, scope: !423)
!427 = !DILocation(line: 1831, column: 3, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !380, line: 1831, column: 3)
!429 = distinct !DILexicalBlock(scope: !422, file: !380, line: 1831, column: 3)
!430 = !DILocation(line: 1831, column: 3, scope: !429)
!431 = !DILocation(line: 1831, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !380, line: 1831, column: 3)
!433 = distinct !DILexicalBlock(scope: !428, file: !380, line: 1831, column: 3)
!434 = !DILocation(line: 1831, column: 3, scope: !433)
!435 = !DILocation(line: 1831, column: 3, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !380, line: 1831, column: 3)
!437 = !DILocation(line: 1831, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !428, file: !380, line: 1831, column: 3)
!439 = !DILocation(line: 1831, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !438, file: !380, line: 1831, column: 3)
!441 = !DILocation(line: 1831, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !380, line: 1831, column: 3)
!443 = distinct !DILexicalBlock(scope: !440, file: !380, line: 1831, column: 3)
!444 = !DILocation(line: 1831, column: 3, scope: !443)
!445 = !DILocation(line: 1831, column: 3, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !380, line: 1831, column: 3)
!447 = !DILocation(line: 1832, column: 1, scope: !379)
!448 = !DISubprogram(name: "PetscSetXIOErrorHandler", scope: !252, file: !252, line: 326, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !378)
!449 = !DISubroutineType(types: !450)
!450 = !{!253, !253}
!451 = !DISubprogram(name: "XFreeGC", scope: !24, file: !24, line: 2561, type: !452, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !378)
!452 = !DISubroutineType(types: !453)
!453 = !{!34, !60, !137}
!454 = !DISubprogram(name: "XCloseDisplay", scope: !24, file: !24, line: 2160, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !378)
!455 = distinct !DISubprogram(name: "PetscDrawXiInit", scope: !165, file: !165, line: 90, type: !456, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!168, !170, !11}
!458 = !{!459, !460, !461, !462, !464, !466}
!459 = !DILocalVariable(name: "XiWin", arg: 1, scope: !455, file: !165, line: 90, type: !170)
!460 = !DILocalVariable(name: "display", arg: 2, scope: !455, file: !165, line: 90, type: !11)
!461 = !DILocalVariable(name: "ierr", scope: !455, file: !165, line: 92, type: !168)
!462 = !DILocalVariable(name: "ierr__", scope: !463, file: !165, line: 94, type: !168)
!463 = distinct !DILexicalBlock(scope: !455, file: !165, line: 94, column: 48)
!464 = !DILocalVariable(name: "ierr__", scope: !465, file: !165, line: 95, type: !168)
!465 = distinct !DILexicalBlock(scope: !455, file: !165, line: 95, column: 55)
!466 = !DILocalVariable(name: "ierr__", scope: !467, file: !165, line: 96, type: !168)
!467 = distinct !DILexicalBlock(scope: !455, file: !165, line: 96, column: 56)
!468 = !DILocation(line: 0, scope: !455)
!469 = !DILocation(line: 93, column: 3, scope: !470)
!470 = distinct !DILexicalBlock(scope: !471, file: !165, line: 93, column: 3)
!471 = distinct !DILexicalBlock(scope: !472, file: !165, line: 93, column: 3)
!472 = distinct !DILexicalBlock(scope: !455, file: !165, line: 93, column: 3)
!473 = !DILocation(line: 93, column: 3, scope: !471)
!474 = !DILocation(line: 93, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !165, line: 93, column: 3)
!476 = distinct !DILexicalBlock(scope: !470, file: !165, line: 93, column: 3)
!477 = !DILocation(line: 93, column: 3, scope: !476)
!478 = !DILocation(line: 93, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !165, line: 93, column: 3)
!480 = !DILocation(line: 23, column: 3, scope: !481, inlinedAt: !488)
!481 = distinct !DILexicalBlock(scope: !482, file: !165, line: 23, column: 3)
!482 = distinct !DILexicalBlock(scope: !483, file: !165, line: 23, column: 3)
!483 = distinct !DILexicalBlock(scope: !484, file: !165, line: 23, column: 3)
!484 = distinct !DISubprogram(name: "PetscDrawXiOpenDisplay", scope: !165, file: !165, line: 21, type: !456, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !485)
!485 = !{!486, !487}
!486 = !DILocalVariable(name: "XiWin", arg: 1, scope: !484, file: !165, line: 21, type: !170)
!487 = !DILocalVariable(name: "display", arg: 2, scope: !484, file: !165, line: 21, type: !11)
!488 = distinct !DILocation(line: 94, column: 10, scope: !455)
!489 = !DILocation(line: 0, scope: !484, inlinedAt: !488)
!490 = !DILocation(line: 23, column: 3, scope: !491, inlinedAt: !488)
!491 = distinct !DILexicalBlock(scope: !492, file: !165, line: 23, column: 3)
!492 = distinct !DILexicalBlock(scope: !481, file: !165, line: 23, column: 3)
!493 = !DILocation(line: 23, column: 3, scope: !492, inlinedAt: !488)
!494 = !DILocation(line: 23, column: 3, scope: !495, inlinedAt: !488)
!495 = distinct !DILexicalBlock(scope: !491, file: !165, line: 23, column: 3)
!496 = !DILocation(line: 24, column: 17, scope: !484, inlinedAt: !488)
!497 = !DILocation(line: 24, column: 10, scope: !484, inlinedAt: !488)
!498 = !DILocation(line: 24, column: 15, scope: !484, inlinedAt: !488)
!499 = !DILocation(line: 25, column: 8, scope: !500, inlinedAt: !488)
!500 = distinct !DILexicalBlock(scope: !484, file: !165, line: 25, column: 7)
!501 = !DILocation(line: 25, column: 7, scope: !484, inlinedAt: !488)
!502 = !DILocation(line: 31, column: 23, scope: !484, inlinedAt: !488)
!503 = !{!504, !275, i64 224}
!504 = !{!"", !266, i64 0, !266, i64 8, !275, i64 16, !275, i64 20, !275, i64 24, !275, i64 28, !266, i64 32, !312, i64 40, !312, i64 48, !312, i64 56, !275, i64 64, !266, i64 72, !275, i64 80, !275, i64 84, !275, i64 88, !275, i64 92, !275, i64 96, !266, i64 104, !275, i64 112, !275, i64 116, !266, i64 120, !266, i64 128, !275, i64 136, !312, i64 144, !312, i64 152, !266, i64 160, !266, i64 168, !266, i64 176, !266, i64 184, !275, i64 192, !266, i64 200, !266, i64 208, !266, i64 216, !275, i64 224, !275, i64 228, !266, i64 232, !312, i64 240, !312, i64 248, !275, i64 256, !275, i64 260, !266, i64 264, !266, i64 272, !275, i64 280, !266, i64 288}
!505 = !DILocation(line: 31, column: 10, scope: !484, inlinedAt: !488)
!506 = !DILocation(line: 31, column: 21, scope: !484, inlinedAt: !488)
!507 = !{!310, !275, i64 8}
!508 = !DILocation(line: 32, column: 23, scope: !484, inlinedAt: !488)
!509 = !{!504, !266, i64 232}
!510 = !{!511, !266, i64 64}
!511 = !{!"", !266, i64 0, !266, i64 8, !312, i64 16, !275, i64 24, !275, i64 28, !275, i64 32, !275, i64 36, !275, i64 40, !266, i64 48, !275, i64 56, !266, i64 64, !266, i64 72, !312, i64 80, !312, i64 88, !312, i64 96, !275, i64 104, !275, i64 108, !275, i64 112, !275, i64 116, !312, i64 120}
!512 = !DILocation(line: 32, column: 10, scope: !484, inlinedAt: !488)
!513 = !DILocation(line: 32, column: 21, scope: !484, inlinedAt: !488)
!514 = !{!310, !266, i64 16}
!515 = !DILocation(line: 33, column: 23, scope: !484, inlinedAt: !488)
!516 = !{!511, !275, i64 56}
!517 = !DILocation(line: 33, column: 10, scope: !484, inlinedAt: !488)
!518 = !DILocation(line: 33, column: 21, scope: !484, inlinedAt: !488)
!519 = !{!310, !275, i64 24}
!520 = !DILocation(line: 34, column: 23, scope: !484, inlinedAt: !488)
!521 = !{!511, !312, i64 80}
!522 = !DILocation(line: 34, column: 10, scope: !484, inlinedAt: !488)
!523 = !DILocation(line: 34, column: 21, scope: !484, inlinedAt: !488)
!524 = !{!310, !312, i64 72}
!525 = !DILocation(line: 35, column: 23, scope: !484, inlinedAt: !488)
!526 = !{!511, !312, i64 88}
!527 = !DILocation(line: 35, column: 10, scope: !484, inlinedAt: !488)
!528 = !DILocation(line: 35, column: 21, scope: !484, inlinedAt: !488)
!529 = !{!310, !312, i64 96}
!530 = !DILocation(line: 36, column: 23, scope: !484, inlinedAt: !488)
!531 = !{!511, !312, i64 96}
!532 = !DILocation(line: 36, column: 10, scope: !484, inlinedAt: !488)
!533 = !DILocation(line: 36, column: 21, scope: !484, inlinedAt: !488)
!534 = !{!310, !312, i64 88}
!535 = !DILocation(line: 37, column: 3, scope: !536, inlinedAt: !488)
!536 = distinct !DILexicalBlock(scope: !537, file: !165, line: 37, column: 3)
!537 = distinct !DILexicalBlock(scope: !538, file: !165, line: 37, column: 3)
!538 = distinct !DILexicalBlock(scope: !484, file: !165, line: 37, column: 3)
!539 = !DILocation(line: 37, column: 3, scope: !537, inlinedAt: !488)
!540 = !DILocalVariable(name: "XiWin", arg: 1, scope: !541, file: !165, line: 71, type: !170)
!541 = distinct !DISubprogram(name: "PetscDrawXiCreateGC", scope: !165, file: !165, line: 71, type: !542, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!168, !170, !187}
!544 = !{!540, !545, !546}
!545 = !DILocalVariable(name: "fg", arg: 2, scope: !541, file: !165, line: 71, type: !187)
!546 = !DILocalVariable(name: "gcvalues", scope: !541, file: !165, line: 73, type: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGCValues", file: !24, line: 207, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 181, size: 1024, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !548, file: !24, line: 182, baseType: !34, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "plane_mask", scope: !548, file: !24, line: 183, baseType: !22, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !548, file: !24, line: 184, baseType: !22, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !548, file: !24, line: 185, baseType: !22, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "line_width", scope: !548, file: !24, line: 186, baseType: !34, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "line_style", scope: !548, file: !24, line: 187, baseType: !34, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cap_style", scope: !548, file: !24, line: 188, baseType: !34, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "join_style", scope: !548, file: !24, line: 190, baseType: !34, size: 32, offset: 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fill_style", scope: !548, file: !24, line: 191, baseType: !34, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !548, file: !24, line: 193, baseType: !34, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "arc_mode", scope: !548, file: !24, line: 194, baseType: !34, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !548, file: !24, line: 195, baseType: !562, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixmap", file: !20, line: 102, baseType: !21)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stipple", scope: !548, file: !24, line: 196, baseType: !562, size: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !548, file: !24, line: 197, baseType: !34, size: 32, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !548, file: !24, line: 198, baseType: !34, size: 32, offset: 672)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !548, file: !24, line: 199, baseType: !194, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow_mode", scope: !548, file: !24, line: 200, baseType: !34, size: 32, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "graphics_exposures", scope: !548, file: !24, line: 201, baseType: !34, size: 32, offset: 800)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !548, file: !24, line: 202, baseType: !34, size: 32, offset: 832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !548, file: !24, line: 203, baseType: !34, size: 32, offset: 864)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !548, file: !24, line: 204, baseType: !562, size: 64, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !548, file: !24, line: 205, baseType: !34, size: 32, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dashes", scope: !548, file: !24, line: 206, baseType: !13, size: 8, offset: 992)
!574 = !DILocation(line: 0, scope: !541, inlinedAt: !575)
!575 = distinct !DILocation(line: 95, column: 10, scope: !455)
!576 = !DILocation(line: 73, column: 3, scope: !541, inlinedAt: !575)
!577 = !DILocation(line: 73, column: 13, scope: !541, inlinedAt: !575)
!578 = !DILocation(line: 75, column: 3, scope: !579, inlinedAt: !575)
!579 = distinct !DILexicalBlock(scope: !580, file: !165, line: 75, column: 3)
!580 = distinct !DILexicalBlock(scope: !541, file: !165, line: 75, column: 3)
!581 = !DILocation(line: 37, column: 3, scope: !582, inlinedAt: !488)
!582 = distinct !DILexicalBlock(scope: !583, file: !165, line: 37, column: 3)
!583 = distinct !DILexicalBlock(scope: !536, file: !165, line: 37, column: 3)
!584 = !DILocation(line: 37, column: 3, scope: !583, inlinedAt: !488)
!585 = !DILocation(line: 37, column: 3, scope: !586, inlinedAt: !488)
!586 = distinct !DILexicalBlock(scope: !587, file: !165, line: 37, column: 3)
!587 = distinct !DILexicalBlock(scope: !582, file: !165, line: 37, column: 3)
!588 = !DILocation(line: 37, column: 3, scope: !587, inlinedAt: !488)
!589 = !DILocation(line: 37, column: 3, scope: !590, inlinedAt: !488)
!590 = distinct !DILexicalBlock(scope: !586, file: !165, line: 37, column: 3)
!591 = !DILocation(line: 37, column: 3, scope: !592, inlinedAt: !488)
!592 = distinct !DILexicalBlock(scope: !582, file: !165, line: 37, column: 3)
!593 = !DILocation(line: 37, column: 3, scope: !594, inlinedAt: !488)
!594 = distinct !DILexicalBlock(scope: !592, file: !165, line: 37, column: 3)
!595 = !DILocation(line: 37, column: 3, scope: !596, inlinedAt: !488)
!596 = distinct !DILexicalBlock(scope: !597, file: !165, line: 37, column: 3)
!597 = distinct !DILexicalBlock(scope: !594, file: !165, line: 37, column: 3)
!598 = !DILocation(line: 37, column: 3, scope: !597, inlinedAt: !488)
!599 = !DILocation(line: 37, column: 3, scope: !600, inlinedAt: !488)
!600 = distinct !DILexicalBlock(scope: !596, file: !165, line: 37, column: 3)
!601 = !DILocation(line: 26, column: 5, scope: !602, inlinedAt: !488)
!602 = distinct !DILexicalBlock(scope: !500, file: !165, line: 25, column: 21)
!603 = !DILocation(line: 0, scope: !463)
!604 = !DILocation(line: 94, column: 48, scope: !605)
!605 = distinct !DILexicalBlock(scope: !463, file: !165, line: 94, column: 48)
!606 = !DILocation(line: 94, column: 48, scope: !463)
!607 = !DILocation(line: 75, column: 3, scope: !608, inlinedAt: !575)
!608 = distinct !DILexicalBlock(scope: !579, file: !165, line: 75, column: 3)
!609 = !DILocation(line: 95, column: 43, scope: !455)
!610 = !DILocation(line: 75, column: 3, scope: !611, inlinedAt: !575)
!611 = distinct !DILexicalBlock(scope: !612, file: !165, line: 75, column: 3)
!612 = distinct !DILexicalBlock(scope: !608, file: !165, line: 75, column: 3)
!613 = !DILocation(line: 75, column: 3, scope: !612, inlinedAt: !575)
!614 = !DILocation(line: 75, column: 3, scope: !615, inlinedAt: !575)
!615 = distinct !DILexicalBlock(scope: !611, file: !165, line: 75, column: 3)
!616 = !DILocation(line: 79, column: 12, scope: !541, inlinedAt: !575)
!617 = !DILocation(line: 79, column: 23, scope: !541, inlinedAt: !575)
!618 = !{!619, !275, i64 0}
!619 = !{!"", !275, i64 0, !312, i64 8, !312, i64 16, !312, i64 24, !275, i64 32, !275, i64 36, !275, i64 40, !275, i64 44, !275, i64 48, !275, i64 52, !275, i64 56, !312, i64 64, !312, i64 72, !275, i64 80, !275, i64 84, !312, i64 88, !275, i64 96, !275, i64 100, !275, i64 104, !275, i64 108, !312, i64 112, !275, i64 120, !267, i64 124}
!620 = !DILocation(line: 80, column: 12, scope: !541, inlinedAt: !575)
!621 = !DILocation(line: 80, column: 23, scope: !541, inlinedAt: !575)
!622 = !{!619, !312, i64 16}
!623 = !DILocation(line: 81, column: 13, scope: !541, inlinedAt: !575)
!624 = !DILocation(line: 81, column: 23, scope: !541, inlinedAt: !575)
!625 = !{!310, !312, i64 40}
!626 = !DILocation(line: 82, column: 42, scope: !541, inlinedAt: !575)
!627 = !DILocation(line: 82, column: 47, scope: !541, inlinedAt: !575)
!628 = !{!511, !312, i64 16}
!629 = !DILocation(line: 82, column: 25, scope: !541, inlinedAt: !575)
!630 = !DILocation(line: 82, column: 13, scope: !541, inlinedAt: !575)
!631 = !DILocation(line: 82, column: 23, scope: !541, inlinedAt: !575)
!632 = !DILocation(line: 83, column: 8, scope: !633, inlinedAt: !575)
!633 = distinct !DILexicalBlock(scope: !541, file: !165, line: 83, column: 7)
!634 = !DILocation(line: 83, column: 7, scope: !541, inlinedAt: !575)
!635 = !DILocation(line: 84, column: 3, scope: !636, inlinedAt: !575)
!636 = distinct !DILexicalBlock(scope: !637, file: !165, line: 84, column: 3)
!637 = distinct !DILexicalBlock(scope: !638, file: !165, line: 84, column: 3)
!638 = distinct !DILexicalBlock(scope: !541, file: !165, line: 84, column: 3)
!639 = !DILocation(line: 84, column: 3, scope: !637, inlinedAt: !575)
!640 = !DILocation(line: 84, column: 3, scope: !641, inlinedAt: !575)
!641 = distinct !DILexicalBlock(scope: !642, file: !165, line: 84, column: 3)
!642 = distinct !DILexicalBlock(scope: !636, file: !165, line: 84, column: 3)
!643 = !DILocation(line: 84, column: 3, scope: !642, inlinedAt: !575)
!644 = !DILocation(line: 84, column: 3, scope: !645, inlinedAt: !575)
!645 = distinct !DILexicalBlock(scope: !646, file: !165, line: 84, column: 3)
!646 = distinct !DILexicalBlock(scope: !641, file: !165, line: 84, column: 3)
!647 = !DILocation(line: 84, column: 3, scope: !646, inlinedAt: !575)
!648 = !DILocation(line: 84, column: 3, scope: !649, inlinedAt: !575)
!649 = distinct !DILexicalBlock(scope: !645, file: !165, line: 84, column: 3)
!650 = !DILocation(line: 84, column: 3, scope: !651, inlinedAt: !575)
!651 = distinct !DILexicalBlock(scope: !641, file: !165, line: 84, column: 3)
!652 = !DILocation(line: 84, column: 3, scope: !653, inlinedAt: !575)
!653 = distinct !DILexicalBlock(scope: !651, file: !165, line: 84, column: 3)
!654 = !DILocation(line: 84, column: 3, scope: !655, inlinedAt: !575)
!655 = distinct !DILexicalBlock(scope: !656, file: !165, line: 84, column: 3)
!656 = distinct !DILexicalBlock(scope: !653, file: !165, line: 84, column: 3)
!657 = !DILocation(line: 84, column: 3, scope: !656, inlinedAt: !575)
!658 = !DILocation(line: 84, column: 3, scope: !659, inlinedAt: !575)
!659 = distinct !DILexicalBlock(scope: !655, file: !165, line: 84, column: 3)
!660 = !DILocation(line: 85, column: 1, scope: !541, inlinedAt: !575)
!661 = !DILocation(line: 0, scope: !465)
!662 = !DILocation(line: 95, column: 55, scope: !465)
!663 = !DILocation(line: 83, column: 23, scope: !633, inlinedAt: !575)
!664 = !DILocation(line: 95, column: 55, scope: !665)
!665 = distinct !DILexicalBlock(scope: !465, file: !165, line: 95, column: 55)
!666 = !DILocation(line: 96, column: 50, scope: !455)
!667 = !DILocation(line: 96, column: 10, scope: !455)
!668 = !DILocation(line: 0, scope: !467)
!669 = !DILocation(line: 96, column: 56, scope: !670)
!670 = distinct !DILexicalBlock(scope: !467, file: !165, line: 96, column: 56)
!671 = !DILocation(line: 96, column: 56, scope: !467)
!672 = !DILocation(line: 97, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !165, line: 97, column: 3)
!674 = distinct !DILexicalBlock(scope: !675, file: !165, line: 97, column: 3)
!675 = distinct !DILexicalBlock(scope: !455, file: !165, line: 97, column: 3)
!676 = !DILocation(line: 97, column: 3, scope: !674)
!677 = !DILocation(line: 97, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !165, line: 97, column: 3)
!679 = distinct !DILexicalBlock(scope: !673, file: !165, line: 97, column: 3)
!680 = !DILocation(line: 97, column: 3, scope: !679)
!681 = !DILocation(line: 97, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !165, line: 97, column: 3)
!683 = distinct !DILexicalBlock(scope: !678, file: !165, line: 97, column: 3)
!684 = !DILocation(line: 97, column: 3, scope: !683)
!685 = !DILocation(line: 97, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !165, line: 97, column: 3)
!687 = !DILocation(line: 97, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !678, file: !165, line: 97, column: 3)
!689 = !DILocation(line: 97, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !688, file: !165, line: 97, column: 3)
!691 = !DILocation(line: 97, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !165, line: 97, column: 3)
!693 = distinct !DILexicalBlock(scope: !690, file: !165, line: 97, column: 3)
!694 = !DILocation(line: 97, column: 3, scope: !693)
!695 = !DILocation(line: 97, column: 3, scope: !696)
!696 = distinct !DILexicalBlock(scope: !692, file: !165, line: 97, column: 3)
!697 = !DILocation(line: 98, column: 1, scope: !455)
!698 = !DISubprogram(name: "PetscDrawXiFontFixed", scope: !172, file: !172, line: 61, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !378)
!699 = !DISubroutineType(types: !700)
!700 = !{!34, !701, !34, !34, !702}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!704 = distinct !DISubprogram(name: "PetscDrawXiQuickWindow", scope: !165, file: !165, line: 228, type: !705, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !707)
!705 = !DISubroutineType(types: !706)
!706 = !{!168, !170, !43, !34, !34, !34, !34}
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !717}
!708 = !DILocalVariable(name: "XiWin", arg: 1, scope: !704, file: !165, line: 228, type: !170)
!709 = !DILocalVariable(name: "name", arg: 2, scope: !704, file: !165, line: 228, type: !43)
!710 = !DILocalVariable(name: "x", arg: 3, scope: !704, file: !165, line: 228, type: !34)
!711 = !DILocalVariable(name: "y", arg: 4, scope: !704, file: !165, line: 228, type: !34)
!712 = !DILocalVariable(name: "nx", arg: 5, scope: !704, file: !165, line: 228, type: !34)
!713 = !DILocalVariable(name: "ny", arg: 6, scope: !704, file: !165, line: 228, type: !34)
!714 = !DILocalVariable(name: "ierr", scope: !704, file: !165, line: 230, type: !168)
!715 = !DILocalVariable(name: "ierr__", scope: !716, file: !165, line: 233, type: !168)
!716 = distinct !DILexicalBlock(scope: !704, file: !165, line: 233, column: 52)
!717 = !DILocalVariable(name: "ierr__", scope: !718, file: !165, line: 234, type: !168)
!718 = distinct !DILexicalBlock(scope: !704, file: !165, line: 234, column: 57)
!719 = !DILocation(line: 0, scope: !704)
!720 = !DILocation(line: 232, column: 3, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !165, line: 232, column: 3)
!722 = distinct !DILexicalBlock(scope: !723, file: !165, line: 232, column: 3)
!723 = distinct !DILexicalBlock(scope: !704, file: !165, line: 232, column: 3)
!724 = !DILocation(line: 232, column: 3, scope: !722)
!725 = !DILocation(line: 232, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !165, line: 232, column: 3)
!727 = distinct !DILexicalBlock(scope: !721, file: !165, line: 232, column: 3)
!728 = !DILocation(line: 232, column: 3, scope: !727)
!729 = !DILocation(line: 232, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !726, file: !165, line: 232, column: 3)
!731 = !DILocation(line: 233, column: 10, scope: !704)
!732 = !DILocation(line: 0, scope: !716)
!733 = !DILocation(line: 233, column: 52, scope: !734)
!734 = distinct !DILexicalBlock(scope: !716, file: !165, line: 233, column: 52)
!735 = !DILocation(line: 233, column: 52, scope: !716)
!736 = !DILocation(line: 0, scope: !737, inlinedAt: !853)
!737 = distinct !DISubprogram(name: "PetscDrawXiDisplayWindow", scope: !165, file: !165, line: 133, type: !705, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !772, !799, !819, !820, !821, !822, !836, !842, !852}
!739 = !DILocalVariable(name: "XiWin", arg: 1, scope: !737, file: !165, line: 133, type: !170)
!740 = !DILocalVariable(name: "label", arg: 2, scope: !737, file: !165, line: 133, type: !43)
!741 = !DILocalVariable(name: "x", arg: 3, scope: !737, file: !165, line: 133, type: !34)
!742 = !DILocalVariable(name: "y", arg: 4, scope: !737, file: !165, line: 133, type: !34)
!743 = !DILocalVariable(name: "w", arg: 5, scope: !737, file: !165, line: 133, type: !34)
!744 = !DILocalVariable(name: "h", arg: 6, scope: !737, file: !165, line: 133, type: !34)
!745 = !DILocalVariable(name: "wavail", scope: !737, file: !165, line: 135, type: !5)
!746 = !DILocalVariable(name: "havail", scope: !737, file: !165, line: 135, type: !5)
!747 = !DILocalVariable(name: "size_hints", scope: !737, file: !165, line: 136, type: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSizeHints", file: !749, line: 94, baseType: !750)
!749 = !DIFile(filename: "/usr/include/X11/Xutil.h", directory: "")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 81, size: 640, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !768, !769, !770, !771}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !750, file: !749, line: 82, baseType: !147, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !750, file: !749, line: 83, baseType: !34, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !750, file: !749, line: 83, baseType: !34, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !750, file: !749, line: 84, baseType: !34, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !750, file: !749, line: 84, baseType: !34, size: 32, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "min_width", scope: !750, file: !749, line: 85, baseType: !34, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "min_height", scope: !750, file: !749, line: 85, baseType: !34, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "max_width", scope: !750, file: !749, line: 86, baseType: !34, size: 32, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_height", scope: !750, file: !749, line: 86, baseType: !34, size: 32, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "width_inc", scope: !750, file: !749, line: 87, baseType: !34, size: 32, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "height_inc", scope: !750, file: !749, line: 87, baseType: !34, size: 32, offset: 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "min_aspect", scope: !750, file: !749, line: 91, baseType: !764, size: 64, offset: 384)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !750, file: !749, line: 88, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !764, file: !749, line: 89, baseType: !34, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !764, file: !749, line: 90, baseType: !34, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "max_aspect", scope: !750, file: !749, line: 91, baseType: !764, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "base_width", scope: !750, file: !749, line: 92, baseType: !34, size: 32, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "base_height", scope: !750, file: !749, line: 92, baseType: !34, size: 32, offset: 544)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "win_gravity", scope: !750, file: !749, line: 93, baseType: !34, size: 32, offset: 576)
!772 = !DILocalVariable(name: "in_window_attributes", scope: !737, file: !165, line: 137, type: !773)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "XWindowAttributes", file: !24, line: 334, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 308, size: 1088, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !774, file: !24, line: 309, baseType: !34, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !774, file: !24, line: 309, baseType: !34, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !774, file: !24, line: 310, baseType: !34, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !774, file: !24, line: 310, baseType: !34, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !774, file: !24, line: 311, baseType: !34, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !774, file: !24, line: 312, baseType: !34, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !774, file: !24, line: 313, baseType: !120, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !774, file: !24, line: 314, baseType: !106, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !774, file: !24, line: 318, baseType: !34, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit_gravity", scope: !774, file: !24, line: 320, baseType: !34, size: 32, offset: 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "win_gravity", scope: !774, file: !24, line: 321, baseType: !34, size: 32, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !774, file: !24, line: 322, baseType: !34, size: 32, offset: 416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "backing_planes", scope: !774, file: !24, line: 323, baseType: !22, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "backing_pixel", scope: !774, file: !24, line: 324, baseType: !22, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "save_under", scope: !774, file: !24, line: 325, baseType: !34, size: 32, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !774, file: !24, line: 326, baseType: !19, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "map_installed", scope: !774, file: !24, line: 327, baseType: !34, size: 32, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "map_state", scope: !774, file: !24, line: 328, baseType: !34, size: 32, offset: 736)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "all_event_masks", scope: !774, file: !24, line: 329, baseType: !147, size: 64, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "your_event_mask", scope: !774, file: !24, line: 330, baseType: !147, size: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_propagate_mask", scope: !774, file: !24, line: 331, baseType: !147, size: 64, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !774, file: !24, line: 332, baseType: !34, size: 32, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !774, file: !24, line: 333, baseType: !99, size: 64, offset: 1024)
!799 = !DILocalVariable(name: "window_attributes", scope: !737, file: !165, line: 138, type: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSetWindowAttributes", file: !24, line: 306, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 290, size: 896, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "background_pixmap", scope: !801, file: !24, line: 291, baseType: !562, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "background_pixel", scope: !801, file: !24, line: 292, baseType: !22, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixmap", scope: !801, file: !24, line: 293, baseType: !562, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixel", scope: !801, file: !24, line: 294, baseType: !22, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bit_gravity", scope: !801, file: !24, line: 295, baseType: !34, size: 32, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "win_gravity", scope: !801, file: !24, line: 296, baseType: !34, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !801, file: !24, line: 297, baseType: !34, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "backing_planes", scope: !801, file: !24, line: 298, baseType: !22, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "backing_pixel", scope: !801, file: !24, line: 299, baseType: !22, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "save_under", scope: !801, file: !24, line: 300, baseType: !34, size: 32, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "event_mask", scope: !801, file: !24, line: 301, baseType: !147, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_propagate_mask", scope: !801, file: !24, line: 302, baseType: !147, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !801, file: !24, line: 303, baseType: !34, size: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !801, file: !24, line: 304, baseType: !19, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !801, file: !24, line: 305, baseType: !818, size: 64, offset: 832)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cursor", file: !20, line: 103, baseType: !21)
!819 = !DILocalVariable(name: "border_width", scope: !737, file: !165, line: 139, type: !5)
!820 = !DILocalVariable(name: "backgnd_pixel", scope: !737, file: !165, line: 140, type: !22)
!821 = !DILocalVariable(name: "wmask", scope: !737, file: !165, line: 141, type: !22)
!822 = !DILocalVariable(name: "wm_hints", scope: !823, file: !165, line: 188, type: !824)
!823 = distinct !DILexicalBlock(scope: !737, file: !165, line: 187, column: 3)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "XWMHints", file: !749, line: 130, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 119, size: 448, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !825, file: !749, line: 120, baseType: !147, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !825, file: !749, line: 121, baseType: !34, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "initial_state", scope: !825, file: !749, line: 123, baseType: !34, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "icon_pixmap", scope: !825, file: !749, line: 124, baseType: !562, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "icon_window", scope: !825, file: !749, line: 125, baseType: !106, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "icon_x", scope: !825, file: !749, line: 126, baseType: !34, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "icon_y", scope: !825, file: !749, line: 126, baseType: !34, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "icon_mask", scope: !825, file: !749, line: 127, baseType: !562, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "window_group", scope: !825, file: !749, line: 128, baseType: !21, size: 64, offset: 384)
!836 = !DILocalVariable(name: "class_hints", scope: !823, file: !165, line: 189, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClassHint", file: !749, line: 192, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 189, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "res_name", scope: !838, file: !749, line: 190, baseType: !43, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "res_class", scope: !838, file: !749, line: 191, baseType: !43, size: 64, offset: 64)
!842 = !DILocalVariable(name: "windowname", scope: !823, file: !165, line: 190, type: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "XTextProperty", file: !749, line: 168, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 163, size: 256, elements: !845)
!845 = !{!846, !848, !850, !851}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !844, file: !749, line: 164, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !844, file: !749, line: 165, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !20, line: 74, baseType: !22)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !844, file: !749, line: 166, baseType: !34, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !844, file: !749, line: 167, baseType: !22, size: 64, offset: 192)
!852 = !DILocalVariable(name: "iconname", scope: !823, file: !165, line: 190, type: !843)
!853 = distinct !DILocation(line: 234, column: 10, scope: !704)
!854 = !DILocation(line: 136, column: 3, scope: !737, inlinedAt: !853)
!855 = !DILocation(line: 136, column: 24, scope: !737, inlinedAt: !853)
!856 = !DILocation(line: 137, column: 3, scope: !737, inlinedAt: !853)
!857 = !DILocation(line: 137, column: 24, scope: !737, inlinedAt: !853)
!858 = !DILocation(line: 138, column: 3, scope: !737, inlinedAt: !853)
!859 = !DILocation(line: 138, column: 24, scope: !737, inlinedAt: !853)
!860 = !DILocation(line: 140, column: 40, scope: !737, inlinedAt: !853)
!861 = !DILocation(line: 143, column: 3, scope: !862, inlinedAt: !853)
!862 = distinct !DILexicalBlock(scope: !863, file: !165, line: 143, column: 3)
!863 = distinct !DILexicalBlock(scope: !864, file: !165, line: 143, column: 3)
!864 = distinct !DILexicalBlock(scope: !737, file: !165, line: 143, column: 3)
!865 = !DILocation(line: 143, column: 3, scope: !863, inlinedAt: !853)
!866 = !DILocation(line: 143, column: 3, scope: !867, inlinedAt: !853)
!867 = distinct !DILexicalBlock(scope: !868, file: !165, line: 143, column: 3)
!868 = distinct !DILexicalBlock(scope: !862, file: !165, line: 143, column: 3)
!869 = !DILocation(line: 143, column: 3, scope: !868, inlinedAt: !853)
!870 = !DILocation(line: 143, column: 3, scope: !871, inlinedAt: !853)
!871 = distinct !DILexicalBlock(scope: !867, file: !165, line: 143, column: 3)
!872 = !DILocation(line: 145, column: 12, scope: !737, inlinedAt: !853)
!873 = !{!511, !275, i64 24}
!874 = !DILocation(line: 146, column: 12, scope: !737, inlinedAt: !853)
!875 = !{!511, !275, i64 28}
!876 = !DILocation(line: 147, column: 9, scope: !877, inlinedAt: !853)
!877 = distinct !DILexicalBlock(scope: !737, file: !165, line: 147, column: 7)
!878 = !DILocation(line: 147, column: 14, scope: !877, inlinedAt: !853)
!879 = !DILocation(line: 147, column: 25, scope: !877, inlinedAt: !853)
!880 = !DILocation(line: 148, column: 23, scope: !881, inlinedAt: !853)
!881 = distinct !DILexicalBlock(scope: !737, file: !165, line: 148, column: 7)
!882 = !DILocation(line: 148, column: 7, scope: !737, inlinedAt: !853)
!883 = !DILocation(line: 149, column: 23, scope: !884, inlinedAt: !853)
!884 = distinct !DILexicalBlock(scope: !737, file: !165, line: 149, column: 7)
!885 = !DILocation(line: 149, column: 7, scope: !737, inlinedAt: !853)
!886 = !DILocation(line: 151, column: 9, scope: !887, inlinedAt: !853)
!887 = distinct !DILexicalBlock(scope: !737, file: !165, line: 151, column: 7)
!888 = !DILocation(line: 151, column: 7, scope: !737, inlinedAt: !853)
!889 = !DILocation(line: 152, column: 9, scope: !890, inlinedAt: !853)
!890 = distinct !DILexicalBlock(scope: !737, file: !165, line: 152, column: 7)
!891 = !DILocation(line: 152, column: 7, scope: !737, inlinedAt: !853)
!892 = !DILocation(line: 153, column: 24, scope: !737, inlinedAt: !853)
!893 = !DILocation(line: 153, column: 28, scope: !737, inlinedAt: !853)
!894 = !DILocation(line: 153, column: 7, scope: !737, inlinedAt: !853)
!895 = !DILocation(line: 154, column: 24, scope: !737, inlinedAt: !853)
!896 = !DILocation(line: 154, column: 28, scope: !737, inlinedAt: !853)
!897 = !DILocation(line: 154, column: 7, scope: !737, inlinedAt: !853)
!898 = !DILocation(line: 157, column: 36, scope: !737, inlinedAt: !853)
!899 = !DILocation(line: 157, column: 3, scope: !737, inlinedAt: !853)
!900 = !DILocation(line: 158, column: 21, scope: !737, inlinedAt: !853)
!901 = !DILocation(line: 158, column: 39, scope: !737, inlinedAt: !853)
!902 = !{!903, !312, i64 0}
!903 = !{!"", !312, i64 0, !312, i64 8, !312, i64 16, !312, i64 24, !275, i64 32, !275, i64 36, !275, i64 40, !312, i64 48, !312, i64 56, !275, i64 64, !312, i64 72, !312, i64 80, !275, i64 88, !312, i64 96, !312, i64 104}
!904 = !DILocation(line: 159, column: 21, scope: !737, inlinedAt: !853)
!905 = !DILocation(line: 159, column: 39, scope: !737, inlinedAt: !853)
!906 = !{!903, !312, i64 8}
!907 = !DILocation(line: 161, column: 21, scope: !737, inlinedAt: !853)
!908 = !DILocation(line: 161, column: 39, scope: !737, inlinedAt: !853)
!909 = !{!903, !312, i64 16}
!910 = !DILocation(line: 165, column: 62, scope: !737, inlinedAt: !853)
!911 = !{!912, !275, i64 44}
!912 = !{!"", !275, i64 0, !275, i64 4, !275, i64 8, !275, i64 12, !275, i64 16, !275, i64 20, !266, i64 24, !312, i64 32, !275, i64 40, !275, i64 44, !275, i64 48, !275, i64 52, !312, i64 56, !312, i64 64, !275, i64 72, !312, i64 80, !275, i64 88, !275, i64 92, !312, i64 96, !312, i64 104, !312, i64 112, !275, i64 120, !266, i64 128}
!913 = !DILocation(line: 165, column: 21, scope: !737, inlinedAt: !853)
!914 = !DILocation(line: 165, column: 39, scope: !737, inlinedAt: !853)
!915 = !{!903, !275, i64 32}
!916 = !DILocation(line: 166, column: 62, scope: !737, inlinedAt: !853)
!917 = !{!912, !275, i64 48}
!918 = !DILocation(line: 166, column: 21, scope: !737, inlinedAt: !853)
!919 = !DILocation(line: 166, column: 39, scope: !737, inlinedAt: !853)
!920 = !{!903, !275, i64 36}
!921 = !DILocation(line: 168, column: 21, scope: !737, inlinedAt: !853)
!922 = !DILocation(line: 168, column: 39, scope: !737, inlinedAt: !853)
!923 = !{!903, !275, i64 40}
!924 = !DILocation(line: 169, column: 21, scope: !737, inlinedAt: !853)
!925 = !DILocation(line: 169, column: 39, scope: !737, inlinedAt: !853)
!926 = !{!903, !312, i64 56}
!927 = !DILocation(line: 170, column: 21, scope: !737, inlinedAt: !853)
!928 = !DILocation(line: 170, column: 39, scope: !737, inlinedAt: !853)
!929 = !{!903, !275, i64 64}
!930 = !DILocation(line: 171, column: 21, scope: !737, inlinedAt: !853)
!931 = !DILocation(line: 174, column: 48, scope: !737, inlinedAt: !853)
!932 = !DILocation(line: 172, column: 43, scope: !737, inlinedAt: !853)
!933 = !DILocation(line: 174, column: 21, scope: !737, inlinedAt: !853)
!934 = !DILocation(line: 174, column: 39, scope: !737, inlinedAt: !853)
!935 = !{!903, !312, i64 96}
!936 = !DILocation(line: 176, column: 21, scope: !737, inlinedAt: !853)
!937 = !DILocation(line: 176, column: 39, scope: !737, inlinedAt: !853)
!938 = !{!903, !312, i64 104}
!939 = !DILocation(line: 183, column: 37, scope: !737, inlinedAt: !853)
!940 = !DILocation(line: 183, column: 42, scope: !737, inlinedAt: !853)
!941 = !DILocation(line: 183, column: 108, scope: !737, inlinedAt: !853)
!942 = !DILocation(line: 183, column: 133, scope: !737, inlinedAt: !853)
!943 = !DILocation(line: 183, column: 16, scope: !737, inlinedAt: !853)
!944 = !DILocation(line: 183, column: 10, scope: !737, inlinedAt: !853)
!945 = !DILocation(line: 183, column: 14, scope: !737, inlinedAt: !853)
!946 = !{!310, !312, i64 56}
!947 = !DILocation(line: 184, column: 8, scope: !948, inlinedAt: !853)
!948 = distinct !DILexicalBlock(scope: !737, file: !165, line: 184, column: 7)
!949 = !DILocation(line: 184, column: 7, scope: !737, inlinedAt: !853)
!950 = !DILocation(line: 184, column: 20, scope: !948, inlinedAt: !853)
!951 = !DILocation(line: 188, column: 5, scope: !823, inlinedAt: !853)
!952 = !DILocation(line: 188, column: 19, scope: !823, inlinedAt: !853)
!953 = !DILocation(line: 189, column: 5, scope: !823, inlinedAt: !853)
!954 = !DILocation(line: 189, column: 19, scope: !823, inlinedAt: !853)
!955 = !DILocation(line: 190, column: 5, scope: !823, inlinedAt: !853)
!956 = !DILocation(line: 190, column: 19, scope: !823, inlinedAt: !853)
!957 = !DILocation(line: 190, column: 30, scope: !823, inlinedAt: !853)
!958 = !DILocation(line: 192, column: 9, scope: !959, inlinedAt: !853)
!959 = distinct !DILexicalBlock(scope: !823, file: !165, line: 192, column: 9)
!960 = !DILocation(line: 192, column: 9, scope: !823, inlinedAt: !853)
!961 = !DILocation(line: 0, scope: !959, inlinedAt: !853)
!962 = !DILocation(line: 194, column: 9, scope: !963, inlinedAt: !853)
!963 = distinct !DILexicalBlock(scope: !823, file: !165, line: 194, column: 9)
!964 = !DILocation(line: 194, column: 9, scope: !823, inlinedAt: !853)
!965 = !DILocation(line: 0, scope: !963, inlinedAt: !853)
!966 = !DILocation(line: 197, column: 14, scope: !823, inlinedAt: !853)
!967 = !DILocation(line: 197, column: 28, scope: !823, inlinedAt: !853)
!968 = !{!969, !275, i64 12}
!969 = !{!"", !312, i64 0, !275, i64 8, !275, i64 12, !312, i64 16, !312, i64 24, !275, i64 32, !275, i64 36, !312, i64 40, !312, i64 48}
!970 = !DILocation(line: 198, column: 14, scope: !823, inlinedAt: !853)
!971 = !DILocation(line: 198, column: 28, scope: !823, inlinedAt: !853)
!972 = !{!969, !275, i64 8}
!973 = !DILocation(line: 199, column: 14, scope: !823, inlinedAt: !853)
!974 = !DILocation(line: 199, column: 28, scope: !823, inlinedAt: !853)
!975 = !{!969, !312, i64 0}
!976 = !DILocation(line: 202, column: 17, scope: !823, inlinedAt: !853)
!977 = !DILocation(line: 202, column: 27, scope: !823, inlinedAt: !853)
!978 = !{!979, !266, i64 0}
!979 = !{!"", !266, i64 0, !266, i64 8}
!980 = !DILocation(line: 203, column: 17, scope: !823, inlinedAt: !853)
!981 = !DILocation(line: 203, column: 27, scope: !823, inlinedAt: !853)
!982 = !{!979, !266, i64 8}
!983 = !DILocation(line: 205, column: 16, scope: !823, inlinedAt: !853)
!984 = !DILocation(line: 205, column: 27, scope: !823, inlinedAt: !853)
!985 = !{!986, !275, i64 8}
!986 = !{!"", !312, i64 0, !275, i64 8, !275, i64 12, !275, i64 16, !275, i64 20, !275, i64 24, !275, i64 28, !275, i64 32, !275, i64 36, !275, i64 40, !275, i64 44, !987, i64 48, !987, i64 56, !275, i64 64, !275, i64 68, !275, i64 72}
!987 = !{!"", !275, i64 0, !275, i64 4}
!988 = !DILocation(line: 206, column: 16, scope: !823, inlinedAt: !853)
!989 = !DILocation(line: 206, column: 27, scope: !823, inlinedAt: !853)
!990 = !{!986, !275, i64 12}
!991 = !DILocation(line: 207, column: 16, scope: !823, inlinedAt: !853)
!992 = !DILocation(line: 207, column: 27, scope: !823, inlinedAt: !853)
!993 = !{!986, !275, i64 24}
!994 = !DILocation(line: 208, column: 16, scope: !823, inlinedAt: !853)
!995 = !DILocation(line: 208, column: 27, scope: !823, inlinedAt: !853)
!996 = !{!986, !275, i64 28}
!997 = !DILocation(line: 209, column: 16, scope: !823, inlinedAt: !853)
!998 = !DILocation(line: 209, column: 27, scope: !823, inlinedAt: !853)
!999 = !{!986, !275, i64 16}
!1000 = !DILocation(line: 210, column: 16, scope: !823, inlinedAt: !853)
!1001 = !DILocation(line: 210, column: 27, scope: !823, inlinedAt: !853)
!1002 = !{!986, !275, i64 20}
!1003 = !DILocation(line: 211, column: 16, scope: !823, inlinedAt: !853)
!1004 = !DILocation(line: 211, column: 27, scope: !823, inlinedAt: !853)
!1005 = !{!986, !312, i64 0}
!1006 = !DILocation(line: 213, column: 29, scope: !823, inlinedAt: !853)
!1007 = !DILocation(line: 213, column: 41, scope: !823, inlinedAt: !853)
!1008 = !DILocation(line: 213, column: 5, scope: !823, inlinedAt: !853)
!1009 = !DILocation(line: 214, column: 29, scope: !823, inlinedAt: !853)
!1010 = !{!1011, !266, i64 0}
!1011 = !{!"", !266, i64 0, !312, i64 8, !275, i64 16, !312, i64 24}
!1012 = !DILocation(line: 214, column: 5, scope: !823, inlinedAt: !853)
!1013 = !DILocation(line: 215, column: 27, scope: !823, inlinedAt: !853)
!1014 = !DILocation(line: 215, column: 5, scope: !823, inlinedAt: !853)
!1015 = !DILocation(line: 216, column: 3, scope: !737, inlinedAt: !853)
!1016 = !DILocation(line: 219, column: 23, scope: !737, inlinedAt: !853)
!1017 = !DILocation(line: 219, column: 35, scope: !737, inlinedAt: !853)
!1018 = !DILocation(line: 219, column: 3, scope: !737, inlinedAt: !853)
!1019 = !DILocation(line: 220, column: 21, scope: !737, inlinedAt: !853)
!1020 = !DILocation(line: 220, column: 33, scope: !737, inlinedAt: !853)
!1021 = !DILocation(line: 220, column: 3, scope: !737, inlinedAt: !853)
!1022 = !DILocalVariable(name: "XiWin", arg: 1, scope: !1023, file: !165, line: 104, type: !170)
!1023 = distinct !DISubprogram(name: "PetscDrawXiWaitMap", scope: !165, file: !165, line: 104, type: !166, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1024)
!1024 = !{!1022, !1025}
!1025 = !DILocalVariable(name: "event", scope: !1023, file: !165, line: 106, type: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !24, line: 1009, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !24, line: 973, size: 1536, elements: !1028)
!1028 = !{!1029, !1030, !1039, !1059, !1078, !1097, !1118, !1129, !1143, !1159, !1170, !1180, !1196, !1206, !1217, !1228, !1238, !1252, !1269, !1281, !1292, !1310, !1321, !1332, !1344, !1355, !1369, !1382, !1394, !1421, !1433, !1444, !1457, !1467, !1479}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1027, file: !24, line: 974, baseType: !34, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !1027, file: !24, line: 975, baseType: !1031, size: 320)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !24, line: 940, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 934, size: 320, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1032, file: !24, line: 935, baseType: !34, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1032, file: !24, line: 936, baseType: !22, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1032, file: !24, line: 937, baseType: !34, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1032, file: !24, line: 938, baseType: !176, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1032, file: !24, line: 939, baseType: !106, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !1027, file: !24, line: 976, baseType: !1040, size: 768)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !24, line: 571, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 557, size: 768, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1041, file: !24, line: 558, baseType: !34, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1041, file: !24, line: 559, baseType: !22, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1041, file: !24, line: 560, baseType: !34, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1041, file: !24, line: 561, baseType: !176, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1041, file: !24, line: 562, baseType: !106, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1041, file: !24, line: 563, baseType: !106, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1041, file: !24, line: 564, baseType: !106, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1041, file: !24, line: 565, baseType: !1051, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !20, line: 77, baseType: !22)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1041, file: !24, line: 566, baseType: !34, size: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1041, file: !24, line: 566, baseType: !34, size: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1041, file: !24, line: 567, baseType: !34, size: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1041, file: !24, line: 567, baseType: !34, size: 32, offset: 608)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1041, file: !24, line: 568, baseType: !5, size: 32, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !1041, file: !24, line: 569, baseType: !5, size: 32, offset: 672)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1041, file: !24, line: 570, baseType: !34, size: 32, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !1027, file: !24, line: 977, baseType: !1060, size: 768)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !24, line: 589, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 575, size: 768, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1061, file: !24, line: 576, baseType: !34, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1061, file: !24, line: 577, baseType: !22, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1061, file: !24, line: 578, baseType: !34, size: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1061, file: !24, line: 579, baseType: !176, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1061, file: !24, line: 580, baseType: !106, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1061, file: !24, line: 581, baseType: !106, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1061, file: !24, line: 582, baseType: !106, size: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1061, file: !24, line: 583, baseType: !1051, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1061, file: !24, line: 584, baseType: !34, size: 32, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1061, file: !24, line: 584, baseType: !34, size: 32, offset: 544)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1061, file: !24, line: 585, baseType: !34, size: 32, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1061, file: !24, line: 585, baseType: !34, size: 32, offset: 608)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1061, file: !24, line: 586, baseType: !5, size: 32, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !1061, file: !24, line: 587, baseType: !5, size: 32, offset: 672)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1061, file: !24, line: 588, baseType: !34, size: 32, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !1027, file: !24, line: 978, baseType: !1079, size: 768)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !24, line: 607, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 593, size: 768, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1080, file: !24, line: 594, baseType: !34, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1080, file: !24, line: 595, baseType: !22, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1080, file: !24, line: 596, baseType: !34, size: 32, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1080, file: !24, line: 597, baseType: !176, size: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1080, file: !24, line: 598, baseType: !106, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1080, file: !24, line: 599, baseType: !106, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1080, file: !24, line: 600, baseType: !106, size: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1080, file: !24, line: 601, baseType: !1051, size: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1080, file: !24, line: 602, baseType: !34, size: 32, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1080, file: !24, line: 602, baseType: !34, size: 32, offset: 544)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1080, file: !24, line: 603, baseType: !34, size: 32, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1080, file: !24, line: 603, baseType: !34, size: 32, offset: 608)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1080, file: !24, line: 604, baseType: !5, size: 32, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !1080, file: !24, line: 605, baseType: !13, size: 8, offset: 672)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1080, file: !24, line: 606, baseType: !34, size: 32, offset: 704)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !1027, file: !24, line: 979, baseType: !1098, size: 832)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !24, line: 630, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 610, size: 832, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !24, line: 611, baseType: !34, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1099, file: !24, line: 612, baseType: !22, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1099, file: !24, line: 613, baseType: !34, size: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1099, file: !24, line: 614, baseType: !176, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1099, file: !24, line: 615, baseType: !106, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1099, file: !24, line: 616, baseType: !106, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1099, file: !24, line: 617, baseType: !106, size: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1099, file: !24, line: 618, baseType: !1051, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1099, file: !24, line: 619, baseType: !34, size: 32, offset: 512)
