; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/cg/taocg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/cg/taocg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 181, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!30 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!31 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!32 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!33 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!34 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!35 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 6, baseType: !28, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!57 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!58 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!59 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!60 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!61 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!62 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!63 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!64 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!65 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!66 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!67 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!68 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 155, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!71 = !{!72, !73, !74, !75, !76}
!72 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!77 = !{!78, !96, !177, !252, !117, !286}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !81, line: 73, size: 4480, elements: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!82 = !{!83, !85, !138, !139, !141, !144, !145, !146, !147, !155, !156, !158, !162, !166, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !180, !181, !182, !184, !185, !187, !189, !190, !191, !192, !193, !196, !198, !199, !200, !201, !202, !205, !207, !208, !209, !219, !221, !222, !226, !227, !276, !281, !283, !284, !285}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !80, file: !81, line: 74, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !80, file: !81, line: 75, baseType: !86, size: 448, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 448, elements: !136)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !81, line: 53, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 45, size: 448, elements: !89)
!89 = !{!90, !100, !108, !113, !120, !124, !131}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !88, file: !81, line: 46, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !78, !95}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !97, line: 330, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !97, line: 330, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !88, file: !81, line: 47, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!94, !78, !104}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !105, line: 16, baseType: !106)
!105 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !105, line: 16, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !88, file: !81, line: 48, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!94, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !88, file: !81, line: 49, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!94, !78, !117, !78}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !88, file: !81, line: 50, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!94, !78, !117, !112}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !88, file: !81, line: 51, baseType: !125, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!94, !78, !117, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !88, file: !81, line: 52, baseType: !132, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!94, !78, !117, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !80, file: !81, line: 76, baseType: !96, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 77, baseType: !140, size: 32, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !80, file: !81, line: 78, baseType: !142, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !143)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !80, file: !81, line: 78, baseType: !142, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !80, file: !81, line: 78, baseType: !142, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !80, file: !81, line: 78, baseType: !142, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !81, line: 79, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !151, line: 27, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !153, line: 43, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!154 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !80, file: !81, line: 80, baseType: !140, size: 32, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !80, file: !81, line: 81, baseType: !157, size: 32, offset: 992)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !80, file: !81, line: 82, baseType: !159, size: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !80, file: !81, line: 83, baseType: !163, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !80, file: !81, line: 84, baseType: !167, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !80, file: !81, line: 85, baseType: !167, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !80, file: !81, line: 86, baseType: !167, size: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !80, file: !81, line: 87, baseType: !167, size: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !80, file: !81, line: 88, baseType: !78, size: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !80, file: !81, line: 89, baseType: !148, size: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !81, line: 90, baseType: !167, size: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !80, file: !81, line: 91, baseType: !167, size: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !80, file: !81, line: 92, baseType: !140, size: 32, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !80, file: !81, line: 93, baseType: !177, size: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !80, file: !81, line: 94, baseType: !179, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !149)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !80, file: !81, line: 95, baseType: !140, size: 32, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !80, file: !81, line: 95, baseType: !140, size: 32, offset: 1888)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !80, file: !81, line: 96, baseType: !183, size: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !80, file: !81, line: 96, baseType: !183, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !80, file: !81, line: 97, baseType: !186, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !80, file: !81, line: 97, baseType: !188, size: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !80, file: !81, line: 98, baseType: !140, size: 32, offset: 2176)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !80, file: !81, line: 98, baseType: !140, size: 32, offset: 2208)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !80, file: !81, line: 99, baseType: !183, size: 64, offset: 2240)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !80, file: !81, line: 99, baseType: !183, size: 64, offset: 2304)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !80, file: !81, line: 100, baseType: !194, size: 64, offset: 2368)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !143)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !80, file: !81, line: 100, baseType: !197, size: 64, offset: 2432)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !80, file: !81, line: 101, baseType: !140, size: 32, offset: 2496)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !80, file: !81, line: 101, baseType: !140, size: 32, offset: 2528)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !80, file: !81, line: 102, baseType: !183, size: 64, offset: 2560)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !80, file: !81, line: 102, baseType: !183, size: 64, offset: 2624)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !80, file: !81, line: 103, baseType: !203, size: 64, offset: 2688)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !80, file: !81, line: 103, baseType: !206, size: 64, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !80, file: !81, line: 104, baseType: !135, size: 64, offset: 2816)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !80, file: !81, line: 105, baseType: !140, size: 32, offset: 2880)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !80, file: !81, line: 106, baseType: !210, size: 128, offset: 2944)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !217)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !81, line: 64, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 61, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !213, file: !81, line: 62, baseType: !128, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !213, file: !81, line: 63, baseType: !177, size: 64, offset: 64)
!217 = !{!218}
!218 = !DISubrange(count: 2)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !80, file: !81, line: 107, baseType: !220, size: 64, offset: 3072)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !217)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !80, file: !81, line: 108, baseType: !177, size: 64, offset: 3136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !80, file: !81, line: 109, baseType: !223, size: 64, offset: 3200)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!94, !177}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !80, file: !81, line: 111, baseType: !140, size: 32, offset: 3264)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !80, file: !81, line: 112, baseType: !228, size: 320, offset: 3328)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 320, elements: !274)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!94, !232, !78, !177}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !235)
!235 = !{!236, !237, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !234, file: !12, line: 100, baseType: !140, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !12, line: 101, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !249, !250, !251, !255, !257, !259, !260, !261}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !240, file: !12, line: 84, baseType: !167, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !240, file: !12, line: 85, baseType: !167, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !12, line: 86, baseType: !177, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !240, file: !12, line: 87, baseType: !159, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !240, file: !12, line: 88, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !240, file: !12, line: 89, baseType: !119, size: 8, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !240, file: !12, line: 90, baseType: !167, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !240, file: !12, line: 91, baseType: !252, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 46, baseType: !254)
!253 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!254 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !240, file: !12, line: 92, baseType: !256, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !12, line: 93, baseType: !258, size: 32, offset: 544)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !12, line: 94, baseType: !238, size: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !240, file: !12, line: 95, baseType: !167, size: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !240, file: !12, line: 96, baseType: !177, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !234, file: !12, line: 102, baseType: !167, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !234, file: !12, line: 102, baseType: !167, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !234, file: !12, line: 103, baseType: !167, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !234, file: !12, line: 104, baseType: !96, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !234, file: !12, line: 105, baseType: !256, size: 32, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !234, file: !12, line: 105, baseType: !256, size: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !234, file: !12, line: 105, baseType: !256, size: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !234, file: !12, line: 106, baseType: !78, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !234, file: !12, line: 107, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!274 = !{!275}
!275 = !DISubrange(count: 5)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !80, file: !81, line: 113, baseType: !277, size: 320, offset: 3648)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 320, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!94, !78, !177}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !80, file: !81, line: 114, baseType: !282, size: 320, offset: 3968)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 320, elements: !274)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !80, file: !81, line: 115, baseType: !256, size: 32, offset: 4288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !80, file: !81, line: 120, baseType: !271, size: 64, offset: 4352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !80, file: !81, line: 121, baseType: !256, size: 32, offset: 4416)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_CG", file: !288, line: 29, baseType: !289)
!288 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/unconstrained/impls/cg/taocg.h", directory: "/home/users/ndemeye/xSDK")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !288, line: 10, size: 512, elements: !290)
!290 = !{!291, !295, !296, !297, !298, !299, !300, !301, !302}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "G_old", scope: !289, file: !288, line: 11, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !70, line: 21, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !70, line: 21, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "X_old", scope: !289, file: !288, line: 12, baseType: !292, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !289, file: !288, line: 13, baseType: !292, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !289, file: !288, line: 15, baseType: !195, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "delta_max", scope: !289, file: !288, line: 16, baseType: !195, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "delta_min", scope: !289, file: !288, line: 17, baseType: !195, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ngradsteps", scope: !289, file: !288, line: 25, baseType: !140, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nresetsteps", scope: !289, file: !288, line: 26, baseType: !140, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cg_type", scope: !289, file: !288, line: 28, baseType: !140, size: 32, offset: 448)
!303 = !{!0}
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/cg/taocg.c", directory: "/home/users/ndemeye/xSDK")
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 4096, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 64)
!308 = !{i32 7, !"Dwarf Version", i32 4}
!309 = !{i32 2, !"Debug Info Version", i32 3}
!310 = !{i32 1, !"wchar_size", i32 4}
!311 = !{i32 7, !"PIC Level", i32 2}
!312 = !{i32 7, !"uwtable", i32 1}
!313 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!314 = distinct !DISubprogram(name: "TaoCreate_CG", scope: !304, file: !304, line: 284, type: !315, scopeLine: 285, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !543)
!315 = !DISubroutineType(types: !316)
!316 = !{!94, !317}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !320, line: 45, size: 14656, elements: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!321 = !{!322, !324, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !417, !419, !420, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !495, !496, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !319, file: !320, line: 46, baseType: !323, size: 4480)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !81, line: 122, baseType: !80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !319, file: !320, line: 46, baseType: !325, size: 1536, offset: 4480)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 1536, elements: !136)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !320, line: 13, size: 1536, elements: !327)
!327 = !{!328, !332, !336, !340, !348, !349, !350, !351, !352, !353, !354, !358, !362, !363, !364, !365, !369, !373, !374, !378, !380, !381, !385, !389}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !326, file: !320, line: 15, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!94, !317, !292, !194, !177}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !326, file: !320, line: 16, baseType: !333, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!94, !317, !292, !194, !292, !177}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !326, file: !320, line: 17, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!94, !317, !292, !292, !177}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !326, file: !320, line: 18, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!94, !317, !292, !344, !344, !177}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !345, line: 16, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !345, line: 16, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !326, file: !320, line: 19, baseType: !337, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !326, file: !320, line: 20, baseType: !341, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !326, file: !320, line: 21, baseType: !337, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !326, file: !320, line: 22, baseType: !337, size: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !326, file: !320, line: 23, baseType: !337, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !326, file: !320, line: 24, baseType: !341, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !326, file: !320, line: 25, baseType: !355, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!94, !317, !292, !344, !344, !344, !177}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !326, file: !320, line: 26, baseType: !359, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!94, !317, !292, !344, !177}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !326, file: !320, line: 27, baseType: !341, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !326, file: !320, line: 28, baseType: !341, size: 64, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !326, file: !320, line: 29, baseType: !337, size: 64, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !326, file: !320, line: 30, baseType: !366, size: 64, offset: 960)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!94, !317, !140, !177}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !326, file: !320, line: 31, baseType: !370, size: 64, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!94, !317, !177}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !326, file: !320, line: 32, baseType: !223, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !326, file: !320, line: 35, baseType: !375, size: 64, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!94, !317, !292, !292}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !326, file: !320, line: 36, baseType: !379, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !326, file: !320, line: 37, baseType: !379, size: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !326, file: !320, line: 38, baseType: !382, size: 64, offset: 1344)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!94, !317, !104}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !326, file: !320, line: 39, baseType: !386, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!94, !232, !317}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !326, file: !320, line: 40, baseType: !379, size: 64, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !319, file: !320, line: 47, baseType: !177, size: 64, offset: 6016)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !319, file: !320, line: 48, baseType: !177, size: 64, offset: 6080)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !319, file: !320, line: 49, baseType: !177, size: 64, offset: 6144)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !319, file: !320, line: 50, baseType: !177, size: 64, offset: 6208)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !319, file: !320, line: 51, baseType: !177, size: 64, offset: 6272)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !319, file: !320, line: 52, baseType: !177, size: 64, offset: 6336)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !319, file: !320, line: 53, baseType: !177, size: 64, offset: 6400)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !319, file: !320, line: 54, baseType: !177, size: 64, offset: 6464)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !319, file: !320, line: 55, baseType: !177, size: 64, offset: 6528)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !319, file: !320, line: 56, baseType: !177, size: 64, offset: 6592)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !319, file: !320, line: 57, baseType: !177, size: 64, offset: 6656)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !319, file: !320, line: 58, baseType: !177, size: 64, offset: 6720)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !319, file: !320, line: 59, baseType: !177, size: 64, offset: 6784)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !319, file: !320, line: 60, baseType: !177, size: 64, offset: 6848)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !319, file: !320, line: 61, baseType: !177, size: 64, offset: 6912)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !319, file: !320, line: 62, baseType: !177, size: 64, offset: 6976)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !319, file: !320, line: 63, baseType: !177, size: 64, offset: 7040)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !319, file: !320, line: 65, baseType: !408, size: 640, offset: 7104)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 640, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 10)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !319, file: !320, line: 66, baseType: !412, size: 640, offset: 7744)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 640, elements: !409)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!94, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !319, file: !320, line: 67, baseType: !418, size: 640, offset: 8384)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 640, elements: !409)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !319, file: !320, line: 68, baseType: !140, size: 32, offset: 9024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !319, file: !320, line: 69, baseType: !177, size: 64, offset: 9088)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !319, file: !320, line: 70, baseType: !422, size: 32, offset: 9152)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !319, file: !320, line: 72, baseType: !256, size: 32, offset: 9184)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !319, file: !320, line: 73, baseType: !177, size: 64, offset: 9216)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !319, file: !320, line: 75, baseType: !292, size: 64, offset: 9280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !319, file: !320, line: 76, baseType: !292, size: 64, offset: 9344)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !319, file: !320, line: 77, baseType: !292, size: 64, offset: 9408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !319, file: !320, line: 78, baseType: !292, size: 64, offset: 9472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !319, file: !320, line: 79, baseType: !292, size: 64, offset: 9536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !319, file: !320, line: 80, baseType: !292, size: 64, offset: 9600)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !319, file: !320, line: 81, baseType: !292, size: 64, offset: 9664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !319, file: !320, line: 82, baseType: !292, size: 64, offset: 9728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !319, file: !320, line: 83, baseType: !292, size: 64, offset: 9792)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !319, file: !320, line: 84, baseType: !344, size: 64, offset: 9856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !319, file: !320, line: 85, baseType: !344, size: 64, offset: 9920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !319, file: !320, line: 86, baseType: !344, size: 64, offset: 9984)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !319, file: !320, line: 87, baseType: !292, size: 64, offset: 10048)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !319, file: !320, line: 88, baseType: !292, size: 64, offset: 10112)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !319, file: !320, line: 89, baseType: !344, size: 64, offset: 10176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !319, file: !320, line: 90, baseType: !344, size: 64, offset: 10240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !319, file: !320, line: 91, baseType: !292, size: 64, offset: 10304)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !319, file: !320, line: 92, baseType: !140, size: 32, offset: 10368)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !319, file: !320, line: 93, baseType: !186, size: 64, offset: 10432)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !319, file: !320, line: 94, baseType: !186, size: 64, offset: 10496)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !319, file: !320, line: 95, baseType: !194, size: 64, offset: 10560)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !319, file: !320, line: 96, baseType: !292, size: 64, offset: 10624)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !319, file: !320, line: 97, baseType: !292, size: 64, offset: 10688)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !319, file: !320, line: 98, baseType: !292, size: 64, offset: 10752)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !319, file: !320, line: 99, baseType: !344, size: 64, offset: 10816)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !319, file: !320, line: 100, baseType: !344, size: 64, offset: 10880)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !319, file: !320, line: 101, baseType: !344, size: 64, offset: 10944)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !319, file: !320, line: 102, baseType: !344, size: 64, offset: 11008)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !319, file: !320, line: 103, baseType: !344, size: 64, offset: 11072)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !319, file: !320, line: 104, baseType: !344, size: 64, offset: 11136)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !319, file: !320, line: 105, baseType: !344, size: 64, offset: 11200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !319, file: !320, line: 106, baseType: !344, size: 64, offset: 11264)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !319, file: !320, line: 107, baseType: !344, size: 64, offset: 11328)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !319, file: !320, line: 108, baseType: !344, size: 64, offset: 11392)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !319, file: !320, line: 109, baseType: !344, size: 64, offset: 11456)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !319, file: !320, line: 110, baseType: !461, size: 64, offset: 11520)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !462, line: 11, baseType: !463)
!462 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !462, line: 11, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !319, file: !320, line: 111, baseType: !461, size: 64, offset: 11584)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !319, file: !320, line: 112, baseType: !195, size: 64, offset: 11648)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !319, file: !320, line: 113, baseType: !195, size: 64, offset: 11712)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !319, file: !320, line: 114, baseType: !195, size: 64, offset: 11776)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !319, file: !320, line: 115, baseType: !195, size: 64, offset: 11840)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !319, file: !320, line: 116, baseType: !195, size: 64, offset: 11904)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !319, file: !320, line: 117, baseType: !195, size: 64, offset: 11968)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !319, file: !320, line: 119, baseType: !140, size: 32, offset: 12032)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !319, file: !320, line: 120, baseType: !140, size: 32, offset: 12064)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !319, file: !320, line: 121, baseType: !140, size: 32, offset: 12096)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !319, file: !320, line: 122, baseType: !140, size: 32, offset: 12128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !319, file: !320, line: 123, baseType: !140, size: 32, offset: 12160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !319, file: !320, line: 124, baseType: !140, size: 32, offset: 12192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !319, file: !320, line: 125, baseType: !140, size: 32, offset: 12224)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !319, file: !320, line: 126, baseType: !140, size: 32, offset: 12256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !319, file: !320, line: 127, baseType: !140, size: 32, offset: 12288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !319, file: !320, line: 128, baseType: !140, size: 32, offset: 12320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !319, file: !320, line: 129, baseType: !140, size: 32, offset: 12352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !319, file: !320, line: 130, baseType: !140, size: 32, offset: 12384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !319, file: !320, line: 131, baseType: !140, size: 32, offset: 12416)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !319, file: !320, line: 132, baseType: !140, size: 32, offset: 12448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !319, file: !320, line: 133, baseType: !140, size: 32, offset: 12480)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !319, file: !320, line: 134, baseType: !140, size: 32, offset: 12512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !319, file: !320, line: 135, baseType: !140, size: 32, offset: 12544)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !319, file: !320, line: 137, baseType: !140, size: 32, offset: 12576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !319, file: !320, line: 138, baseType: !140, size: 32, offset: 12608)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !319, file: !320, line: 140, baseType: !492, size: 64, offset: 12672)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !55, line: 5, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !55, line: 5, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !319, file: !320, line: 141, baseType: !256, size: 32, offset: 12736)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !319, file: !320, line: 142, baseType: !497, size: 64, offset: 12800)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !498, line: 22, baseType: !499)
!498 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !498, line: 22, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !319, file: !320, line: 143, baseType: !195, size: 64, offset: 12864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !319, file: !320, line: 144, baseType: !195, size: 64, offset: 12928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !319, file: !320, line: 146, baseType: !195, size: 64, offset: 12992)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !319, file: !320, line: 147, baseType: !195, size: 64, offset: 13056)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !319, file: !320, line: 148, baseType: !195, size: 64, offset: 13120)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !319, file: !320, line: 149, baseType: !195, size: 64, offset: 13184)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !319, file: !320, line: 150, baseType: !195, size: 64, offset: 13248)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !319, file: !320, line: 151, baseType: !195, size: 64, offset: 13312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !319, file: !320, line: 152, baseType: !195, size: 64, offset: 13376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !319, file: !320, line: 153, baseType: !256, size: 32, offset: 13440)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !319, file: !320, line: 154, baseType: !256, size: 32, offset: 13472)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !319, file: !320, line: 155, baseType: !256, size: 32, offset: 13504)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !319, file: !320, line: 156, baseType: !256, size: 32, offset: 13536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !319, file: !320, line: 157, baseType: !256, size: 32, offset: 13568)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !319, file: !320, line: 158, baseType: !256, size: 32, offset: 13600)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !319, file: !320, line: 159, baseType: !256, size: 32, offset: 13632)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !319, file: !320, line: 160, baseType: !256, size: 32, offset: 13664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !319, file: !320, line: 161, baseType: !256, size: 32, offset: 13696)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !319, file: !320, line: 162, baseType: !256, size: 32, offset: 13728)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !319, file: !320, line: 163, baseType: !256, size: 32, offset: 13760)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !319, file: !320, line: 164, baseType: !256, size: 32, offset: 13792)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !319, file: !320, line: 165, baseType: !256, size: 32, offset: 13824)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !319, file: !320, line: 166, baseType: !256, size: 32, offset: 13856)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !319, file: !320, line: 167, baseType: !256, size: 32, offset: 13888)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !319, file: !320, line: 168, baseType: !256, size: 32, offset: 13920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !319, file: !320, line: 169, baseType: !256, size: 32, offset: 13952)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !319, file: !320, line: 170, baseType: !256, size: 32, offset: 13984)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !319, file: !320, line: 171, baseType: !256, size: 32, offset: 14016)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !319, file: !320, line: 172, baseType: !256, size: 32, offset: 14048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !319, file: !320, line: 173, baseType: !256, size: 32, offset: 14080)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !319, file: !320, line: 174, baseType: !256, size: 32, offset: 14112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !319, file: !320, line: 175, baseType: !256, size: 32, offset: 14144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !319, file: !320, line: 177, baseType: !534, size: 32, offset: 14176)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !319, file: !320, line: 178, baseType: !140, size: 32, offset: 14208)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !319, file: !320, line: 179, baseType: !194, size: 64, offset: 14272)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !319, file: !320, line: 180, baseType: !194, size: 64, offset: 14336)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !319, file: !320, line: 181, baseType: !194, size: 64, offset: 14400)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !319, file: !320, line: 182, baseType: !186, size: 64, offset: 14464)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !319, file: !320, line: 183, baseType: !140, size: 32, offset: 14528)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !319, file: !320, line: 184, baseType: !256, size: 32, offset: 14560)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !319, file: !320, line: 185, baseType: !256, size: 32, offset: 14592)
!543 = !{!544, !545, !546, !547, !548, !550, !552, !554, !556, !558}
!544 = !DILocalVariable(name: "tao", arg: 1, scope: !314, file: !304, line: 284, type: !317)
!545 = !DILocalVariable(name: "cgP", scope: !314, file: !304, line: 286, type: !286)
!546 = !DILocalVariable(name: "morethuente_type", scope: !314, file: !304, line: 287, type: !117)
!547 = !DILocalVariable(name: "ierr", scope: !314, file: !304, line: 288, type: !94)
!548 = !DILocalVariable(name: "ierr__", scope: !549, file: !304, line: 305, type: !94)
!549 = distinct !DILexicalBlock(scope: !314, file: !304, line: 305, column: 74)
!550 = !DILocalVariable(name: "ierr__", scope: !551, file: !304, line: 306, type: !94)
!551 = distinct !DILexicalBlock(scope: !314, file: !304, line: 306, column: 90)
!552 = !DILocalVariable(name: "ierr__", scope: !553, file: !304, line: 307, type: !94)
!553 = distinct !DILexicalBlock(scope: !314, file: !304, line: 307, column: 66)
!554 = !DILocalVariable(name: "ierr__", scope: !555, file: !304, line: 308, type: !94)
!555 = distinct !DILexicalBlock(scope: !314, file: !304, line: 308, column: 60)
!556 = !DILocalVariable(name: "ierr__", scope: !557, file: !304, line: 309, type: !94)
!557 = distinct !DILexicalBlock(scope: !314, file: !304, line: 309, column: 73)
!558 = !DILocalVariable(name: "ierr__", scope: !559, file: !304, line: 311, type: !94)
!559 = distinct !DILexicalBlock(scope: !314, file: !304, line: 311, column: 32)
!560 = !DILocation(line: 0, scope: !314)
!561 = !DILocation(line: 286, column: 3, scope: !314)
!562 = !DILocation(line: 290, column: 3, scope: !563)
!563 = distinct !DILexicalBlock(scope: !564, file: !304, line: 290, column: 3)
!564 = distinct !DILexicalBlock(scope: !565, file: !304, line: 290, column: 3)
!565 = distinct !DILexicalBlock(scope: !314, file: !304, line: 290, column: 3)
!566 = !{!567, !567, i64 0}
!567 = !{!"any pointer", !568, i64 0}
!568 = !{!"omnipotent char", !569, i64 0}
!569 = !{!"Simple C/C++ TBAA"}
!570 = !DILocation(line: 290, column: 3, scope: !564)
!571 = !DILocation(line: 290, column: 3, scope: !572)
!572 = distinct !DILexicalBlock(scope: !573, file: !304, line: 290, column: 3)
!573 = distinct !DILexicalBlock(scope: !563, file: !304, line: 290, column: 3)
!574 = !{!575, !576, i64 1536}
!575 = !{!"", !568, i64 0, !568, i64 512, !568, i64 1024, !568, i64 1280, !576, i64 1536, !576, i64 1540, !568, i64 1544}
!576 = !{!"int", !568, i64 0}
!577 = !DILocation(line: 290, column: 3, scope: !573)
!578 = !DILocation(line: 290, column: 3, scope: !579)
!579 = distinct !DILexicalBlock(scope: !572, file: !304, line: 290, column: 3)
!580 = !{!576, !576, i64 0}
!581 = !{!575, !576, i64 1540}
!582 = !DILocation(line: 291, column: 13, scope: !314)
!583 = !DILocation(line: 291, column: 19, scope: !314)
!584 = !{!585, !567, i64 152}
!585 = !{!"_TaoOps", !567, i64 0, !567, i64 8, !567, i64 16, !567, i64 24, !567, i64 32, !567, i64 40, !567, i64 48, !567, i64 56, !567, i64 64, !567, i64 72, !567, i64 80, !567, i64 88, !567, i64 96, !567, i64 104, !567, i64 112, !567, i64 120, !567, i64 128, !567, i64 136, !567, i64 144, !567, i64 152, !567, i64 160, !567, i64 168, !567, i64 176, !567, i64 184}
!586 = !DILocation(line: 292, column: 13, scope: !314)
!587 = !DILocation(line: 292, column: 19, scope: !314)
!588 = !{!585, !567, i64 160}
!589 = !DILocation(line: 293, column: 13, scope: !314)
!590 = !DILocation(line: 293, column: 18, scope: !314)
!591 = !{!585, !567, i64 168}
!592 = !DILocation(line: 294, column: 13, scope: !314)
!593 = !DILocation(line: 294, column: 28, scope: !314)
!594 = !{!585, !567, i64 176}
!595 = !DILocation(line: 295, column: 13, scope: !314)
!596 = !DILocation(line: 295, column: 21, scope: !314)
!597 = !{!585, !567, i64 184}
!598 = !DILocation(line: 298, column: 13, scope: !599)
!599 = distinct !DILexicalBlock(scope: !314, file: !304, line: 298, column: 7)
!600 = !{!601, !568, i64 1684}
