; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/matrart.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/matrart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 1345, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!306 = !{!307, !338, !419, !359, !335, !494, !1301, !437, !409}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_RARt", file: !309, line: 74, baseType: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 65, size: 448, elements: !311)
!311 = !{!312, !547, !1293, !1294, !1295, !1299, !1300}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "matcoloring", scope: !310, file: !309, line: 66, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !41, line: 1401, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !316, line: 660, size: 5312, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !528, !530, !531, !532, !533, !534, !535, !536, !537, !538, !540, !541, !542, !543, !544, !545, !546}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !315, file: !316, line: 661, baseType: !319, size: 4480)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !320, line: 122, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !320, line: 73, size: 4480, elements: !322)
!322 = !{!323, !325, !380, !381, !383, !386, !387, !388, !389, !397, !398, !400, !404, !408, !410, !411, !412, !413, !414, !415, !416, !417, !418, !420, !422, !423, !424, !426, !427, !429, !431, !432, !433, !434, !435, !438, !440, !441, !442, !443, !444, !447, !449, !450, !451, !461, !463, !464, !468, !469, !518, !523, !525, !526, !527}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !321, file: !320, line: 74, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !77)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !321, file: !320, line: 75, baseType: !326, size: 448, offset: 64)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 448, elements: !378)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !320, line: 53, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 45, size: 448, elements: !329)
!329 = !{!330, !342, !350, !355, !362, !366, !373}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !328, file: !320, line: 46, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !335, !337}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !77)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !339, line: 330, baseType: !340)
!339 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !339, line: 330, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !328, file: !320, line: 47, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!334, !335, !346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !347, line: 16, baseType: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !347, line: 16, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !328, file: !320, line: 48, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!334, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !328, file: !320, line: 49, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!334, !335, !359, !335}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !328, file: !320, line: 50, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!334, !335, !359, !354}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !328, file: !320, line: 51, baseType: !367, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!334, !335, !359, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !328, file: !320, line: 52, baseType: !374, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!334, !335, !359, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!378 = !{!379}
!379 = !DISubrange(count: 1)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !321, file: !320, line: 76, baseType: !338, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !320, line: 77, baseType: !382, size: 32, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !77)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !321, file: !320, line: 78, baseType: !384, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !385)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !321, file: !320, line: 78, baseType: !384, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !321, file: !320, line: 78, baseType: !384, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !321, file: !320, line: 78, baseType: !384, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !321, file: !320, line: 79, baseType: !390, size: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !393, line: 27, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !395, line: 43, baseType: !396)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!396 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !321, file: !320, line: 80, baseType: !382, size: 32, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !321, file: !320, line: 81, baseType: !399, size: 32, offset: 992)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !77)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !321, file: !320, line: 82, baseType: !401, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !321, file: !320, line: 83, baseType: !405, size: 64, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !321, file: !320, line: 84, baseType: !409, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !321, file: !320, line: 85, baseType: !409, size: 64, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !321, file: !320, line: 86, baseType: !409, size: 64, offset: 1280)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !321, file: !320, line: 87, baseType: !409, size: 64, offset: 1344)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !321, file: !320, line: 88, baseType: !335, size: 64, offset: 1408)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !321, file: !320, line: 89, baseType: !390, size: 64, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !320, line: 90, baseType: !409, size: 64, offset: 1536)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !321, file: !320, line: 91, baseType: !409, size: 64, offset: 1600)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !321, file: !320, line: 92, baseType: !382, size: 32, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !321, file: !320, line: 93, baseType: !419, size: 64, offset: 1728)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !321, file: !320, line: 94, baseType: !421, size: 64, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !391)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !321, file: !320, line: 95, baseType: !382, size: 32, offset: 1856)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !321, file: !320, line: 95, baseType: !382, size: 32, offset: 1888)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !321, file: !320, line: 96, baseType: !425, size: 64, offset: 1920)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !321, file: !320, line: 96, baseType: !425, size: 64, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !321, file: !320, line: 97, baseType: !428, size: 64, offset: 2048)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !321, file: !320, line: 97, baseType: !430, size: 64, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !321, file: !320, line: 98, baseType: !382, size: 32, offset: 2176)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !321, file: !320, line: 98, baseType: !382, size: 32, offset: 2208)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !321, file: !320, line: 99, baseType: !425, size: 64, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !321, file: !320, line: 99, baseType: !425, size: 64, offset: 2304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !321, file: !320, line: 100, baseType: !436, size: 64, offset: 2368)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !385)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !321, file: !320, line: 100, baseType: !439, size: 64, offset: 2432)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !321, file: !320, line: 101, baseType: !382, size: 32, offset: 2496)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !321, file: !320, line: 101, baseType: !382, size: 32, offset: 2528)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !321, file: !320, line: 102, baseType: !425, size: 64, offset: 2560)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !321, file: !320, line: 102, baseType: !425, size: 64, offset: 2624)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !321, file: !320, line: 103, baseType: !445, size: 64, offset: 2688)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !437)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !321, file: !320, line: 103, baseType: !448, size: 64, offset: 2752)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !321, file: !320, line: 104, baseType: !377, size: 64, offset: 2816)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !321, file: !320, line: 105, baseType: !382, size: 32, offset: 2880)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !321, file: !320, line: 106, baseType: !452, size: 128, offset: 2944)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 128, elements: !459)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !320, line: 64, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 61, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !455, file: !320, line: 62, baseType: !370, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !455, file: !320, line: 63, baseType: !419, size: 64, offset: 64)
!459 = !{!460}
!460 = !DISubrange(count: 2)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !321, file: !320, line: 107, baseType: !462, size: 64, offset: 3072)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 64, elements: !459)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !321, file: !320, line: 108, baseType: !419, size: 64, offset: 3136)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !321, file: !320, line: 109, baseType: !465, size: 64, offset: 3200)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!334, !419}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !321, file: !320, line: 111, baseType: !382, size: 32, offset: 3264)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !321, file: !320, line: 112, baseType: !470, size: 320, offset: 3328)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 320, elements: !516)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!334, !474, !335, !419}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !477)
!477 = !{!478, !479, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !476, file: !10, line: 100, baseType: !382, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !10, line: 101, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !491, !492, !493, !497, !499, !501, !502, !503}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !482, file: !10, line: 84, baseType: !409, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !482, file: !10, line: 85, baseType: !409, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !10, line: 86, baseType: !419, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !482, file: !10, line: 87, baseType: !401, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !482, file: !10, line: 88, baseType: !489, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !482, file: !10, line: 89, baseType: !361, size: 8, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !482, file: !10, line: 90, baseType: !409, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !482, file: !10, line: 91, baseType: !494, size: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !495, line: 46, baseType: !496)
!495 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!496 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !482, file: !10, line: 92, baseType: !498, size: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !10, line: 93, baseType: !500, size: 32, offset: 544)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 94, baseType: !480, size: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !482, file: !10, line: 95, baseType: !409, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !482, file: !10, line: 96, baseType: !419, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !476, file: !10, line: 102, baseType: !409, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !476, file: !10, line: 102, baseType: !409, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !476, file: !10, line: 103, baseType: !409, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !476, file: !10, line: 104, baseType: !338, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !476, file: !10, line: 106, baseType: !335, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !476, file: !10, line: 107, baseType: !513, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!516 = !{!517}
!517 = !DISubrange(count: 5)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !321, file: !320, line: 113, baseType: !519, size: 320, offset: 3648)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !516)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!334, !335, !419}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !321, file: !320, line: 114, baseType: !524, size: 320, offset: 3968)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 320, elements: !516)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !321, file: !320, line: 115, baseType: !498, size: 32, offset: 4288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !321, file: !320, line: 120, baseType: !513, size: 64, offset: 4352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !321, file: !320, line: 121, baseType: !498, size: 32, offset: 4416)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !315, file: !316, line: 661, baseType: !529, size: 32, offset: 4480)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !378)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !315, file: !316, line: 662, baseType: !382, size: 32, offset: 4512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !315, file: !316, line: 662, baseType: !382, size: 32, offset: 4544)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !315, file: !316, line: 662, baseType: !382, size: 32, offset: 4576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !315, file: !316, line: 663, baseType: !382, size: 32, offset: 4608)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !315, file: !316, line: 664, baseType: !382, size: 32, offset: 4640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !315, file: !316, line: 665, baseType: !428, size: 64, offset: 4672)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !315, file: !316, line: 666, baseType: !428, size: 64, offset: 4736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !315, file: !316, line: 667, baseType: !382, size: 32, offset: 4800)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !315, file: !316, line: 668, baseType: !539, size: 32, offset: 4832)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !315, file: !316, line: 670, baseType: !428, size: 64, offset: 4864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !315, file: !316, line: 670, baseType: !428, size: 64, offset: 4928)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !315, file: !316, line: 671, baseType: !428, size: 64, offset: 4992)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !315, file: !316, line: 672, baseType: !428, size: 64, offset: 5056)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !315, file: !316, line: 673, baseType: !428, size: 64, offset: 5120)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !315, file: !316, line: 674, baseType: !382, size: 32, offset: 5184)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !315, file: !316, line: 675, baseType: !428, size: 64, offset: 5248)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Rt", scope: !310, file: !309, line: 67, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !316, line: 436, size: 23424, elements: !551)
!551 = !{!552, !553, !1036, !1056, !1057, !1058, !1060, !1061, !1062, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1189, !1190, !1206, !1207, !1208, !1209, !1210, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1245, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1291, !1292}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !550, file: !316, line: 437, baseType: !319, size: 4480)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !550, file: !316, line: 437, baseType: !554, size: 9472, offset: 4480)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 9472, elements: !378)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !316, line: 32, size: 9472, elements: !556)
!556 = !{!557, !566, !570, !571, !578, !582, !583, !584, !585, !586, !587, !588, !612, !616, !621, !627, !646, !651, !655, !656, !661, !666, !667, !672, !676, !680, !684, !688, !692, !693, !694, !695, !696, !700, !701, !706, !707, !708, !709, !710, !715, !722, !727, !731, !735, !739, !743, !744, !748, !749, !756, !761, !762, !763, !764, !824, !832, !833, !837, !838, !842, !843, !847, !852, !853, !857, !861, !868, !869, !870, !871, !872, !873, !878, !879, !883, !887, !891, !892, !893, !897, !907, !908, !912, !913, !917, !918, !922, !923, !928, !929, !933, !937, !938, !939, !940, !941, !942, !943, !947, !948, !949, !950, !951, !952, !956, !957, !958, !959, !960, !961, !962, !963, !967, !971, !972, !973, !977, !978, !979, !980, !981, !982, !983, !987, !988, !989, !994, !998, !999, !1003, !1004, !1005, !1006, !1010, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1030, !1034, !1035}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !555, file: !316, line: 34, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!334, !548, !382, !561, !382, !561, !563, !565}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !555, file: !316, line: 35, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!334, !548, !382, !428, !430, !448}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !555, file: !316, line: 36, baseType: !567, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !555, file: !316, line: 37, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!334, !548, !575, !575}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !65, line: 21, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !65, line: 21, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !555, file: !316, line: 38, baseType: !579, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!334, !548, !575, !575, !575}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !555, file: !316, line: 40, baseType: !572, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !555, file: !316, line: 41, baseType: !579, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !555, file: !316, line: 42, baseType: !572, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !555, file: !316, line: 43, baseType: !579, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !555, file: !316, line: 44, baseType: !572, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !555, file: !316, line: 46, baseType: !579, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !555, file: !316, line: 47, baseType: !589, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!334, !548, !592, !592, !596}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !593, line: 11, baseType: !594)
!593 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !593, line: 11, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !41, line: 1239, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 1226, size: 704, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !599, file: !41, line: 1227, baseType: !437, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !599, file: !41, line: 1228, baseType: !437, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !599, file: !41, line: 1229, baseType: !437, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !599, file: !41, line: 1230, baseType: !437, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !599, file: !41, line: 1231, baseType: !437, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !599, file: !41, line: 1232, baseType: !437, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !599, file: !41, line: 1233, baseType: !437, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !599, file: !41, line: 1234, baseType: !437, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !599, file: !41, line: 1236, baseType: !437, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !599, file: !41, line: 1237, baseType: !437, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !599, file: !41, line: 1238, baseType: !437, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !555, file: !316, line: 48, baseType: !613, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!334, !548, !592, !596}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !555, file: !316, line: 49, baseType: !617, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!334, !548, !575, !437, !620, !437, !382, !382, !575}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !41, line: 1291, baseType: !40)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !555, file: !316, line: 50, baseType: !622, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!334, !548, !625, !626}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !41, line: 238, baseType: !53)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !555, file: !316, line: 52, baseType: !628, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!334, !548, !631, !632}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !41, line: 612, baseType: !59)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !41, line: 600, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 592, size: 640, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !634, file: !41, line: 593, baseType: !384, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !634, file: !41, line: 594, baseType: !384, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !634, file: !41, line: 594, baseType: !384, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !634, file: !41, line: 594, baseType: !384, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !634, file: !41, line: 595, baseType: !384, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !634, file: !41, line: 596, baseType: !384, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !634, file: !41, line: 597, baseType: !384, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !634, file: !41, line: 598, baseType: !384, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !634, file: !41, line: 598, baseType: !384, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !634, file: !41, line: 599, baseType: !384, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !555, file: !316, line: 53, baseType: !647, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!334, !548, !548, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !555, file: !316, line: 54, baseType: !652, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!334, !548, !575}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !555, file: !316, line: 55, baseType: !572, size: 64, offset: 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !555, file: !316, line: 56, baseType: !657, size: 64, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!334, !548, !660, !436}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !65, line: 155, baseType: !64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !555, file: !316, line: 58, baseType: !662, size: 64, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!334, !548, !665}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !41, line: 424, baseType: !72)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !555, file: !316, line: 59, baseType: !662, size: 64, offset: 1344)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !555, file: !316, line: 60, baseType: !668, size: 64, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!334, !548, !671, !498}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !41, line: 469, baseType: !76)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !555, file: !316, line: 61, baseType: !673, size: 64, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!334, !548}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !555, file: !316, line: 63, baseType: !677, size: 64, offset: 1536)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!334, !548, !382, !561, !446, !575, !575}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !555, file: !316, line: 64, baseType: !681, size: 64, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!334, !548, !548, !592, !592, !596}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !555, file: !316, line: 65, baseType: !685, size: 64, offset: 1664)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!334, !548, !548, !596}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !555, file: !316, line: 66, baseType: !689, size: 64, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!334, !548, !548, !592, !596}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !555, file: !316, line: 67, baseType: !685, size: 64, offset: 1792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !555, file: !316, line: 69, baseType: !673, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !555, file: !316, line: 70, baseType: !681, size: 64, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !555, file: !316, line: 71, baseType: !689, size: 64, offset: 1984)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !555, file: !316, line: 72, baseType: !697, size: 64, offset: 2048)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!334, !548, !626}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !555, file: !316, line: 73, baseType: !673, size: 64, offset: 2112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !555, file: !316, line: 75, baseType: !702, size: 64, offset: 2176)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!334, !548, !705, !626}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !41, line: 563, baseType: !107)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !555, file: !316, line: 76, baseType: !572, size: 64, offset: 2240)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !555, file: !316, line: 77, baseType: !572, size: 64, offset: 2304)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !555, file: !316, line: 78, baseType: !589, size: 64, offset: 2368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !555, file: !316, line: 79, baseType: !613, size: 64, offset: 2432)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !555, file: !316, line: 81, baseType: !711, size: 64, offset: 2496)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!334, !548, !446, !548, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !555, file: !316, line: 82, baseType: !716, size: 64, offset: 2560)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!334, !548, !382, !719, !719, !625, !721}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !555, file: !316, line: 83, baseType: !723, size: 64, offset: 2624)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!334, !548, !382, !726, !382}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !555, file: !316, line: 84, baseType: !728, size: 64, offset: 2688)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!334, !548, !382, !561, !382, !561, !445}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !555, file: !316, line: 85, baseType: !732, size: 64, offset: 2752)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!334, !548, !548, !714}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !555, file: !316, line: 87, baseType: !736, size: 64, offset: 2816)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!334, !548, !575, !428}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !555, file: !316, line: 88, baseType: !740, size: 64, offset: 2880)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!334, !548, !446}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !555, file: !316, line: 89, baseType: !740, size: 64, offset: 2944)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !555, file: !316, line: 90, baseType: !745, size: 64, offset: 3008)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!334, !548, !575, !565}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !555, file: !316, line: 91, baseType: !677, size: 64, offset: 3072)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !555, file: !316, line: 93, baseType: !750, size: 64, offset: 3136)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!334, !548, !753}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !555, file: !316, line: 94, baseType: !757, size: 64, offset: 3200)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!334, !548, !382, !498, !498, !428, !760, !760, !650}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !555, file: !316, line: 95, baseType: !757, size: 64, offset: 3264)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !555, file: !316, line: 96, baseType: !757, size: 64, offset: 3328)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !555, file: !316, line: 97, baseType: !757, size: 64, offset: 3392)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !555, file: !316, line: 99, baseType: !765, size: 64, offset: 3456)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!334, !548, !768, !771}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !593, line: 51, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !593, line: 51, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !41, line: 1378, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !316, line: 609, size: 6208, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !794, !801, !802, !803, !804, !805, !806, !807, !808, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !773, file: !316, line: 610, baseType: !319, size: 4480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !773, file: !316, line: 610, baseType: !529, size: 32, offset: 4480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !773, file: !316, line: 611, baseType: !382, size: 32, offset: 4512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !773, file: !316, line: 611, baseType: !382, size: 32, offset: 4544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !773, file: !316, line: 611, baseType: !382, size: 32, offset: 4576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !773, file: !316, line: 612, baseType: !382, size: 32, offset: 4608)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !773, file: !316, line: 613, baseType: !382, size: 32, offset: 4640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !773, file: !316, line: 614, baseType: !428, size: 64, offset: 4672)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !773, file: !316, line: 615, baseType: !430, size: 64, offset: 4736)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !773, file: !316, line: 616, baseType: !726, size: 64, offset: 4800)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !773, file: !316, line: 617, baseType: !428, size: 64, offset: 4864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !773, file: !316, line: 618, baseType: !787, size: 64, offset: 4928)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !316, line: 602, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 598, size: 128, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !789, file: !316, line: 599, baseType: !382, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !789, file: !316, line: 600, baseType: !382, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !789, file: !316, line: 601, baseType: !445, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !773, file: !316, line: 619, baseType: !795, size: 64, offset: 4992)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !316, line: 607, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 604, size: 128, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !797, file: !316, line: 605, baseType: !382, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !797, file: !316, line: 606, baseType: !445, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !773, file: !316, line: 620, baseType: !445, size: 64, offset: 5056)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !773, file: !316, line: 621, baseType: !437, size: 64, offset: 5120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !773, file: !316, line: 622, baseType: !437, size: 64, offset: 5184)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !773, file: !316, line: 623, baseType: !575, size: 64, offset: 5248)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !773, file: !316, line: 623, baseType: !575, size: 64, offset: 5312)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !773, file: !316, line: 623, baseType: !575, size: 64, offset: 5376)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !773, file: !316, line: 624, baseType: !498, size: 32, offset: 5440)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !773, file: !316, line: 625, baseType: !809, size: 64, offset: 5504)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!334}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !773, file: !316, line: 626, baseType: !419, size: 64, offset: 5568)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !773, file: !316, line: 627, baseType: !575, size: 64, offset: 5632)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !773, file: !316, line: 628, baseType: !382, size: 32, offset: 5696)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !773, file: !316, line: 629, baseType: !359, size: 64, offset: 5760)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !773, file: !316, line: 630, baseType: !539, size: 32, offset: 5824)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !773, file: !316, line: 631, baseType: !382, size: 32, offset: 5856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !773, file: !316, line: 631, baseType: !382, size: 32, offset: 5888)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !773, file: !316, line: 632, baseType: !498, size: 32, offset: 5920)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !773, file: !316, line: 633, baseType: !498, size: 32, offset: 5952)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !773, file: !316, line: 634, baseType: !370, size: 64, offset: 6016)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !773, file: !316, line: 634, baseType: !419, size: 64, offset: 6080)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !773, file: !316, line: 635, baseType: !390, size: 64, offset: 6144)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !555, file: !316, line: 100, baseType: !825, size: 64, offset: 3520)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!334, !548, !382, !382, !828, !831}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !25, line: 215, baseType: !830)
!830 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !555, file: !316, line: 101, baseType: !673, size: 64, offset: 3584)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !555, file: !316, line: 102, baseType: !834, size: 64, offset: 3648)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!334, !548, !592, !592, !626}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !555, file: !316, line: 103, baseType: !558, size: 64, offset: 3712)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !555, file: !316, line: 105, baseType: !839, size: 64, offset: 3776)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!334, !548, !592, !592, !625, !626}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !555, file: !316, line: 106, baseType: !673, size: 64, offset: 3840)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !555, file: !316, line: 107, baseType: !844, size: 64, offset: 3904)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!334, !548, !346}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !555, file: !316, line: 108, baseType: !848, size: 64, offset: 3968)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!334, !548, !851, !625, !626}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !41, line: 25, baseType: !359)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !555, file: !316, line: 109, baseType: !809, size: 64, offset: 4032)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !555, file: !316, line: 111, baseType: !854, size: 64, offset: 4096)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!334, !548, !548, !548, !437, !548}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !555, file: !316, line: 112, baseType: !858, size: 64, offset: 4160)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!334, !548, !548, !548, !548}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !555, file: !316, line: 113, baseType: !862, size: 64, offset: 4224)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!334, !548, !865, !865}
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !593, line: 30, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !593, line: 30, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !555, file: !316, line: 114, baseType: !558, size: 64, offset: 4288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !555, file: !316, line: 115, baseType: !677, size: 64, offset: 4352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !555, file: !316, line: 117, baseType: !736, size: 64, offset: 4416)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !555, file: !316, line: 118, baseType: !736, size: 64, offset: 4480)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !555, file: !316, line: 119, baseType: !848, size: 64, offset: 4544)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !555, file: !316, line: 120, baseType: !874, size: 64, offset: 4608)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!334, !548, !877, !650}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !41, line: 1675, baseType: !118)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !555, file: !316, line: 121, baseType: !809, size: 64, offset: 4672)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !555, file: !316, line: 123, baseType: !880, size: 64, offset: 4736)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!334, !548, !382, !419}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !555, file: !316, line: 124, baseType: !884, size: 64, offset: 4800)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!334, !548, !771, !575, !419}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !555, file: !316, line: 125, baseType: !888, size: 64, offset: 4864)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!334, !474, !548}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !555, file: !316, line: 126, baseType: !572, size: 64, offset: 4928)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !555, file: !316, line: 127, baseType: !572, size: 64, offset: 4992)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !555, file: !316, line: 129, baseType: !894, size: 64, offset: 5056)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!334, !548, !726}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !555, file: !316, line: 130, baseType: !898, size: 64, offset: 5120)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!334, !548, !901, !901}
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !65, line: 654, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !65, line: 653, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !903, file: !65, line: 653, baseType: !382, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !903, file: !65, line: 653, baseType: !575, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !555, file: !316, line: 131, baseType: !898, size: 64, offset: 5184)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !555, file: !316, line: 132, baseType: !909, size: 64, offset: 5248)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!334, !548, !428, !428, !428}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !555, file: !316, line: 133, baseType: !844, size: 64, offset: 5312)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !555, file: !316, line: 135, baseType: !914, size: 64, offset: 5376)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!334, !548, !437, !650}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !555, file: !316, line: 136, baseType: !914, size: 64, offset: 5440)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !555, file: !316, line: 137, baseType: !919, size: 64, offset: 5504)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!334, !548, !650}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !555, file: !316, line: 138, baseType: !558, size: 64, offset: 5568)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !555, file: !316, line: 139, baseType: !924, size: 64, offset: 5632)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!334, !548, !927, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !555, file: !316, line: 141, baseType: !809, size: 64, offset: 5696)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !555, file: !316, line: 142, baseType: !930, size: 64, offset: 5760)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!334, !548, !548, !437, !548}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !555, file: !316, line: 143, baseType: !934, size: 64, offset: 5824)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!334, !548, !548, !548}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !555, file: !316, line: 144, baseType: !809, size: 64, offset: 5888)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !555, file: !316, line: 145, baseType: !930, size: 64, offset: 5952)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !555, file: !316, line: 147, baseType: !934, size: 64, offset: 6016)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !555, file: !316, line: 148, baseType: !809, size: 64, offset: 6080)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !555, file: !316, line: 149, baseType: !930, size: 64, offset: 6144)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !555, file: !316, line: 150, baseType: !934, size: 64, offset: 6208)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !555, file: !316, line: 151, baseType: !944, size: 64, offset: 6272)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!334, !548, !498}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !555, file: !316, line: 153, baseType: !673, size: 64, offset: 6336)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !555, file: !316, line: 154, baseType: !673, size: 64, offset: 6400)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !555, file: !316, line: 155, baseType: !673, size: 64, offset: 6464)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !555, file: !316, line: 156, baseType: !673, size: 64, offset: 6528)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !555, file: !316, line: 157, baseType: !844, size: 64, offset: 6592)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !555, file: !316, line: 159, baseType: !953, size: 64, offset: 6656)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!334, !548, !382, !563}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !555, file: !316, line: 160, baseType: !673, size: 64, offset: 6720)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !555, file: !316, line: 161, baseType: !673, size: 64, offset: 6784)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !555, file: !316, line: 162, baseType: !673, size: 64, offset: 6848)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !555, file: !316, line: 163, baseType: !673, size: 64, offset: 6912)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !555, file: !316, line: 165, baseType: !934, size: 64, offset: 6976)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !555, file: !316, line: 166, baseType: !934, size: 64, offset: 7040)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !555, file: !316, line: 167, baseType: !736, size: 64, offset: 7104)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !555, file: !316, line: 168, baseType: !964, size: 64, offset: 7168)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!334, !548, !575, !382}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !555, file: !316, line: 169, baseType: !968, size: 64, offset: 7232)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!334, !548, !650, !428}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !555, file: !316, line: 171, baseType: !697, size: 64, offset: 7296)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !555, file: !316, line: 172, baseType: !673, size: 64, offset: 7360)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !555, file: !316, line: 173, baseType: !974, size: 64, offset: 7424)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!334, !548, !428, !760}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !555, file: !316, line: 174, baseType: !834, size: 64, offset: 7488)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !555, file: !316, line: 175, baseType: !834, size: 64, offset: 7552)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !555, file: !316, line: 177, baseType: !572, size: 64, offset: 7616)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !555, file: !316, line: 178, baseType: !622, size: 64, offset: 7680)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !555, file: !316, line: 179, baseType: !572, size: 64, offset: 7744)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !555, file: !316, line: 180, baseType: !579, size: 64, offset: 7808)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !555, file: !316, line: 181, baseType: !984, size: 64, offset: 7872)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!334, !548, !338, !625, !626}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !555, file: !316, line: 183, baseType: !894, size: 64, offset: 7936)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !555, file: !316, line: 184, baseType: !657, size: 64, offset: 8000)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !555, file: !316, line: 185, baseType: !990, size: 64, offset: 8064)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!334, !548, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !555, file: !316, line: 186, baseType: !995, size: 64, offset: 8128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!334, !548, !382, !561, !445}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !555, file: !316, line: 187, baseType: !716, size: 64, offset: 8192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !555, file: !316, line: 189, baseType: !1000, size: 64, offset: 8256)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!334, !548, !382, !382, !428, !563}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !555, file: !316, line: 190, baseType: !809, size: 64, offset: 8320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !555, file: !316, line: 191, baseType: !930, size: 64, offset: 8384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !555, file: !316, line: 192, baseType: !934, size: 64, offset: 8448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !555, file: !316, line: 193, baseType: !1007, size: 64, offset: 8512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!334, !548, !768, !313}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !555, file: !316, line: 195, baseType: !1011, size: 64, offset: 8576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!334, !313, !548, !548}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !555, file: !316, line: 196, baseType: !1011, size: 64, offset: 8640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !555, file: !316, line: 197, baseType: !809, size: 64, offset: 8704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !555, file: !316, line: 198, baseType: !930, size: 64, offset: 8768)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !555, file: !316, line: 199, baseType: !934, size: 64, offset: 8832)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !555, file: !316, line: 201, baseType: !1019, size: 64, offset: 8896)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!334, !548, !382, !382}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !555, file: !316, line: 202, baseType: !711, size: 64, offset: 8960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !555, file: !316, line: 203, baseType: !579, size: 64, offset: 9024)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !555, file: !316, line: 204, baseType: !765, size: 64, offset: 9088)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !555, file: !316, line: 205, baseType: !894, size: 64, offset: 9152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !555, file: !316, line: 206, baseType: !1027, size: 64, offset: 9216)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!334, !338, !548, !382, !625, !626}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !555, file: !316, line: 208, baseType: !1031, size: 64, offset: 9280)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!334, !382, !721}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !555, file: !316, line: 209, baseType: !934, size: 64, offset: 9344)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !555, file: !316, line: 210, baseType: !728, size: 64, offset: 9408)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !550, file: !316, line: 438, baseType: !1037, size: 64, offset: 13952)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !593, line: 60, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1039, file: !25, line: 241, baseType: !338, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !25, line: 242, baseType: !399, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1039, file: !25, line: 243, baseType: !382, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1039, file: !25, line: 243, baseType: !382, size: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1039, file: !25, line: 244, baseType: !382, size: 32, offset: 160)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1039, file: !25, line: 244, baseType: !382, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !25, line: 245, baseType: !428, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1039, file: !25, line: 246, baseType: !498, size: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1039, file: !25, line: 247, baseType: !382, size: 32, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1039, file: !25, line: 251, baseType: !382, size: 32, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1039, file: !25, line: 252, baseType: !865, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1039, file: !25, line: 253, baseType: !498, size: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1039, file: !25, line: 254, baseType: !382, size: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1039, file: !25, line: 254, baseType: !382, size: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1039, file: !25, line: 255, baseType: !382, size: 32, offset: 608)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !550, file: !316, line: 438, baseType: !1037, size: 64, offset: 14016)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !316, line: 439, baseType: !419, size: 64, offset: 14080)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !550, file: !316, line: 440, baseType: !1059, size: 32, offset: 14144)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !41, line: 161, baseType: !263)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !550, file: !316, line: 441, baseType: !498, size: 32, offset: 14176)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !550, file: !316, line: 442, baseType: !498, size: 32, offset: 14208)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !550, file: !316, line: 443, baseType: !1063, size: 448, offset: 14272)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 448, elements: !1065)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !41, line: 1159, baseType: !359)
!1065 = !{!1066}
!1066 = !DISubrange(count: 7)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !550, file: !316, line: 444, baseType: !498, size: 32, offset: 14720)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !550, file: !316, line: 445, baseType: !498, size: 32, offset: 14752)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !550, file: !316, line: 446, baseType: !382, size: 32, offset: 14784)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !550, file: !316, line: 447, baseType: !421, size: 64, offset: 14848)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !550, file: !316, line: 448, baseType: !421, size: 64, offset: 14912)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !550, file: !316, line: 449, baseType: !633, size: 640, offset: 14976)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !550, file: !316, line: 450, baseType: !565, size: 32, offset: 15616)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !550, file: !316, line: 451, baseType: !1075, size: 2880, offset: 15680)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !316, line: 318, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !316, line: 319, size: 2880, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1097, !1098, !1103, !1108, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1123, !1124, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1156, !1157, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1186, !1187}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1076, file: !316, line: 320, baseType: !382, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1076, file: !316, line: 321, baseType: !382, size: 32, offset: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1076, file: !316, line: 322, baseType: !382, size: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1076, file: !316, line: 323, baseType: !382, size: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1076, file: !316, line: 324, baseType: !382, size: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1076, file: !316, line: 325, baseType: !382, size: 32, offset: 160)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1076, file: !316, line: 326, baseType: !1085, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !316, line: 293, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !316, line: 295, size: 448, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !316, line: 296, baseType: !1085, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1087, file: !316, line: 297, baseType: !445, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1087, file: !316, line: 297, baseType: !445, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1087, file: !316, line: 298, baseType: !428, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1087, file: !316, line: 298, baseType: !428, size: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1087, file: !316, line: 299, baseType: !382, size: 32, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1087, file: !316, line: 300, baseType: !382, size: 32, offset: 352)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1087, file: !316, line: 301, baseType: !382, size: 32, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1076, file: !316, line: 326, baseType: !1085, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1076, file: !316, line: 328, baseType: !1099, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!334, !548, !1102, !428}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1076, file: !316, line: 329, baseType: !1104, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!334, !1102, !1107, !430, !430, !448, !428}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1076, file: !316, line: 330, baseType: !1109, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!334, !1102}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1076, file: !316, line: 331, baseType: !1109, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1076, file: !316, line: 334, baseType: !338, size: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !316, line: 335, baseType: !399, size: 32, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1076, file: !316, line: 335, baseType: !399, size: 32, offset: 672)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1076, file: !316, line: 336, baseType: !399, size: 32, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1076, file: !316, line: 336, baseType: !399, size: 32, offset: 736)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1076, file: !316, line: 337, baseType: !1119, size: 64, offset: 768)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !339, line: 339, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !339, line: 339, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1076, file: !316, line: 338, baseType: !1119, size: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1076, file: !316, line: 339, baseType: !1125, size: 64, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !339, line: 341, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !339, line: 351, size: 192, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1127, file: !339, line: 354, baseType: !77, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1127, file: !339, line: 355, baseType: !77, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1127, file: !339, line: 356, baseType: !77, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1127, file: !339, line: 361, baseType: !77, size: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1127, file: !339, line: 362, baseType: !494, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1076, file: !316, line: 340, baseType: !382, size: 32, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1076, file: !316, line: 340, baseType: !382, size: 32, offset: 992)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1076, file: !316, line: 341, baseType: !445, size: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1076, file: !316, line: 342, baseType: !428, size: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1076, file: !316, line: 343, baseType: !448, size: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1076, file: !316, line: 344, baseType: !430, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1076, file: !316, line: 345, baseType: !382, size: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1076, file: !316, line: 346, baseType: !1107, size: 64, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1076, file: !316, line: 347, baseType: !498, size: 32, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1076, file: !316, line: 348, baseType: !382, size: 32, offset: 1440)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1076, file: !316, line: 351, baseType: !498, size: 32, offset: 1472)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1076, file: !316, line: 352, baseType: !498, size: 32, offset: 1504)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1076, file: !316, line: 353, baseType: !399, size: 32, offset: 1536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1076, file: !316, line: 354, baseType: !399, size: 32, offset: 1568)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1076, file: !316, line: 355, baseType: !1107, size: 64, offset: 1600)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1076, file: !316, line: 356, baseType: !1107, size: 64, offset: 1664)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1076, file: !316, line: 357, baseType: !1151, size: 64, offset: 1728)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !316, line: 310, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 308, size: 32, elements: !1154)
!1154 = !{!1155}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1153, file: !316, line: 309, baseType: !382, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1076, file: !316, line: 357, baseType: !1151, size: 64, offset: 1792)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1076, file: !316, line: 358, baseType: !1158, size: 64, offset: 1856)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !316, line: 316, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 312, size: 128, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1160, file: !316, line: 313, baseType: !419, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1160, file: !316, line: 314, baseType: !382, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1160, file: !316, line: 315, baseType: !361, size: 8, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1076, file: !316, line: 359, baseType: !1158, size: 64, offset: 1920)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1076, file: !316, line: 360, baseType: !1158, size: 64, offset: 1984)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1076, file: !316, line: 361, baseType: !382, size: 32, offset: 2048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1076, file: !316, line: 362, baseType: !399, size: 32, offset: 2080)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1076, file: !316, line: 363, baseType: !382, size: 32, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1076, file: !316, line: 364, baseType: !1107, size: 64, offset: 2176)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1076, file: !316, line: 365, baseType: !1125, size: 64, offset: 2240)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1076, file: !316, line: 366, baseType: !399, size: 32, offset: 2304)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1076, file: !316, line: 367, baseType: !399, size: 32, offset: 2336)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1076, file: !316, line: 368, baseType: !1119, size: 64, offset: 2368)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1076, file: !316, line: 369, baseType: !1119, size: 64, offset: 2432)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1076, file: !316, line: 370, baseType: !1177, size: 64, offset: 2496)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1076, file: !316, line: 371, baseType: !1177, size: 64, offset: 2560)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1076, file: !316, line: 372, baseType: !1177, size: 64, offset: 2624)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1076, file: !316, line: 373, baseType: !1183, size: 64, offset: 2688)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !339, line: 331, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !339, line: 331, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1076, file: !316, line: 374, baseType: !494, size: 64, offset: 2752)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1076, file: !316, line: 375, baseType: !1188, size: 64, offset: 2816)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !550, file: !316, line: 451, baseType: !1075, size: 2880, offset: 18560)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !550, file: !316, line: 452, baseType: !1191, size: 64, offset: 21440)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !41, line: 1723, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !316, line: 681, size: 4864, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1201, !1205}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1193, file: !316, line: 682, baseType: !319, size: 4480)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1193, file: !316, line: 682, baseType: !529, size: 32, offset: 4480)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1193, file: !316, line: 683, baseType: !498, size: 32, offset: 4512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1193, file: !316, line: 684, baseType: !382, size: 32, offset: 4544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1193, file: !316, line: 685, baseType: !927, size: 64, offset: 4608)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1193, file: !316, line: 686, baseType: !445, size: 64, offset: 4672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1193, file: !316, line: 687, baseType: !1202, size: 64, offset: 4736)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!334, !1191, !575, !419}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1193, file: !316, line: 688, baseType: !419, size: 64, offset: 4800)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !550, file: !316, line: 453, baseType: !1191, size: 64, offset: 21504)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !550, file: !316, line: 454, baseType: !1191, size: 64, offset: 21568)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !550, file: !316, line: 455, baseType: !382, size: 32, offset: 21632)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !550, file: !316, line: 456, baseType: !498, size: 32, offset: 21664)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !550, file: !316, line: 457, baseType: !1211, size: 320, offset: 21696)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !316, line: 399, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 394, size: 320, elements: !1213)
!1213 = !{!1214, !1215, !1219, !1220}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1212, file: !316, line: 395, baseType: !382, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1212, file: !316, line: 396, baseType: !1216, size: 128, offset: 32)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 128, elements: !1217)
!1217 = !{!1218}
!1218 = !DISubrange(count: 4)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1212, file: !316, line: 397, baseType: !1216, size: 128, offset: 160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1212, file: !316, line: 398, baseType: !498, size: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !550, file: !316, line: 458, baseType: !498, size: 32, offset: 22016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !550, file: !316, line: 458, baseType: !498, size: 32, offset: 22048)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !550, file: !316, line: 458, baseType: !498, size: 32, offset: 22080)
