; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/ftn-custom/zitfuncf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/ftn-custom/zitfuncf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.anon = type { i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_KSP = type opaque
%struct.PetscViewerAndFormat = type { %struct._p_PetscViewer*, i32, %struct._p_PetscDrawLG*, i8* }
%struct._p_PetscViewer = type opaque
%struct._p_PetscDrawLG = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!70 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 663, baseType: !32, size: 32, elements: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 170, baseType: !32, size: 32, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !86}
!85 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 81, baseType: !32, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!90 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!95 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!96 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!97 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!98 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!100 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!101 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 55, baseType: !32, size: 32, elements: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!108 = !{!109, !112, !115, !116, !117, !121, !123, !133, !151, !154, !344, !347, !183, !127}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !113, line: 100, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !118, line: 330, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !118, line: 330, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !122, line: 1451, baseType: !109)
!122 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !127, !130, !131, !116}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !83, line: 14, baseType: !7)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !6, line: 22, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !6, line: 22, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !83, line: 102, baseType: !7)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !83, line: 189, baseType: !132)
!132 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !31, line: 178, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 178, size: 256, elements: !137)
!137 = !{!138, !143, !145, !150}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !136, file: !31, line: 178, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !140, line: 16, baseType: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !140, line: 16, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !136, file: !31, line: 178, baseType: !144, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !31, line: 162, baseType: !30)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !136, file: !31, line: 178, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !147, line: 43, baseType: !148)
!147 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !147, line: 43, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !31, line: 178, baseType: !116, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!126, !115}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !83, line: 430, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !103, line: 73, size: 4480, elements: !157)
!157 = !{!158, !160, !201, !202, !203, !205, !206, !207, !208, !216, !217, !219, !223, !227, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !241, !242, !244, !245, !247, !249, !250, !251, !252, !253, !255, !257, !258, !259, !260, !261, !264, !266, !267, !268, !278, !280, !281, !285, !286, !334, !339, !341, !342, !343}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !156, file: !103, line: 74, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !83, line: 32, baseType: !7)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !156, file: !103, line: 75, baseType: !161, size: 448, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 448, elements: !199)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !103, line: 53, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 45, size: 448, elements: !164)
!164 = !{!165, !170, !174, !179, !186, !190, !194}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !163, file: !103, line: 46, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!126, !154, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !163, file: !103, line: 47, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!126, !154, !139}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !163, file: !103, line: 48, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!126, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !163, file: !103, line: 49, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!126, !154, !183, !154}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !163, file: !103, line: 50, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!126, !154, !183, !178}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !163, file: !103, line: 51, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!126, !154, !183, !109}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !163, file: !103, line: 52, baseType: !195, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!126, !154, !183, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !156, file: !103, line: 76, baseType: !117, size: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !103, line: 77, baseType: !130, size: 32, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !156, file: !103, line: 78, baseType: !204, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !83, line: 360, baseType: !132)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !156, file: !103, line: 78, baseType: !204, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !156, file: !103, line: 78, baseType: !204, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !156, file: !103, line: 78, baseType: !204, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !103, line: 79, baseType: !209, size: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !83, line: 442, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !83, line: 90, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !212, line: 27, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !214, line: 43, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!215 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !156, file: !103, line: 80, baseType: !130, size: 32, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !103, line: 81, baseType: !218, size: 32, offset: 992)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !83, line: 49, baseType: !7)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !156, file: !103, line: 82, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !83, line: 465, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !83, line: 465, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !156, file: !103, line: 83, baseType: !224, size: 64, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !83, line: 496, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !83, line: 496, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !156, file: !103, line: 84, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !156, file: !103, line: 85, baseType: !228, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !156, file: !103, line: 86, baseType: !228, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !156, file: !103, line: 87, baseType: !228, size: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !103, line: 88, baseType: !154, size: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !156, file: !103, line: 89, baseType: !209, size: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !103, line: 90, baseType: !228, size: 64, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !156, file: !103, line: 91, baseType: !228, size: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !156, file: !103, line: 92, baseType: !130, size: 32, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !156, file: !103, line: 93, baseType: !116, size: 64, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !103, line: 94, baseType: !239, size: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !83, line: 455, baseType: !210)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !156, file: !103, line: 95, baseType: !130, size: 32, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !156, file: !103, line: 95, baseType: !130, size: 32, offset: 1888)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !156, file: !103, line: 96, baseType: !243, size: 64, offset: 1920)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !156, file: !103, line: 96, baseType: !243, size: 64, offset: 1984)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !156, file: !103, line: 97, baseType: !246, size: 64, offset: 2048)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !156, file: !103, line: 97, baseType: !248, size: 64, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !156, file: !103, line: 98, baseType: !130, size: 32, offset: 2176)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !156, file: !103, line: 98, baseType: !130, size: 32, offset: 2208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !156, file: !103, line: 99, baseType: !243, size: 64, offset: 2240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !156, file: !103, line: 99, baseType: !243, size: 64, offset: 2304)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !156, file: !103, line: 100, baseType: !254, size: 64, offset: 2368)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !156, file: !103, line: 100, baseType: !256, size: 64, offset: 2432)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !156, file: !103, line: 101, baseType: !130, size: 32, offset: 2496)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !156, file: !103, line: 101, baseType: !130, size: 32, offset: 2528)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !156, file: !103, line: 102, baseType: !243, size: 64, offset: 2560)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !156, file: !103, line: 102, baseType: !243, size: 64, offset: 2624)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !156, file: !103, line: 103, baseType: !262, size: 64, offset: 2688)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !83, line: 305, baseType: !131)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !156, file: !103, line: 103, baseType: !265, size: 64, offset: 2752)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !156, file: !103, line: 104, baseType: !198, size: 64, offset: 2816)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !156, file: !103, line: 105, baseType: !130, size: 32, offset: 2880)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !156, file: !103, line: 106, baseType: !269, size: 128, offset: 2944)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 128, elements: !276)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !103, line: 64, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 61, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !272, file: !103, line: 62, baseType: !109, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !272, file: !103, line: 63, baseType: !116, size: 64, offset: 64)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !156, file: !103, line: 107, baseType: !279, size: 64, offset: 3072)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !276)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !156, file: !103, line: 108, baseType: !116, size: 64, offset: 3136)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !156, file: !103, line: 109, baseType: !282, size: 64, offset: 3200)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!126, !116}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !156, file: !103, line: 111, baseType: !130, size: 32, offset: 3264)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !156, file: !103, line: 112, baseType: !287, size: 320, offset: 3328)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 320, elements: !332)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!126, !291, !154, !116}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !88, line: 108, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !88, line: 99, size: 640, elements: !294)
!294 = !{!295, !296, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !293, file: !88, line: 100, baseType: !130, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !88, line: 101, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !88, line: 82, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !88, line: 83, size: 768, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !308, !309, !310, !313, !315, !317, !318, !319}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !299, file: !88, line: 84, baseType: !228, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !299, file: !88, line: 85, baseType: !228, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !88, line: 86, baseType: !116, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !299, file: !88, line: 87, baseType: !220, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !299, file: !88, line: 88, baseType: !306, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !299, file: !88, line: 89, baseType: !185, size: 8, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !299, file: !88, line: 90, baseType: !228, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !299, file: !88, line: 91, baseType: !311, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !312, line: 46, baseType: !114)
!312 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !299, file: !88, line: 92, baseType: !314, size: 32, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !83, line: 170, baseType: !82)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !88, line: 93, baseType: !316, size: 32, offset: 544)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !88, line: 81, baseType: !87)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !88, line: 94, baseType: !297, size: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !299, file: !88, line: 95, baseType: !228, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !299, file: !88, line: 96, baseType: !116, size: 64, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !293, file: !88, line: 102, baseType: !228, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !293, file: !88, line: 102, baseType: !228, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !293, file: !88, line: 103, baseType: !228, size: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !293, file: !88, line: 104, baseType: !117, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !293, file: !88, line: 105, baseType: !314, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !293, file: !88, line: 105, baseType: !314, size: 32, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !293, file: !88, line: 105, baseType: !314, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !293, file: !88, line: 106, baseType: !154, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !293, file: !88, line: 107, baseType: !329, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !88, line: 10, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !88, line: 10, flags: DIFlagFwdDecl)
!332 = !{!333}
!333 = !DISubrange(count: 5)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !156, file: !103, line: 113, baseType: !335, size: 320, offset: 3648)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 320, elements: !332)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!126, !154, !116}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !156, file: !103, line: 114, baseType: !340, size: 320, offset: 3968)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 320, elements: !332)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !156, file: !103, line: 115, baseType: !314, size: 32, offset: 4288)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !156, file: !103, line: 120, baseType: !329, size: 64, offset: 4352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !156, file: !103, line: 121, baseType: !314, size: 32, offset: 4416)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !346, line: 135, baseType: !112)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!348 = !{!0}
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/ftn-custom/zitfuncf.c", directory: "/home/users/ndemeye/xSDK")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !349, line: 92, size: 128, elements: !351)
!351 = !{!352, !354, !355, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !350, file: !349, line: 93, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !103, line: 56, baseType: !7)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !350, file: !349, line: 94, baseType: !353, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !350, file: !349, line: 95, baseType: !353, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "testdestroy", scope: !350, file: !349, line: 96, baseType: !353, size: 32, offset: 96)
!357 = !{i32 7, !"Dwarf Version", i32 4}
!358 = !{i32 2, !"Debug Info Version", i32 3}
!359 = !{i32 1, !"wchar_size", i32 4}
!360 = !{i32 7, !"PIC Level", i32 2}
!361 = !{i32 7, !"uwtable", i32 1}
!362 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!363 = distinct !DISubprogram(name: "kspconvergeddefault_", scope: !349, file: !349, line: 57, type: !364, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366, !246, !254, !367, !116, !369}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !6, line: 540, baseType: !5)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DILocalVariable(name: "ksp", arg: 1, scope: !363, file: !349, line: 57, type: !366)
!372 = !DILocalVariable(name: "n", arg: 2, scope: !363, file: !349, line: 57, type: !246)
!373 = !DILocalVariable(name: "rnorm", arg: 3, scope: !363, file: !349, line: 57, type: !254)
!374 = !DILocalVariable(name: "flag", arg: 4, scope: !363, file: !349, line: 57, type: !367)
!375 = !DILocalVariable(name: "dummy", arg: 5, scope: !363, file: !349, line: 57, type: !116)
!376 = !DILocalVariable(name: "ierr", arg: 6, scope: !363, file: !349, line: 57, type: !369)
!377 = !DILocation(line: 0, scope: !363)
!378 = !DILocation(line: 59, column: 31, scope: !363)
!379 = !{!380, !380, i64 0}
!380 = !{!"any pointer", !381, i64 0}
!381 = !{!"omnipotent char", !382, i64 0}
!382 = !{!"Simple C/C++ TBAA"}
!383 = !DILocation(line: 59, column: 36, scope: !363)
!384 = !{!385, !385, i64 0}
!385 = !{!"int", !381, i64 0}
!386 = !DILocation(line: 59, column: 39, scope: !363)
!387 = !{!388, !388, i64 0}
!388 = !{!"double", !381, i64 0}
!389 = !DILocation(line: 59, column: 11, scope: !363)
!390 = !DILocation(line: 59, column: 9, scope: !363)
!391 = !DILocation(line: 60, column: 1, scope: !363)
!392 = !DISubprogram(name: "KSPConvergedDefault", scope: !6, file: !6, line: 684, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !396)
!393 = !DISubroutineType(types: !394)
!394 = !{!7, !128, !7, !132, !395, !116}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!396 = !{}
!397 = distinct !DISubprogram(name: "kspconvergedskip_", scope: !349, file: !349, line: 62, type: !364, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !398)
!398 = !{!399, !400, !401, !402, !403, !404}
!399 = !DILocalVariable(name: "ksp", arg: 1, scope: !397, file: !349, line: 62, type: !366)
!400 = !DILocalVariable(name: "n", arg: 2, scope: !397, file: !349, line: 62, type: !246)
!401 = !DILocalVariable(name: "rnorm", arg: 3, scope: !397, file: !349, line: 62, type: !254)
!402 = !DILocalVariable(name: "flag", arg: 4, scope: !397, file: !349, line: 62, type: !367)
!403 = !DILocalVariable(name: "dummy", arg: 5, scope: !397, file: !349, line: 62, type: !116)
!404 = !DILocalVariable(name: "ierr", arg: 6, scope: !397, file: !349, line: 62, type: !369)
!405 = !DILocation(line: 0, scope: !397)
!406 = !DILocation(line: 64, column: 28, scope: !397)
!407 = !DILocation(line: 64, column: 33, scope: !397)
!408 = !DILocation(line: 64, column: 36, scope: !397)
!409 = !DILocation(line: 64, column: 11, scope: !397)
!410 = !DILocation(line: 64, column: 9, scope: !397)
!411 = !DILocation(line: 65, column: 1, scope: !397)
