; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexadapt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexadapt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PlexGeneratorFunctionList = type { i32 (%struct._p_DM*, i32, %struct._p_DM**)*, i32 (%struct._p_DM*, double*, %struct._p_DM**)*, i32 (%struct._p_DM*, %struct._p_DMLabel*, %struct._p_DM**)*, i8*, i32, %struct._n_PlexGeneratorFunctionList* }

!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 213, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39}
!31 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !{!73, !77, !78, !81, !248, !282, !285, !164, !88, !191, !137}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !74, line: 330, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !74, line: 330, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !84, line: 73, size: 4480, elements: !85)
!84 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!85 = !{!86, !89, !135, !136, !138, !141, !142, !143, !144, !152, !153, !155, !159, !163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !180, !181, !183, !185, !186, !187, !188, !189, !192, !194, !195, !196, !197, !198, !201, !203, !204, !205, !215, !217, !218, !222, !223, !272, !277, !279, !280, !281}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !83, file: !84, line: 74, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !88)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !83, file: !84, line: 75, baseType: !90, size: 448, offset: 64)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 448, elements: !133)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !84, line: 53, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 45, size: 448, elements: !93)
!93 = !{!94, !100, !108, !113, !117, !121, !128}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !92, file: !84, line: 46, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !81, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !88)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !92, file: !84, line: 47, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!98, !81, !104}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !105, line: 16, baseType: !106)
!105 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !105, line: 16, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !92, file: !84, line: 48, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!98, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !92, file: !84, line: 49, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!98, !81, !78, !81}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !92, file: !84, line: 50, baseType: !118, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!98, !81, !78, !112}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !92, file: !84, line: 51, baseType: !122, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!98, !81, !78, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !92, file: !84, line: 52, baseType: !129, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!98, !81, !78, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !83, file: !84, line: 76, baseType: !73, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !84, line: 77, baseType: !137, size: 32, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !88)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !83, file: !84, line: 78, baseType: !139, size: 64, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !140)
!140 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !83, file: !84, line: 78, baseType: !139, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !83, file: !84, line: 78, baseType: !139, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !83, file: !84, line: 78, baseType: !139, size: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !83, file: !84, line: 79, baseType: !145, size: 64, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !148, line: 27, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !150, line: 43, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!151 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !83, file: !84, line: 80, baseType: !137, size: 32, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !83, file: !84, line: 81, baseType: !154, size: 32, offset: 992)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !88)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !83, file: !84, line: 82, baseType: !156, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !83, file: !84, line: 83, baseType: !160, size: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !83, file: !84, line: 84, baseType: !164, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !83, file: !84, line: 85, baseType: !164, size: 64, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !83, file: !84, line: 86, baseType: !164, size: 64, offset: 1280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !83, file: !84, line: 87, baseType: !164, size: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !83, file: !84, line: 88, baseType: !81, size: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !83, file: !84, line: 89, baseType: !145, size: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !84, line: 90, baseType: !164, size: 64, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !83, file: !84, line: 91, baseType: !164, size: 64, offset: 1600)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !83, file: !84, line: 92, baseType: !137, size: 32, offset: 1664)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !83, file: !84, line: 93, baseType: !77, size: 64, offset: 1728)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !83, file: !84, line: 94, baseType: !175, size: 64, offset: 1792)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !146)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !83, file: !84, line: 95, baseType: !137, size: 32, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !83, file: !84, line: 95, baseType: !137, size: 32, offset: 1888)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !83, file: !84, line: 96, baseType: !179, size: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !83, file: !84, line: 96, baseType: !179, size: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !83, file: !84, line: 97, baseType: !182, size: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !83, file: !84, line: 97, baseType: !184, size: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !83, file: !84, line: 98, baseType: !137, size: 32, offset: 2176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !83, file: !84, line: 98, baseType: !137, size: 32, offset: 2208)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !83, file: !84, line: 99, baseType: !179, size: 64, offset: 2240)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !83, file: !84, line: 99, baseType: !179, size: 64, offset: 2304)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !83, file: !84, line: 100, baseType: !190, size: 64, offset: 2368)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !140)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !83, file: !84, line: 100, baseType: !193, size: 64, offset: 2432)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !83, file: !84, line: 101, baseType: !137, size: 32, offset: 2496)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !83, file: !84, line: 101, baseType: !137, size: 32, offset: 2528)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !83, file: !84, line: 102, baseType: !179, size: 64, offset: 2560)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !83, file: !84, line: 102, baseType: !179, size: 64, offset: 2624)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !83, file: !84, line: 103, baseType: !199, size: 64, offset: 2688)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !191)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !83, file: !84, line: 103, baseType: !202, size: 64, offset: 2752)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !83, file: !84, line: 104, baseType: !132, size: 64, offset: 2816)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !83, file: !84, line: 105, baseType: !137, size: 32, offset: 2880)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !83, file: !84, line: 106, baseType: !206, size: 128, offset: 2944)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 128, elements: !213)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !84, line: 64, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 61, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !209, file: !84, line: 62, baseType: !125, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !209, file: !84, line: 63, baseType: !77, size: 64, offset: 64)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !83, file: !84, line: 107, baseType: !216, size: 64, offset: 3072)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !213)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !83, file: !84, line: 108, baseType: !77, size: 64, offset: 3136)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !83, file: !84, line: 109, baseType: !219, size: 64, offset: 3200)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!98, !77}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !83, file: !84, line: 111, baseType: !137, size: 32, offset: 3264)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !83, file: !84, line: 112, baseType: !224, size: 320, offset: 3328)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 320, elements: !270)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!98, !228, !81, !77}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !231)
!231 = !{!232, !233, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !230, file: !10, line: 100, baseType: !137, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !10, line: 101, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !245, !246, !247, !251, !253, !255, !256, !257}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !236, file: !10, line: 84, baseType: !164, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !236, file: !10, line: 85, baseType: !164, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !10, line: 86, baseType: !77, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !236, file: !10, line: 87, baseType: !156, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !236, file: !10, line: 88, baseType: !243, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !236, file: !10, line: 89, baseType: !80, size: 8, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !236, file: !10, line: 90, baseType: !164, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !236, file: !10, line: 91, baseType: !248, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !249, line: 46, baseType: !250)
!249 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!250 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !236, file: !10, line: 92, baseType: !252, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !10, line: 93, baseType: !254, size: 32, offset: 544)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !10, line: 94, baseType: !234, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !236, file: !10, line: 95, baseType: !164, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !236, file: !10, line: 96, baseType: !77, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !230, file: !10, line: 102, baseType: !164, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !230, file: !10, line: 102, baseType: !164, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !230, file: !10, line: 103, baseType: !164, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !230, file: !10, line: 104, baseType: !73, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !230, file: !10, line: 105, baseType: !252, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !230, file: !10, line: 105, baseType: !252, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !230, file: !10, line: 105, baseType: !252, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !230, file: !10, line: 106, baseType: !81, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !230, file: !10, line: 107, baseType: !267, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!270 = !{!271}
!271 = !DISubrange(count: 5)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !83, file: !84, line: 113, baseType: !273, size: 320, offset: 3648)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 320, elements: !270)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!98, !81, !77}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !83, file: !84, line: 114, baseType: !278, size: 320, offset: 3968)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 320, elements: !270)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !83, file: !84, line: 115, baseType: !252, size: 32, offset: 4288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !83, file: !84, line: 120, baseType: !267, size: 64, offset: 4352)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !83, file: !84, line: 121, baseType: !252, size: 32, offset: 4416)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !74, line: 331, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !74, line: 331, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !74, line: 338, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !74, line: 338, flags: DIFlagFwdDecl)
!288 = !{i32 7, !"Dwarf Version", i32 4}
!289 = !{i32 2, !"Debug Info Version", i32 3}
!290 = !{i32 1, !"wchar_size", i32 4}
!291 = !{i32 7, !"PIC Level", i32 2}
!292 = !{i32 7, !"uwtable", i32 1}
!293 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!294 = distinct !DISubprogram(name: "DMPlexRefine_Internal", scope: !295, file: !295, line: 165, type: !296, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1044)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexadapt.c", directory: "/home/users/ndemeye/xSDK")
!296 = !DISubroutineType(types: !297)
!297 = !{!98, !298, !409, !317}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !301)
!301 = !{!302, !304, !539, !543, !544, !545, !546, !556, !557, !565, !566, !574, !575, !576, !577, !581, !582, !586, !588, !590, !591, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !619, !631, !643, !655, !664, !665, !688, !689, !690, !691, !692, !693, !695, !786, !787, !807, !808, !809, !810, !811, !812, !816, !817, !821, !822, !823, !824, !825, !826, !827, !828, !829, !832, !844, !845, !846, !855, !943, !944, !1032, !1033, !1034, !1035, !1037, !1039, !1040, !1041, !1042, !1043}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !300, file: !47, line: 203, baseType: !303, size: 4480)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !84, line: 122, baseType: !83)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !300, file: !47, line: 203, baseType: !305, size: 3456, offset: 4480)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 3456, elements: !133)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !307)
!307 = !{!308, !312, !313, !318, !322, !326, !327, !328, !337, !338, !339, !351, !352, !360, !369, !378, !382, !386, !387, !392, !393, !397, !398, !402, !403, !405, !413, !418, !419, !420, !421, !422, !423, !424, !428, !434, !438, !443, !447, !458, !462, !467, !474, !478, !479, !485, !496, !500, !510, !514, !522, !526, !534, !535}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !306, file: !47, line: 31, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!98, !298, !104}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !306, file: !47, line: 32, baseType: !309, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !306, file: !47, line: 33, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!98, !298, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !306, file: !47, line: 34, baseType: !319, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!98, !228, !298}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !306, file: !47, line: 35, baseType: !323, size: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!98, !298}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !306, file: !47, line: 36, baseType: !323, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !306, file: !47, line: 37, baseType: !323, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !306, file: !47, line: 38, baseType: !329, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!98, !298, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !334, line: 21, baseType: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !334, line: 21, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !306, file: !47, line: 39, baseType: !329, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !306, file: !47, line: 40, baseType: !323, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !306, file: !47, line: 41, baseType: !340, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!98, !298, !182, !343, !345}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !348, line: 11, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !348, line: 11, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !306, file: !47, line: 42, baseType: !314, size: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !306, file: !47, line: 43, baseType: !353, size: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!98, !298, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !306, file: !47, line: 45, baseType: !361, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!98, !298, !364, !365}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !348, line: 51, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !348, line: 51, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !306, file: !47, line: 46, baseType: !370, size: 64, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!98, !298, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !375, line: 16, baseType: !376)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !375, line: 16, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !306, file: !47, line: 47, baseType: !379, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!98, !298, !298, !373, !332}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !306, file: !47, line: 48, baseType: !383, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!98, !298, !298, !373}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !306, file: !47, line: 49, baseType: !383, size: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !306, file: !47, line: 50, baseType: !388, size: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!98, !298, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !306, file: !47, line: 51, baseType: !383, size: 64, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !306, file: !47, line: 53, baseType: !394, size: 64, offset: 1280)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!98, !298, !73, !317}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !306, file: !47, line: 54, baseType: !394, size: 64, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !306, file: !47, line: 55, baseType: !399, size: 64, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!98, !298, !137, !317}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !306, file: !47, line: 56, baseType: !399, size: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !306, file: !47, line: 57, baseType: !404, size: 64, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !306, file: !47, line: 58, baseType: !406, size: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!98, !298, !333, !409, !317}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !410, line: 12, baseType: !411)
!410 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !410, line: 12, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !306, file: !47, line: 60, baseType: !414, size: 64, offset: 1664)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!98, !298, !333, !417, !333}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !306, file: !47, line: 61, baseType: !414, size: 64, offset: 1728)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !306, file: !47, line: 62, baseType: !414, size: 64, offset: 1792)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !306, file: !47, line: 63, baseType: !414, size: 64, offset: 1856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !306, file: !47, line: 64, baseType: !414, size: 64, offset: 1920)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !306, file: !47, line: 65, baseType: !414, size: 64, offset: 1984)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !306, file: !47, line: 67, baseType: !323, size: 64, offset: 2048)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !306, file: !47, line: 69, baseType: !425, size: 64, offset: 2112)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!98, !298, !333, !333}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !306, file: !47, line: 71, baseType: !429, size: 64, offset: 2176)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!98, !298, !137, !432, !346, !317}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !306, file: !47, line: 72, baseType: !435, size: 64, offset: 2240)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!98, !317, !137, !345, !317}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !306, file: !47, line: 73, baseType: !439, size: 64, offset: 2304)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!98, !298, !182, !343, !345, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !306, file: !47, line: 74, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!98, !298, !182, !343, !345, !345, !442}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !306, file: !47, line: 75, baseType: !448, size: 64, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!98, !298, !137, !317, !451, !451, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !454, line: 59, baseType: !455)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !454, line: 15, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !454, line: 15, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !306, file: !47, line: 77, baseType: !459, size: 64, offset: 2496)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!98, !298, !137, !182, !182}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !306, file: !47, line: 78, baseType: !463, size: 64, offset: 2560)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!98, !298, !333, !466, !455}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !306, file: !47, line: 79, baseType: !468, size: 64, offset: 2624)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!98, !298, !182, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !306, file: !47, line: 80, baseType: !475, size: 64, offset: 2688)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!98, !298, !190, !190}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !306, file: !47, line: 81, baseType: !475, size: 64, offset: 2752)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !306, file: !47, line: 82, baseType: !480, size: 64, offset: 2816)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!98, !298, !333, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !306, file: !47, line: 84, baseType: !486, size: 64, offset: 2880)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!98, !298, !191, !489, !495, !417, !333}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!98, !137, !191, !493, !137, !199, !77}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !306, file: !47, line: 85, baseType: !497, size: 64, offset: 2944)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!98, !298, !191, !409, !137, !432, !137, !432, !489, !495, !417, !333}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !306, file: !47, line: 86, baseType: !501, size: 64, offset: 3008)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!98, !298, !191, !333, !504, !417, !333}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !137, !137, !137, !432, !432, !508, !508, !508, !432, !432, !508, !508, !508, !191, !493, !137, !508, !199}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !306, file: !47, line: 87, baseType: !511, size: 64, offset: 3072)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!98, !298, !191, !409, !137, !432, !137, !432, !333, !504, !417, !333}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !306, file: !47, line: 88, baseType: !515, size: 64, offset: 3136)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!98, !298, !191, !409, !137, !432, !137, !432, !333, !518, !417, !333}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !137, !137, !137, !432, !432, !508, !508, !508, !432, !432, !508, !508, !508, !191, !493, !493, !137, !508, !199}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !306, file: !47, line: 89, baseType: !523, size: 64, offset: 3200)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!98, !298, !191, !489, !495, !333, !190}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !306, file: !47, line: 90, baseType: !527, size: 64, offset: 3264)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!98, !298, !191, !530, !495, !333, !493, !190}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!98, !137, !191, !493, !493, !137, !199, !77}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !306, file: !47, line: 91, baseType: !523, size: 64, offset: 3328)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !306, file: !47, line: 93, baseType: !536, size: 64, offset: 3392)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!98, !298, !298, !391, !391}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !300, file: !47, line: 204, baseType: !540, size: 6400, offset: 7936)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 6400, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 100)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !300, file: !47, line: 204, baseType: !540, size: 6400, offset: 14336)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !300, file: !47, line: 205, baseType: !540, size: 6400, offset: 20736)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !300, file: !47, line: 205, baseType: !540, size: 6400, offset: 27136)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !300, file: !47, line: 206, baseType: !547, size: 64, offset: 33536)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !550)
!550 = !{!551, !552, !553, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !549, file: !47, line: 143, baseType: !333, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !549, file: !47, line: 144, baseType: !164, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !549, file: !47, line: 145, baseType: !554, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !47, line: 146, baseType: !547, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !300, file: !47, line: 207, baseType: !547, size: 64, offset: 33600)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !300, file: !47, line: 208, baseType: !558, size: 64, offset: 33664)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !560, file: !47, line: 151, baseType: !248, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !560, file: !47, line: 152, baseType: !77, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !47, line: 153, baseType: !558, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !300, file: !47, line: 208, baseType: !558, size: 64, offset: 33728)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !300, file: !47, line: 209, baseType: !567, size: 64, offset: 33792)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !569, file: !47, line: 159, baseType: !409, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !569, file: !47, line: 160, baseType: !252, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !47, line: 161, baseType: !568, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !300, file: !47, line: 210, baseType: !409, size: 64, offset: 33856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !300, file: !47, line: 211, baseType: !409, size: 64, offset: 33920)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !300, file: !47, line: 212, baseType: !77, size: 64, offset: 33984)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !300, file: !47, line: 213, baseType: !578, size: 64, offset: 34048)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!98, !495}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !300, file: !47, line: 214, baseType: !364, size: 32, offset: 34112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !300, file: !47, line: 215, baseType: !583, size: 64, offset: 34176)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !375, line: 1378, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !375, line: 1378, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !300, file: !47, line: 216, baseType: !587, size: 64, offset: 34240)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !334, line: 83, baseType: !78)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !300, file: !47, line: 217, baseType: !589, size: 64, offset: 34304)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !375, line: 25, baseType: !78)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !300, file: !47, line: 218, baseType: !137, size: 32, offset: 34368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !300, file: !47, line: 219, baseType: !592, size: 64, offset: 34432)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !348, line: 30, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !348, line: 30, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !300, file: !47, line: 220, baseType: !252, size: 32, offset: 34496)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !300, file: !47, line: 221, baseType: !252, size: 32, offset: 34528)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !300, file: !47, line: 222, baseType: !137, size: 32, offset: 34560)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !300, file: !47, line: 222, baseType: !137, size: 32, offset: 34592)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !300, file: !47, line: 223, baseType: !252, size: 32, offset: 34624)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !300, file: !47, line: 224, baseType: !252, size: 32, offset: 34656)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !47, line: 225, baseType: !77, size: 64, offset: 34688)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !300, file: !47, line: 227, baseType: !298, size: 64, offset: 34752)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !300, file: !47, line: 228, baseType: !298, size: 64, offset: 34816)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !300, file: !47, line: 229, baseType: !605, size: 64, offset: 34880)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !608)
!608 = !{!609, !613, !617, !618}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !607, file: !47, line: 102, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!98, !298, !298, !77}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !607, file: !47, line: 103, baseType: !614, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!98, !298, !374, !333, !374, !298, !77}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !607, file: !47, line: 104, baseType: !77, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !47, line: 105, baseType: !605, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !300, file: !47, line: 230, baseType: !620, size: 64, offset: 34944)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !623)
!623 = !{!624, !625, !629, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !622, file: !47, line: 110, baseType: !610, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !622, file: !47, line: 111, baseType: !626, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!98, !298, !374, !298, !77}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !622, file: !47, line: 112, baseType: !77, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !622, file: !47, line: 113, baseType: !620, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !300, file: !47, line: 231, baseType: !632, size: 64, offset: 35008)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !635)
!635 = !{!636, !637, !641, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !634, file: !47, line: 118, baseType: !610, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !634, file: !47, line: 119, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!98, !298, !453, !453, !298, !77}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !634, file: !47, line: 120, baseType: !77, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !634, file: !47, line: 121, baseType: !632, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !300, file: !47, line: 232, baseType: !644, size: 64, offset: 35072)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !647)
!647 = !{!648, !652, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !646, file: !47, line: 126, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!98, !298, !333, !417, !333, !77}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !646, file: !47, line: 127, baseType: !649, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !646, file: !47, line: 128, baseType: !77, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !646, file: !47, line: 129, baseType: !644, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !300, file: !47, line: 233, baseType: !656, size: 64, offset: 35136)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !658, file: !47, line: 134, baseType: !649, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !658, file: !47, line: 135, baseType: !649, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !658, file: !47, line: 136, baseType: !77, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !47, line: 137, baseType: !656, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !300, file: !47, line: 235, baseType: !137, size: 32, offset: 35200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !300, file: !47, line: 237, baseType: !666, size: 64, offset: 35264)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !670)
!670 = !{!671, !675, !676, !677, !678, !680, !687}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !669, file: !47, line: 27, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !673, line: 166, baseType: !674)
!673 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !673, line: 139, baseType: !5)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !47, line: 27, baseType: !672, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !669, file: !47, line: 27, baseType: !672, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !669, file: !47, line: 27, baseType: !672, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !47, line: 27, baseType: !679, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !669, file: !47, line: 27, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !683, file: !47, line: 19, baseType: !409, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !683, file: !47, line: 20, baseType: !137, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !669, file: !47, line: 27, baseType: !332, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !300, file: !47, line: 239, baseType: !455, size: 64, offset: 35328)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !300, file: !47, line: 240, baseType: !455, size: 64, offset: 35392)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !300, file: !47, line: 241, baseType: !455, size: 64, offset: 35456)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !300, file: !47, line: 242, baseType: !455, size: 64, offset: 35520)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !300, file: !47, line: 243, baseType: !252, size: 32, offset: 35584)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !300, file: !47, line: 245, baseType: !694, size: 64, offset: 35616)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !213)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !300, file: !47, line: 246, baseType: !696, size: 64, offset: 35712)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !697, line: 18, baseType: !698)
!697 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !700, line: 29, size: 5760, elements: !701)
!700 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!701 = !{!702, !703, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !749, !750, !751}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !699, file: !700, line: 30, baseType: !303, size: 4480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !699, file: !700, line: 30, baseType: !704, size: 32, offset: 4480)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !133)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !699, file: !700, line: 31, baseType: !137, size: 32, offset: 4512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !699, file: !700, line: 31, baseType: !137, size: 32, offset: 4544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !699, file: !700, line: 32, baseType: !347, size: 64, offset: 4608)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !699, file: !700, line: 33, baseType: !252, size: 32, offset: 4672)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !699, file: !700, line: 34, baseType: !252, size: 32, offset: 4704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !699, file: !700, line: 35, baseType: !182, size: 64, offset: 4736)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !699, file: !700, line: 36, baseType: !182, size: 64, offset: 4800)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !699, file: !700, line: 37, baseType: !137, size: 32, offset: 4864)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !699, file: !700, line: 38, baseType: !696, size: 64, offset: 4928)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !699, file: !700, line: 39, baseType: !182, size: 64, offset: 4992)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !699, file: !700, line: 40, baseType: !252, size: 32, offset: 5056)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !699, file: !700, line: 42, baseType: !137, size: 32, offset: 5088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !699, file: !700, line: 43, baseType: !344, size: 64, offset: 5120)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !699, file: !700, line: 44, baseType: !182, size: 64, offset: 5184)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !699, file: !700, line: 45, baseType: !720, size: 64, offset: 5248)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !699, file: !700, line: 46, baseType: !252, size: 32, offset: 5312)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !699, file: !700, line: 47, baseType: !343, size: 64, offset: 5376)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !699, file: !700, line: 49, baseType: !81, size: 64, offset: 5440)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !699, file: !700, line: 50, baseType: !725, size: 64, offset: 5504)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !700, line: 27, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !700, line: 27, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !700, line: 27, size: 320, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !742}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !728, file: !700, line: 27, baseType: !672, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !728, file: !700, line: 27, baseType: !672, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !728, file: !700, line: 27, baseType: !672, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !728, file: !700, line: 27, baseType: !672, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !728, file: !700, line: 27, baseType: !679, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !728, file: !700, line: 27, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !700, line: 10, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !700, line: 8, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !738, file: !700, line: 9, baseType: !137, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !738, file: !700, line: 9, baseType: !137, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !728, file: !700, line: 27, baseType: !743, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !700, line: 14, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !700, line: 12, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !745, file: !700, line: 13, baseType: !182, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !745, file: !700, line: 13, baseType: !182, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !699, file: !700, line: 51, baseType: !696, size: 64, offset: 5568)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !699, file: !700, line: 52, baseType: !347, size: 64, offset: 5632)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !699, file: !700, line: 53, baseType: !752, size: 64, offset: 5696)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !697, line: 33, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !700, line: 72, size: 4864, elements: !755)
!755 = !{!756, !757, !775, !776, !785}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !754, file: !700, line: 73, baseType: !303, size: 4480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !754, file: !700, line: 73, baseType: !758, size: 192, offset: 4480)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 192, elements: !133)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !700, line: 56, size: 192, elements: !760)
!760 = !{!761, !767, !771}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !759, file: !700, line: 57, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!98, !752, !696, !137, !432, !765, !766}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !759, file: !700, line: 58, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!98, !752}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !759, file: !700, line: 59, baseType: !772, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!98, !752, !104}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !700, line: 74, baseType: !77, size: 64, offset: 4672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !754, file: !700, line: 75, baseType: !777, size: 64, offset: 4736)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !700, line: 62, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !700, line: 64, size: 256, elements: !780)
!780 = !{!781, !782, !783, !784}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !700, line: 66, baseType: !777, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !779, file: !700, line: 67, baseType: !765, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !779, file: !700, line: 68, baseType: !766, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !779, file: !700, line: 69, baseType: !137, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !754, file: !700, line: 76, baseType: !777, size: 64, offset: 4800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !300, file: !47, line: 247, baseType: !696, size: 64, offset: 35776)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !300, file: !47, line: 248, baseType: !788, size: 64, offset: 35840)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !348, line: 60, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !790, file: !25, line: 241, baseType: !73, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !790, file: !25, line: 242, baseType: !154, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !790, file: !25, line: 243, baseType: !137, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !790, file: !25, line: 243, baseType: !137, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !790, file: !25, line: 244, baseType: !137, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !790, file: !25, line: 244, baseType: !137, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !790, file: !25, line: 245, baseType: !182, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !790, file: !25, line: 246, baseType: !252, size: 32, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !790, file: !25, line: 247, baseType: !137, size: 32, offset: 352)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !790, file: !25, line: 251, baseType: !137, size: 32, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !790, file: !25, line: 252, baseType: !592, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !790, file: !25, line: 253, baseType: !252, size: 32, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !790, file: !25, line: 254, baseType: !137, size: 32, offset: 544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !790, file: !25, line: 254, baseType: !137, size: 32, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !790, file: !25, line: 255, baseType: !137, size: 32, offset: 608)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !300, file: !47, line: 250, baseType: !696, size: 64, offset: 35904)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !300, file: !47, line: 251, baseType: !374, size: 64, offset: 35968)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !300, file: !47, line: 253, baseType: !298, size: 64, offset: 36032)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !300, file: !47, line: 254, baseType: !333, size: 64, offset: 36096)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !300, file: !47, line: 255, baseType: !77, size: 64, offset: 36160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !300, file: !47, line: 256, baseType: !813, size: 64, offset: 36224)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!98, !298, !77}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !300, file: !47, line: 257, baseType: !813, size: 64, offset: 36288)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !300, file: !47, line: 258, baseType: !818, size: 64, offset: 36352)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!98, !298, !493, !252, !766, !77}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !300, file: !47, line: 260, baseType: !137, size: 32, offset: 36416)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !300, file: !47, line: 261, baseType: !298, size: 64, offset: 36480)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !300, file: !47, line: 262, baseType: !333, size: 64, offset: 36544)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !300, file: !47, line: 263, baseType: !333, size: 64, offset: 36608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !300, file: !47, line: 264, baseType: !252, size: 32, offset: 36672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !300, file: !47, line: 265, baseType: !357, size: 64, offset: 36736)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !300, file: !47, line: 266, baseType: !190, size: 64, offset: 36800)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !300, file: !47, line: 266, baseType: !190, size: 64, offset: 36864)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !300, file: !47, line: 267, baseType: !830, size: 64, offset: 36928)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !300, file: !47, line: 269, baseType: !833, size: 640, offset: 36992)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 640, elements: !842)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!98, !298, !137, !137, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !375, line: 1723, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !375, line: 1723, flags: DIFlagFwdDecl)
!842 = !{!843}
!843 = !DISubrange(count: 10)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !300, file: !47, line: 270, baseType: !833, size: 640, offset: 37632)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !300, file: !47, line: 272, baseType: !137, size: 32, offset: 38272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !300, file: !47, line: 273, baseType: !847, size: 64, offset: 38336)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !849, file: !47, line: 174, baseType: !81, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !849, file: !47, line: 175, baseType: !409, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !849, file: !47, line: 176, baseType: !694, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !849, file: !47, line: 177, baseType: !252, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !300, file: !47, line: 274, baseType: !856, size: 64, offset: 38400)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !859)
!859 = !{!860, !941, !942}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !858, file: !47, line: 168, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !862, line: 11, baseType: !863)
!862 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !862, line: 13, size: 832, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !932, !934, !935, !936, !937, !938, !939, !940}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !864, file: !862, line: 14, baseType: !78, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !864, file: !862, line: 15, baseType: !409, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !864, file: !862, line: 16, baseType: !78, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !864, file: !862, line: 17, baseType: !137, size: 32, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !864, file: !862, line: 18, baseType: !182, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !864, file: !862, line: 19, baseType: !872, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !873, line: 22, baseType: !874)
!873 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !862, line: 81, size: 4992, elements: !876)
!876 = !{!877, !878, !892, !893, !894, !903}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !875, file: !862, line: 82, baseType: !303, size: 4480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !875, file: !862, line: 82, baseType: !879, size: 256, offset: 4480)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 256, elements: !133)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !862, line: 74, size: 256, elements: !881)
!881 = !{!882, !886, !887, !891}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !880, file: !862, line: 75, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!98, !872}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !880, file: !862, line: 76, baseType: !883, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !880, file: !862, line: 77, baseType: !888, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!98, !872, !104}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !880, file: !862, line: 78, baseType: !883, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !875, file: !862, line: 83, baseType: !77, size: 64, offset: 4736)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !875, file: !862, line: 85, baseType: !137, size: 32, offset: 4800)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !875, file: !862, line: 86, baseType: !895, size: 64, offset: 4864)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !862, line: 41, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !862, line: 36, size: 256, elements: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !897, file: !862, line: 37, baseType: !248, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !897, file: !862, line: 38, baseType: !248, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !897, file: !862, line: 39, baseType: !248, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !897, file: !862, line: 40, baseType: !164, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !875, file: !862, line: 87, baseType: !904, size: 64, offset: 4928)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !862, line: 54, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !862, line: 54, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !862, line: 54, size: 320, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !924}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !908, file: !862, line: 54, baseType: !672, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !908, file: !862, line: 54, baseType: !672, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !908, file: !862, line: 54, baseType: !672, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !908, file: !862, line: 54, baseType: !672, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !908, file: !862, line: 54, baseType: !679, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !908, file: !862, line: 54, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !873, line: 41, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !873, line: 35, size: 192, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !918, file: !873, line: 37, baseType: !409, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !918, file: !873, line: 38, baseType: !137, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !918, file: !873, line: 39, baseType: !137, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !918, file: !873, line: 40, baseType: !137, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !908, file: !862, line: 54, baseType: !925, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !862, line: 34, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !862, line: 30, size: 96, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !927, file: !862, line: 31, baseType: !137, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !927, file: !862, line: 32, baseType: !137, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !927, file: !862, line: 33, baseType: !137, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !864, file: !862, line: 20, baseType: !933, size: 32, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !864, file: !862, line: 21, baseType: !137, size: 32, offset: 416)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !864, file: !862, line: 22, baseType: !137, size: 32, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !864, file: !862, line: 23, baseType: !182, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !864, file: !862, line: 24, baseType: !125, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !864, file: !862, line: 25, baseType: !125, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !864, file: !862, line: 26, baseType: !77, size: 64, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !864, file: !862, line: 27, baseType: !861, size: 64, offset: 768)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !858, file: !47, line: 169, baseType: !409, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !47, line: 170, baseType: !856, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !300, file: !47, line: 275, baseType: !137, size: 32, offset: 38464)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !300, file: !47, line: 276, baseType: !945, size: 64, offset: 38528)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !948)
!948 = !{!949, !1030, !1031}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !947, file: !47, line: 181, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !873, line: 13, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !862, line: 98, size: 7232, elements: !953)
!953 = !{!954, !955, !969, !970, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !986, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !952, file: !862, line: 99, baseType: !303, size: 4480)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !952, file: !862, line: 99, baseType: !956, size: 256, offset: 4480)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, elements: !133)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !862, line: 91, size: 256, elements: !958)
!958 = !{!959, !963, !964, !968}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !957, file: !862, line: 92, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!98, !950}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !957, file: !862, line: 93, baseType: !960, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !957, file: !862, line: 94, baseType: !965, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!98, !950, !104}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !957, file: !862, line: 95, baseType: !960, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !952, file: !862, line: 100, baseType: !77, size: 64, offset: 4736)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !952, file: !862, line: 101, baseType: !971, size: 64, offset: 4800)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !952, file: !862, line: 102, baseType: !252, size: 32, offset: 4864)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !952, file: !862, line: 103, baseType: !252, size: 32, offset: 4896)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !952, file: !862, line: 104, baseType: !137, size: 32, offset: 4928)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !952, file: !862, line: 105, baseType: !137, size: 32, offset: 4960)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !952, file: !862, line: 106, baseType: !112, size: 64, offset: 4992)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !952, file: !862, line: 108, baseType: !861, size: 64, offset: 5056)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !952, file: !862, line: 109, baseType: !252, size: 32, offset: 5120)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !952, file: !862, line: 110, baseType: !391, size: 64, offset: 5184)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !952, file: !862, line: 111, baseType: !182, size: 64, offset: 5248)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !952, file: !862, line: 112, baseType: !872, size: 64, offset: 5312)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !952, file: !862, line: 113, baseType: !983, size: 64, offset: 5376)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !985, line: 563, baseType: !505)
!985 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!986 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !952, file: !862, line: 114, baseType: !987, size: 64, offset: 5440)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !985, line: 580, baseType: !490)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !952, file: !862, line: 115, baseType: !495, size: 64, offset: 5504)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !952, file: !862, line: 116, baseType: !987, size: 64, offset: 5568)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !952, file: !862, line: 117, baseType: !495, size: 64, offset: 5632)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !952, file: !862, line: 118, baseType: !137, size: 32, offset: 5696)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !952, file: !862, line: 119, baseType: !199, size: 64, offset: 5760)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !952, file: !862, line: 120, baseType: !495, size: 64, offset: 5824)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !952, file: !862, line: 122, baseType: !137, size: 32, offset: 5888)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !952, file: !862, line: 123, baseType: !137, size: 32, offset: 5920)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !952, file: !862, line: 124, baseType: !182, size: 64, offset: 5952)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !952, file: !862, line: 125, baseType: !182, size: 64, offset: 6016)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !952, file: !862, line: 126, baseType: !182, size: 64, offset: 6080)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !952, file: !862, line: 127, baseType: !182, size: 64, offset: 6144)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !952, file: !862, line: 128, baseType: !1002, size: 64, offset: 6208)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1004, line: 481, baseType: !1005)
!1004 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1004, line: 469, size: 256, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1006, file: !1004, line: 470, baseType: !137, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1006, file: !1004, line: 471, baseType: !137, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1006, file: !1004, line: 472, baseType: !137, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1006, file: !1004, line: 473, baseType: !137, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1006, file: !1004, line: 474, baseType: !137, size: 32, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !1006, file: !1004, line: 475, baseType: !137, size: 32, offset: 160)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !1006, file: !1004, line: 476, baseType: !193, size: 64, offset: 192)
