; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagstencil.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagstencil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!66 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!67 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 16, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmstag.h", directory: "/home/users/ndemeye/xSDK")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!71 = !DIEnumerator(name: "DMSTAG_NULL_LOCATION", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_LEFT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "DMSTAG_BACK_DOWN", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_RIGHT", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "DMSTAG_BACK_LEFT", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "DMSTAG_BACK", value: 5, isUnsigned: true)
!77 = !DIEnumerator(name: "DMSTAG_BACK_RIGHT", value: 6, isUnsigned: true)
!78 = !DIEnumerator(name: "DMSTAG_BACK_UP_LEFT", value: 7, isUnsigned: true)
!79 = !DIEnumerator(name: "DMSTAG_BACK_UP", value: 8, isUnsigned: true)
!80 = !DIEnumerator(name: "DMSTAG_BACK_UP_RIGHT", value: 9, isUnsigned: true)
!81 = !DIEnumerator(name: "DMSTAG_DOWN_LEFT", value: 10, isUnsigned: true)
!82 = !DIEnumerator(name: "DMSTAG_DOWN", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "DMSTAG_DOWN_RIGHT", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "DMSTAG_LEFT", value: 13, isUnsigned: true)
!85 = !DIEnumerator(name: "DMSTAG_ELEMENT", value: 14, isUnsigned: true)
!86 = !DIEnumerator(name: "DMSTAG_RIGHT", value: 15, isUnsigned: true)
!87 = !DIEnumerator(name: "DMSTAG_UP_LEFT", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "DMSTAG_UP", value: 17, isUnsigned: true)
!89 = !DIEnumerator(name: "DMSTAG_UP_RIGHT", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_LEFT", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN", value: 20, isUnsigned: true)
!92 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_RIGHT", value: 21, isUnsigned: true)
!93 = !DIEnumerator(name: "DMSTAG_FRONT_LEFT", value: 22, isUnsigned: true)
!94 = !DIEnumerator(name: "DMSTAG_FRONT", value: 23, isUnsigned: true)
!95 = !DIEnumerator(name: "DMSTAG_FRONT_RIGHT", value: 24, isUnsigned: true)
!96 = !DIEnumerator(name: "DMSTAG_FRONT_UP_LEFT", value: 25, isUnsigned: true)
!97 = !DIEnumerator(name: "DMSTAG_FRONT_UP", value: 26, isUnsigned: true)
!98 = !DIEnumerator(name: "DMSTAG_FRONT_UP_RIGHT", value: 27, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 75, baseType: !7, size: 32, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIEnumerator(name: "DMSTAG_STENCIL_NONE", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "DMSTAG_STENCIL_STAR", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "DMSTAG_STENCIL_BOX", value: 2, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 663, baseType: !7, size: 32, elements: !106)
!105 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!112 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!130 = !{!131, !186, !190, !191, !160, !354}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Stag", file: !133, line: 47, baseType: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmstagimpl.h", directory: "/home/users/ndemeye/xSDK")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 13, size: 1792, elements: !135)
!135 = !{!136, !142, !143, !146, !150, !152, !153, !156, !157, !163, !164, !165, !166, !169, !171, !177, !178, !179, !180, !181, !182, !185}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !134, file: !133, line: 16, baseType: !137, size: 96)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !140)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !139)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !134, file: !133, line: 17, baseType: !137, size: 96, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !134, file: !133, line: 18, baseType: !144, size: 192, offset: 192)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !140)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !134, file: !133, line: 19, baseType: !147, size: 128, offset: 384)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "stencilType", scope: !134, file: !133, line: 20, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMStagStencilType", file: !69, line: 75, baseType: !99)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "stencilWidth", scope: !134, file: !133, line: 21, baseType: !138, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "boundaryType", scope: !134, file: !133, line: 22, baseType: !154, size: 96, offset: 576)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 96, elements: !140)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !43, line: 42, baseType: !53)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nRanks", scope: !134, file: !133, line: 23, baseType: !137, size: 96, offset: 672)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDMType", scope: !134, file: !133, line: 26, baseType: !158, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMType", file: !159, line: 26, baseType: !160)
!159 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nGhost", scope: !134, file: !133, line: 31, baseType: !137, size: 96, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !134, file: !133, line: 32, baseType: !137, size: 96, offset: 928)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "startGhost", scope: !134, file: !133, line: 33, baseType: !137, size: 96, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !134, file: !133, line: 34, baseType: !167, size: 96, offset: 1120)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 96, elements: !140)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !139)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !134, file: !133, line: 35, baseType: !170, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !134, file: !133, line: 36, baseType: !172, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !173, line: 59, baseType: !174)
!173 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !173, line: 15, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !173, line: 15, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ltog_injective", scope: !134, file: !133, line: 37, baseType: !172, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "locationOffsets", scope: !134, file: !133, line: 38, baseType: !145, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "entriesPerElement", scope: !134, file: !133, line: 41, baseType: !138, size: 32, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !134, file: !133, line: 42, baseType: !138, size: 32, offset: 1504)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "entriesGhost", scope: !134, file: !133, line: 43, baseType: !138, size: 32, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "firstRank", scope: !134, file: !133, line: 44, baseType: !183, size: 96, offset: 1568)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 96, elements: !140)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "lastRank", scope: !134, file: !133, line: 45, baseType: !183, size: 96, offset: 1664)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !187, line: 330, baseType: !188)
!187 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !187, line: 330, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !194, line: 73, size: 4480, elements: !195)
!194 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!195 = !{!196, !198, !244, !245, !246, !249, !250, !251, !252, !260, !261, !262, !266, !270, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !283, !284, !285, !287, !288, !289, !291, !292, !293, !294, !295, !298, !300, !301, !302, !303, !304, !307, !309, !310, !311, !321, !323, !324, !328, !329, !377, !382, !384, !385, !386}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !193, file: !194, line: 74, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !139)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !193, file: !194, line: 75, baseType: !199, size: 448, offset: 64)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 448, elements: !242)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !194, line: 53, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 45, size: 448, elements: !202)
!202 = !{!203, !209, !217, !222, !226, !230, !237}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !201, file: !194, line: 46, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !191, !208}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !139)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !201, file: !194, line: 47, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!207, !191, !213}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !214, line: 16, baseType: !215)
!214 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !214, line: 16, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !201, file: !194, line: 48, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!207, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !201, file: !194, line: 49, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!207, !191, !160, !191}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !201, file: !194, line: 50, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!207, !191, !160, !221}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !201, file: !194, line: 51, baseType: !231, size: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!207, !191, !160, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !201, file: !194, line: 52, baseType: !238, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!207, !191, !160, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!242 = !{!243}
!243 = !DISubrange(count: 1)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !193, file: !194, line: 76, baseType: !186, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !193, file: !194, line: 77, baseType: !138, size: 32, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !193, file: !194, line: 78, baseType: !247, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !248)
!248 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !193, file: !194, line: 78, baseType: !247, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !193, file: !194, line: 78, baseType: !247, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !193, file: !194, line: 78, baseType: !247, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !193, file: !194, line: 79, baseType: !253, size: 64, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !256, line: 27, baseType: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !258, line: 43, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!259 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !193, file: !194, line: 80, baseType: !138, size: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !193, file: !194, line: 81, baseType: !168, size: 32, offset: 992)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !193, file: !194, line: 82, baseType: !263, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !193, file: !194, line: 83, baseType: !267, size: 64, offset: 1088)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !193, file: !194, line: 84, baseType: !271, size: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !193, file: !194, line: 85, baseType: !271, size: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !193, file: !194, line: 86, baseType: !271, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !193, file: !194, line: 87, baseType: !271, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !193, file: !194, line: 88, baseType: !191, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !193, file: !194, line: 89, baseType: !253, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !194, line: 90, baseType: !271, size: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !193, file: !194, line: 91, baseType: !271, size: 64, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !193, file: !194, line: 92, baseType: !138, size: 32, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !193, file: !194, line: 93, baseType: !190, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !193, file: !194, line: 94, baseType: !282, size: 64, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !254)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !193, file: !194, line: 95, baseType: !138, size: 32, offset: 1856)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !193, file: !194, line: 95, baseType: !138, size: 32, offset: 1888)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !193, file: !194, line: 96, baseType: !286, size: 64, offset: 1920)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !193, file: !194, line: 96, baseType: !286, size: 64, offset: 1984)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !193, file: !194, line: 97, baseType: !145, size: 64, offset: 2048)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !193, file: !194, line: 97, baseType: !290, size: 64, offset: 2112)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !193, file: !194, line: 98, baseType: !138, size: 32, offset: 2176)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !193, file: !194, line: 98, baseType: !138, size: 32, offset: 2208)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !193, file: !194, line: 99, baseType: !286, size: 64, offset: 2240)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !193, file: !194, line: 99, baseType: !286, size: 64, offset: 2304)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !193, file: !194, line: 100, baseType: !296, size: 64, offset: 2368)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !248)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !193, file: !194, line: 100, baseType: !299, size: 64, offset: 2432)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !193, file: !194, line: 101, baseType: !138, size: 32, offset: 2496)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !193, file: !194, line: 101, baseType: !138, size: 32, offset: 2528)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !193, file: !194, line: 102, baseType: !286, size: 64, offset: 2560)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !193, file: !194, line: 102, baseType: !286, size: 64, offset: 2624)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !193, file: !194, line: 103, baseType: !305, size: 64, offset: 2688)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !297)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !193, file: !194, line: 103, baseType: !308, size: 64, offset: 2752)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !193, file: !194, line: 104, baseType: !241, size: 64, offset: 2816)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !193, file: !194, line: 105, baseType: !138, size: 32, offset: 2880)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !193, file: !194, line: 106, baseType: !312, size: 128, offset: 2944)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 128, elements: !319)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !194, line: 64, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 61, size: 128, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !315, file: !194, line: 62, baseType: !234, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !315, file: !194, line: 63, baseType: !190, size: 64, offset: 64)
!319 = !{!320}
!320 = !DISubrange(count: 2)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !193, file: !194, line: 107, baseType: !322, size: 64, offset: 3072)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !319)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !193, file: !194, line: 108, baseType: !190, size: 64, offset: 3136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !193, file: !194, line: 109, baseType: !325, size: 64, offset: 3200)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!207, !190}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !193, file: !194, line: 111, baseType: !138, size: 32, offset: 3264)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !193, file: !194, line: 112, baseType: !330, size: 320, offset: 3328)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 320, elements: !375)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!207, !334, !191, !190}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !337)
!337 = !{!338, !339, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !12, line: 100, baseType: !138, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !12, line: 101, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !351, !352, !353, !357, !358, !360, !361, !362}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !342, file: !12, line: 84, baseType: !271, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !342, file: !12, line: 85, baseType: !271, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !12, line: 86, baseType: !190, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !342, file: !12, line: 87, baseType: !263, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !342, file: !12, line: 88, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !342, file: !12, line: 89, baseType: !162, size: 8, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !342, file: !12, line: 90, baseType: !271, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !342, file: !12, line: 91, baseType: !354, size: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !355, line: 46, baseType: !356)
!355 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!356 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !342, file: !12, line: 92, baseType: !184, size: 32, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !12, line: 93, baseType: !359, size: 32, offset: 544)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !12, line: 94, baseType: !340, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !342, file: !12, line: 95, baseType: !271, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !342, file: !12, line: 96, baseType: !190, size: 64, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !336, file: !12, line: 102, baseType: !271, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !336, file: !12, line: 102, baseType: !271, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !336, file: !12, line: 103, baseType: !271, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !336, file: !12, line: 104, baseType: !186, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !336, file: !12, line: 105, baseType: !184, size: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !336, file: !12, line: 105, baseType: !184, size: 32, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !336, file: !12, line: 105, baseType: !184, size: 32, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !336, file: !12, line: 106, baseType: !191, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !336, file: !12, line: 107, baseType: !372, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!375 = !{!376}
!376 = !DISubrange(count: 5)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !193, file: !194, line: 113, baseType: !378, size: 320, offset: 3648)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 320, elements: !375)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!207, !191, !190}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !193, file: !194, line: 114, baseType: !383, size: 320, offset: 3968)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 320, elements: !375)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !193, file: !194, line: 115, baseType: !184, size: 32, offset: 4288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !193, file: !194, line: 120, baseType: !372, size: 64, offset: 4352)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !193, file: !194, line: 121, baseType: !184, size: 32, offset: 4416)
!387 = !{!0, !388}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "DMStagStencilLocations", scope: !2, file: !390, line: 8, type: !391, isLocal: false, isDefinition: true)
!390 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagstencil.c", directory: "/home/users/ndemeye/xSDK")
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 1792, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 28)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 384, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 6)
!397 = !{i32 7, !"Dwarf Version", i32 4}
!398 = !{i32 2, !"Debug Info Version", i32 3}
!399 = !{i32 1, !"wchar_size", i32 4}
!400 = !{i32 7, !"PIC Level", i32 2}
!401 = !{i32 7, !"uwtable", i32 1}
!402 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!403 = distinct !DISubprogram(name: "DMStagGetLocationDOF", scope: !390, file: !390, line: 25, type: !404, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1148)
!404 = !DISubroutineType(types: !405)
!405 = !{!207, !406, !1147, !145}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !43, line: 14, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !49, line: 202, size: 40000, elements: !409)
!409 = !{!410, !412, !643, !647, !648, !649, !650, !660, !661, !669, !670, !678, !679, !680, !681, !685, !686, !690, !692, !694, !695, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !723, !735, !747, !759, !768, !769, !792, !793, !794, !795, !796, !797, !799, !890, !891, !911, !912, !913, !914, !915, !916, !920, !921, !925, !926, !927, !928, !929, !930, !931, !932, !933, !935, !947, !948, !949, !958, !1046, !1047, !1135, !1136, !1137, !1138, !1140, !1142, !1143, !1144, !1145, !1146}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !408, file: !49, line: 203, baseType: !411, size: 4480)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !194, line: 122, baseType: !193)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !408, file: !49, line: 203, baseType: !413, size: 3456, offset: 4480)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 3456, elements: !242)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !49, line: 30, size: 3456, elements: !415)
!415 = !{!416, !420, !421, !426, !430, !434, !435, !436, !445, !446, !447, !459, !460, !468, !477, !486, !490, !494, !495, !500, !501, !505, !506, !510, !511, !519, !523, !528, !529, !530, !531, !532, !533, !534, !538, !544, !548, !553, !557, !563, !567, !572, !579, !583, !584, !589, !600, !604, !614, !618, !626, !630, !638, !639}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !414, file: !49, line: 31, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!207, !406, !213}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !414, file: !49, line: 32, baseType: !417, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !414, file: !49, line: 33, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!207, !406, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !414, file: !49, line: 34, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!207, !334, !406}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !414, file: !49, line: 35, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!207, !406}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !414, file: !49, line: 36, baseType: !431, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !414, file: !49, line: 37, baseType: !431, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !414, file: !49, line: 38, baseType: !437, size: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!207, !406, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !442, line: 21, baseType: !443)
!442 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !442, line: 21, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !414, file: !49, line: 39, baseType: !437, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !414, file: !49, line: 40, baseType: !431, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !414, file: !49, line: 41, baseType: !448, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!207, !406, !145, !451, !453}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !456, line: 11, baseType: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !456, line: 11, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !414, file: !49, line: 42, baseType: !422, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !414, file: !49, line: 43, baseType: !461, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!207, !406, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !43, line: 165, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !43, line: 165, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !414, file: !49, line: 45, baseType: !469, size: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!207, !406, !472, !473}
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !27, line: 213, baseType: !26)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !456, line: 51, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !456, line: 51, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !414, file: !49, line: 46, baseType: !478, size: 64, offset: 896)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!207, !406, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !483, line: 16, baseType: !484)
!483 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !483, line: 16, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !414, file: !49, line: 47, baseType: !487, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!207, !406, !406, !481, !440}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !414, file: !49, line: 48, baseType: !491, size: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!207, !406, !406, !481}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !414, file: !49, line: 49, baseType: !491, size: 64, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !414, file: !49, line: 50, baseType: !496, size: 64, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!207, !406, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !414, file: !49, line: 51, baseType: !491, size: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !414, file: !49, line: 53, baseType: !502, size: 64, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!207, !406, !186, !425}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !414, file: !49, line: 54, baseType: !502, size: 64, offset: 1344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !414, file: !49, line: 55, baseType: !507, size: 64, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!207, !406, !138, !425}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !414, file: !49, line: 56, baseType: !507, size: 64, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !414, file: !49, line: 57, baseType: !512, size: 64, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!207, !406, !515, !425}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !516, line: 12, baseType: !517)
!516 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !516, line: 12, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !414, file: !49, line: 58, baseType: !520, size: 64, offset: 1600)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!207, !406, !441, !515, !425}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !414, file: !49, line: 60, baseType: !524, size: 64, offset: 1664)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!207, !406, !441, !527, !441}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !31)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !414, file: !49, line: 61, baseType: !524, size: 64, offset: 1728)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !414, file: !49, line: 62, baseType: !524, size: 64, offset: 1792)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !414, file: !49, line: 63, baseType: !524, size: 64, offset: 1856)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !414, file: !49, line: 64, baseType: !524, size: 64, offset: 1920)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !414, file: !49, line: 65, baseType: !524, size: 64, offset: 1984)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !414, file: !49, line: 67, baseType: !431, size: 64, offset: 2048)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !414, file: !49, line: 69, baseType: !535, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!207, !406, !441, !441}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !414, file: !49, line: 71, baseType: !539, size: 64, offset: 2176)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!207, !406, !138, !542, !454, !425}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !414, file: !49, line: 72, baseType: !545, size: 64, offset: 2240)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!207, !425, !138, !453, !425}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !414, file: !49, line: 73, baseType: !549, size: 64, offset: 2304)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!207, !406, !145, !451, !453, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !414, file: !49, line: 74, baseType: !554, size: 64, offset: 2368)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!207, !406, !145, !451, !453, !453, !552}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !414, file: !49, line: 75, baseType: !558, size: 64, offset: 2432)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!207, !406, !138, !425, !561, !561, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !414, file: !49, line: 77, baseType: !564, size: 64, offset: 2496)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!207, !406, !138, !145, !145}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !414, file: !49, line: 78, baseType: !568, size: 64, offset: 2560)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!207, !406, !441, !571, !174}
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !43, line: 74, baseType: !42)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !414, file: !49, line: 79, baseType: !573, size: 64, offset: 2624)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!207, !406, !145, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !414, file: !49, line: 80, baseType: !580, size: 64, offset: 2688)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!207, !406, !296, !296}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !414, file: !49, line: 81, baseType: !580, size: 64, offset: 2752)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !414, file: !49, line: 82, baseType: !585, size: 64, offset: 2816)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!207, !406, !441, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !414, file: !49, line: 84, baseType: !590, size: 64, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!207, !406, !297, !593, !599, !527, !441}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!207, !138, !297, !597, !138, !305, !190}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !414, file: !49, line: 85, baseType: !601, size: 64, offset: 2944)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!207, !406, !297, !515, !138, !542, !138, !542, !593, !599, !527, !441}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !414, file: !49, line: 86, baseType: !605, size: 64, offset: 3008)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!207, !406, !297, !441, !608, !527, !441}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !138, !138, !138, !542, !542, !612, !612, !612, !542, !542, !612, !612, !612, !297, !597, !138, !612, !305}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !414, file: !49, line: 87, baseType: !615, size: 64, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!207, !406, !297, !515, !138, !542, !138, !542, !441, !608, !527, !441}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !414, file: !49, line: 88, baseType: !619, size: 64, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!207, !406, !297, !515, !138, !542, !138, !542, !441, !622, !527, !441}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !138, !138, !138, !542, !542, !612, !612, !612, !542, !542, !612, !612, !612, !297, !597, !597, !138, !612, !305}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !414, file: !49, line: 89, baseType: !627, size: 64, offset: 3200)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!207, !406, !297, !593, !599, !441, !296}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !414, file: !49, line: 90, baseType: !631, size: 64, offset: 3264)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!207, !406, !297, !634, !599, !441, !597, !296}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!207, !138, !297, !597, !597, !138, !305, !190}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !414, file: !49, line: 91, baseType: !627, size: 64, offset: 3328)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !414, file: !49, line: 93, baseType: !640, size: 64, offset: 3392)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!207, !406, !406, !499, !499}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !408, file: !49, line: 204, baseType: !644, size: 6400, offset: 7936)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 6400, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 100)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !408, file: !49, line: 204, baseType: !644, size: 6400, offset: 14336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !408, file: !49, line: 205, baseType: !644, size: 6400, offset: 20736)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !408, file: !49, line: 205, baseType: !644, size: 6400, offset: 27136)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !408, file: !49, line: 206, baseType: !651, size: 64, offset: 33536)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !49, line: 141, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !49, line: 142, size: 256, elements: !654)
!654 = !{!655, !656, !657, !659}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !653, file: !49, line: 143, baseType: !441, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !49, line: 144, baseType: !271, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !653, file: !49, line: 145, baseType: !658, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !49, line: 140, baseType: !48)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !49, line: 146, baseType: !651, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !408, file: !49, line: 207, baseType: !651, size: 64, offset: 33600)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !408, file: !49, line: 208, baseType: !662, size: 64, offset: 33664)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !49, line: 149, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !49, line: 150, size: 192, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !664, file: !49, line: 151, baseType: !354, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !664, file: !49, line: 152, baseType: !190, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !49, line: 153, baseType: !662, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !408, file: !49, line: 208, baseType: !662, size: 64, offset: 33728)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !408, file: !49, line: 209, baseType: !671, size: 64, offset: 33792)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !49, line: 163, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !49, line: 158, size: 192, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !673, file: !49, line: 159, baseType: !515, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !673, file: !49, line: 160, baseType: !184, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !49, line: 161, baseType: !672, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !408, file: !49, line: 210, baseType: !515, size: 64, offset: 33856)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !408, file: !49, line: 211, baseType: !515, size: 64, offset: 33920)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !408, file: !49, line: 212, baseType: !190, size: 64, offset: 33984)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !408, file: !49, line: 213, baseType: !682, size: 64, offset: 34048)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!207, !599}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !408, file: !49, line: 214, baseType: !472, size: 32, offset: 34112)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !408, file: !49, line: 215, baseType: !687, size: 64, offset: 34176)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !483, line: 1378, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !483, line: 1378, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !408, file: !49, line: 216, baseType: !691, size: 64, offset: 34240)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !442, line: 83, baseType: !160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !408, file: !49, line: 217, baseType: !693, size: 64, offset: 34304)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !483, line: 25, baseType: !160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !408, file: !49, line: 218, baseType: !138, size: 32, offset: 34368)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !408, file: !49, line: 219, baseType: !696, size: 64, offset: 34432)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !456, line: 30, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !456, line: 30, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !408, file: !49, line: 220, baseType: !184, size: 32, offset: 34496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !408, file: !49, line: 221, baseType: !184, size: 32, offset: 34528)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !408, file: !49, line: 222, baseType: !138, size: 32, offset: 34560)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !408, file: !49, line: 222, baseType: !138, size: 32, offset: 34592)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !408, file: !49, line: 223, baseType: !184, size: 32, offset: 34624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !408, file: !49, line: 224, baseType: !184, size: 32, offset: 34656)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !49, line: 225, baseType: !190, size: 64, offset: 34688)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !408, file: !49, line: 227, baseType: !406, size: 64, offset: 34752)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !408, file: !49, line: 228, baseType: !406, size: 64, offset: 34816)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !408, file: !49, line: 229, baseType: !709, size: 64, offset: 34880)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !49, line: 100, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !49, line: 101, size: 256, elements: !712)
!712 = !{!713, !717, !721, !722}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !711, file: !49, line: 102, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!207, !406, !406, !190}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !711, file: !49, line: 103, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!207, !406, !482, !441, !482, !406, !190}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !711, file: !49, line: 104, baseType: !190, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !49, line: 105, baseType: !709, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !408, file: !49, line: 230, baseType: !724, size: 64, offset: 34944)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !49, line: 108, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !49, line: 109, size: 256, elements: !727)
!727 = !{!728, !729, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !726, file: !49, line: 110, baseType: !714, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !726, file: !49, line: 111, baseType: !730, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!207, !406, !482, !406, !190}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !726, file: !49, line: 112, baseType: !190, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !49, line: 113, baseType: !724, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !408, file: !49, line: 231, baseType: !736, size: 64, offset: 35008)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !49, line: 116, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !49, line: 117, size: 256, elements: !739)
!739 = !{!740, !741, !745, !746}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !738, file: !49, line: 118, baseType: !714, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !738, file: !49, line: 119, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!207, !406, !172, !172, !406, !190}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !738, file: !49, line: 120, baseType: !190, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !49, line: 121, baseType: !736, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !408, file: !49, line: 232, baseType: !748, size: 64, offset: 35072)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !49, line: 124, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !49, line: 125, size: 256, elements: !751)
!751 = !{!752, !756, !757, !758}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !750, file: !49, line: 126, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!207, !406, !441, !527, !441, !190}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !750, file: !49, line: 127, baseType: !753, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !750, file: !49, line: 128, baseType: !190, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !49, line: 129, baseType: !748, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !408, file: !49, line: 233, baseType: !760, size: 64, offset: 35136)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !49, line: 132, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !49, line: 133, size: 256, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !762, file: !49, line: 134, baseType: !753, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !762, file: !49, line: 135, baseType: !753, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !762, file: !49, line: 136, baseType: !190, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !49, line: 137, baseType: !760, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !408, file: !49, line: 235, baseType: !138, size: 32, offset: 35200)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !408, file: !49, line: 237, baseType: !770, size: 64, offset: 35264)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !49, line: 27, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !49, line: 27, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !49, line: 27, size: 320, elements: !774)
!774 = !{!775, !779, !780, !781, !782, !784, !791}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !773, file: !49, line: 27, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !777, line: 166, baseType: !778)
!777 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !777, line: 139, baseType: !7)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !773, file: !49, line: 27, baseType: !776, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !773, file: !49, line: 27, baseType: !776, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !773, file: !49, line: 27, baseType: !776, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !49, line: 27, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !773, file: !49, line: 27, baseType: !785, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !49, line: 21, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !49, line: 17, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !787, file: !49, line: 19, baseType: !515, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !787, file: !49, line: 20, baseType: !138, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !773, file: !49, line: 27, baseType: !440, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !408, file: !49, line: 239, baseType: !174, size: 64, offset: 35328)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !408, file: !49, line: 240, baseType: !174, size: 64, offset: 35392)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !408, file: !49, line: 241, baseType: !174, size: 64, offset: 35456)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !408, file: !49, line: 242, baseType: !174, size: 64, offset: 35520)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !408, file: !49, line: 243, baseType: !184, size: 32, offset: 35584)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !408, file: !49, line: 245, baseType: !798, size: 64, offset: 35616)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !319)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !408, file: !49, line: 246, baseType: !800, size: 64, offset: 35712)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !801, line: 18, baseType: !802)
!801 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !804, line: 29, size: 5760, elements: !805)
!804 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!805 = !{!806, !807, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !825, !826, !827, !828, !853, !854, !855}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !803, file: !804, line: 30, baseType: !411, size: 4480)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !803, file: !804, line: 30, baseType: !808, size: 32, offset: 4480)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32, elements: !242)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !803, file: !804, line: 31, baseType: !138, size: 32, offset: 4512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !803, file: !804, line: 31, baseType: !138, size: 32, offset: 4544)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !803, file: !804, line: 32, baseType: !455, size: 64, offset: 4608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !803, file: !804, line: 33, baseType: !184, size: 32, offset: 4672)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !803, file: !804, line: 34, baseType: !184, size: 32, offset: 4704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !803, file: !804, line: 35, baseType: !145, size: 64, offset: 4736)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !803, file: !804, line: 36, baseType: !145, size: 64, offset: 4800)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !803, file: !804, line: 37, baseType: !138, size: 32, offset: 4864)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !803, file: !804, line: 38, baseType: !800, size: 64, offset: 4928)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !803, file: !804, line: 39, baseType: !145, size: 64, offset: 4992)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !803, file: !804, line: 40, baseType: !184, size: 32, offset: 5056)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !803, file: !804, line: 42, baseType: !138, size: 32, offset: 5088)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !803, file: !804, line: 43, baseType: !452, size: 64, offset: 5120)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !803, file: !804, line: 44, baseType: !145, size: 64, offset: 5184)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !803, file: !804, line: 45, baseType: !824, size: 64, offset: 5248)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !803, file: !804, line: 46, baseType: !184, size: 32, offset: 5312)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !803, file: !804, line: 47, baseType: !451, size: 64, offset: 5376)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !803, file: !804, line: 49, baseType: !191, size: 64, offset: 5440)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !803, file: !804, line: 50, baseType: !829, size: 64, offset: 5504)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !804, line: 27, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !804, line: 27, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !804, line: 27, size: 320, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !846}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !832, file: !804, line: 27, baseType: !776, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !832, file: !804, line: 27, baseType: !776, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !832, file: !804, line: 27, baseType: !776, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !832, file: !804, line: 27, baseType: !776, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !832, file: !804, line: 27, baseType: !783, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !832, file: !804, line: 27, baseType: !840, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !804, line: 10, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !804, line: 8, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !842, file: !804, line: 9, baseType: !138, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !842, file: !804, line: 9, baseType: !138, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !832, file: !804, line: 27, baseType: !847, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !804, line: 14, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 12, size: 128, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !849, file: !804, line: 13, baseType: !145, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !849, file: !804, line: 13, baseType: !145, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !803, file: !804, line: 51, baseType: !800, size: 64, offset: 5568)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !803, file: !804, line: 52, baseType: !455, size: 64, offset: 5632)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !803, file: !804, line: 53, baseType: !856, size: 64, offset: 5696)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !801, line: 33, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !804, line: 72, size: 4864, elements: !859)
!859 = !{!860, !861, !879, !880, !889}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !858, file: !804, line: 73, baseType: !411, size: 4480)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !858, file: !804, line: 73, baseType: !862, size: 192, offset: 4480)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 192, elements: !242)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !804, line: 56, size: 192, elements: !864)
!864 = !{!865, !871, !875}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !863, file: !804, line: 57, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!207, !856, !800, !138, !542, !869, !870}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !863, file: !804, line: 58, baseType: !872, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!207, !856}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !863, file: !804, line: 59, baseType: !876, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!207, !856, !213}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !858, file: !804, line: 74, baseType: !190, size: 64, offset: 4672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !858, file: !804, line: 75, baseType: !881, size: 64, offset: 4736)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !804, line: 62, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !804, line: 64, size: 256, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !804, line: 66, baseType: !881, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !883, file: !804, line: 67, baseType: !869, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !883, file: !804, line: 68, baseType: !870, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !883, file: !804, line: 69, baseType: !138, size: 32, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !858, file: !804, line: 76, baseType: !881, size: 64, offset: 4800)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !408, file: !49, line: 247, baseType: !800, size: 64, offset: 35776)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !408, file: !49, line: 248, baseType: !892, size: 64, offset: 35840)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !456, line: 60, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !27, line: 240, size: 640, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !894, file: !27, line: 241, baseType: !186, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !894, file: !27, line: 242, baseType: !168, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !894, file: !27, line: 243, baseType: !138, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !894, file: !27, line: 243, baseType: !138, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !894, file: !27, line: 244, baseType: !138, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !894, file: !27, line: 244, baseType: !138, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !894, file: !27, line: 245, baseType: !145, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !894, file: !27, line: 246, baseType: !184, size: 32, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !894, file: !27, line: 247, baseType: !138, size: 32, offset: 352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !894, file: !27, line: 251, baseType: !138, size: 32, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !894, file: !27, line: 252, baseType: !696, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !894, file: !27, line: 253, baseType: !184, size: 32, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !894, file: !27, line: 254, baseType: !138, size: 32, offset: 544)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !894, file: !27, line: 254, baseType: !138, size: 32, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !894, file: !27, line: 255, baseType: !138, size: 32, offset: 608)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !408, file: !49, line: 250, baseType: !800, size: 64, offset: 35904)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !408, file: !49, line: 251, baseType: !482, size: 64, offset: 35968)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !408, file: !49, line: 253, baseType: !406, size: 64, offset: 36032)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !408, file: !49, line: 254, baseType: !441, size: 64, offset: 36096)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !408, file: !49, line: 255, baseType: !190, size: 64, offset: 36160)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !408, file: !49, line: 256, baseType: !917, size: 64, offset: 36224)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!207, !406, !190}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !408, file: !49, line: 257, baseType: !917, size: 64, offset: 36288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !408, file: !49, line: 258, baseType: !922, size: 64, offset: 36352)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!207, !406, !597, !184, !870, !190}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !408, file: !49, line: 260, baseType: !138, size: 32, offset: 36416)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !408, file: !49, line: 261, baseType: !406, size: 64, offset: 36480)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !408, file: !49, line: 262, baseType: !441, size: 64, offset: 36544)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !408, file: !49, line: 263, baseType: !441, size: 64, offset: 36608)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !408, file: !49, line: 264, baseType: !184, size: 32, offset: 36672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !408, file: !49, line: 265, baseType: !465, size: 64, offset: 36736)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !408, file: !49, line: 266, baseType: !296, size: 64, offset: 36800)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !408, file: !49, line: 266, baseType: !296, size: 64, offset: 36864)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !408, file: !49, line: 267, baseType: !934, size: 64, offset: 36928)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !408, file: !49, line: 269, baseType: !936, size: 640, offset: 36992)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 640, elements: !945)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !49, line: 15, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!207, !406, !138, !138, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !483, line: 1723, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !483, line: 1723, flags: DIFlagFwdDecl)
!945 = !{!946}
!946 = !DISubrange(count: 10)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !408, file: !49, line: 270, baseType: !936, size: 640, offset: 37632)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !408, file: !49, line: 272, baseType: !138, size: 32, offset: 38272)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !408, file: !49, line: 273, baseType: !950, size: 64, offset: 38336)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !49, line: 178, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !49, line: 173, size: 256, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !952, file: !49, line: 174, baseType: !191, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !952, file: !49, line: 175, baseType: !515, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !952, file: !49, line: 176, baseType: !798, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !952, file: !49, line: 177, baseType: !184, size: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !408, file: !49, line: 274, baseType: !959, size: 64, offset: 38400)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !49, line: 165, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !49, line: 167, size: 192, elements: !962)
!962 = !{!963, !1044, !1045}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !961, file: !49, line: 168, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !965, line: 11, baseType: !966)
!965 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !965, line: 13, size: 832, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !1035, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !965, line: 14, baseType: !160, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !967, file: !965, line: 15, baseType: !515, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !967, file: !965, line: 16, baseType: !160, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !967, file: !965, line: 17, baseType: !138, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !967, file: !965, line: 18, baseType: !145, size: 64, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !967, file: !965, line: 19, baseType: !975, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !976, line: 22, baseType: !977)
!976 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !965, line: 81, size: 4992, elements: !979)
!979 = !{!980, !981, !995, !996, !997, !1006}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !978, file: !965, line: 82, baseType: !411, size: 4480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !978, file: !965, line: 82, baseType: !982, size: 256, offset: 4480)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 256, elements: !242)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !965, line: 74, size: 256, elements: !984)
!984 = !{!985, !989, !990, !994}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !983, file: !965, line: 75, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!207, !975}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !983, file: !965, line: 76, baseType: !986, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !983, file: !965, line: 77, baseType: !991, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!207, !975, !213}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !983, file: !965, line: 78, baseType: !986, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !978, file: !965, line: 83, baseType: !190, size: 64, offset: 4736)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !978, file: !965, line: 85, baseType: !138, size: 32, offset: 4800)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !978, file: !965, line: 86, baseType: !998, size: 64, offset: 4864)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !965, line: 41, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !965, line: 36, size: 256, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !965, line: 37, baseType: !354, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1000, file: !965, line: 38, baseType: !354, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !1000, file: !965, line: 39, baseType: !354, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1000, file: !965, line: 40, baseType: !271, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !978, file: !965, line: 87, baseType: !1007, size: 64, offset: 4928)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !965, line: 54, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !965, line: 54, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !965, line: 54, size: 320, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1027}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1011, file: !965, line: 54, baseType: !776, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1011, file: !965, line: 54, baseType: !776, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1011, file: !965, line: 54, baseType: !776, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1011, file: !965, line: 54, baseType: !776, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1011, file: !965, line: 54, baseType: !783, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1011, file: !965, line: 54, baseType: !1019, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !976, line: 41, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !976, line: 35, size: 192, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1021, file: !976, line: 37, baseType: !515, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1021, file: !976, line: 38, baseType: !138, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1021, file: !976, line: 39, baseType: !138, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1021, file: !976, line: 40, baseType: !138, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1011, file: !965, line: 54, baseType: !1028, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !965, line: 34, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !965, line: 30, size: 96, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1030, file: !965, line: 31, baseType: !138, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1030, file: !965, line: 32, baseType: !138, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1030, file: !965, line: 33, baseType: !138, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !967, file: !965, line: 20, baseType: !1036, size: 32, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !43, line: 60, baseType: !60)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !967, file: !965, line: 21, baseType: !138, size: 32, offset: 416)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !967, file: !965, line: 22, baseType: !138, size: 32, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !967, file: !965, line: 23, baseType: !145, size: 64, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !967, file: !965, line: 24, baseType: !234, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !967, file: !965, line: 25, baseType: !234, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !967, file: !965, line: 26, baseType: !190, size: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !965, line: 27, baseType: !964, size: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !961, file: !49, line: 169, baseType: !515, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !961, file: !49, line: 170, baseType: !959, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !408, file: !49, line: 275, baseType: !138, size: 32, offset: 38464)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !408, file: !49, line: 276, baseType: !1048, size: 64, offset: 38528)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !49, line: 184, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !49, line: 180, size: 192, elements: !1051)
!1051 = !{!1052, !1133, !1134}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1050, file: !49, line: 181, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !976, line: 13, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !965, line: 98, size: 7232, elements: !1056)
!1056 = !{!1057, !1058, !1072, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1089, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1055, file: !965, line: 99, baseType: !411, size: 4480)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1055, file: !965, line: 99, baseType: !1059, size: 256, offset: 4480)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 256, elements: !242)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !965, line: 91, size: 256, elements: !1061)
!1061 = !{!1062, !1066, !1067, !1071}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1060, file: !965, line: 92, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!207, !1053}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1060, file: !965, line: 93, baseType: !1063, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1060, file: !965, line: 94, baseType: !1068, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!207, !1053, !213}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1060, file: !965, line: 95, baseType: !1063, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !965, line: 100, baseType: !190, size: 64, offset: 4736)
