; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dviewp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dviewp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }

!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 204, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 141, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 663, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!68 = !{!69, !73, !74, !136, !110, !160, !81, !133, !187, !278, !244}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !70, line: 330, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !70, line: 330, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !77, line: 73, size: 4480, elements: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!78 = !{!79, !82, !131, !132, !134, !137, !138, !139, !140, !148, !149, !151, !155, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !173, !174, !176, !177, !179, !181, !182, !183, !184, !185, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !211, !213, !214, !218, !219, !268, !273, !275, !276, !277}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !76, file: !77, line: 74, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !81)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !76, file: !77, line: 75, baseType: !83, size: 448, offset: 64)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 448, elements: !129)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !77, line: 53, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 45, size: 448, elements: !86)
!86 = !{!87, !93, !101, !106, !113, !117, !124}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !85, file: !77, line: 46, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !74, !92}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !81)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !85, file: !77, line: 47, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!91, !74, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !98, line: 16, baseType: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !98, line: 16, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !85, file: !77, line: 48, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!91, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !85, file: !77, line: 49, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!91, !74, !110, !74}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !85, file: !77, line: 50, baseType: !114, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!91, !74, !110, !105}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !85, file: !77, line: 51, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!91, !74, !110, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !85, file: !77, line: 52, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!91, !74, !110, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !76, file: !77, line: 76, baseType: !69, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !77, line: 77, baseType: !133, size: 32, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !76, file: !77, line: 78, baseType: !135, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !136)
!136 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !76, file: !77, line: 78, baseType: !135, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !76, file: !77, line: 78, baseType: !135, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !76, file: !77, line: 78, baseType: !135, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !76, file: !77, line: 79, baseType: !141, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !144, line: 27, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !146, line: 43, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !76, file: !77, line: 80, baseType: !133, size: 32, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !76, file: !77, line: 81, baseType: !150, size: 32, offset: 992)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !81)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !76, file: !77, line: 82, baseType: !152, size: 64, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !76, file: !77, line: 83, baseType: !156, size: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !76, file: !77, line: 84, baseType: !160, size: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !76, file: !77, line: 85, baseType: !160, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !76, file: !77, line: 86, baseType: !160, size: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !76, file: !77, line: 87, baseType: !160, size: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !76, file: !77, line: 88, baseType: !74, size: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !76, file: !77, line: 89, baseType: !141, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 90, baseType: !160, size: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !76, file: !77, line: 91, baseType: !160, size: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !76, file: !77, line: 92, baseType: !133, size: 32, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !76, file: !77, line: 93, baseType: !73, size: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !76, file: !77, line: 94, baseType: !171, size: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !142)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !76, file: !77, line: 95, baseType: !133, size: 32, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !76, file: !77, line: 95, baseType: !133, size: 32, offset: 1888)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !76, file: !77, line: 96, baseType: !175, size: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !76, file: !77, line: 96, baseType: !175, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !76, file: !77, line: 97, baseType: !178, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !76, file: !77, line: 97, baseType: !180, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !76, file: !77, line: 98, baseType: !133, size: 32, offset: 2176)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !76, file: !77, line: 98, baseType: !133, size: 32, offset: 2208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !76, file: !77, line: 99, baseType: !175, size: 64, offset: 2240)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !76, file: !77, line: 99, baseType: !175, size: 64, offset: 2304)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !76, file: !77, line: 100, baseType: !186, size: 64, offset: 2368)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !136)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !76, file: !77, line: 100, baseType: !189, size: 64, offset: 2432)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !76, file: !77, line: 101, baseType: !133, size: 32, offset: 2496)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !76, file: !77, line: 101, baseType: !133, size: 32, offset: 2528)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !76, file: !77, line: 102, baseType: !175, size: 64, offset: 2560)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !76, file: !77, line: 102, baseType: !175, size: 64, offset: 2624)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !76, file: !77, line: 103, baseType: !195, size: 64, offset: 2688)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !187)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !76, file: !77, line: 103, baseType: !198, size: 64, offset: 2752)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !76, file: !77, line: 104, baseType: !128, size: 64, offset: 2816)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !76, file: !77, line: 105, baseType: !133, size: 32, offset: 2880)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !76, file: !77, line: 106, baseType: !202, size: 128, offset: 2944)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !209)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !77, line: 64, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 61, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !205, file: !77, line: 62, baseType: !121, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !205, file: !77, line: 63, baseType: !73, size: 64, offset: 64)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !76, file: !77, line: 107, baseType: !212, size: 64, offset: 3072)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !209)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !76, file: !77, line: 108, baseType: !73, size: 64, offset: 3136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !76, file: !77, line: 109, baseType: !215, size: 64, offset: 3200)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!91, !73}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !76, file: !77, line: 111, baseType: !133, size: 32, offset: 3264)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !76, file: !77, line: 112, baseType: !220, size: 320, offset: 3328)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 320, elements: !266)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!91, !224, !74, !73}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !227)
!227 = !{!228, !229, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !226, file: !10, line: 100, baseType: !133, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !10, line: 101, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !241, !242, !243, !247, !249, !251, !252, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !232, file: !10, line: 84, baseType: !160, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !232, file: !10, line: 85, baseType: !160, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !10, line: 86, baseType: !73, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !232, file: !10, line: 87, baseType: !152, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !232, file: !10, line: 88, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !232, file: !10, line: 89, baseType: !112, size: 8, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !232, file: !10, line: 90, baseType: !160, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !232, file: !10, line: 91, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !245, line: 46, baseType: !246)
!245 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!246 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !232, file: !10, line: 92, baseType: !248, size: 32, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !10, line: 93, baseType: !250, size: 32, offset: 544)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !10, line: 94, baseType: !230, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !232, file: !10, line: 95, baseType: !160, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !232, file: !10, line: 96, baseType: !73, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !226, file: !10, line: 102, baseType: !160, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !226, file: !10, line: 102, baseType: !160, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !226, file: !10, line: 103, baseType: !160, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !226, file: !10, line: 104, baseType: !69, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !226, file: !10, line: 105, baseType: !248, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !226, file: !10, line: 106, baseType: !74, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !226, file: !10, line: 107, baseType: !263, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!266 = !{!267}
!267 = !DISubrange(count: 5)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !76, file: !77, line: 113, baseType: !269, size: 320, offset: 3648)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 320, elements: !266)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!91, !74, !73}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !76, file: !77, line: 114, baseType: !274, size: 320, offset: 3968)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 320, elements: !266)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !76, file: !77, line: 115, baseType: !248, size: 32, offset: 4288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !76, file: !77, line: 120, baseType: !263, size: 64, offset: 4352)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !76, file: !77, line: 121, baseType: !248, size: 32, offset: 4416)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !70, line: 338, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !70, line: 338, flags: DIFlagFwdDecl)
!281 = !{i32 7, !"Dwarf Version", i32 4}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{i32 7, !"PIC Level", i32 2}
!285 = !{i32 7, !"uwtable", i32 1}
!286 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!287 = distinct !DISubprogram(name: "PetscDrawSetViewPort", scope: !288, file: !288, line: 22, type: !289, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !450)
!288 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dviewp.c", directory: "/home/users/ndemeye/xSDK")
!289 = !DISubroutineType(types: !290)
!290 = !{!91, !291, !187, !187, !187, !187}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !292, line: 25, baseType: !293)
!292 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !295, line: 53, size: 11072, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !299, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !426, !427, !428, !429, !430, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !294, file: !295, line: 54, baseType: !298, size: 4480)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !77, line: 122, baseType: !76)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !294, file: !295, line: 54, baseType: !300, size: 2304, offset: 4480)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 2304, elements: !129)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !295, line: 14, size: 2304, elements: !302)
!302 = !{!303, !307, !308, !312, !316, !320, !324, !325, !329, !330, !334, !338, !340, !341, !345, !349, !350, !356, !357, !358, !359, !364, !368, !369, !373, !374, !378, !379, !380, !381, !393, !394, !395, !400, !404, !408}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !301, file: !295, line: 15, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!91, !291}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !301, file: !295, line: 16, baseType: !304, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !301, file: !295, line: 17, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!91, !291, !187, !187, !187, !187, !81}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !301, file: !295, line: 18, baseType: !313, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!91, !291, !187}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !301, file: !295, line: 19, baseType: !317, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!91, !291, !186}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !301, file: !295, line: 20, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!91, !291, !187, !187, !81}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !301, file: !295, line: 21, baseType: !313, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !301, file: !295, line: 22, baseType: !326, size: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!91, !291, !187, !187, !81, !110}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !301, file: !295, line: 23, baseType: !326, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !301, file: !295, line: 24, baseType: !331, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!91, !291, !187, !187}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !301, file: !295, line: 25, baseType: !335, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!91, !291, !186, !186}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !301, file: !295, line: 26, baseType: !339, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !301, file: !295, line: 27, baseType: !304, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !301, file: !295, line: 28, baseType: !342, size: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!91, !291, !187, !187, !187, !187, !81, !81, !81, !81}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !301, file: !295, line: 29, baseType: !346, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!91, !291, !187, !187, !187, !187, !187, !187, !81, !81, !81}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !301, file: !295, line: 30, baseType: !309, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !301, file: !295, line: 31, baseType: !351, size: 64, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!91, !291, !354, !186, !186, !186, !186}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !25, line: 207, baseType: !24)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !301, file: !295, line: 32, baseType: !304, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !301, file: !295, line: 33, baseType: !304, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !301, file: !295, line: 34, baseType: !304, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !301, file: !295, line: 35, baseType: !360, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!91, !291, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !301, file: !295, line: 36, baseType: !365, size: 64, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!91, !291, !110}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !301, file: !295, line: 37, baseType: !304, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !301, file: !295, line: 38, baseType: !370, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!91, !291, !81, !81}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !301, file: !295, line: 39, baseType: !304, size: 64, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !301, file: !295, line: 40, baseType: !375, size: 64, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!91, !291, !97}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !301, file: !295, line: 41, baseType: !360, size: 64, offset: 1664)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !301, file: !295, line: 42, baseType: !360, size: 64, offset: 1728)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !301, file: !295, line: 43, baseType: !304, size: 64, offset: 1792)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !301, file: !295, line: 44, baseType: !382, size: 64, offset: 1856)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!91, !291, !385, !390, !390, !391}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 24, elements: !388)
!387 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!388 = !{!389}
!389 = !DISubrange(count: 3)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !301, file: !295, line: 45, baseType: !339, size: 64, offset: 1920)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !301, file: !295, line: 46, baseType: !309, size: 64, offset: 1984)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !301, file: !295, line: 47, baseType: !396, size: 64, offset: 2048)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!91, !291, !187, !187, !399, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !301, file: !295, line: 48, baseType: !401, size: 64, offset: 2112)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!91, !291, !81, !81, !186, !186}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !301, file: !295, line: 49, baseType: !405, size: 64, offset: 2176)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!91, !291, !81, !81, !81}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !301, file: !295, line: 50, baseType: !409, size: 64, offset: 2240)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!91, !291, !187, !187, !81, !81, !110, !186, !186}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !294, file: !295, line: 55, baseType: !187, size: 64, offset: 6784)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !294, file: !295, line: 56, baseType: !187, size: 64, offset: 6848)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !294, file: !295, line: 56, baseType: !187, size: 64, offset: 6912)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !294, file: !295, line: 56, baseType: !187, size: 64, offset: 6976)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !294, file: !295, line: 56, baseType: !187, size: 64, offset: 7040)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !294, file: !295, line: 57, baseType: !187, size: 64, offset: 7104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !294, file: !295, line: 57, baseType: !187, size: 64, offset: 7168)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !294, file: !295, line: 57, baseType: !187, size: 64, offset: 7232)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !294, file: !295, line: 57, baseType: !187, size: 64, offset: 7296)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !294, file: !295, line: 58, baseType: !422, size: 1280, offset: 7360)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 1280, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 20)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !294, file: !295, line: 58, baseType: !422, size: 1280, offset: 8640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !294, file: !295, line: 59, baseType: !187, size: 64, offset: 9920)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !294, file: !295, line: 59, baseType: !187, size: 64, offset: 9984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !294, file: !295, line: 59, baseType: !187, size: 64, offset: 10048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !294, file: !295, line: 59, baseType: !187, size: 64, offset: 10112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !294, file: !295, line: 60, baseType: !133, size: 32, offset: 10176)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !294, file: !295, line: 61, baseType: !432, size: 32, offset: 10208)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !25, line: 141, baseType: !36)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !294, file: !295, line: 62, baseType: !160, size: 64, offset: 10240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !294, file: !295, line: 63, baseType: !160, size: 64, offset: 10304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !294, file: !295, line: 64, baseType: !291, size: 64, offset: 10368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !294, file: !295, line: 65, baseType: !81, size: 32, offset: 10432)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !294, file: !295, line: 65, baseType: !81, size: 32, offset: 10464)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !294, file: !295, line: 65, baseType: !81, size: 32, offset: 10496)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !294, file: !295, line: 65, baseType: !81, size: 32, offset: 10528)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !294, file: !295, line: 66, baseType: !160, size: 64, offset: 10560)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !294, file: !295, line: 67, baseType: !160, size: 64, offset: 10624)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !294, file: !295, line: 68, baseType: !160, size: 64, offset: 10688)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !294, file: !295, line: 69, baseType: !133, size: 32, offset: 10752)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !294, file: !295, line: 70, baseType: !248, size: 32, offset: 10784)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !294, file: !295, line: 71, baseType: !133, size: 32, offset: 10816)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !294, file: !295, line: 72, baseType: !160, size: 64, offset: 10880)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !294, file: !295, line: 73, baseType: !248, size: 32, offset: 10944)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !294, file: !295, line: 74, baseType: !248, size: 32, offset: 10976)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !295, line: 75, baseType: !73, size: 64, offset: 11008)
!450 = !{!451, !452, !453, !454, !455, !456, !457}
!451 = !DILocalVariable(name: "draw", arg: 1, scope: !287, file: !288, line: 22, type: !291)
!452 = !DILocalVariable(name: "xl", arg: 2, scope: !287, file: !288, line: 22, type: !187)
!453 = !DILocalVariable(name: "yl", arg: 3, scope: !287, file: !288, line: 22, type: !187)
!454 = !DILocalVariable(name: "xr", arg: 4, scope: !287, file: !288, line: 22, type: !187)
!455 = !DILocalVariable(name: "yr", arg: 5, scope: !287, file: !288, line: 22, type: !187)
!456 = !DILocalVariable(name: "ierr", scope: !287, file: !288, line: 24, type: !91)
!457 = !DILocalVariable(name: "ierr__", scope: !458, file: !288, line: 32, type: !91)
!458 = distinct !DILexicalBlock(scope: !459, file: !288, line: 32, column: 56)
!459 = distinct !DILexicalBlock(scope: !460, file: !288, line: 31, column: 31)
!460 = distinct !DILexicalBlock(scope: !287, file: !288, line: 31, column: 7)
!461 = !DILocation(line: 0, scope: !287)
!462 = !DILocation(line: 26, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !288, line: 26, column: 3)
!464 = distinct !DILexicalBlock(scope: !465, file: !288, line: 26, column: 3)
!465 = distinct !DILexicalBlock(scope: !287, file: !288, line: 26, column: 3)
!466 = !{!467, !467, i64 0}
!467 = !{!"any pointer", !468, i64 0}
!468 = !{!"omnipotent char", !469, i64 0}
!469 = !{!"Simple C/C++ TBAA"}
!470 = !DILocation(line: 26, column: 3, scope: !464)
!471 = !DILocation(line: 26, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !288, line: 26, column: 3)
!473 = distinct !DILexicalBlock(scope: !463, file: !288, line: 26, column: 3)
!474 = !{!475, !476, i64 1536}
!475 = !{!"", !468, i64 0, !468, i64 512, !468, i64 1024, !468, i64 1280, !476, i64 1536, !476, i64 1540, !468, i64 1544}
!476 = !{!"int", !468, i64 0}
!477 = !DILocation(line: 26, column: 3, scope: !473)
!478 = !DILocation(line: 26, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !288, line: 26, column: 3)
!480 = !{!476, !476, i64 0}
!481 = !{!475, !476, i64 1540}
!482 = !DILocation(line: 27, column: 3, scope: !483)
!483 = distinct !DILexicalBlock(scope: !484, file: !288, line: 27, column: 3)
!484 = distinct !DILexicalBlock(scope: !287, file: !288, line: 27, column: 3)
!485 = !DILocation(line: 27, column: 3, scope: !484)
!486 = !DILocation(line: 27, column: 3, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !288, line: 27, column: 3)
!488 = !DILocation(line: 27, column: 3, scope: !489)
!489 = distinct !DILexicalBlock(scope: !484, file: !288, line: 27, column: 3)
!490 = !{!491, !476, i64 0}
!491 = !{!"_p_PetscObject", !476, i64 0, !468, i64 8, !467, i64 64, !476, i64 72, !492, i64 80, !492, i64 88, !492, i64 96, !492, i64 104, !493, i64 112, !476, i64 120, !476, i64 124, !467, i64 128, !467, i64 136, !467, i64 144, !467, i64 152, !467, i64 160, !467, i64 168, !467, i64 176, !493, i64 184, !467, i64 192, !467, i64 200, !476, i64 208, !467, i64 216, !493, i64 224, !476, i64 232, !476, i64 236, !467, i64 240, !467, i64 248, !467, i64 256, !467, i64 264, !476, i64 272, !476, i64 276, !467, i64 280, !467, i64 288, !467, i64 296, !467, i64 304, !476, i64 312, !476, i64 316, !467, i64 320, !467, i64 328, !467, i64 336, !467, i64 344, !467, i64 352, !476, i64 360, !468, i64 368, !468, i64 384, !467, i64 392, !467, i64 400, !476, i64 408, !468, i64 416, !468, i64 456, !468, i64 496, !468, i64 536, !467, i64 544, !468, i64 552}
!492 = !{!"double", !468, i64 0}
!493 = !{!"long", !468, i64 0}
!494 = !DILocation(line: 27, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !288, line: 27, column: 3)
!496 = distinct !DILexicalBlock(scope: !489, file: !288, line: 27, column: 3)
!497 = !DILocation(line: 27, column: 3, scope: !496)
!498 = !DILocation(line: 28, column: 10, scope: !499)
!499 = distinct !DILexicalBlock(scope: !287, file: !288, line: 28, column: 7)
!500 = !DILocation(line: 28, column: 16, scope: !499)
!501 = !DILocation(line: 28, column: 77, scope: !499)
!502 = !DILocation(line: 29, column: 9, scope: !287)
!503 = !DILocation(line: 29, column: 17, scope: !287)
!504 = !{!505, !492, i64 856}
!505 = !{!"_p_PetscDraw", !491, i64 0, !468, i64 560, !492, i64 848, !492, i64 856, !492, i64 864, !492, i64 872, !492, i64 880, !492, i64 888, !492, i64 896, !492, i64 904, !492, i64 912, !468, i64 920, !468, i64 1080, !492, i64 1240, !492, i64 1248, !492, i64 1256, !492, i64 1264, !476, i64 1272, !468, i64 1276, !467, i64 1280, !467, i64 1288, !467, i64 1296, !476, i64 1304, !476, i64 1308, !476, i64 1312, !476, i64 1316, !467, i64 1320, !467, i64 1328, !467, i64 1336, !476, i64 1344, !468, i64 1348, !476, i64 1352, !467, i64 1360, !468, i64 1368, !468, i64 1372, !467, i64 1376}
!506 = !DILocation(line: 29, column: 29, scope: !287)
!507 = !DILocation(line: 29, column: 37, scope: !287)
!508 = !{!505, !492, i64 864}
!509 = !DILocation(line: 30, column: 9, scope: !287)
!510 = !DILocation(line: 30, column: 17, scope: !287)
!511 = !{!505, !492, i64 872}
!512 = !DILocation(line: 30, column: 29, scope: !287)
!513 = !DILocation(line: 30, column: 37, scope: !287)
!514 = !{!505, !492, i64 880}
!515 = !DILocation(line: 31, column: 18, scope: !460)
!516 = !{!517, !467, i64 88}
!517 = !{!"_PetscDrawOps", !467, i64 0, !467, i64 8, !467, i64 16, !467, i64 24, !467, i64 32, !467, i64 40, !467, i64 48, !467, i64 56, !467, i64 64, !467, i64 72, !467, i64 80, !467, i64 88, !467, i64 96, !467, i64 104, !467, i64 112, !467, i64 120, !467, i64 128, !467, i64 136, !467, i64 144, !467, i64 152, !467, i64 160, !467, i64 168, !467, i64 176, !467, i64 184, !467, i64 192, !467, i64 200, !467, i64 208, !467, i64 216, !467, i64 224, !467, i64 232, !467, i64 240, !467, i64 248, !467, i64 256, !467, i64 264, !467, i64 272, !467, i64 280}
!518 = !DILocation(line: 31, column: 7, scope: !460)
!519 = !DILocation(line: 31, column: 7, scope: !287)
!520 = !DILocation(line: 32, column: 12, scope: !459)
!521 = !DILocation(line: 0, scope: !458)
!522 = !DILocation(line: 32, column: 56, scope: !523)
!523 = distinct !DILexicalBlock(scope: !458, file: !288, line: 32, column: 56)
!524 = !DILocation(line: 32, column: 56, scope: !458)
!525 = !{!"branch_weights", i32 2000, i32 1}
!526 = !DILocation(line: 34, column: 3, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !288, line: 34, column: 3)
!528 = distinct !DILexicalBlock(scope: !529, file: !288, line: 34, column: 3)
!529 = distinct !DILexicalBlock(scope: !287, file: !288, line: 34, column: 3)
!530 = !DILocation(line: 34, column: 3, scope: !528)
!531 = !DILocation(line: 34, column: 3, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !288, line: 34, column: 3)
!533 = distinct !DILexicalBlock(scope: !527, file: !288, line: 34, column: 3)
!534 = !DILocation(line: 34, column: 3, scope: !533)
!535 = !DILocation(line: 34, column: 3, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !288, line: 34, column: 3)
!537 = distinct !DILexicalBlock(scope: !532, file: !288, line: 34, column: 3)
!538 = !{!475, !468, i64 1544}
!539 = !DILocation(line: 34, column: 3, scope: !537)
!540 = !DILocation(line: 34, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !536, file: !288, line: 34, column: 3)
!542 = !DILocation(line: 34, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !532, file: !288, line: 34, column: 3)
!544 = !DILocation(line: 34, column: 3, scope: !545)
!545 = distinct !DILexicalBlock(scope: !543, file: !288, line: 34, column: 3)
!546 = !DILocation(line: 34, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !288, line: 34, column: 3)
!548 = distinct !DILexicalBlock(scope: !545, file: !288, line: 34, column: 3)
!549 = !DILocation(line: 34, column: 3, scope: !548)
!550 = !DILocation(line: 34, column: 3, scope: !551)
!551 = distinct !DILexicalBlock(scope: !547, file: !288, line: 34, column: 3)
!552 = !DILocation(line: 35, column: 1, scope: !287)
!553 = !DISubprogram(name: "PetscError", scope: !43, file: !43, line: 668, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{!91, !71, !81, !110, !110, !81, !42, !110, null}
!556 = !{}
!557 = !DISubprogram(name: "PetscCheckPointer", scope: !77, file: !77, line: 183, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!558 = !DISubroutineType(types: !559)
!559 = !{!3, !560, !48}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!562 = distinct !DISubprogram(name: "PetscDrawGetViewPort", scope: !288, file: !288, line: 54, type: !563, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!91, !291, !186, !186, !186, !186}
!565 = !{!566, !567, !568, !569, !570}
!566 = !DILocalVariable(name: "draw", arg: 1, scope: !562, file: !288, line: 54, type: !291)
!567 = !DILocalVariable(name: "xl", arg: 2, scope: !562, file: !288, line: 54, type: !186)
!568 = !DILocalVariable(name: "yl", arg: 3, scope: !562, file: !288, line: 54, type: !186)
!569 = !DILocalVariable(name: "xr", arg: 4, scope: !562, file: !288, line: 54, type: !186)
!570 = !DILocalVariable(name: "yr", arg: 5, scope: !562, file: !288, line: 54, type: !186)
!571 = !DILocation(line: 0, scope: !562)
!572 = !DILocation(line: 56, column: 3, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !288, line: 56, column: 3)
!574 = distinct !DILexicalBlock(scope: !575, file: !288, line: 56, column: 3)
!575 = distinct !DILexicalBlock(scope: !562, file: !288, line: 56, column: 3)
!576 = !DILocation(line: 56, column: 3, scope: !574)
!577 = !DILocation(line: 56, column: 3, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !288, line: 56, column: 3)
!579 = distinct !DILexicalBlock(scope: !573, file: !288, line: 56, column: 3)
!580 = !DILocation(line: 56, column: 3, scope: !579)
!581 = !DILocation(line: 56, column: 3, scope: !582)
!582 = distinct !DILexicalBlock(scope: !578, file: !288, line: 56, column: 3)
!583 = !DILocation(line: 57, column: 3, scope: !584)
!584 = distinct !DILexicalBlock(scope: !585, file: !288, line: 57, column: 3)
!585 = distinct !DILexicalBlock(scope: !562, file: !288, line: 57, column: 3)
!586 = !DILocation(line: 57, column: 3, scope: !585)
!587 = !DILocation(line: 57, column: 3, scope: !588)
!588 = distinct !DILexicalBlock(scope: !585, file: !288, line: 57, column: 3)
!589 = !DILocation(line: 57, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !288, line: 57, column: 3)
!591 = !DILocation(line: 57, column: 3, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !288, line: 57, column: 3)
!593 = distinct !DILexicalBlock(scope: !590, file: !288, line: 57, column: 3)
!594 = !DILocation(line: 57, column: 3, scope: !593)
!595 = !DILocation(line: 58, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !597, file: !288, line: 58, column: 3)
!597 = distinct !DILexicalBlock(scope: !562, file: !288, line: 58, column: 3)
!598 = !DILocation(line: 58, column: 3, scope: !597)
!599 = !DILocation(line: 58, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !597, file: !288, line: 58, column: 3)
!601 = !DILocation(line: 59, column: 3, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !288, line: 59, column: 3)
!603 = distinct !DILexicalBlock(scope: !562, file: !288, line: 59, column: 3)
!604 = !DILocation(line: 59, column: 3, scope: !603)
!605 = !DILocation(line: 59, column: 3, scope: !606)
!606 = distinct !DILexicalBlock(scope: !603, file: !288, line: 59, column: 3)
!607 = !DILocation(line: 60, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !288, line: 60, column: 3)
!609 = distinct !DILexicalBlock(scope: !562, file: !288, line: 60, column: 3)
!610 = !DILocation(line: 60, column: 3, scope: !609)
!611 = !DILocation(line: 60, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !288, line: 60, column: 3)
!613 = !DILocation(line: 61, column: 3, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !288, line: 61, column: 3)
!615 = distinct !DILexicalBlock(scope: !562, file: !288, line: 61, column: 3)
!616 = !DILocation(line: 61, column: 3, scope: !615)
!617 = !DILocation(line: 61, column: 3, scope: !618)
!618 = distinct !DILexicalBlock(scope: !615, file: !288, line: 61, column: 3)
!619 = !DILocation(line: 62, column: 15, scope: !562)
!620 = !DILocation(line: 62, column: 7, scope: !562)
!621 = !{!492, !492, i64 0}
!622 = !DILocation(line: 63, column: 15, scope: !562)
!623 = !DILocation(line: 63, column: 7, scope: !562)
!624 = !DILocation(line: 64, column: 15, scope: !562)
!625 = !DILocation(line: 64, column: 7, scope: !562)
!626 = !DILocation(line: 65, column: 15, scope: !562)
!627 = !DILocation(line: 65, column: 7, scope: !562)
!628 = !DILocation(line: 66, column: 3, scope: !629)
!629 = distinct !DILexicalBlock(scope: !630, file: !288, line: 66, column: 3)
!630 = distinct !DILexicalBlock(scope: !631, file: !288, line: 66, column: 3)
!631 = distinct !DILexicalBlock(scope: !562, file: !288, line: 66, column: 3)
!632 = !DILocation(line: 66, column: 3, scope: !630)
!633 = !DILocation(line: 66, column: 3, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !288, line: 66, column: 3)
!635 = distinct !DILexicalBlock(scope: !629, file: !288, line: 66, column: 3)
!636 = !DILocation(line: 66, column: 3, scope: !635)
!637 = !DILocation(line: 66, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !288, line: 66, column: 3)
!639 = distinct !DILexicalBlock(scope: !634, file: !288, line: 66, column: 3)
!640 = !DILocation(line: 66, column: 3, scope: !639)
!641 = !DILocation(line: 66, column: 3, scope: !642)
!642 = distinct !DILexicalBlock(scope: !638, file: !288, line: 66, column: 3)
!643 = !DILocation(line: 66, column: 3, scope: !644)
!644 = distinct !DILexicalBlock(scope: !634, file: !288, line: 66, column: 3)
!645 = !DILocation(line: 66, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !644, file: !288, line: 66, column: 3)
!647 = !DILocation(line: 66, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !288, line: 66, column: 3)
!649 = distinct !DILexicalBlock(scope: !646, file: !288, line: 66, column: 3)
!650 = !DILocation(line: 66, column: 3, scope: !649)
!651 = !DILocation(line: 66, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !648, file: !288, line: 66, column: 3)
!653 = !DILocation(line: 67, column: 1, scope: !562)
!654 = distinct !DISubprogram(name: "PetscDrawSplitViewPort", scope: !288, file: !288, line: 83, type: !305, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !669, !671, !677, !678, !680, !683, !684, !686, !708, !714, !715, !716, !717, !719, !723, !730, !732, !735, !736, !740, !742, !744, !746, !748, !750, !752, !756, !758, !761, !762, !766, !768, !770}
!656 = !DILocalVariable(name: "draw", arg: 1, scope: !654, file: !288, line: 83, type: !291)
!657 = !DILocalVariable(name: "ierr", scope: !654, file: !288, line: 85, type: !91)
!658 = !DILocalVariable(name: "rank", scope: !654, file: !288, line: 86, type: !150)
!659 = !DILocalVariable(name: "size", scope: !654, file: !288, line: 86, type: !150)
!660 = !DILocalVariable(name: "n", scope: !654, file: !288, line: 87, type: !133)
!661 = !DILocalVariable(name: "isnull", scope: !654, file: !288, line: 88, type: !248)
!662 = !DILocalVariable(name: "xl", scope: !654, file: !288, line: 89, type: !187)
!663 = !DILocalVariable(name: "xr", scope: !654, file: !288, line: 89, type: !187)
!664 = !DILocalVariable(name: "yl", scope: !654, file: !288, line: 89, type: !187)
!665 = !DILocalVariable(name: "yr", scope: !654, file: !288, line: 89, type: !187)
!666 = !DILocalVariable(name: "h", scope: !654, file: !288, line: 89, type: !187)
!667 = !DILocalVariable(name: "ierr__", scope: !668, file: !288, line: 93, type: !91)
!668 = distinct !DILexicalBlock(scope: !654, file: !288, line: 93, column: 40)
!669 = !DILocalVariable(name: "_7_errorcode", scope: !670, file: !288, line: 95, type: !91)
!670 = distinct !DILexicalBlock(scope: !654, file: !288, line: 95, column: 66)
!671 = !DILocalVariable(name: "_7_errorstring", scope: !672, file: !288, line: 95, type: !674)
!672 = distinct !DILexicalBlock(scope: !673, file: !288, line: 95, column: 66)
!673 = distinct !DILexicalBlock(scope: !670, file: !288, line: 95, column: 66)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 2048, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 256)
!677 = !DILocalVariable(name: "_7_resultlen", scope: !672, file: !288, line: 95, type: !150)
!678 = !DILocalVariable(name: "_7_errorcode", scope: !679, file: !288, line: 96, type: !91)
!679 = distinct !DILexicalBlock(scope: !654, file: !288, line: 96, column: 66)
!680 = !DILocalVariable(name: "_7_errorstring", scope: !681, file: !288, line: 96, type: !674)
!681 = distinct !DILexicalBlock(scope: !682, file: !288, line: 96, column: 66)
!682 = distinct !DILexicalBlock(scope: !679, file: !288, line: 96, column: 66)
!683 = !DILocalVariable(name: "_7_resultlen", scope: !681, file: !288, line: 96, type: !150)
!684 = !DILocalVariable(name: "_Petsc_ierr", scope: !685, file: !288, line: 107, type: !91)
!685 = distinct !DILexicalBlock(scope: !654, file: !288, line: 107, column: 10)
!686 = !DILocalVariable(name: "_Petsc_jmpbuf", scope: !685, file: !288, line: 107, type: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !688, line: 45, baseType: !689)
!688 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 1600, elements: !129)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !688, line: 33, size: 1600, elements: !691)
!691 = !{!692, !698, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !690, file: !688, line: 39, baseType: !693, size: 512)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !694, line: 31, baseType: !695)
!694 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !690, file: !688, line: 40, baseType: !81, size: 32, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !690, file: !688, line: 41, baseType: !700, size: 1024, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !701, line: 8, baseType: !702)
!701 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 5, size: 1024, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !702, file: !701, line: 7, baseType: !705, size: 1024)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1024, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 16)
!708 = !DILocalVariable(name: "_Petsc_xioerrhdl", scope: !685, file: !288, line: 107, type: !709)
!709 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscXIOErrorHandler", file: !25, line: 325, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !73}
!714 = !DILocalVariable(name: "_Petsc_isdrawx", scope: !685, file: !288, line: 107, type: !248)
!715 = !DILocalVariable(name: "_Petsc_xioerr", scope: !685, file: !288, line: 107, type: !248)
!716 = !DILocalVariable(name: "_Petsc_xioerr_local", scope: !685, file: !288, line: 107, type: !248)
!717 = !DILocalVariable(name: "ierr__", scope: !718, file: !288, line: 107, type: !91)
!718 = distinct !DILexicalBlock(scope: !685, file: !288, line: 107, column: 10)
!719 = !DILocalVariable(name: "ierr__", scope: !720, file: !288, line: 107, type: !91)
!720 = distinct !DILexicalBlock(scope: !721, file: !288, line: 107, column: 10)
!721 = distinct !DILexicalBlock(scope: !722, file: !288, line: 107, column: 10)
!722 = distinct !DILexicalBlock(scope: !685, file: !288, line: 107, column: 10)
!723 = !DILocalVariable(name: "ierr__", scope: !724, file: !288, line: 107, type: !91)
!724 = distinct !DILexicalBlock(scope: !725, file: !288, line: 107, column: 10)
!725 = distinct !DILexicalBlock(scope: !726, file: !288, line: 107, column: 10)
!726 = distinct !DILexicalBlock(scope: !727, file: !288, line: 107, column: 10)
!727 = distinct !DILexicalBlock(scope: !728, file: !288, line: 107, column: 10)
!728 = distinct !DILexicalBlock(scope: !729, file: !288, line: 107, column: 10)
!729 = distinct !DILexicalBlock(scope: !721, file: !288, line: 107, column: 10)
!730 = !DILocalVariable(name: "_7_errorcode", scope: !731, file: !288, line: 107, type: !91)
!731 = distinct !DILexicalBlock(scope: !725, file: !288, line: 107, column: 10)
!732 = !DILocalVariable(name: "_7_errorstring", scope: !733, file: !288, line: 107, type: !674)
!733 = distinct !DILexicalBlock(scope: !734, file: !288, line: 107, column: 10)
!734 = distinct !DILexicalBlock(scope: !731, file: !288, line: 107, column: 10)
!735 = !DILocalVariable(name: "_7_resultlen", scope: !733, file: !288, line: 107, type: !150)
!736 = !DILocalVariable(name: "ierr__", scope: !737, file: !288, line: 107, type: !91)
!737 = distinct !DILexicalBlock(scope: !738, file: !288, line: 107, column: 10)
!738 = distinct !DILexicalBlock(scope: !739, file: !288, line: 107, column: 10)
!739 = distinct !DILexicalBlock(scope: !725, file: !288, line: 107, column: 10)
!740 = !DILocalVariable(name: "ierr__", scope: !741, file: !288, line: 107, type: !91)
!741 = distinct !DILexicalBlock(scope: !728, file: !288, line: 107, column: 10)
!742 = !DILocalVariable(name: "ierr__", scope: !743, file: !288, line: 107, type: !91)
!743 = distinct !DILexicalBlock(scope: !685, file: !288, line: 107, column: 41)
!744 = !DILocalVariable(name: "ierr__", scope: !745, file: !288, line: 108, type: !91)
!745 = distinct !DILexicalBlock(scope: !685, file: !288, line: 108, column: 59)
!746 = !DILocalVariable(name: "ierr__", scope: !747, file: !288, line: 109, type: !91)
!747 = distinct !DILexicalBlock(scope: !685, file: !288, line: 109, column: 59)
!748 = !DILocalVariable(name: "ierr__", scope: !749, file: !288, line: 110, type: !91)
!749 = distinct !DILexicalBlock(scope: !685, file: !288, line: 110, column: 59)
!750 = !DILocalVariable(name: "ierr__", scope: !751, file: !288, line: 111, type: !91)
!751 = distinct !DILexicalBlock(scope: !685, file: !288, line: 111, column: 59)
!752 = !DILocalVariable(name: "ierr__", scope: !753, file: !288, line: 112, type: !91)
!753 = distinct !DILexicalBlock(scope: !754, file: !288, line: 112, column: 10)
!754 = distinct !DILexicalBlock(scope: !755, file: !288, line: 112, column: 10)
!755 = distinct !DILexicalBlock(scope: !685, file: !288, line: 112, column: 10)
!756 = !DILocalVariable(name: "_7_errorcode", scope: !757, file: !288, line: 112, type: !91)
!757 = distinct !DILexicalBlock(scope: !754, file: !288, line: 112, column: 10)
!758 = !DILocalVariable(name: "_7_errorstring", scope: !759, file: !288, line: 112, type: !674)
!759 = distinct !DILexicalBlock(scope: !760, file: !288, line: 112, column: 10)
!760 = distinct !DILexicalBlock(scope: !757, file: !288, line: 112, column: 10)
!761 = !DILocalVariable(name: "_7_resultlen", scope: !759, file: !288, line: 112, type: !150)
!762 = !DILocalVariable(name: "ierr__", scope: !763, file: !288, line: 112, type: !91)
!763 = distinct !DILexicalBlock(scope: !764, file: !288, line: 112, column: 10)
!764 = distinct !DILexicalBlock(scope: !765, file: !288, line: 112, column: 10)
!765 = distinct !DILexicalBlock(scope: !754, file: !288, line: 112, column: 10)
!766 = !DILocalVariable(name: "ierr__", scope: !767, file: !288, line: 112, type: !91)
!767 = distinct !DILexicalBlock(scope: !654, file: !288, line: 112, column: 39)
!768 = !DILocalVariable(name: "ierr__", scope: !769, file: !288, line: 113, type: !91)
!769 = distinct !DILexicalBlock(scope: !654, file: !288, line: 113, column: 31)
!770 = !DILocalVariable(name: "ierr__", scope: !771, file: !288, line: 121, type: !91)
!771 = distinct !DILexicalBlock(scope: !772, file: !288, line: 121, column: 57)
!772 = distinct !DILexicalBlock(scope: !773, file: !288, line: 120, column: 31)
!773 = distinct !DILexicalBlock(scope: !654, file: !288, line: 120, column: 7)
!774 = !DILocation(line: 0, scope: !654)
!775 = !DILocation(line: 86, column: 3, scope: !654)
!776 = !DILocation(line: 88, column: 3, scope: !654)
!777 = !DILocation(line: 91, column: 3, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !288, line: 91, column: 3)
!779 = distinct !DILexicalBlock(scope: !780, file: !288, line: 91, column: 3)
!780 = distinct !DILexicalBlock(scope: !654, file: !288, line: 91, column: 3)
!781 = !DILocation(line: 91, column: 3, scope: !779)
!782 = !DILocation(line: 91, column: 3, scope: !783)
!783 = distinct !DILexicalBlock(scope: !784, file: !288, line: 91, column: 3)
!784 = distinct !DILexicalBlock(scope: !778, file: !288, line: 91, column: 3)
!785 = !DILocation(line: 91, column: 3, scope: !784)
!786 = !DILocation(line: 91, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !783, file: !288, line: 91, column: 3)
!788 = !DILocation(line: 92, column: 3, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !288, line: 92, column: 3)
!790 = distinct !DILexicalBlock(scope: !654, file: !288, line: 92, column: 3)
!791 = !DILocation(line: 92, column: 3, scope: !790)
!792 = !DILocation(line: 92, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !790, file: !288, line: 92, column: 3)
!794 = !DILocation(line: 92, column: 3, scope: !795)
!795 = distinct !DILexicalBlock(scope: !790, file: !288, line: 92, column: 3)
!796 = !DILocation(line: 92, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !288, line: 92, column: 3)
!798 = distinct !DILexicalBlock(scope: !795, file: !288, line: 92, column: 3)
!799 = !DILocation(line: 92, column: 3, scope: !798)
!800 = !DILocation(line: 93, column: 10, scope: !654)
!801 = !DILocation(line: 0, scope: !668)
!802 = !DILocation(line: 93, column: 40, scope: !803)
!803 = distinct !DILexicalBlock(scope: !668, file: !288, line: 93, column: 40)
!804 = !DILocation(line: 93, column: 40, scope: !668)
!805 = !DILocation(line: 94, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !654, file: !288, line: 94, column: 7)
!807 = !{!468, !468, i64 0}
!808 = !DILocation(line: 94, column: 7, scope: !654)
!809 = !DILocation(line: 94, column: 15, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !288, line: 94, column: 15)
!811 = distinct !DILexicalBlock(scope: !812, file: !288, line: 94, column: 15)
!812 = distinct !DILexicalBlock(scope: !806, file: !288, line: 94, column: 15)
!813 = !DILocation(line: 94, column: 15, scope: !811)
!814 = !DILocation(line: 94, column: 15, scope: !815)
!815 = distinct !DILexicalBlock(scope: !816, file: !288, line: 94, column: 15)
!816 = distinct !DILexicalBlock(scope: !810, file: !288, line: 94, column: 15)
!817 = !DILocation(line: 94, column: 15, scope: !816)
!818 = !DILocation(line: 94, column: 15, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !288, line: 94, column: 15)
!820 = distinct !DILexicalBlock(scope: !815, file: !288, line: 94, column: 15)
!821 = !DILocation(line: 94, column: 15, scope: !820)
!822 = !DILocation(line: 94, column: 15, scope: !823)
!823 = distinct !DILexicalBlock(scope: !819, file: !288, line: 94, column: 15)
!824 = !DILocation(line: 94, column: 15, scope: !825)
!825 = distinct !DILexicalBlock(scope: !815, file: !288, line: 94, column: 15)
!826 = !DILocation(line: 94, column: 15, scope: !827)
!827 = distinct !DILexicalBlock(scope: !825, file: !288, line: 94, column: 15)
!828 = !DILocation(line: 94, column: 15, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !288, line: 94, column: 15)
!830 = distinct !DILexicalBlock(scope: !827, file: !288, line: 94, column: 15)
!831 = !DILocation(line: 94, column: 15, scope: !830)
!832 = !DILocation(line: 94, column: 15, scope: !833)
!833 = distinct !DILexicalBlock(scope: !829, file: !288, line: 94, column: 15)
!834 = !DILocation(line: 95, column: 24, scope: !654)
!835 = !DILocation(line: 95, column: 10, scope: !654)
!836 = !DILocation(line: 0, scope: !670)
!837 = !DILocation(line: 95, column: 66, scope: !673)
!838 = !DILocation(line: 95, column: 66, scope: !670)
!839 = !DILocation(line: 95, column: 66, scope: !672)
!840 = !DILocation(line: 0, scope: !672)
!841 = !DILocation(line: 96, column: 24, scope: !654)
!842 = !DILocation(line: 96, column: 10, scope: !654)
!843 = !DILocation(line: 0, scope: !679)
!844 = !DILocation(line: 96, column: 66, scope: !682)
!845 = !DILocation(line: 96, column: 66, scope: !679)
!846 = !DILocation(line: 96, column: 66, scope: !681)
!847 = !DILocation(line: 0, scope: !681)
!848 = !DILocation(line: 98, column: 23, scope: !654)
!849 = !DILocation(line: 98, column: 21, scope: !654)
!850 = !DILocation(line: 98, column: 7, scope: !654)
!851 = !DILocation(line: 99, column: 3, scope: !654)
!852 = !DILocation(line: 99, column: 11, scope: !654)
!853 = !DILocation(line: 99, column: 14, scope: !654)
!854 = !DILocation(line: 99, column: 23, scope: !654)
!855 = distinct !{!855, !851, !854, !856}
!856 = !{!"llvm.loop.mustprogress"}
!857 = !DILocation(line: 101, column: 12, scope: !654)
!858 = !DILocation(line: 101, column: 11, scope: !654)
!859 = !DILocation(line: 102, column: 9, scope: !654)
!860 = !DILocation(line: 102, column: 14, scope: !654)
!861 = !DILocation(line: 102, column: 8, scope: !654)
!862 = !DILocation(line: 102, column: 18, scope: !654)
!863 = !DILocation(line: 103, column: 11, scope: !654)
!864 = !DILocation(line: 104, column: 14, scope: !654)
!865 = !DILocation(line: 104, column: 8, scope: !654)
!866 = !DILocation(line: 104, column: 18, scope: !654)
!867 = !DILocation(line: 105, column: 11, scope: !654)
!868 = !DILocation(line: 107, column: 10, scope: !685)
!869 = !DILocation(line: 0, scope: !685)
!870 = !DILocation(line: 0, scope: !718)
!871 = !DILocation(line: 107, column: 10, scope: !872)
!872 = distinct !DILexicalBlock(scope: !718, file: !288, line: 107, column: 10)
!873 = !DILocation(line: 107, column: 10, scope: !718)
!874 = !DILocation(line: 107, column: 10, scope: !722)
!875 = !DILocation(line: 107, column: 10, scope: !721)
!876 = !DILocation(line: 0, scope: !720)
!877 = !DILocation(line: 107, column: 10, scope: !878)
!878 = distinct !DILexicalBlock(scope: !720, file: !288, line: 107, column: 10)
!879 = !DILocation(line: 107, column: 10, scope: !720)
!880 = !DILocation(line: 107, column: 10, scope: !729)
!881 = !DILocation(line: 107, column: 10, scope: !728)
!882 = !DILocation(line: 107, column: 10, scope: !726)
!883 = !DILocation(line: 107, column: 10, scope: !727)
!884 = !DILocation(line: 107, column: 10, scope: !725)
!885 = !DILocation(line: 0, scope: !724)
!886 = !DILocation(line: 107, column: 10, scope: !887)
!887 = distinct !DILexicalBlock(scope: !724, file: !288, line: 107, column: 10)
!888 = !DILocation(line: 107, column: 10, scope: !724)
!889 = !DILocalVariable(name: "comm", arg: 1, scope: !890, file: !891, line: 498, type: !69)
!890 = distinct !DISubprogram(name: "PetscMPIParallelComm", scope: !891, file: !891, line: 498, type: !892, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !894)
!891 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!892 = !DISubroutineType(types: !893)
!893 = !{!81, !69}
!894 = !{!889, !895}
!895 = !DILocalVariable(name: "size", scope: !890, file: !891, line: 500, type: !150)
!896 = !DILocation(line: 0, scope: !890, inlinedAt: !897)
!897 = distinct !DILocation(line: 107, column: 10, scope: !725)
!898 = !DILocation(line: 500, column: 3, scope: !890, inlinedAt: !897)
!899 = !DILocation(line: 500, column: 21, scope: !890, inlinedAt: !897)
!900 = !DILocation(line: 500, column: 55, scope: !890, inlinedAt: !897)
!901 = !DILocation(line: 500, column: 60, scope: !890, inlinedAt: !897)
!902 = !DILocation(line: 501, column: 1, scope: !890, inlinedAt: !897)
!903 = !DILocation(line: 0, scope: !731)
!904 = !DILocation(line: 107, column: 10, scope: !734)
!905 = !DILocation(line: 107, column: 10, scope: !731)
!906 = !DILocation(line: 107, column: 10, scope: !733)
!907 = !DILocation(line: 0, scope: !733)
!908 = !DILocation(line: 107, column: 10, scope: !739)
!909 = !DILocation(line: 107, column: 10, scope: !738)
!910 = !DILocation(line: 0, scope: !737)
!911 = !DILocation(line: 107, column: 10, scope: !912)
!912 = distinct !DILexicalBlock(scope: !737, file: !288, line: 107, column: 10)
!913 = !DILocation(line: 107, column: 10, scope: !737)
!914 = !DILocation(line: 107, column: 10, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !288, line: 107, column: 10)
!916 = distinct !DILexicalBlock(scope: !917, file: !288, line: 107, column: 10)
!917 = distinct !DILexicalBlock(scope: !738, file: !288, line: 107, column: 10)
!918 = !DILocation(line: 107, column: 10, scope: !916)
!919 = !DILocation(line: 107, column: 10, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !288, line: 107, column: 10)
!921 = distinct !DILexicalBlock(scope: !915, file: !288, line: 107, column: 10)
!922 = !DILocation(line: 107, column: 10, scope: !921)
!923 = !DILocation(line: 107, column: 10, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !288, line: 107, column: 10)
!925 = distinct !DILexicalBlock(scope: !920, file: !288, line: 107, column: 10)
!926 = !DILocation(line: 107, column: 10, scope: !925)
!927 = !DILocation(line: 107, column: 10, scope: !928)
!928 = distinct !DILexicalBlock(scope: !924, file: !288, line: 107, column: 10)
!929 = !DILocation(line: 107, column: 10, scope: !930)
!930 = distinct !DILexicalBlock(scope: !920, file: !288, line: 107, column: 10)
!931 = !DILocation(line: 107, column: 10, scope: !932)
!932 = distinct !DILexicalBlock(scope: !930, file: !288, line: 107, column: 10)
!933 = !DILocation(line: 107, column: 10, scope: !934)
!934 = distinct !DILexicalBlock(scope: !935, file: !288, line: 107, column: 10)
!935 = distinct !DILexicalBlock(scope: !932, file: !288, line: 107, column: 10)
!936 = !DILocation(line: 107, column: 10, scope: !935)
!937 = !DILocation(line: 107, column: 10, scope: !938)
!938 = distinct !DILexicalBlock(scope: !934, file: !288, line: 107, column: 10)
!939 = !DILocation(line: 108, column: 10, scope: !685)
!940 = !DILocation(line: 0, scope: !745)
!941 = !DILocation(line: 108, column: 59, scope: !942)
!942 = distinct !DILexicalBlock(scope: !745, file: !288, line: 108, column: 59)
!943 = !DILocation(line: 108, column: 59, scope: !745)
!944 = !DILocation(line: 109, column: 10, scope: !685)
!945 = !DILocation(line: 0, scope: !747)
!946 = !DILocation(line: 109, column: 59, scope: !947)
!947 = distinct !DILexicalBlock(scope: !747, file: !288, line: 109, column: 59)
!948 = !DILocation(line: 109, column: 59, scope: !747)
!949 = !DILocation(line: 110, column: 10, scope: !685)
!950 = !DILocation(line: 0, scope: !749)
!951 = !DILocation(line: 110, column: 59, scope: !952)
!952 = distinct !DILexicalBlock(scope: !749, file: !288, line: 110, column: 59)
!953 = !DILocation(line: 110, column: 59, scope: !749)
!954 = !DILocation(line: 111, column: 10, scope: !685)
!955 = !DILocation(line: 0, scope: !751)
!956 = !DILocation(line: 111, column: 59, scope: !957)
!957 = distinct !DILexicalBlock(scope: !751, file: !288, line: 111, column: 59)
!958 = !DILocation(line: 111, column: 59, scope: !751)
!959 = !DILocation(line: 112, column: 10, scope: !755)
!960 = !DILocation(line: 112, column: 10, scope: !685)
!961 = !DILocation(line: 112, column: 10, scope: !754)
!962 = !DILocation(line: 0, scope: !753)
!963 = !DILocation(line: 112, column: 10, scope: !964)
!964 = distinct !DILexicalBlock(scope: !753, file: !288, line: 112, column: 10)
!965 = !DILocation(line: 112, column: 10, scope: !753)
!966 = !DILocation(line: 0, scope: !890, inlinedAt: !967)
!967 = distinct !DILocation(line: 112, column: 10, scope: !754)
!968 = !DILocation(line: 500, column: 3, scope: !890, inlinedAt: !967)
!969 = !DILocation(line: 500, column: 21, scope: !890, inlinedAt: !967)
!970 = !DILocation(line: 500, column: 55, scope: !890, inlinedAt: !967)
!971 = !DILocation(line: 500, column: 60, scope: !890, inlinedAt: !967)
!972 = !DILocation(line: 501, column: 1, scope: !890, inlinedAt: !967)
!973 = !DILocation(line: 0, scope: !757)
!974 = !DILocation(line: 112, column: 10, scope: !760)
!975 = !DILocation(line: 112, column: 10, scope: !757)
!976 = !DILocation(line: 112, column: 10, scope: !759)
!977 = !DILocation(line: 0, scope: !759)
!978 = !DILocation(line: 112, column: 10, scope: !765)
!979 = !DILocation(line: 112, column: 10, scope: !764)
!980 = !DILocation(line: 0, scope: !763)
!981 = !DILocation(line: 112, column: 10, scope: !982)
!982 = distinct !DILexicalBlock(scope: !763, file: !288, line: 112, column: 10)
!983 = !DILocation(line: 112, column: 10, scope: !763)
!984 = !DILocation(line: 112, column: 10, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !288, line: 112, column: 10)
!986 = distinct !DILexicalBlock(scope: !987, file: !288, line: 112, column: 10)
!987 = distinct !DILexicalBlock(scope: !764, file: !288, line: 112, column: 10)
!988 = !DILocation(line: 112, column: 10, scope: !986)
!989 = !DILocation(line: 112, column: 10, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !288, line: 112, column: 10)
!991 = distinct !DILexicalBlock(scope: !985, file: !288, line: 112, column: 10)
!992 = !DILocation(line: 112, column: 10, scope: !991)
!993 = !DILocation(line: 112, column: 10, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !288, line: 112, column: 10)
!995 = distinct !DILexicalBlock(scope: !990, file: !288, line: 112, column: 10)
!996 = !DILocation(line: 112, column: 10, scope: !995)
!997 = !DILocation(line: 112, column: 10, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !288, line: 112, column: 10)
!999 = !DILocation(line: 112, column: 10, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !990, file: !288, line: 112, column: 10)
!1001 = !DILocation(line: 112, column: 10, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1000, file: !288, line: 112, column: 10)
!1003 = !DILocation(line: 112, column: 10, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !288, line: 112, column: 10)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !288, line: 112, column: 10)
!1006 = !DILocation(line: 112, column: 10, scope: !1005)
!1007 = !DILocation(line: 112, column: 10, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !288, line: 112, column: 10)
!1009 = !DILocation(line: 112, column: 10, scope: !654)
!1010 = !DILocation(line: 0, scope: !767)
!1011 = !DILocation(line: 112, column: 39, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !767, file: !288, line: 112, column: 39)
!1013 = !DILocation(line: 112, column: 39, scope: !767)
!1014 = !DILocation(line: 113, column: 10, scope: !654)
!1015 = !DILocation(line: 0, scope: !769)
!1016 = !DILocation(line: 113, column: 31, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !769, file: !288, line: 113, column: 31)
!1018 = !DILocation(line: 113, column: 31, scope: !769)
!1019 = !DILocation(line: 115, column: 27, scope: !654)
!1020 = !DILocation(line: 115, column: 22, scope: !654)
!1021 = !DILocation(line: 115, column: 9, scope: !654)
!1022 = !DILocation(line: 115, column: 17, scope: !654)
!1023 = !DILocation(line: 116, column: 22, scope: !654)
!1024 = !DILocation(line: 116, column: 9, scope: !654)
!1025 = !DILocation(line: 116, column: 17, scope: !654)
!1026 = !DILocation(line: 117, column: 22, scope: !654)
!1027 = !DILocation(line: 117, column: 9, scope: !654)
!1028 = !DILocation(line: 117, column: 17, scope: !654)
!1029 = !DILocation(line: 118, column: 22, scope: !654)
!1030 = !DILocation(line: 118, column: 9, scope: !654)
!1031 = !DILocation(line: 118, column: 17, scope: !654)
!1032 = !DILocation(line: 120, column: 18, scope: !773)
!1033 = !DILocation(line: 120, column: 7, scope: !773)
!1034 = !DILocation(line: 120, column: 7, scope: !654)
!1035 = !DILocation(line: 121, column: 13, scope: !772)
!1036 = !DILocation(line: 0, scope: !771)
!1037 = !DILocation(line: 121, column: 57, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !771, file: !288, line: 121, column: 57)
!1039 = !DILocation(line: 121, column: 57, scope: !771)
!1040 = !DILocation(line: 123, column: 3, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !288, line: 123, column: 3)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !288, line: 123, column: 3)
!1043 = distinct !DILexicalBlock(scope: !654, file: !288, line: 123, column: 3)
!1044 = !DILocation(line: 123, column: 3, scope: !1042)
!1045 = !DILocation(line: 123, column: 3, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !288, line: 123, column: 3)
!1047 = distinct !DILexicalBlock(scope: !1041, file: !288, line: 123, column: 3)
!1048 = !DILocation(line: 123, column: 3, scope: !1047)
!1049 = !DILocation(line: 123, column: 3, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !288, line: 123, column: 3)
!1051 = distinct !DILexicalBlock(scope: !1046, file: !288, line: 123, column: 3)
!1052 = !DILocation(line: 123, column: 3, scope: !1051)
!1053 = !DILocation(line: 123, column: 3, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !288, line: 123, column: 3)
!1055 = !DILocation(line: 123, column: 3, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1046, file: !288, line: 123, column: 3)
!1057 = !DILocation(line: 123, column: 3, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1056, file: !288, line: 123, column: 3)
!1059 = !DILocation(line: 123, column: 3, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !288, line: 123, column: 3)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !288, line: 123, column: 3)
!1062 = !DILocation(line: 123, column: 3, scope: !1061)
!1063 = !DILocation(line: 123, column: 3, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !288, line: 123, column: 3)
!1065 = !DILocation(line: 124, column: 1, scope: !654)
!1066 = !DISubprogram(name: "PetscDrawIsNull", scope: !25, file: !25, line: 111, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!81, !293, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!1070 = !DISubprogram(name: "MPI_Comm_rank", scope: !70, file: !70, line: 1324, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!81, !71, !399}
!1073 = !DISubprogram(name: "PetscObjectComm", scope: !1074, file: !1074, line: 2649, type: !1075, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1074 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!71, !75}
!1077 = !DISubprogram(name: "MPI_Error_string", scope: !70, file: !70, line: 1357, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!81, !81, !160, !399}
!1080 = !DISubprogram(name: "MPI_Comm_size", scope: !70, file: !70, line: 1331, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1081 = !DISubprogram(name: "PetscObjectTypeCompare", scope: !1074, file: !1074, line: 1505, type: !1082, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!81, !75, !110, !1069}
!1084 = distinct !DISubprogram(name: "PetscMemcpy", scope: !1074, file: !1074, line: 1792, type: !1085, scopeLine: 1793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1087)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!91, !73, !560, !244}
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093}
!1088 = !DILocalVariable(name: "a", arg: 1, scope: !1084, file: !1074, line: 1792, type: !73)
!1089 = !DILocalVariable(name: "b", arg: 2, scope: !1084, file: !1074, line: 1792, type: !560)
!1090 = !DILocalVariable(name: "n", arg: 3, scope: !1084, file: !1074, line: 1792, type: !244)
!1091 = !DILocalVariable(name: "al", scope: !1084, file: !1074, line: 1795, type: !244)
!1092 = !DILocalVariable(name: "bl", scope: !1084, file: !1074, line: 1795, type: !244)
!1093 = !DILocalVariable(name: "nl", scope: !1084, file: !1074, line: 1796, type: !244)
!1094 = !DILocation(line: 0, scope: !1084)
!1095 = !DILocation(line: 1795, column: 15, scope: !1084)
!1096 = !DILocation(line: 1795, column: 31, scope: !1084)
!1097 = !DILocation(line: 1797, column: 3, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !1074, line: 1797, column: 3)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !1074, line: 1797, column: 3)
!1100 = distinct !DILexicalBlock(scope: !1084, file: !1074, line: 1797, column: 3)
!1101 = !DILocation(line: 1797, column: 3, scope: !1099)
!1102 = !DILocation(line: 1797, column: 3, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !1074, line: 1797, column: 3)
!1104 = distinct !DILexicalBlock(scope: !1098, file: !1074, line: 1797, column: 3)
!1105 = !DILocation(line: 1797, column: 3, scope: !1104)
!1106 = !DILocation(line: 1797, column: 3, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1103, file: !1074, line: 1797, column: 3)
!1108 = !DILocation(line: 1798, column: 13, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1084, file: !1074, line: 1798, column: 7)
!1110 = !DILocation(line: 1798, column: 20, scope: !1109)
!1111 = !DILocation(line: 1799, column: 13, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1084, file: !1074, line: 1799, column: 7)
!1113 = !DILocation(line: 1799, column: 20, scope: !1112)
!1114 = !DILocation(line: 1803, column: 9, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1084, file: !1074, line: 1803, column: 7)
!1116 = !DILocation(line: 1803, column: 14, scope: !1115)
!1117 = !DILocation(line: 1805, column: 13, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !1074, line: 1805, column: 9)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !1074, line: 1803, column: 24)
!1120 = !DILocation(line: 1805, column: 18, scope: !1118)
!1121 = !DILocation(line: 1805, column: 57, scope: !1118)
!1122 = !DILocation(line: 1828, column: 5, scope: !1119)
!1123 = !DILocation(line: 1831, column: 3, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !1074, line: 1831, column: 3)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !1074, line: 1831, column: 3)
!1126 = distinct !DILexicalBlock(scope: !1084, file: !1074, line: 1831, column: 3)
!1127 = !DILocation(line: 1830, column: 3, scope: !1119)
!1128 = !DILocation(line: 1831, column: 3, scope: !1125)
!1129 = !DILocation(line: 1831, column: 3, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !1074, line: 1831, column: 3)
!1131 = distinct !DILexicalBlock(scope: !1124, file: !1074, line: 1831, column: 3)
!1132 = !DILocation(line: 1831, column: 3, scope: !1131)
!1133 = !DILocation(line: 1831, column: 3, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !1074, line: 1831, column: 3)
!1135 = distinct !DILexicalBlock(scope: !1130, file: !1074, line: 1831, column: 3)
!1136 = !DILocation(line: 1831, column: 3, scope: !1135)
!1137 = !DILocation(line: 1831, column: 3, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !1074, line: 1831, column: 3)
!1139 = !DILocation(line: 1831, column: 3, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1130, file: !1074, line: 1831, column: 3)
!1141 = !DILocation(line: 1831, column: 3, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1140, file: !1074, line: 1831, column: 3)
!1143 = !DILocation(line: 1831, column: 3, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !1074, line: 1831, column: 3)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !1074, line: 1831, column: 3)
!1146 = !DILocation(line: 1831, column: 3, scope: !1145)
!1147 = !DILocation(line: 1831, column: 3, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1144, file: !1074, line: 1831, column: 3)
!1149 = !DILocation(line: 1832, column: 1, scope: !1084)
!1150 = !DISubprogram(name: "PetscSetXIOErrorHandler", scope: !25, file: !25, line: 326, type: !1151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!711, !711}
!1153 = !DISubprogram(name: "MPI_Allreduce", scope: !70, file: !70, line: 1218, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!81, !560, !73, !81, !1156, !279, !71}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !70, line: 331, flags: DIFlagFwdDecl)
!1158 = !DISubprogram(name: "PetscDrawSetType", scope: !25, file: !25, line: 17, type: !1159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!81, !293, !110}
!1161 = !DISubprogram(name: "PetscDrawLine", scope: !25, file: !25, line: 124, type: !1162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!81, !293, !136, !136, !136, !136, !81}
!1164 = !DISubprogram(name: "PetscDrawFlush", scope: !25, file: !25, line: 181, type: !1165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !556)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!81, !293}
!1167 = distinct !DISubprogram(name: "PetscDrawViewPortsCreate", scope: !288, file: !288, line: 146, type: !1168, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1185)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!91, !291, !133, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawViewPorts", file: !25, line: 228, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 220, size: 640, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nports", scope: !1173, file: !25, line: 221, baseType: !133, size: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !1173, file: !25, line: 222, baseType: !186, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "xr", scope: !1173, file: !25, line: 223, baseType: !186, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "yl", scope: !1173, file: !25, line: 224, baseType: !186, size: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "yr", scope: !1173, file: !25, line: 225, baseType: !186, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1173, file: !25, line: 226, baseType: !291, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !1173, file: !25, line: 227, baseType: !187, size: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !1173, file: !25, line: 227, baseType: !187, size: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !1173, file: !25, line: 227, baseType: !187, size: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !1173, file: !25, line: 227, baseType: !187, size: 64, offset: 576)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1202, !1204, !1207, !1208, !1210, !1212, !1214, !1216, !1218, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1231, !1238, !1240, !1243, !1244, !1248, !1250, !1252, !1259, !1261, !1263, !1265, !1269, !1271, !1274, !1275, !1279, !1281}
!1186 = !DILocalVariable(name: "draw", arg: 1, scope: !1167, file: !288, line: 146, type: !291)
!1187 = !DILocalVariable(name: "nports", arg: 2, scope: !1167, file: !288, line: 146, type: !133)
!1188 = !DILocalVariable(name: "newports", arg: 3, scope: !1167, file: !288, line: 146, type: !1170)
!1189 = !DILocalVariable(name: "ports", scope: !1167, file: !288, line: 148, type: !1171)
!1190 = !DILocalVariable(name: "i", scope: !1167, file: !288, line: 149, type: !133)
!1191 = !DILocalVariable(name: "n", scope: !1167, file: !288, line: 149, type: !133)
!1192 = !DILocalVariable(name: "isnull", scope: !1167, file: !288, line: 150, type: !248)
!1193 = !DILocalVariable(name: "rank", scope: !1167, file: !288, line: 151, type: !150)
!1194 = !DILocalVariable(name: "xl", scope: !1167, file: !288, line: 152, type: !186)
!1195 = !DILocalVariable(name: "xr", scope: !1167, file: !288, line: 152, type: !186)
!1196 = !DILocalVariable(name: "yl", scope: !1167, file: !288, line: 152, type: !186)
!1197 = !DILocalVariable(name: "yr", scope: !1167, file: !288, line: 152, type: !186)
!1198 = !DILocalVariable(name: "h", scope: !1167, file: !288, line: 152, type: !187)
!1199 = !DILocalVariable(name: "ierr", scope: !1167, file: !288, line: 153, type: !91)
!1200 = !DILocalVariable(name: "ierr__", scope: !1201, file: !288, line: 159, type: !91)
!1201 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 159, column: 40)
!1202 = !DILocalVariable(name: "_7_errorcode", scope: !1203, file: !288, line: 161, type: !91)
!1203 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 161, column: 66)
!1204 = !DILocalVariable(name: "_7_errorstring", scope: !1205, file: !288, line: 161, type: !674)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !288, line: 161, column: 66)
!1206 = distinct !DILexicalBlock(scope: !1203, file: !288, line: 161, column: 66)
!1207 = !DILocalVariable(name: "_7_resultlen", scope: !1205, file: !288, line: 161, type: !150)
!1208 = !DILocalVariable(name: "ierr__", scope: !1209, file: !288, line: 163, type: !91)
!1209 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 163, column: 27)
!1210 = !DILocalVariable(name: "ierr__", scope: !1211, file: !288, line: 166, type: !91)
!1211 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 166, column: 50)
!1212 = !DILocalVariable(name: "ierr__", scope: !1213, file: !288, line: 168, type: !91)
!1213 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 168, column: 101)
!1214 = !DILocalVariable(name: "ierr__", scope: !1215, file: !288, line: 174, type: !91)
!1215 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 174, column: 56)
!1216 = !DILocalVariable(name: "ierr__", scope: !1217, file: !288, line: 180, type: !91)
!1217 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 180, column: 56)
!1218 = !DILocalVariable(name: "_Petsc_ierr", scope: !1219, file: !288, line: 181, type: !91)
!1219 = distinct !DILexicalBlock(scope: !1167, file: !288, line: 181, column: 10)
!1220 = !DILocalVariable(name: "_Petsc_jmpbuf", scope: !1219, file: !288, line: 181, type: !687)
!1221 = !DILocalVariable(name: "_Petsc_xioerrhdl", scope: !1219, file: !288, line: 181, type: !709)
!1222 = !DILocalVariable(name: "_Petsc_isdrawx", scope: !1219, file: !288, line: 181, type: !248)
!1223 = !DILocalVariable(name: "_Petsc_xioerr", scope: !1219, file: !288, line: 181, type: !248)
!1224 = !DILocalVariable(name: "_Petsc_xioerr_local", scope: !1219, file: !288, line: 181, type: !248)
