; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glleadapt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glleadapt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glleadapt.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !{!53, !57, !58, !63, !66, !67, !231, !265, !266, !267, !174, !273, !147}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !54, line: 330, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !54, line: 330, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !59, line: 1451, baseType: !60)
!59 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !70, line: 73, size: 4480, elements: !71)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!71 = !{!72, !75, !118, !119, !121, !124, !125, !126, !127, !135, !136, !138, !142, !146, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !159, !160, !161, !163, !164, !166, !168, !169, !170, !171, !172, !175, !177, !178, !179, !180, !181, !184, !186, !187, !188, !198, !200, !201, !205, !206, !255, !260, !262, !263, !264}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !69, file: !70, line: 74, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !69, file: !70, line: 75, baseType: !76, size: 448, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 448, elements: !116)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !70, line: 53, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 45, size: 448, elements: !79)
!79 = !{!80, !86, !94, !99, !103, !107, !111}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !78, file: !70, line: 46, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !67, !85}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !78, file: !70, line: 47, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!84, !67, !90}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !91, line: 16, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !91, line: 16, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !78, file: !70, line: 48, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!84, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !78, file: !70, line: 49, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!84, !67, !63, !67}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !78, file: !70, line: 50, baseType: !104, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!84, !67, !63, !98}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !78, file: !70, line: 51, baseType: !108, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!84, !67, !63, !60}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !78, file: !70, line: 52, baseType: !112, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!84, !67, !63, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !69, file: !70, line: 76, baseType: !53, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !70, line: 77, baseType: !120, size: 32, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !69, file: !70, line: 78, baseType: !122, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !123)
!123 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !69, file: !70, line: 78, baseType: !122, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !69, file: !70, line: 78, baseType: !122, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !69, file: !70, line: 78, baseType: !122, size: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !70, line: 79, baseType: !128, size: 64, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !131, line: 27, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !133, line: 43, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!134 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !69, file: !70, line: 80, baseType: !120, size: 32, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !69, file: !70, line: 81, baseType: !137, size: 32, offset: 992)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !69, file: !70, line: 82, baseType: !139, size: 64, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !69, file: !70, line: 83, baseType: !143, size: 64, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !69, file: !70, line: 84, baseType: !147, size: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !69, file: !70, line: 85, baseType: !147, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !69, file: !70, line: 86, baseType: !147, size: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !69, file: !70, line: 87, baseType: !147, size: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !69, file: !70, line: 88, baseType: !67, size: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !69, file: !70, line: 89, baseType: !128, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !70, line: 90, baseType: !147, size: 64, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !69, file: !70, line: 91, baseType: !147, size: 64, offset: 1600)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !69, file: !70, line: 92, baseType: !120, size: 32, offset: 1664)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !69, file: !70, line: 93, baseType: !57, size: 64, offset: 1728)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !69, file: !70, line: 94, baseType: !158, size: 64, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !129)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !69, file: !70, line: 95, baseType: !120, size: 32, offset: 1856)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !69, file: !70, line: 95, baseType: !120, size: 32, offset: 1888)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !69, file: !70, line: 96, baseType: !162, size: 64, offset: 1920)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !69, file: !70, line: 96, baseType: !162, size: 64, offset: 1984)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !69, file: !70, line: 97, baseType: !165, size: 64, offset: 2048)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !69, file: !70, line: 97, baseType: !167, size: 64, offset: 2112)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !69, file: !70, line: 98, baseType: !120, size: 32, offset: 2176)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !69, file: !70, line: 98, baseType: !120, size: 32, offset: 2208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !69, file: !70, line: 99, baseType: !162, size: 64, offset: 2240)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !69, file: !70, line: 99, baseType: !162, size: 64, offset: 2304)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !69, file: !70, line: 100, baseType: !173, size: 64, offset: 2368)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !123)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !69, file: !70, line: 100, baseType: !176, size: 64, offset: 2432)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !69, file: !70, line: 101, baseType: !120, size: 32, offset: 2496)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !69, file: !70, line: 101, baseType: !120, size: 32, offset: 2528)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !69, file: !70, line: 102, baseType: !162, size: 64, offset: 2560)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !69, file: !70, line: 102, baseType: !162, size: 64, offset: 2624)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !69, file: !70, line: 103, baseType: !182, size: 64, offset: 2688)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !69, file: !70, line: 103, baseType: !185, size: 64, offset: 2752)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !69, file: !70, line: 104, baseType: !115, size: 64, offset: 2816)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !69, file: !70, line: 105, baseType: !120, size: 32, offset: 2880)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !69, file: !70, line: 106, baseType: !189, size: 128, offset: 2944)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, elements: !196)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !70, line: 64, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 61, size: 128, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !192, file: !70, line: 62, baseType: !60, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !192, file: !70, line: 63, baseType: !57, size: 64, offset: 64)
!196 = !{!197}
!197 = !DISubrange(count: 2)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !69, file: !70, line: 107, baseType: !199, size: 64, offset: 3072)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !196)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !69, file: !70, line: 108, baseType: !57, size: 64, offset: 3136)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !69, file: !70, line: 109, baseType: !202, size: 64, offset: 3200)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!84, !57}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !69, file: !70, line: 111, baseType: !120, size: 32, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !69, file: !70, line: 112, baseType: !207, size: 320, offset: 3328)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !253)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!84, !211, !67, !57}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !214)
!214 = !{!215, !216, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !213, file: !12, line: 100, baseType: !120, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !12, line: 101, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !228, !229, !230, !234, !236, !238, !239, !240}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !219, file: !12, line: 84, baseType: !147, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !219, file: !12, line: 85, baseType: !147, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !219, file: !12, line: 86, baseType: !57, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !219, file: !12, line: 87, baseType: !139, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !219, file: !12, line: 88, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !219, file: !12, line: 89, baseType: !65, size: 8, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !219, file: !12, line: 90, baseType: !147, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !219, file: !12, line: 91, baseType: !231, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 46, baseType: !233)
!232 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!233 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !219, file: !12, line: 92, baseType: !235, size: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !12, line: 93, baseType: !237, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !12, line: 94, baseType: !217, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !219, file: !12, line: 95, baseType: !147, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !219, file: !12, line: 96, baseType: !57, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !213, file: !12, line: 102, baseType: !147, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !213, file: !12, line: 102, baseType: !147, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !213, file: !12, line: 103, baseType: !147, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !213, file: !12, line: 104, baseType: !53, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !213, file: !12, line: 105, baseType: !235, size: 32, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !213, file: !12, line: 105, baseType: !235, size: 32, offset: 416)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !213, file: !12, line: 105, baseType: !235, size: 32, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !213, file: !12, line: 106, baseType: !67, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !213, file: !12, line: 107, baseType: !250, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!253 = !{!254}
!254 = !DISubrange(count: 5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !69, file: !70, line: 113, baseType: !256, size: 320, offset: 3648)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!84, !67, !57}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !69, file: !70, line: 114, baseType: !261, size: 320, offset: 3968)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 320, elements: !253)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !69, file: !70, line: 115, baseType: !235, size: 32, offset: 4288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !69, file: !70, line: 120, baseType: !250, size: 64, offset: 4352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !69, file: !70, line: 121, baseType: !235, size: 32, offset: 4416)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !70, line: 130, baseType: !95)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !70, line: 131, baseType: !87)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdapt_Size", file: !269, line: 272, baseType: !270)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glleadapt.c", directory: "/home/users/ndemeye/xSDK")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 270, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "desired_h", scope: !270, file: !269, line: 271, baseType: !174, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdapt_Both", file: !269, line: 315, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 312, size: 128, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "count_at_order", scope: !275, file: !269, line: 313, baseType: !120, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desired_h", scope: !275, file: !269, line: 314, baseType: !174, size: 64, offset: 64)
!279 = !{!0, !280, !282, !284}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "TSGLLEAdaptPackageInitialized", scope: !2, file: !269, line: 5, type: !235, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "TSGLLEAdaptRegisterAllCalled", scope: !2, file: !269, line: 6, type: !235, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "TSGLLEADAPT_CLASSID", scope: !2, file: !269, line: 7, type: !73, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !{i32 7, !"Dwarf Version", i32 4}
!289 = !{i32 2, !"Debug Info Version", i32 3}
!290 = !{i32 1, !"wchar_size", i32 4}
!291 = !{i32 7, !"PIC Level", i32 2}
!292 = !{i32 7, !"uwtable", i32 1}
!293 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!294 = distinct !DISubprogram(name: "TSGLLEAdaptRegister", scope: !269, file: !269, line: 51, type: !295, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !330)
!295 = !DISubroutineType(types: !296)
!296 = !{!84, !63, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!84, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdapt", file: !301, line: 751, baseType: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscts.h", directory: "/home/users/ndemeye/xSDK")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSGLLEAdapt", file: !269, line: 16, size: 4800, elements: !304)
!304 = !{!305, !307, !329}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !303, file: !269, line: 17, baseType: !306, size: 4480)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !70, line: 122, baseType: !69)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !303, file: !269, line: 17, baseType: !308, size: 256, offset: 4480)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 256, elements: !116)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSGLLEAdaptOps", file: !269, line: 9, size: 256, elements: !310)
!310 = !{!311, !320, !321, !325}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !309, file: !269, line: 10, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!84, !300, !120, !315, !317, !317, !120, !174, !174, !165, !173, !319}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !309, file: !269, line: 11, baseType: !297, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !309, file: !269, line: 12, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!84, !300, !90}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !309, file: !269, line: 13, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!84, !211, !300}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !269, line: 18, baseType: !57, size: 64, offset: 4736)
!330 = !{!331, !332, !333, !334, !336}
!331 = !DILocalVariable(name: "sname", arg: 1, scope: !294, file: !269, line: 51, type: !63)
!332 = !DILocalVariable(name: "function", arg: 2, scope: !294, file: !269, line: 51, type: !297)
!333 = !DILocalVariable(name: "ierr", scope: !294, file: !269, line: 53, type: !84)
!334 = !DILocalVariable(name: "ierr__", scope: !335, file: !269, line: 56, type: !84)
!335 = distinct !DILexicalBlock(scope: !294, file: !269, line: 56, column: 41)
!336 = !DILocalVariable(name: "ierr__", scope: !337, file: !269, line: 57, type: !84)
!337 = distinct !DILexicalBlock(scope: !294, file: !269, line: 57, column: 64)
!338 = !DILocation(line: 0, scope: !294)
!339 = !DILocation(line: 55, column: 3, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !269, line: 55, column: 3)
!341 = distinct !DILexicalBlock(scope: !342, file: !269, line: 55, column: 3)
!342 = distinct !DILexicalBlock(scope: !294, file: !269, line: 55, column: 3)
!343 = !{!344, !344, i64 0}
!344 = !{!"any pointer", !345, i64 0}
!345 = !{!"omnipotent char", !346, i64 0}
!346 = !{!"Simple C/C++ TBAA"}
!347 = !DILocation(line: 55, column: 3, scope: !341)
!348 = !DILocation(line: 55, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !350, file: !269, line: 55, column: 3)
!350 = distinct !DILexicalBlock(scope: !340, file: !269, line: 55, column: 3)
!351 = !{!352, !353, i64 1536}
!352 = !{!"", !345, i64 0, !345, i64 512, !345, i64 1024, !345, i64 1280, !353, i64 1536, !353, i64 1540, !345, i64 1544}
!353 = !{!"int", !345, i64 0}
!354 = !DILocation(line: 55, column: 3, scope: !350)
!355 = !DILocation(line: 55, column: 3, scope: !356)
!356 = distinct !DILexicalBlock(scope: !349, file: !269, line: 55, column: 3)
!357 = !{!353, !353, i64 0}
!358 = !{!352, !353, i64 1540}
!359 = !DILocation(line: 56, column: 10, scope: !294)
!360 = !DILocation(line: 0, scope: !335)
!361 = !DILocation(line: 56, column: 41, scope: !362)
!362 = distinct !DILexicalBlock(scope: !335, file: !269, line: 56, column: 41)
!363 = !DILocation(line: 56, column: 41, scope: !335)
!364 = !{!"branch_weights", i32 2000, i32 1}
!365 = !DILocation(line: 57, column: 10, scope: !294)
!366 = !DILocation(line: 0, scope: !337)
!367 = !DILocation(line: 57, column: 64, scope: !368)
!368 = distinct !DILexicalBlock(scope: !337, file: !269, line: 57, column: 64)
!369 = !DILocation(line: 57, column: 64, scope: !337)
!370 = !DILocation(line: 58, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !269, line: 58, column: 3)
!372 = distinct !DILexicalBlock(scope: !373, file: !269, line: 58, column: 3)
!373 = distinct !DILexicalBlock(scope: !294, file: !269, line: 58, column: 3)
!374 = !DILocation(line: 58, column: 3, scope: !372)
!375 = !DILocation(line: 58, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !269, line: 58, column: 3)
!377 = distinct !DILexicalBlock(scope: !371, file: !269, line: 58, column: 3)
!378 = !DILocation(line: 58, column: 3, scope: !377)
!379 = !DILocation(line: 58, column: 3, scope: !380)
!380 = distinct !DILexicalBlock(scope: !381, file: !269, line: 58, column: 3)
!381 = distinct !DILexicalBlock(scope: !376, file: !269, line: 58, column: 3)
!382 = !{!352, !345, i64 1544}
!383 = !DILocation(line: 58, column: 3, scope: !381)
!384 = !DILocation(line: 58, column: 3, scope: !385)
!385 = distinct !DILexicalBlock(scope: !380, file: !269, line: 58, column: 3)
!386 = !DILocation(line: 58, column: 3, scope: !387)
!387 = distinct !DILexicalBlock(scope: !376, file: !269, line: 58, column: 3)
!388 = !DILocation(line: 58, column: 3, scope: !389)
!389 = distinct !DILexicalBlock(scope: !387, file: !269, line: 58, column: 3)
!390 = !DILocation(line: 58, column: 3, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !269, line: 58, column: 3)
!392 = distinct !DILexicalBlock(scope: !389, file: !269, line: 58, column: 3)
!393 = !DILocation(line: 58, column: 3, scope: !392)
!394 = !DILocation(line: 58, column: 3, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !269, line: 58, column: 3)
!396 = !DILocation(line: 59, column: 1, scope: !294)
!397 = distinct !DISubprogram(name: "TSGLLEAdaptInitializePackage", scope: !269, file: !269, line: 110, type: !398, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !400)
!398 = !DISubroutineType(types: !399)
!399 = !{!84}
!400 = !{!401, !402, !404, !406}
!401 = !DILocalVariable(name: "ierr", scope: !397, file: !269, line: 112, type: !84)
!402 = !DILocalVariable(name: "ierr__", scope: !403, file: !269, line: 117, type: !84)
!403 = distinct !DILexicalBlock(scope: !397, file: !269, line: 117, column: 67)
!404 = !DILocalVariable(name: "ierr__", scope: !405, file: !269, line: 118, type: !84)
!405 = distinct !DILexicalBlock(scope: !397, file: !269, line: 118, column: 35)
!406 = !DILocalVariable(name: "ierr__", scope: !407, file: !269, line: 119, type: !84)
!407 = distinct !DILexicalBlock(scope: !397, file: !269, line: 119, column: 60)
!408 = !DILocation(line: 114, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !269, line: 114, column: 3)
!410 = distinct !DILexicalBlock(scope: !411, file: !269, line: 114, column: 3)
!411 = distinct !DILexicalBlock(scope: !397, file: !269, line: 114, column: 3)
!412 = !DILocation(line: 114, column: 3, scope: !410)
!413 = !DILocation(line: 114, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !269, line: 114, column: 3)
!415 = distinct !DILexicalBlock(scope: !409, file: !269, line: 114, column: 3)
!416 = !DILocation(line: 114, column: 3, scope: !415)
!417 = !DILocation(line: 114, column: 3, scope: !418)
!418 = distinct !DILexicalBlock(scope: !414, file: !269, line: 114, column: 3)
!419 = !DILocation(line: 115, column: 7, scope: !420)
!420 = distinct !DILexicalBlock(scope: !397, file: !269, line: 115, column: 7)
!421 = !DILocation(line: 115, column: 7, scope: !397)
!422 = !DILocation(line: 115, column: 38, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !269, line: 115, column: 38)
!424 = distinct !DILexicalBlock(scope: !425, file: !269, line: 115, column: 38)
!425 = distinct !DILexicalBlock(scope: !426, file: !269, line: 115, column: 38)
!426 = distinct !DILexicalBlock(scope: !427, file: !269, line: 115, column: 38)
!427 = distinct !DILexicalBlock(scope: !420, file: !269, line: 115, column: 38)
!428 = !DILocation(line: 115, column: 38, scope: !424)
!429 = !DILocation(line: 115, column: 38, scope: !430)
!430 = distinct !DILexicalBlock(scope: !431, file: !269, line: 115, column: 38)
!431 = distinct !DILexicalBlock(scope: !423, file: !269, line: 115, column: 38)
!432 = !DILocation(line: 115, column: 38, scope: !431)
!433 = !DILocation(line: 115, column: 38, scope: !434)
!434 = distinct !DILexicalBlock(scope: !430, file: !269, line: 115, column: 38)
!435 = !DILocation(line: 115, column: 38, scope: !436)
!436 = distinct !DILexicalBlock(scope: !423, file: !269, line: 115, column: 38)
!437 = !DILocation(line: 115, column: 38, scope: !438)
!438 = distinct !DILexicalBlock(scope: !436, file: !269, line: 115, column: 38)
!439 = !DILocation(line: 115, column: 38, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !269, line: 115, column: 38)
!441 = distinct !DILexicalBlock(scope: !438, file: !269, line: 115, column: 38)
!442 = !DILocation(line: 115, column: 38, scope: !441)
!443 = !DILocation(line: 115, column: 38, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !269, line: 115, column: 38)
!445 = !DILocation(line: 116, column: 33, scope: !397)
!446 = !DILocation(line: 117, column: 10, scope: !397)
!447 = !DILocation(line: 0, scope: !397)
!448 = !DILocation(line: 0, scope: !403)
!449 = !DILocation(line: 117, column: 67, scope: !450)
!450 = distinct !DILexicalBlock(scope: !403, file: !269, line: 117, column: 67)
!451 = !DILocation(line: 117, column: 67, scope: !403)
!452 = !DILocation(line: 118, column: 10, scope: !397)
!453 = !DILocation(line: 0, scope: !405)
!454 = !DILocation(line: 118, column: 35, scope: !455)
!455 = distinct !DILexicalBlock(scope: !405, file: !269, line: 118, column: 35)
!456 = !DILocation(line: 118, column: 35, scope: !405)
!457 = !DILocation(line: 119, column: 10, scope: !397)
!458 = !DILocation(line: 0, scope: !407)
!459 = !DILocation(line: 119, column: 60, scope: !460)
!460 = distinct !DILexicalBlock(scope: !407, file: !269, line: 119, column: 60)
!461 = !DILocation(line: 119, column: 60, scope: !407)
!462 = !DILocation(line: 120, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !269, line: 120, column: 3)
!464 = distinct !DILexicalBlock(scope: !465, file: !269, line: 120, column: 3)
!465 = distinct !DILexicalBlock(scope: !397, file: !269, line: 120, column: 3)
!466 = !DILocation(line: 120, column: 3, scope: !464)
!467 = !DILocation(line: 120, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !269, line: 120, column: 3)
!469 = distinct !DILexicalBlock(scope: !463, file: !269, line: 120, column: 3)
!470 = !DILocation(line: 120, column: 3, scope: !469)
!471 = !DILocation(line: 120, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !269, line: 120, column: 3)
!473 = distinct !DILexicalBlock(scope: !468, file: !269, line: 120, column: 3)
!474 = !DILocation(line: 120, column: 3, scope: !473)
!475 = !DILocation(line: 120, column: 3, scope: !476)
!476 = distinct !DILexicalBlock(scope: !472, file: !269, line: 120, column: 3)
!477 = !DILocation(line: 120, column: 3, scope: !478)
!478 = distinct !DILexicalBlock(scope: !468, file: !269, line: 120, column: 3)
!479 = !DILocation(line: 120, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !478, file: !269, line: 120, column: 3)
!481 = !DILocation(line: 120, column: 3, scope: !482)
!482 = distinct !DILexicalBlock(scope: !483, file: !269, line: 120, column: 3)
!483 = distinct !DILexicalBlock(scope: !480, file: !269, line: 120, column: 3)
!484 = !DILocation(line: 120, column: 3, scope: !483)
!485 = !DILocation(line: 120, column: 3, scope: !486)
!486 = distinct !DILexicalBlock(scope: !482, file: !269, line: 120, column: 3)
!487 = !DILocation(line: 121, column: 1, scope: !397)
!488 = !DISubprogram(name: "PetscError", scope: !27, file: !27, line: 668, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{!84, !55, !74, !63, !63, !74, !26, !63, null}
!491 = !{}
!492 = !DISubprogram(name: "PetscFunctionListAdd_Private", scope: !59, file: !59, line: 1564, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!493 = !DISubroutineType(types: !494)
!494 = !{!74, !495, !63, !60}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!496 = distinct !DISubprogram(name: "TSGLLEAdaptRegisterAll", scope: !269, file: !269, line: 70, type: !398, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !497)
!497 = !{!498, !499, !501, !503}
!498 = !DILocalVariable(name: "ierr", scope: !496, file: !269, line: 72, type: !84)
!499 = !DILocalVariable(name: "ierr__", scope: !500, file: !269, line: 77, type: !84)
!500 = distinct !DILexicalBlock(scope: !496, file: !269, line: 77, column: 71)
!501 = !DILocalVariable(name: "ierr__", scope: !502, file: !269, line: 78, type: !84)
!502 = distinct !DILexicalBlock(scope: !496, file: !269, line: 78, column: 71)
!503 = !DILocalVariable(name: "ierr__", scope: !504, file: !269, line: 79, type: !84)
!504 = distinct !DILexicalBlock(scope: !496, file: !269, line: 79, column: 71)
!505 = !DILocation(line: 74, column: 3, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !269, line: 74, column: 3)
!507 = distinct !DILexicalBlock(scope: !508, file: !269, line: 74, column: 3)
!508 = distinct !DILexicalBlock(scope: !496, file: !269, line: 74, column: 3)
!509 = !DILocation(line: 74, column: 3, scope: !507)
!510 = !DILocation(line: 74, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !269, line: 74, column: 3)
!512 = distinct !DILexicalBlock(scope: !506, file: !269, line: 74, column: 3)
!513 = !DILocation(line: 74, column: 3, scope: !512)
!514 = !DILocation(line: 74, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !511, file: !269, line: 74, column: 3)
!516 = !DILocation(line: 75, column: 7, scope: !517)
!517 = distinct !DILexicalBlock(scope: !496, file: !269, line: 75, column: 7)
!518 = !DILocation(line: 75, column: 7, scope: !496)
!519 = !DILocation(line: 75, column: 37, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !269, line: 75, column: 37)
!521 = distinct !DILexicalBlock(scope: !522, file: !269, line: 75, column: 37)
!522 = distinct !DILexicalBlock(scope: !523, file: !269, line: 75, column: 37)
!523 = distinct !DILexicalBlock(scope: !524, file: !269, line: 75, column: 37)
!524 = distinct !DILexicalBlock(scope: !517, file: !269, line: 75, column: 37)
!525 = !DILocation(line: 75, column: 37, scope: !521)
!526 = !DILocation(line: 75, column: 37, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !269, line: 75, column: 37)
!528 = distinct !DILexicalBlock(scope: !520, file: !269, line: 75, column: 37)
!529 = !DILocation(line: 75, column: 37, scope: !528)
!530 = !DILocation(line: 75, column: 37, scope: !531)
!531 = distinct !DILexicalBlock(scope: !527, file: !269, line: 75, column: 37)
!532 = !DILocation(line: 75, column: 37, scope: !533)
!533 = distinct !DILexicalBlock(scope: !520, file: !269, line: 75, column: 37)
!534 = !DILocation(line: 75, column: 37, scope: !535)
!535 = distinct !DILexicalBlock(scope: !533, file: !269, line: 75, column: 37)
!536 = !DILocation(line: 75, column: 37, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !269, line: 75, column: 37)
!538 = distinct !DILexicalBlock(scope: !535, file: !269, line: 75, column: 37)
!539 = !DILocation(line: 75, column: 37, scope: !538)
!540 = !DILocation(line: 75, column: 37, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !269, line: 75, column: 37)
!542 = !DILocation(line: 76, column: 32, scope: !496)
!543 = !DILocation(line: 77, column: 10, scope: !496)
!544 = !DILocation(line: 0, scope: !496)
!545 = !DILocation(line: 0, scope: !500)
!546 = !DILocation(line: 77, column: 71, scope: !547)
!547 = distinct !DILexicalBlock(scope: !500, file: !269, line: 77, column: 71)
!548 = !DILocation(line: 77, column: 71, scope: !500)
!549 = !DILocation(line: 78, column: 10, scope: !496)
!550 = !DILocation(line: 0, scope: !502)
!551 = !DILocation(line: 78, column: 71, scope: !552)
!552 = distinct !DILexicalBlock(scope: !502, file: !269, line: 78, column: 71)
!553 = !DILocation(line: 78, column: 71, scope: !502)
!554 = !DILocation(line: 79, column: 10, scope: !496)
!555 = !DILocation(line: 0, scope: !504)
!556 = !DILocation(line: 79, column: 71, scope: !557)
!557 = distinct !DILexicalBlock(scope: !504, file: !269, line: 79, column: 71)
!558 = !DILocation(line: 79, column: 71, scope: !504)
!559 = !DILocation(line: 80, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !269, line: 80, column: 3)
!561 = distinct !DILexicalBlock(scope: !562, file: !269, line: 80, column: 3)
!562 = distinct !DILexicalBlock(scope: !496, file: !269, line: 80, column: 3)
!563 = !DILocation(line: 80, column: 3, scope: !561)
!564 = !DILocation(line: 80, column: 3, scope: !565)
!565 = distinct !DILexicalBlock(scope: !566, file: !269, line: 80, column: 3)
!566 = distinct !DILexicalBlock(scope: !560, file: !269, line: 80, column: 3)
!567 = !DILocation(line: 80, column: 3, scope: !566)
!568 = !DILocation(line: 80, column: 3, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !269, line: 80, column: 3)
!570 = distinct !DILexicalBlock(scope: !565, file: !269, line: 80, column: 3)
!571 = !DILocation(line: 80, column: 3, scope: !570)
!572 = !DILocation(line: 80, column: 3, scope: !573)
!573 = distinct !DILexicalBlock(scope: !569, file: !269, line: 80, column: 3)
!574 = !DILocation(line: 80, column: 3, scope: !575)
!575 = distinct !DILexicalBlock(scope: !565, file: !269, line: 80, column: 3)
!576 = !DILocation(line: 80, column: 3, scope: !577)
!577 = distinct !DILexicalBlock(scope: !575, file: !269, line: 80, column: 3)
!578 = !DILocation(line: 80, column: 3, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !269, line: 80, column: 3)
!580 = distinct !DILexicalBlock(scope: !577, file: !269, line: 80, column: 3)
!581 = !DILocation(line: 80, column: 3, scope: !580)
!582 = !DILocation(line: 80, column: 3, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !269, line: 80, column: 3)
!584 = !DILocation(line: 81, column: 1, scope: !496)
!585 = distinct !DISubprogram(name: "TSGLLEAdaptCreate_None", scope: !269, file: !269, line: 256, type: !298, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !586)
!586 = !{!587, !588, !589, !596}
!587 = !DILocalVariable(name: "adapt", arg: 1, scope: !585, file: !269, line: 256, type: !300)
!588 = !DILocalVariable(name: "ierr", scope: !585, file: !269, line: 258, type: !84)
!589 = !DILocalVariable(name: "a", scope: !585, file: !269, line: 259, type: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdapt_None", file: !269, line: 241, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 238, size: 128, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !592, file: !269, line: 239, baseType: !120, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !592, file: !269, line: 240, baseType: !174, size: 64, offset: 64)
!596 = !DILocalVariable(name: "ierr__", scope: !597, file: !269, line: 262, type: !84)
!597 = distinct !DILexicalBlock(scope: !585, file: !269, line: 262, column: 32)
!598 = !DILocation(line: 0, scope: !585)
!599 = !DILocation(line: 259, column: 3, scope: !585)
!600 = !DILocation(line: 261, column: 3, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !269, line: 261, column: 3)
!602 = distinct !DILexicalBlock(scope: !603, file: !269, line: 261, column: 3)
!603 = distinct !DILexicalBlock(scope: !585, file: !269, line: 261, column: 3)
!604 = !DILocation(line: 261, column: 3, scope: !602)
!605 = !DILocation(line: 261, column: 3, scope: !606)
!606 = distinct !DILexicalBlock(scope: !607, file: !269, line: 261, column: 3)
!607 = distinct !DILexicalBlock(scope: !601, file: !269, line: 261, column: 3)
!608 = !DILocation(line: 261, column: 3, scope: !607)
!609 = !DILocation(line: 261, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !606, file: !269, line: 261, column: 3)
!611 = !DILocation(line: 262, column: 10, scope: !585)
!612 = !{!"branch_weights", i32 2146410443, i32 1073205}
!613 = !DILocation(line: 0, scope: !597)
!614 = !DILocation(line: 262, column: 32, scope: !597)
!615 = !DILocation(line: 262, column: 32, scope: !616)
!616 = distinct !DILexicalBlock(scope: !597, file: !269, line: 262, column: 32)
!617 = !DILocation(line: 263, column: 32, scope: !585)
!618 = !DILocation(line: 263, column: 10, scope: !585)
!619 = !DILocation(line: 263, column: 23, scope: !585)
!620 = !{!621, !344, i64 592}
!621 = !{!"_p_TSGLLEAdapt", !622, i64 0, !345, i64 560, !344, i64 592}
!622 = !{!"_p_PetscObject", !353, i64 0, !345, i64 8, !344, i64 64, !353, i64 72, !623, i64 80, !623, i64 88, !623, i64 96, !623, i64 104, !624, i64 112, !353, i64 120, !353, i64 124, !344, i64 128, !344, i64 136, !344, i64 144, !344, i64 152, !344, i64 160, !344, i64 168, !344, i64 176, !624, i64 184, !344, i64 192, !344, i64 200, !353, i64 208, !344, i64 216, !624, i64 224, !353, i64 232, !353, i64 236, !344, i64 240, !344, i64 248, !344, i64 256, !344, i64 264, !353, i64 272, !353, i64 276, !344, i64 280, !344, i64 288, !344, i64 296, !344, i64 304, !353, i64 312, !353, i64 316, !344, i64 320, !344, i64 328, !344, i64 336, !344, i64 344, !344, i64 352, !353, i64 360, !345, i64 368, !345, i64 384, !344, i64 392, !344, i64 400, !353, i64 408, !345, i64 416, !345, i64 456, !345, i64 496, !345, i64 536, !344, i64 544, !345, i64 552}
!623 = !{!"double", !345, i64 0}
!624 = !{!"long", !345, i64 0}
!625 = !DILocation(line: 264, column: 15, scope: !585)
!626 = !DILocation(line: 264, column: 23, scope: !585)
!627 = !{!628, !344, i64 0}
!628 = !{!"_TSGLLEAdaptOps", !344, i64 0, !344, i64 8, !344, i64 16, !344, i64 24}
!629 = !DILocation(line: 265, column: 15, scope: !585)
!630 = !DILocation(line: 265, column: 23, scope: !585)
!631 = !{!628, !344, i64 8}
!632 = !DILocation(line: 266, column: 3, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !269, line: 266, column: 3)
!634 = distinct !DILexicalBlock(scope: !635, file: !269, line: 266, column: 3)
!635 = distinct !DILexicalBlock(scope: !585, file: !269, line: 266, column: 3)
!636 = !DILocation(line: 266, column: 3, scope: !634)
!637 = !DILocation(line: 266, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !269, line: 266, column: 3)
!639 = distinct !DILexicalBlock(scope: !633, file: !269, line: 266, column: 3)
!640 = !DILocation(line: 266, column: 3, scope: !639)
!641 = !DILocation(line: 266, column: 3, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !269, line: 266, column: 3)
!643 = distinct !DILexicalBlock(scope: !638, file: !269, line: 266, column: 3)
!644 = !DILocation(line: 266, column: 3, scope: !643)
!645 = !DILocation(line: 266, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !642, file: !269, line: 266, column: 3)
!647 = !DILocation(line: 266, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !638, file: !269, line: 266, column: 3)
!649 = !DILocation(line: 266, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !648, file: !269, line: 266, column: 3)
!651 = !DILocation(line: 266, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !269, line: 266, column: 3)
!653 = distinct !DILexicalBlock(scope: !650, file: !269, line: 266, column: 3)
!654 = !DILocation(line: 266, column: 3, scope: !653)
!655 = !DILocation(line: 266, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !269, line: 266, column: 3)
!657 = !DILocation(line: 267, column: 1, scope: !585)
!658 = distinct !DISubprogram(name: "TSGLLEAdaptCreate_Size", scope: !269, file: !269, line: 298, type: !298, scopeLine: 299, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(name: "adapt", arg: 1, scope: !658, file: !269, line: 298, type: !300)
!661 = !DILocalVariable(name: "ierr", scope: !658, file: !269, line: 300, type: !84)
!662 = !DILocalVariable(name: "a", scope: !658, file: !269, line: 301, type: !267)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !269, line: 304, type: !84)
!664 = distinct !DILexicalBlock(scope: !658, file: !269, line: 304, column: 32)
!665 = !DILocation(line: 0, scope: !658)
!666 = !DILocation(line: 301, column: 3, scope: !658)
!667 = !DILocation(line: 303, column: 3, scope: !668)
!668 = distinct !DILexicalBlock(scope: !669, file: !269, line: 303, column: 3)
!669 = distinct !DILexicalBlock(scope: !670, file: !269, line: 303, column: 3)
!670 = distinct !DILexicalBlock(scope: !658, file: !269, line: 303, column: 3)
!671 = !DILocation(line: 303, column: 3, scope: !669)
!672 = !DILocation(line: 303, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !269, line: 303, column: 3)
!674 = distinct !DILexicalBlock(scope: !668, file: !269, line: 303, column: 3)
!675 = !DILocation(line: 303, column: 3, scope: !674)
!676 = !DILocation(line: 303, column: 3, scope: !677)
!677 = distinct !DILexicalBlock(scope: !673, file: !269, line: 303, column: 3)
!678 = !DILocation(line: 304, column: 10, scope: !658)
!679 = !DILocation(line: 0, scope: !664)
!680 = !DILocation(line: 304, column: 32, scope: !664)
!681 = !DILocation(line: 304, column: 32, scope: !682)
!682 = distinct !DILexicalBlock(scope: !664, file: !269, line: 304, column: 32)
!683 = !DILocation(line: 305, column: 32, scope: !658)
!684 = !DILocation(line: 305, column: 10, scope: !658)
!685 = !DILocation(line: 305, column: 23, scope: !658)
!686 = !DILocation(line: 306, column: 15, scope: !658)
!687 = !DILocation(line: 306, column: 23, scope: !658)
!688 = !DILocation(line: 307, column: 15, scope: !658)
!689 = !DILocation(line: 307, column: 23, scope: !658)
!690 = !DILocation(line: 308, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !269, line: 308, column: 3)
!692 = distinct !DILexicalBlock(scope: !693, file: !269, line: 308, column: 3)
!693 = distinct !DILexicalBlock(scope: !658, file: !269, line: 308, column: 3)
!694 = !DILocation(line: 308, column: 3, scope: !692)
!695 = !DILocation(line: 308, column: 3, scope: !696)
!696 = distinct !DILexicalBlock(scope: !697, file: !269, line: 308, column: 3)
!697 = distinct !DILexicalBlock(scope: !691, file: !269, line: 308, column: 3)
!698 = !DILocation(line: 308, column: 3, scope: !697)
!699 = !DILocation(line: 308, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !269, line: 308, column: 3)
!701 = distinct !DILexicalBlock(scope: !696, file: !269, line: 308, column: 3)
!702 = !DILocation(line: 308, column: 3, scope: !701)
!703 = !DILocation(line: 308, column: 3, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !269, line: 308, column: 3)
!705 = !DILocation(line: 308, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !696, file: !269, line: 308, column: 3)
!707 = !DILocation(line: 308, column: 3, scope: !708)
!708 = distinct !DILexicalBlock(scope: !706, file: !269, line: 308, column: 3)
!709 = !DILocation(line: 308, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !269, line: 308, column: 3)
!711 = distinct !DILexicalBlock(scope: !708, file: !269, line: 308, column: 3)
!712 = !DILocation(line: 308, column: 3, scope: !711)
!713 = !DILocation(line: 308, column: 3, scope: !714)
!714 = distinct !DILexicalBlock(scope: !710, file: !269, line: 308, column: 3)
!715 = !DILocation(line: 309, column: 1, scope: !658)
!716 = distinct !DISubprogram(name: "TSGLLEAdaptCreate_Both", scope: !269, file: !269, line: 361, type: !298, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(name: "adapt", arg: 1, scope: !716, file: !269, line: 361, type: !300)
!719 = !DILocalVariable(name: "ierr", scope: !716, file: !269, line: 363, type: !84)
!720 = !DILocalVariable(name: "a", scope: !716, file: !269, line: 364, type: !273)
!721 = !DILocalVariable(name: "ierr__", scope: !722, file: !269, line: 367, type: !84)
!722 = distinct !DILexicalBlock(scope: !716, file: !269, line: 367, column: 32)
!723 = !DILocation(line: 0, scope: !716)
!724 = !DILocation(line: 364, column: 3, scope: !716)
!725 = !DILocation(line: 366, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !269, line: 366, column: 3)
!727 = distinct !DILexicalBlock(scope: !728, file: !269, line: 366, column: 3)
!728 = distinct !DILexicalBlock(scope: !716, file: !269, line: 366, column: 3)
!729 = !DILocation(line: 366, column: 3, scope: !727)
!730 = !DILocation(line: 366, column: 3, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !269, line: 366, column: 3)
!732 = distinct !DILexicalBlock(scope: !726, file: !269, line: 366, column: 3)
!733 = !DILocation(line: 366, column: 3, scope: !732)
!734 = !DILocation(line: 366, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !731, file: !269, line: 366, column: 3)
!736 = !DILocation(line: 367, column: 10, scope: !716)
!737 = !DILocation(line: 0, scope: !722)
!738 = !DILocation(line: 367, column: 32, scope: !722)
!739 = !DILocation(line: 367, column: 32, scope: !740)
!740 = distinct !DILexicalBlock(scope: !722, file: !269, line: 367, column: 32)
!741 = !DILocation(line: 368, column: 32, scope: !716)
!742 = !DILocation(line: 368, column: 10, scope: !716)
!743 = !DILocation(line: 368, column: 23, scope: !716)
!744 = !DILocation(line: 369, column: 15, scope: !716)
!745 = !DILocation(line: 369, column: 23, scope: !716)
!746 = !DILocation(line: 370, column: 15, scope: !716)
!747 = !DILocation(line: 370, column: 23, scope: !716)
!748 = !DILocation(line: 371, column: 3, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !269, line: 371, column: 3)
!750 = distinct !DILexicalBlock(scope: !751, file: !269, line: 371, column: 3)
!751 = distinct !DILexicalBlock(scope: !716, file: !269, line: 371, column: 3)
!752 = !DILocation(line: 371, column: 3, scope: !750)
!753 = !DILocation(line: 371, column: 3, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !269, line: 371, column: 3)
!755 = distinct !DILexicalBlock(scope: !749, file: !269, line: 371, column: 3)
!756 = !DILocation(line: 371, column: 3, scope: !755)
!757 = !DILocation(line: 371, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !269, line: 371, column: 3)
!759 = distinct !DILexicalBlock(scope: !754, file: !269, line: 371, column: 3)
!760 = !DILocation(line: 371, column: 3, scope: !759)
!761 = !DILocation(line: 371, column: 3, scope: !762)
!762 = distinct !DILexicalBlock(scope: !758, file: !269, line: 371, column: 3)
!763 = !DILocation(line: 371, column: 3, scope: !764)
!764 = distinct !DILexicalBlock(scope: !754, file: !269, line: 371, column: 3)
!765 = !DILocation(line: 371, column: 3, scope: !766)
!766 = distinct !DILexicalBlock(scope: !764, file: !269, line: 371, column: 3)
!767 = !DILocation(line: 371, column: 3, scope: !768)
!768 = distinct !DILexicalBlock(scope: !769, file: !269, line: 371, column: 3)
!769 = distinct !DILexicalBlock(scope: !766, file: !269, line: 371, column: 3)
!770 = !DILocation(line: 371, column: 3, scope: !769)
!771 = !DILocation(line: 371, column: 3, scope: !772)
!772 = distinct !DILexicalBlock(scope: !768, file: !269, line: 371, column: 3)
!773 = !DILocation(line: 372, column: 1, scope: !716)
!774 = distinct !DISubprogram(name: "TSGLLEAdaptFinalizePackage", scope: !269, file: !269, line: 91, type: !398, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !775)
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "ierr", scope: !774, file: !269, line: 93, type: !84)
!777 = !DILocalVariable(name: "ierr__", scope: !778, file: !269, line: 96, type: !84)
!778 = distinct !DILexicalBlock(scope: !774, file: !269, line: 96, column: 53)
!779 = !DILocation(line: 95, column: 3, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !269, line: 95, column: 3)
!781 = distinct !DILexicalBlock(scope: !782, file: !269, line: 95, column: 3)
!782 = distinct !DILexicalBlock(scope: !774, file: !269, line: 95, column: 3)
!783 = !DILocation(line: 95, column: 3, scope: !781)
!784 = !DILocation(line: 95, column: 3, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !269, line: 95, column: 3)
!786 = distinct !DILexicalBlock(scope: !780, file: !269, line: 95, column: 3)
!787 = !DILocation(line: 95, column: 3, scope: !786)
!788 = !DILocation(line: 95, column: 3, scope: !789)
!789 = distinct !DILexicalBlock(scope: !785, file: !269, line: 95, column: 3)
!790 = !DILocation(line: 96, column: 10, scope: !774)
!791 = !DILocation(line: 0, scope: !774)
!792 = !DILocation(line: 0, scope: !778)
!793 = !DILocation(line: 96, column: 53, scope: !794)
!794 = distinct !DILexicalBlock(scope: !778, file: !269, line: 96, column: 53)
!795 = !DILocation(line: 96, column: 53, scope: !778)
!796 = !DILocation(line: 97, column: 33, scope: !774)
!797 = !DILocation(line: 98, column: 33, scope: !774)
!798 = !DILocation(line: 99, column: 3, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !269, line: 99, column: 3)
!800 = distinct !DILexicalBlock(scope: !801, file: !269, line: 99, column: 3)
!801 = distinct !DILexicalBlock(scope: !774, file: !269, line: 99, column: 3)
!802 = !DILocation(line: 99, column: 3, scope: !800)
!803 = !DILocation(line: 99, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !269, line: 99, column: 3)
!805 = distinct !DILexicalBlock(scope: !799, file: !269, line: 99, column: 3)
!806 = !DILocation(line: 99, column: 3, scope: !805)
!807 = !DILocation(line: 99, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !269, line: 99, column: 3)
!809 = distinct !DILexicalBlock(scope: !804, file: !269, line: 99, column: 3)
!810 = !DILocation(line: 99, column: 3, scope: !809)
!811 = !DILocation(line: 99, column: 3, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !269, line: 99, column: 3)
!813 = !DILocation(line: 99, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !804, file: !269, line: 99, column: 3)
!815 = !DILocation(line: 99, column: 3, scope: !816)
!816 = distinct !DILexicalBlock(scope: !814, file: !269, line: 99, column: 3)
!817 = !DILocation(line: 99, column: 3, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !269, line: 99, column: 3)
!819 = distinct !DILexicalBlock(scope: !816, file: !269, line: 99, column: 3)
!820 = !DILocation(line: 99, column: 3, scope: !819)
!821 = !DILocation(line: 99, column: 3, scope: !822)
!822 = distinct !DILexicalBlock(scope: !818, file: !269, line: 99, column: 3)
!823 = !DILocation(line: 100, column: 1, scope: !774)
!824 = !DISubprogram(name: "PetscFunctionListDestroy", scope: !59, file: !59, line: 1565, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!825 = !DISubroutineType(types: !826)
!826 = !{!74, !495}
!827 = !DISubprogram(name: "PetscClassIdRegister", scope: !59, file: !59, line: 1408, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!828 = !DISubroutineType(types: !829)
!829 = !{!74, !63, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!831 = !DISubprogram(name: "PetscRegisterFinalize", scope: !59, file: !59, line: 1509, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!832 = !DISubroutineType(types: !833)
!833 = !{!74, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!74}
!837 = distinct !DISubprogram(name: "TSGLLEAdaptSetType", scope: !269, file: !269, line: 123, type: !838, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !841)
!838 = !DISubroutineType(types: !839)
!839 = !{!84, !300, !840}
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdaptType", file: !301, line: 760, baseType: !63)
!841 = !{!842, !843, !844, !845, !846, !848, !852, !854}
!842 = !DILocalVariable(name: "adapt", arg: 1, scope: !837, file: !269, line: 123, type: !300)
!843 = !DILocalVariable(name: "type", arg: 2, scope: !837, file: !269, line: 123, type: !840)
!844 = !DILocalVariable(name: "ierr", scope: !837, file: !269, line: 125, type: !84)
!845 = !DILocalVariable(name: "r", scope: !837, file: !269, line: 125, type: !297)
!846 = !DILocalVariable(name: "ierr__", scope: !847, file: !269, line: 128, type: !84)
!847 = distinct !DILexicalBlock(scope: !837, file: !269, line: 128, column: 57)
!848 = !DILocalVariable(name: "ierr__", scope: !849, file: !269, line: 130, type: !84)
!849 = distinct !DILexicalBlock(scope: !850, file: !269, line: 130, column: 78)
!850 = distinct !DILexicalBlock(scope: !851, file: !269, line: 130, column: 40)
!851 = distinct !DILexicalBlock(scope: !837, file: !269, line: 130, column: 7)
!852 = !DILocalVariable(name: "ierr__", scope: !853, file: !269, line: 131, type: !84)
!853 = distinct !DILexicalBlock(scope: !837, file: !269, line: 131, column: 22)
!854 = !DILocalVariable(name: "ierr__", scope: !855, file: !269, line: 132, type: !84)
!855 = distinct !DILexicalBlock(scope: !837, file: !269, line: 132, column: 61)
!856 = !DILocation(line: 0, scope: !837)
!857 = !DILocation(line: 125, column: 3, scope: !837)
!858 = !DILocation(line: 127, column: 3, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !269, line: 127, column: 3)
!860 = distinct !DILexicalBlock(scope: !861, file: !269, line: 127, column: 3)
!861 = distinct !DILexicalBlock(scope: !837, file: !269, line: 127, column: 3)
!862 = !DILocation(line: 127, column: 3, scope: !860)
!863 = !DILocation(line: 127, column: 3, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !269, line: 127, column: 3)
!865 = distinct !DILexicalBlock(scope: !859, file: !269, line: 127, column: 3)
!866 = !DILocation(line: 127, column: 3, scope: !865)
!867 = !DILocation(line: 127, column: 3, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !269, line: 127, column: 3)
!869 = !DILocation(line: 128, column: 10, scope: !837)
!870 = !DILocation(line: 0, scope: !847)
!871 = !DILocation(line: 128, column: 57, scope: !872)
!872 = distinct !DILexicalBlock(scope: !847, file: !269, line: 128, column: 57)
!873 = !DILocation(line: 128, column: 57, scope: !847)
!874 = !DILocation(line: 129, column: 8, scope: !875)
!875 = distinct !DILexicalBlock(scope: !837, file: !269, line: 129, column: 7)
!876 = !DILocation(line: 129, column: 7, scope: !837)
!877 = !DILocation(line: 129, column: 11, scope: !875)
!878 = !DILocation(line: 130, column: 29, scope: !851)
!879 = !{!622, !344, i64 168}
!880 = !DILocation(line: 130, column: 7, scope: !851)
!881 = !DILocation(line: 130, column: 7, scope: !837)
!882 = !DILocation(line: 130, column: 62, scope: !850)
!883 = !DILocation(line: 130, column: 48, scope: !850)
!884 = !DILocation(line: 0, scope: !849)
!885 = !DILocation(line: 130, column: 78, scope: !886)
!886 = distinct !DILexicalBlock(scope: !849, file: !269, line: 130, column: 78)
!887 = !DILocation(line: 130, column: 78, scope: !849)
!888 = !DILocation(line: 131, column: 12, scope: !837)
!889 = !DILocation(line: 131, column: 10, scope: !837)
!890 = !DILocation(line: 0, scope: !853)
!891 = !DILocation(line: 131, column: 22, scope: !892)
!892 = distinct !DILexicalBlock(scope: !853, file: !269, line: 131, column: 22)
!893 = !DILocation(line: 131, column: 22, scope: !853)
!894 = !DILocation(line: 132, column: 10, scope: !837)
!895 = !DILocation(line: 0, scope: !855)
!896 = !DILocation(line: 132, column: 61, scope: !897)
!897 = distinct !DILexicalBlock(scope: !855, file: !269, line: 132, column: 61)
!898 = !DILocation(line: 132, column: 61, scope: !855)
!899 = !DILocation(line: 133, column: 3, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !269, line: 133, column: 3)
!901 = distinct !DILexicalBlock(scope: !902, file: !269, line: 133, column: 3)
!902 = distinct !DILexicalBlock(scope: !837, file: !269, line: 133, column: 3)
!903 = !DILocation(line: 133, column: 3, scope: !901)
!904 = !DILocation(line: 133, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !269, line: 133, column: 3)
!906 = distinct !DILexicalBlock(scope: !900, file: !269, line: 133, column: 3)
!907 = !DILocation(line: 133, column: 3, scope: !906)
!908 = !DILocation(line: 133, column: 3, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !269, line: 133, column: 3)
!910 = distinct !DILexicalBlock(scope: !905, file: !269, line: 133, column: 3)
!911 = !DILocation(line: 133, column: 3, scope: !910)
!912 = !DILocation(line: 133, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !909, file: !269, line: 133, column: 3)
!914 = !DILocation(line: 133, column: 3, scope: !915)
!915 = distinct !DILexicalBlock(scope: !905, file: !269, line: 133, column: 3)
!916 = !DILocation(line: 133, column: 3, scope: !917)
!917 = distinct !DILexicalBlock(scope: !915, file: !269, line: 133, column: 3)
!918 = !DILocation(line: 133, column: 3, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !269, line: 133, column: 3)
!920 = distinct !DILexicalBlock(scope: !917, file: !269, line: 133, column: 3)
!921 = !DILocation(line: 133, column: 3, scope: !920)
!922 = !DILocation(line: 133, column: 3, scope: !923)
!923 = distinct !DILexicalBlock(scope: !919, file: !269, line: 133, column: 3)
!924 = !DILocation(line: 134, column: 1, scope: !837)
!925 = !DISubprogram(name: "PetscFunctionListFind_Private", scope: !59, file: !59, line: 1567, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!926 = !DISubroutineType(types: !927)
!927 = !{!74, !140, !63, !115}
!928 = !DISubprogram(name: "PetscObjectChangeTypeName", scope: !59, file: !59, line: 1500, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!929 = !DISubroutineType(types: !930)
!930 = !{!74, !68, !63}
!931 = distinct !DISubprogram(name: "TSGLLEAdaptSetOptionsPrefix", scope: !269, file: !269, line: 136, type: !932, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !934)
!932 = !DISubroutineType(types: !933)
!933 = !{!84, !300, !63}
!934 = !{!935, !936, !937, !938}
!935 = !DILocalVariable(name: "adapt", arg: 1, scope: !931, file: !269, line: 136, type: !300)
!936 = !DILocalVariable(name: "prefix", arg: 2, scope: !931, file: !269, line: 136, type: !63)
!937 = !DILocalVariable(name: "ierr", scope: !931, file: !269, line: 138, type: !84)
!938 = !DILocalVariable(name: "ierr__", scope: !939, file: !269, line: 141, type: !84)
!939 = distinct !DILexicalBlock(scope: !931, file: !269, line: 141, column: 65)
!940 = !DILocation(line: 0, scope: !931)
!941 = !DILocation(line: 140, column: 3, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !269, line: 140, column: 3)
!943 = distinct !DILexicalBlock(scope: !944, file: !269, line: 140, column: 3)
!944 = distinct !DILexicalBlock(scope: !931, file: !269, line: 140, column: 3)
!945 = !DILocation(line: 140, column: 3, scope: !943)
!946 = !DILocation(line: 140, column: 3, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !269, line: 140, column: 3)
!948 = distinct !DILexicalBlock(scope: !942, file: !269, line: 140, column: 3)
!949 = !DILocation(line: 140, column: 3, scope: !948)
!950 = !DILocation(line: 140, column: 3, scope: !951)
!951 = distinct !DILexicalBlock(scope: !947, file: !269, line: 140, column: 3)
!952 = !DILocation(line: 141, column: 38, scope: !931)
!953 = !DILocation(line: 141, column: 10, scope: !931)
!954 = !DILocation(line: 0, scope: !939)
!955 = !DILocation(line: 141, column: 65, scope: !956)
!956 = distinct !DILexicalBlock(scope: !939, file: !269, line: 141, column: 65)
!957 = !DILocation(line: 141, column: 65, scope: !939)
!958 = !DILocation(line: 142, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !269, line: 142, column: 3)
!960 = distinct !DILexicalBlock(scope: !961, file: !269, line: 142, column: 3)
!961 = distinct !DILexicalBlock(scope: !931, file: !269, line: 142, column: 3)
!962 = !DILocation(line: 142, column: 3, scope: !960)
!963 = !DILocation(line: 142, column: 3, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !269, line: 142, column: 3)
!965 = distinct !DILexicalBlock(scope: !959, file: !269, line: 142, column: 3)
!966 = !DILocation(line: 142, column: 3, scope: !965)
!967 = !DILocation(line: 142, column: 3, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !269, line: 142, column: 3)
!969 = distinct !DILexicalBlock(scope: !964, file: !269, line: 142, column: 3)
!970 = !DILocation(line: 142, column: 3, scope: !969)
!971 = !DILocation(line: 142, column: 3, scope: !972)
!972 = distinct !DILexicalBlock(scope: !968, file: !269, line: 142, column: 3)
!973 = !DILocation(line: 142, column: 3, scope: !974)
!974 = distinct !DILexicalBlock(scope: !964, file: !269, line: 142, column: 3)
!975 = !DILocation(line: 142, column: 3, scope: !976)
!976 = distinct !DILexicalBlock(scope: !974, file: !269, line: 142, column: 3)
!977 = !DILocation(line: 142, column: 3, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !269, line: 142, column: 3)
!979 = distinct !DILexicalBlock(scope: !976, file: !269, line: 142, column: 3)
!980 = !DILocation(line: 142, column: 3, scope: !979)
!981 = !DILocation(line: 142, column: 3, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !269, line: 142, column: 3)
!983 = !DILocation(line: 143, column: 1, scope: !931)
!984 = !DISubprogram(name: "PetscObjectSetOptionsPrefix", scope: !59, file: !59, line: 1496, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!985 = distinct !DISubprogram(name: "TSGLLEAdaptView", scope: !269, file: !269, line: 145, type: !323, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !986)
!986 = !{!987, !988, !989, !990, !991, !993, !997, !1001, !1003}
!987 = !DILocalVariable(name: "adapt", arg: 1, scope: !985, file: !269, line: 145, type: !300)
!988 = !DILocalVariable(name: "viewer", arg: 2, scope: !985, file: !269, line: 145, type: !90)
!989 = !DILocalVariable(name: "ierr", scope: !985, file: !269, line: 147, type: !84)
!990 = !DILocalVariable(name: "iascii", scope: !985, file: !269, line: 148, type: !235)
!991 = !DILocalVariable(name: "ierr__", scope: !992, file: !269, line: 151, type: !84)
!992 = distinct !DILexicalBlock(scope: !985, file: !269, line: 151, column: 79)
!993 = !DILocalVariable(name: "ierr__", scope: !994, file: !269, line: 153, type: !84)
!994 = distinct !DILexicalBlock(scope: !995, file: !269, line: 153, column: 75)
!995 = distinct !DILexicalBlock(scope: !996, file: !269, line: 152, column: 15)
!996 = distinct !DILexicalBlock(scope: !985, file: !269, line: 152, column: 7)
!997 = !DILocalVariable(name: "ierr__", scope: !998, file: !269, line: 155, type: !84)
!998 = distinct !DILexicalBlock(scope: !999, file: !269, line: 155, column: 46)
!999 = distinct !DILexicalBlock(scope: !1000, file: !269, line: 154, column: 27)
!1000 = distinct !DILexicalBlock(scope: !995, file: !269, line: 154, column: 9)
!1001 = !DILocalVariable(name: "ierr__", scope: !1002, file: !269, line: 156, type: !84)
!1002 = distinct !DILexicalBlock(scope: !999, file: !269, line: 156, column: 48)
!1003 = !DILocalVariable(name: "ierr__", scope: !1004, file: !269, line: 157, type: !84)
!1004 = distinct !DILexicalBlock(scope: !999, file: !269, line: 157, column: 45)
!1005 = !DILocation(line: 0, scope: !985)
!1006 = !DILocation(line: 148, column: 3, scope: !985)
!1007 = !DILocation(line: 150, column: 3, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !269, line: 150, column: 3)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !269, line: 150, column: 3)
!1010 = distinct !DILexicalBlock(scope: !985, file: !269, line: 150, column: 3)
!1011 = !DILocation(line: 150, column: 3, scope: !1009)
!1012 = !DILocation(line: 150, column: 3, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !269, line: 150, column: 3)
!1014 = distinct !DILexicalBlock(scope: !1008, file: !269, line: 150, column: 3)
!1015 = !DILocation(line: 150, column: 3, scope: !1014)
!1016 = !DILocation(line: 150, column: 3, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1013, file: !269, line: 150, column: 3)
!1018 = !DILocation(line: 151, column: 33, scope: !985)
!1019 = !DILocation(line: 151, column: 10, scope: !985)
!1020 = !DILocation(line: 0, scope: !992)
!1021 = !DILocation(line: 151, column: 79, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !992, file: !269, line: 151, column: 79)
!1023 = !DILocation(line: 151, column: 79, scope: !992)
!1024 = !DILocation(line: 152, column: 7, scope: !996)
!1025 = !{!345, !345, i64 0}
!1026 = !DILocation(line: 152, column: 7, scope: !985)
!1027 = !DILocation(line: 153, column: 48, scope: !995)
!1028 = !DILocation(line: 153, column: 12, scope: !995)
!1029 = !DILocation(line: 0, scope: !994)
!1030 = !DILocation(line: 153, column: 75, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !994, file: !269, line: 153, column: 75)
!1032 = !DILocation(line: 153, column: 75, scope: !994)
!1033 = !DILocation(line: 154, column: 21, scope: !1000)
!1034 = !{!628, !344, i64 16}
!1035 = !DILocation(line: 154, column: 9, scope: !1000)
!1036 = !DILocation(line: 154, column: 9, scope: !995)
!1037 = !DILocation(line: 155, column: 14, scope: !999)
!1038 = !DILocation(line: 0, scope: !998)
!1039 = !DILocation(line: 155, column: 46, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !998, file: !269, line: 155, column: 46)
!1041 = !DILocation(line: 155, column: 46, scope: !998)
!1042 = !DILocation(line: 156, column: 28, scope: !999)
!1043 = !DILocation(line: 156, column: 14, scope: !999)
!1044 = !DILocation(line: 0, scope: !1002)
!1045 = !DILocation(line: 156, column: 48, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1002, file: !269, line: 156, column: 48)
!1047 = !DILocation(line: 156, column: 48, scope: !1002)
!1048 = !DILocation(line: 157, column: 14, scope: !999)
!1049 = !DILocation(line: 0, scope: !1004)
!1050 = !DILocation(line: 157, column: 45, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1004, file: !269, line: 157, column: 45)
!1052 = !DILocation(line: 157, column: 45, scope: !1004)
!1053 = !DILocation(line: 160, column: 3, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !269, line: 160, column: 3)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !269, line: 160, column: 3)
!1056 = distinct !DILexicalBlock(scope: !985, file: !269, line: 160, column: 3)
!1057 = !DILocation(line: 160, column: 3, scope: !1055)
!1058 = !DILocation(line: 160, column: 3, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !269, line: 160, column: 3)
!1060 = distinct !DILexicalBlock(scope: !1054, file: !269, line: 160, column: 3)
!1061 = !DILocation(line: 160, column: 3, scope: !1060)
!1062 = !DILocation(line: 160, column: 3, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !269, line: 160, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1059, file: !269, line: 160, column: 3)
!1065 = !DILocation(line: 160, column: 3, scope: !1064)
!1066 = !DILocation(line: 160, column: 3, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1063, file: !269, line: 160, column: 3)
!1068 = !DILocation(line: 160, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1059, file: !269, line: 160, column: 3)
!1070 = !DILocation(line: 160, column: 3, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1069, file: !269, line: 160, column: 3)
!1072 = !DILocation(line: 160, column: 3, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !269, line: 160, column: 3)
!1074 = distinct !DILexicalBlock(scope: !1071, file: !269, line: 160, column: 3)
!1075 = !DILocation(line: 160, column: 3, scope: !1074)
!1076 = !DILocation(line: 160, column: 3, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !269, line: 160, column: 3)
!1078 = !DILocation(line: 161, column: 1, scope: !985)
!1079 = !DISubprogram(name: "PetscObjectTypeCompare", scope: !59, file: !59, line: 1505, type: !1080, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!74, !68, !63, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1083 = !DISubprogram(name: "PetscObjectPrintClassNamePrefixType", scope: !59, file: !59, line: 1492, type: !1084, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!74, !68, !92}
!1086 = !DISubprogram(name: "PetscViewerASCIIPushTab", scope: !1087, file: !1087, line: 194, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1087 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!74, !92}
!1090 = !DISubprogram(name: "PetscViewerASCIIPopTab", scope: !1087, file: !1087, line: 195, type: !1088, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1091 = distinct !DISubprogram(name: "TSGLLEAdaptDestroy", scope: !269, file: !269, line: 163, type: !1092, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1095)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!84, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!1095 = !{!1096, !1097, !1098, !1102}
!1096 = !DILocalVariable(name: "adapt", arg: 1, scope: !1091, file: !269, line: 163, type: !1094)
!1097 = !DILocalVariable(name: "ierr", scope: !1091, file: !269, line: 165, type: !84)
!1098 = !DILocalVariable(name: "ierr__", scope: !1099, file: !269, line: 171, type: !84)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !269, line: 171, column: 73)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !269, line: 171, column: 31)
!1101 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 171, column: 7)
!1102 = !DILocalVariable(name: "ierr__", scope: !1103, file: !269, line: 172, type: !84)
!1103 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 172, column: 36)
!1104 = !DILocation(line: 0, scope: !1091)
!1105 = !DILocation(line: 167, column: 3, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !269, line: 167, column: 3)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !269, line: 167, column: 3)
!1108 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 167, column: 3)
!1109 = !DILocation(line: 167, column: 3, scope: !1107)
!1110 = !DILocation(line: 167, column: 3, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !269, line: 167, column: 3)
!1112 = distinct !DILexicalBlock(scope: !1106, file: !269, line: 167, column: 3)
!1113 = !DILocation(line: 167, column: 3, scope: !1112)
!1114 = !DILocation(line: 167, column: 3, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !269, line: 167, column: 3)
!1116 = !DILocation(line: 168, column: 8, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 168, column: 7)
!1118 = !DILocation(line: 168, column: 7, scope: !1091)
!1119 = !DILocation(line: 168, column: 16, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !269, line: 168, column: 16)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !269, line: 168, column: 16)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !269, line: 168, column: 16)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !269, line: 168, column: 16)
!1124 = distinct !DILexicalBlock(scope: !1117, file: !269, line: 168, column: 16)
!1125 = !DILocation(line: 168, column: 16, scope: !1121)
!1126 = !DILocation(line: 168, column: 16, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !269, line: 168, column: 16)
!1128 = distinct !DILexicalBlock(scope: !1120, file: !269, line: 168, column: 16)
!1129 = !DILocation(line: 168, column: 16, scope: !1128)
!1130 = !DILocation(line: 168, column: 16, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !269, line: 168, column: 16)
!1132 = !DILocation(line: 168, column: 16, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1120, file: !269, line: 168, column: 16)
!1134 = !DILocation(line: 168, column: 16, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1133, file: !269, line: 168, column: 16)
!1136 = !DILocation(line: 168, column: 16, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !269, line: 168, column: 16)
!1138 = distinct !DILexicalBlock(scope: !1135, file: !269, line: 168, column: 16)
!1139 = !DILocation(line: 168, column: 16, scope: !1138)
!1140 = !DILocation(line: 168, column: 16, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !269, line: 168, column: 16)
!1142 = !DILocation(line: 169, column: 3, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !269, line: 169, column: 3)
!1144 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 169, column: 3)
!1145 = !DILocation(line: 169, column: 3, scope: !1144)
!1146 = !DILocation(line: 169, column: 3, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1144, file: !269, line: 169, column: 3)
!1148 = !{!622, !353, i64 0}
!1149 = !DILocation(line: 169, column: 3, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !269, line: 169, column: 3)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !269, line: 169, column: 3)
!1152 = !DILocation(line: 169, column: 3, scope: !1151)
!1153 = !DILocation(line: 170, column: 34, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 170, column: 7)
!1155 = !DILocation(line: 170, column: 7, scope: !1154)
!1156 = !{!622, !353, i64 120}
!1157 = !DILocation(line: 170, column: 40, scope: !1154)
!1158 = !DILocation(line: 170, column: 7, scope: !1091)
!1159 = !DILocation(line: 170, column: 53, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !269, line: 170, column: 45)
!1161 = !DILocation(line: 170, column: 61, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !269, line: 170, column: 61)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !269, line: 170, column: 61)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !269, line: 170, column: 61)
!1165 = !DILocation(line: 170, column: 61, scope: !1163)
!1166 = !DILocation(line: 170, column: 61, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !269, line: 170, column: 61)
!1168 = distinct !DILexicalBlock(scope: !1162, file: !269, line: 170, column: 61)
!1169 = !DILocation(line: 170, column: 61, scope: !1168)
!1170 = !DILocation(line: 170, column: 61, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !269, line: 170, column: 61)
!1172 = distinct !DILexicalBlock(scope: !1167, file: !269, line: 170, column: 61)
!1173 = !DILocation(line: 170, column: 61, scope: !1172)
!1174 = !DILocation(line: 170, column: 61, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1171, file: !269, line: 170, column: 61)
!1176 = !DILocation(line: 170, column: 61, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1167, file: !269, line: 170, column: 61)
!1178 = !DILocation(line: 170, column: 61, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1177, file: !269, line: 170, column: 61)
!1180 = !DILocation(line: 170, column: 61, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !269, line: 170, column: 61)
!1182 = distinct !DILexicalBlock(scope: !1179, file: !269, line: 170, column: 61)
!1183 = !DILocation(line: 170, column: 61, scope: !1182)
!1184 = !DILocation(line: 170, column: 61, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !269, line: 170, column: 61)
!1186 = !DILocation(line: 171, column: 22, scope: !1101)
!1187 = !DILocation(line: 171, column: 7, scope: !1101)
!1188 = !DILocation(line: 171, column: 7, scope: !1091)
!1189 = !DILocation(line: 171, column: 39, scope: !1100)
!1190 = !DILocation(line: 0, scope: !1099)
!1191 = !DILocation(line: 171, column: 73, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1099, file: !269, line: 171, column: 73)
!1193 = !DILocation(line: 171, column: 73, scope: !1099)
!1194 = !DILocation(line: 172, column: 10, scope: !1091)
!1195 = !DILocation(line: 0, scope: !1103)
!1196 = !DILocation(line: 172, column: 36, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1103, file: !269, line: 172, column: 36)
!1198 = !DILocation(line: 173, column: 3, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !269, line: 173, column: 3)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !269, line: 173, column: 3)
!1201 = distinct !DILexicalBlock(scope: !1091, file: !269, line: 173, column: 3)
!1202 = !DILocation(line: 173, column: 3, scope: !1200)
!1203 = !DILocation(line: 173, column: 3, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !269, line: 173, column: 3)
!1205 = distinct !DILexicalBlock(scope: !1199, file: !269, line: 173, column: 3)
!1206 = !DILocation(line: 173, column: 3, scope: !1205)
!1207 = !DILocation(line: 173, column: 3, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !269, line: 173, column: 3)
!1209 = distinct !DILexicalBlock(scope: !1204, file: !269, line: 173, column: 3)
!1210 = !DILocation(line: 173, column: 3, scope: !1209)
!1211 = !DILocation(line: 173, column: 3, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !269, line: 173, column: 3)
!1213 = !DILocation(line: 173, column: 3, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1204, file: !269, line: 173, column: 3)
!1215 = !DILocation(line: 173, column: 3, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1214, file: !269, line: 173, column: 3)
!1217 = !DILocation(line: 173, column: 3, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !269, line: 173, column: 3)
!1219 = distinct !DILexicalBlock(scope: !1216, file: !269, line: 173, column: 3)
!1220 = !DILocation(line: 173, column: 3, scope: !1219)
!1221 = !DILocation(line: 173, column: 3, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !269, line: 173, column: 3)
!1223 = !DILocation(line: 174, column: 1, scope: !1091)
!1224 = !DISubprogram(name: "PetscCheckPointer", scope: !70, file: !70, line: 183, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!5, !1227, !32}
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1229 = !DISubprogram(name: "PetscHeaderDestroy_Private", scope: !70, file: !70, line: 174, type: !1230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !491)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!74, !68}
!1232 = distinct !DISubprogram(name: "TSGLLEAdaptSetFromOptions", scope: !269, file: !269, line: 176, type: !327, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1241, !1242, !1244, !1246, !1250, !1254}
!1234 = !DILocalVariable(name: "PetscOptionsObject", arg: 1, scope: !1232, file: !269, line: 176, type: !211)
!1235 = !DILocalVariable(name: "adapt", arg: 2, scope: !1232, file: !269, line: 176, type: !300)
!1236 = !DILocalVariable(name: "ierr", scope: !1232, file: !269, line: 178, type: !84)
!1237 = !DILocalVariable(name: "type", scope: !1232, file: !269, line: 179, type: !1238)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !1239)
!1239 = !{!1240}
!1240 = !DISubrange(count: 256)
!1241 = !DILocalVariable(name: "flg", scope: !1232, file: !269, line: 180, type: !235)
!1242 = !DILocalVariable(name: "ierr__", scope: !1243, file: !269, line: 185, type: !84)
!1243 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 185, column: 75)
!1244 = !DILocalVariable(name: "ierr__", scope: !1245, file: !269, line: 187, type: !84)
!1245 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 187, column: 124)
!1246 = !DILocalVariable(name: "ierr__", scope: !1247, file: !269, line: 189, type: !84)
!1247 = distinct !DILexicalBlock(scope: !1248, file: !269, line: 189, column: 43)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !269, line: 188, column: 48)
!1249 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 188, column: 7)
!1250 = !DILocalVariable(name: "ierr__", scope: !1251, file: !269, line: 191, type: !84)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !269, line: 191, column: 99)
!1252 = distinct !DILexicalBlock(scope: !1253, file: !269, line: 191, column: 35)
!1253 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 191, column: 7)
!1254 = !DILocalVariable(name: "ierr__", scope: !1255, file: !269, line: 192, type: !84)
!1255 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 192, column: 29)
!1256 = !DILocation(line: 0, scope: !1232)
!1257 = !DILocation(line: 179, column: 3, scope: !1232)
!1258 = !DILocation(line: 179, column: 18, scope: !1232)
!1259 = !DILocation(line: 180, column: 3, scope: !1232)
!1260 = !DILocation(line: 182, column: 3, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !269, line: 182, column: 3)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !269, line: 182, column: 3)
!1263 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 182, column: 3)
!1264 = !DILocation(line: 182, column: 3, scope: !1262)
!1265 = !DILocation(line: 182, column: 3, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1267, file: !269, line: 182, column: 3)
!1267 = distinct !DILexicalBlock(scope: !1261, file: !269, line: 182, column: 3)
!1268 = !DILocation(line: 182, column: 3, scope: !1267)
!1269 = !DILocation(line: 182, column: 3, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !269, line: 182, column: 3)
!1271 = !DILocation(line: 185, column: 10, scope: !1232)
!1272 = !DILocation(line: 0, scope: !1243)
!1273 = !DILocation(line: 185, column: 75, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1243, file: !269, line: 185, column: 75)
!1275 = !DILocation(line: 185, column: 75, scope: !1243)
!1276 = !DILocation(line: 186, column: 10, scope: !1232)
!1277 = !DILocation(line: 0, scope: !1245)
!1278 = !DILocation(line: 187, column: 124, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1245, file: !269, line: 187, column: 124)
!1280 = !DILocation(line: 187, column: 124, scope: !1245)
!1281 = !DILocation(line: 188, column: 7, scope: !1249)
!1282 = !DILocation(line: 188, column: 11, scope: !1249)
!1283 = !DILocation(line: 188, column: 37, scope: !1249)
!1284 = !DILocation(line: 188, column: 15, scope: !1249)
!1285 = !DILocation(line: 188, column: 7, scope: !1232)
!1286 = !DILocation(line: 189, column: 12, scope: !1248)
!1287 = !DILocation(line: 0, scope: !1247)
!1288 = !DILocation(line: 189, column: 43, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1247, file: !269, line: 189, column: 43)
!1290 = !DILocation(line: 189, column: 43, scope: !1247)
!1291 = !DILocation(line: 191, column: 19, scope: !1253)
!1292 = !{!628, !344, i64 24}
!1293 = !DILocation(line: 191, column: 7, scope: !1253)
!1294 = !DILocation(line: 191, column: 7, scope: !1232)
!1295 = !DILocation(line: 191, column: 43, scope: !1252)
!1296 = !DILocation(line: 0, scope: !1251)
!1297 = !DILocation(line: 191, column: 99, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1251, file: !269, line: 191, column: 99)
!1299 = !DILocation(line: 191, column: 99, scope: !1251)
!1300 = !DILocation(line: 192, column: 10, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1302, file: !269, line: 192, column: 10)
!1302 = distinct !DILexicalBlock(scope: !1232, file: !269, line: 192, column: 10)
!1303 = !{!1304, !353, i64 0}
!1304 = !{!"_p_PetscOptionItems", !353, i64 0, !344, i64 8, !344, i64 16, !344, i64 24, !344, i64 32, !344, i64 40, !345, i64 48, !345, i64 52, !345, i64 56, !344, i64 64, !344, i64 72}
!1305 = !DILocation(line: 192, column: 10, scope: !1302)
!1306 = !DILocation(line: 192, column: 10, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1308, file: !269, line: 192, column: 10)
