; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lmvm/lmvmpc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lmvm/lmvmpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!327 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 119, baseType: !5, size: 32, elements: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!345 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!377 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!378 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!379 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!380 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!381 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!382 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!383 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!384 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!385 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!386 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!387 = !{!388, !429, !510, !426, !450, !585}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_LMVM", file: !390, line: 14, baseType: !391)
!390 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lmvm/lmvmpc.c", directory: "/home/users/ndemeye/xSDK")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 9, size: 320, elements: !392)
!392 = !{!393, !397, !398, !403, !1376}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xwork", scope: !391, file: !390, line: 10, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ywork", scope: !391, file: !390, line: 10, baseType: !394, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !391, file: !390, line: 11, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !400, line: 11, baseType: !401)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !400, line: 11, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !391, file: !390, line: 12, baseType: !404, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !407, line: 436, size: 23424, elements: !408)
!407 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!408 = !{!409, !619, !1119, !1139, !1140, !1141, !1143, !1144, !1145, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1272, !1273, !1289, !1290, !1291, !1292, !1293, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1328, !1348, !1349, !1351, !1352, !1353, !1354, !1355, !1356, !1374, !1375}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !406, file: !407, line: 437, baseType: !410, size: 4480)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !411, line: 122, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !411, line: 73, size: 4480, elements: !413)
!413 = !{!414, !416, !471, !472, !474, !477, !478, !479, !480, !488, !489, !491, !495, !499, !501, !502, !503, !504, !505, !506, !507, !508, !509, !511, !513, !514, !515, !517, !518, !520, !522, !523, !524, !525, !526, !529, !531, !532, !533, !534, !535, !538, !540, !541, !542, !552, !554, !555, !559, !560, !609, !614, !616, !617, !618}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !412, file: !411, line: 74, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !412, file: !411, line: 75, baseType: !417, size: 448, offset: 64)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 448, elements: !469)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !411, line: 53, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 45, size: 448, elements: !420)
!420 = !{!421, !433, !441, !446, !453, !457, !464}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !419, file: !411, line: 46, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !426, !428}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !430, line: 330, baseType: !431)
!430 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !430, line: 330, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !419, file: !411, line: 47, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!425, !426, !437}
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !438, line: 16, baseType: !439)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !438, line: 16, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !419, file: !411, line: 48, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!425, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !419, file: !411, line: 49, baseType: !447, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!425, !426, !450, !426}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !419, file: !411, line: 50, baseType: !454, size: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!425, !426, !450, !445}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !419, file: !411, line: 51, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!425, !426, !450, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !419, file: !411, line: 52, baseType: !465, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!425, !426, !450, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!469 = !{!470}
!470 = !DISubrange(count: 1)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !412, file: !411, line: 76, baseType: !429, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !411, line: 77, baseType: !473, size: 32, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !412, file: !411, line: 78, baseType: !475, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !476)
!476 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !412, file: !411, line: 78, baseType: !475, size: 64, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !412, file: !411, line: 78, baseType: !475, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !412, file: !411, line: 78, baseType: !475, size: 64, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !412, file: !411, line: 79, baseType: !481, size: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !484, line: 27, baseType: !485)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !486, line: 43, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!487 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !412, file: !411, line: 80, baseType: !473, size: 32, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !412, file: !411, line: 81, baseType: !490, size: 32, offset: 992)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !412, file: !411, line: 82, baseType: !492, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !412, file: !411, line: 83, baseType: !496, size: 64, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !412, file: !411, line: 84, baseType: !500, size: 64, offset: 1152)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !412, file: !411, line: 85, baseType: !500, size: 64, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !412, file: !411, line: 86, baseType: !500, size: 64, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !412, file: !411, line: 87, baseType: !500, size: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !412, file: !411, line: 88, baseType: !426, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !412, file: !411, line: 89, baseType: !481, size: 64, offset: 1472)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !411, line: 90, baseType: !500, size: 64, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !412, file: !411, line: 91, baseType: !500, size: 64, offset: 1600)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !412, file: !411, line: 92, baseType: !473, size: 32, offset: 1664)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !412, file: !411, line: 93, baseType: !510, size: 64, offset: 1728)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !412, file: !411, line: 94, baseType: !512, size: 64, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !482)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !412, file: !411, line: 95, baseType: !473, size: 32, offset: 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !412, file: !411, line: 95, baseType: !473, size: 32, offset: 1888)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !412, file: !411, line: 96, baseType: !516, size: 64, offset: 1920)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !412, file: !411, line: 96, baseType: !516, size: 64, offset: 1984)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !412, file: !411, line: 97, baseType: !519, size: 64, offset: 2048)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !412, file: !411, line: 97, baseType: !521, size: 64, offset: 2112)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !412, file: !411, line: 98, baseType: !473, size: 32, offset: 2176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !412, file: !411, line: 98, baseType: !473, size: 32, offset: 2208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !412, file: !411, line: 99, baseType: !516, size: 64, offset: 2240)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !412, file: !411, line: 99, baseType: !516, size: 64, offset: 2304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !412, file: !411, line: 100, baseType: !527, size: 64, offset: 2368)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !476)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !412, file: !411, line: 100, baseType: !530, size: 64, offset: 2432)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !412, file: !411, line: 101, baseType: !473, size: 32, offset: 2496)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !412, file: !411, line: 101, baseType: !473, size: 32, offset: 2528)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !412, file: !411, line: 102, baseType: !516, size: 64, offset: 2560)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !412, file: !411, line: 102, baseType: !516, size: 64, offset: 2624)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !412, file: !411, line: 103, baseType: !536, size: 64, offset: 2688)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !528)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !412, file: !411, line: 103, baseType: !539, size: 64, offset: 2752)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !412, file: !411, line: 104, baseType: !468, size: 64, offset: 2816)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !412, file: !411, line: 105, baseType: !473, size: 32, offset: 2880)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !412, file: !411, line: 106, baseType: !543, size: 128, offset: 2944)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 128, elements: !550)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !411, line: 64, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 61, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !546, file: !411, line: 62, baseType: !461, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !546, file: !411, line: 63, baseType: !510, size: 64, offset: 64)
!550 = !{!551}
!551 = !DISubrange(count: 2)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !412, file: !411, line: 107, baseType: !553, size: 64, offset: 3072)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 64, elements: !550)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !412, file: !411, line: 108, baseType: !510, size: 64, offset: 3136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !412, file: !411, line: 109, baseType: !556, size: 64, offset: 3200)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!425, !510}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !412, file: !411, line: 111, baseType: !473, size: 32, offset: 3264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !412, file: !411, line: 112, baseType: !561, size: 320, offset: 3328)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 320, elements: !607)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!425, !565, !426, !510}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !568)
!568 = !{!569, !570, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !567, file: !10, line: 100, baseType: !473, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !10, line: 101, baseType: !571, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !582, !583, !584, !588, !590, !592, !593, !594}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !573, file: !10, line: 84, baseType: !500, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !573, file: !10, line: 85, baseType: !500, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !573, file: !10, line: 86, baseType: !510, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !573, file: !10, line: 87, baseType: !492, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !573, file: !10, line: 88, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !573, file: !10, line: 89, baseType: !452, size: 8, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !573, file: !10, line: 90, baseType: !500, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !573, file: !10, line: 91, baseType: !585, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !586, line: 46, baseType: !587)
!586 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!587 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !573, file: !10, line: 92, baseType: !589, size: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !10, line: 93, baseType: !591, size: 32, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !10, line: 94, baseType: !571, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !573, file: !10, line: 95, baseType: !500, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !573, file: !10, line: 96, baseType: !510, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !567, file: !10, line: 102, baseType: !500, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !567, file: !10, line: 102, baseType: !500, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !567, file: !10, line: 103, baseType: !500, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !567, file: !10, line: 104, baseType: !429, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !567, file: !10, line: 105, baseType: !589, size: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !567, file: !10, line: 105, baseType: !589, size: 32, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !567, file: !10, line: 105, baseType: !589, size: 32, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !567, file: !10, line: 106, baseType: !426, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !567, file: !10, line: 107, baseType: !604, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!607 = !{!608}
!608 = !DISubrange(count: 5)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !412, file: !411, line: 113, baseType: !610, size: 320, offset: 3648)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 320, elements: !607)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!425, !426, !510}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !412, file: !411, line: 114, baseType: !615, size: 320, offset: 3968)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 320, elements: !607)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !412, file: !411, line: 115, baseType: !589, size: 32, offset: 4288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !412, file: !411, line: 120, baseType: !604, size: 64, offset: 4352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !412, file: !411, line: 121, baseType: !589, size: 32, offset: 4416)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !406, file: !407, line: 437, baseType: !620, size: 9472, offset: 4480)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 9472, elements: !469)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !407, line: 32, size: 9472, elements: !622)
!622 = !{!623, !632, !636, !637, !641, !645, !646, !647, !648, !649, !650, !651, !671, !675, !680, !686, !705, !710, !714, !715, !720, !725, !726, !731, !735, !739, !743, !747, !751, !752, !753, !754, !755, !759, !760, !765, !766, !767, !768, !769, !774, !781, !786, !790, !794, !798, !802, !803, !807, !808, !815, !820, !821, !822, !823, !885, !893, !894, !898, !899, !903, !904, !908, !913, !914, !918, !922, !929, !930, !931, !932, !933, !934, !939, !940, !944, !948, !952, !953, !954, !958, !968, !969, !973, !974, !978, !979, !983, !984, !989, !990, !994, !998, !999, !1000, !1001, !1002, !1003, !1004, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1028, !1032, !1033, !1034, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1048, !1049, !1050, !1055, !1059, !1060, !1064, !1065, !1066, !1067, !1093, !1097, !1098, !1099, !1100, !1101, !1105, !1106, !1107, !1108, !1109, !1113, !1117, !1118}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !621, file: !407, line: 34, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!425, !404, !473, !627, !473, !627, !629, !631}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !621, file: !407, line: 35, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!425, !404, !473, !519, !521, !539}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !621, file: !407, line: 36, baseType: !633, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !621, file: !407, line: 37, baseType: !638, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!425, !404, !394, !394}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !621, file: !407, line: 38, baseType: !642, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!425, !404, !394, !394, !394}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !621, file: !407, line: 40, baseType: !638, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !621, file: !407, line: 41, baseType: !642, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !621, file: !407, line: 42, baseType: !638, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !621, file: !407, line: 43, baseType: !642, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !621, file: !407, line: 44, baseType: !638, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !621, file: !407, line: 46, baseType: !642, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !621, file: !407, line: 47, baseType: !652, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!425, !404, !399, !399, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !658, file: !36, line: 1227, baseType: !528, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !658, file: !36, line: 1228, baseType: !528, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !658, file: !36, line: 1229, baseType: !528, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !658, file: !36, line: 1230, baseType: !528, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !658, file: !36, line: 1231, baseType: !528, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !658, file: !36, line: 1232, baseType: !528, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !658, file: !36, line: 1233, baseType: !528, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !658, file: !36, line: 1234, baseType: !528, size: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !658, file: !36, line: 1236, baseType: !528, size: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !658, file: !36, line: 1237, baseType: !528, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !658, file: !36, line: 1238, baseType: !528, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !621, file: !407, line: 48, baseType: !672, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!425, !404, !399, !655}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !621, file: !407, line: 49, baseType: !676, size: 64, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!425, !404, !394, !528, !679, !528, !473, !473, !394}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !621, file: !407, line: 50, baseType: !681, size: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!425, !404, !684, !685}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !621, file: !407, line: 52, baseType: !687, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!425, !404, !690, !691}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !693, file: !36, line: 593, baseType: !475, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !693, file: !36, line: 594, baseType: !475, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !693, file: !36, line: 594, baseType: !475, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !693, file: !36, line: 594, baseType: !475, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !693, file: !36, line: 595, baseType: !475, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !693, file: !36, line: 596, baseType: !475, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !693, file: !36, line: 597, baseType: !475, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !693, file: !36, line: 598, baseType: !475, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !693, file: !36, line: 598, baseType: !475, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !693, file: !36, line: 599, baseType: !475, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !621, file: !407, line: 53, baseType: !706, size: 64, offset: 1024)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!425, !404, !404, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !621, file: !407, line: 54, baseType: !711, size: 64, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!425, !404, !394}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !621, file: !407, line: 55, baseType: !638, size: 64, offset: 1152)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !621, file: !407, line: 56, baseType: !716, size: 64, offset: 1216)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!425, !404, !719, !527}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !621, file: !407, line: 58, baseType: !721, size: 64, offset: 1280)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!425, !404, !724}
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !621, file: !407, line: 59, baseType: !721, size: 64, offset: 1344)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !621, file: !407, line: 60, baseType: !727, size: 64, offset: 1408)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!425, !404, !730, !589}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !621, file: !407, line: 61, baseType: !732, size: 64, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!425, !404}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !621, file: !407, line: 63, baseType: !736, size: 64, offset: 1536)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!425, !404, !473, !627, !537, !394, !394}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !621, file: !407, line: 64, baseType: !740, size: 64, offset: 1600)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!425, !404, !404, !399, !399, !655}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !621, file: !407, line: 65, baseType: !744, size: 64, offset: 1664)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!425, !404, !404, !655}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !621, file: !407, line: 66, baseType: !748, size: 64, offset: 1728)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!425, !404, !404, !399, !655}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !621, file: !407, line: 67, baseType: !744, size: 64, offset: 1792)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !621, file: !407, line: 69, baseType: !732, size: 64, offset: 1856)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !621, file: !407, line: 70, baseType: !740, size: 64, offset: 1920)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !621, file: !407, line: 71, baseType: !748, size: 64, offset: 1984)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !621, file: !407, line: 72, baseType: !756, size: 64, offset: 2048)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!425, !404, !685}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !621, file: !407, line: 73, baseType: !732, size: 64, offset: 2112)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !621, file: !407, line: 75, baseType: !761, size: 64, offset: 2176)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!425, !404, !764, !685}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !621, file: !407, line: 76, baseType: !638, size: 64, offset: 2240)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !621, file: !407, line: 77, baseType: !638, size: 64, offset: 2304)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !621, file: !407, line: 78, baseType: !652, size: 64, offset: 2368)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !621, file: !407, line: 79, baseType: !672, size: 64, offset: 2432)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !621, file: !407, line: 81, baseType: !770, size: 64, offset: 2496)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!425, !404, !537, !404, !773}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !621, file: !407, line: 82, baseType: !775, size: 64, offset: 2560)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!425, !404, !473, !778, !778, !684, !780}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !621, file: !407, line: 83, baseType: !782, size: 64, offset: 2624)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!425, !404, !473, !785, !473}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !621, file: !407, line: 84, baseType: !787, size: 64, offset: 2688)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!425, !404, !473, !627, !473, !627, !536}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !621, file: !407, line: 85, baseType: !791, size: 64, offset: 2752)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!425, !404, !404, !773}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !621, file: !407, line: 87, baseType: !795, size: 64, offset: 2816)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!425, !404, !394, !519}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !621, file: !407, line: 88, baseType: !799, size: 64, offset: 2880)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!425, !404, !537}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !621, file: !407, line: 89, baseType: !799, size: 64, offset: 2944)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !621, file: !407, line: 90, baseType: !804, size: 64, offset: 3008)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!425, !404, !394, !631}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !621, file: !407, line: 91, baseType: !736, size: 64, offset: 3072)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !621, file: !407, line: 93, baseType: !809, size: 64, offset: 3136)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!425, !404, !812}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !621, file: !407, line: 94, baseType: !816, size: 64, offset: 3200)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!425, !404, !473, !589, !589, !519, !819, !819, !709}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !621, file: !407, line: 95, baseType: !816, size: 64, offset: 3264)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !621, file: !407, line: 96, baseType: !816, size: 64, offset: 3328)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !621, file: !407, line: 97, baseType: !816, size: 64, offset: 3392)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !621, file: !407, line: 99, baseType: !824, size: 64, offset: 3456)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!425, !404, !827, !830}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !400, line: 51, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !400, line: 51, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !407, line: 609, size: 6208, elements: !833)
!833 = !{!834, !835, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !854, !861, !862, !863, !864, !865, !866, !867, !868, !872, !873, !874, !875, !876, !878, !879, !880, !881, !882, !883, !884}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !832, file: !407, line: 610, baseType: !410, size: 4480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !832, file: !407, line: 610, baseType: !836, size: 32, offset: 4480)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !469)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !832, file: !407, line: 611, baseType: !473, size: 32, offset: 4512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !832, file: !407, line: 611, baseType: !473, size: 32, offset: 4544)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !832, file: !407, line: 611, baseType: !473, size: 32, offset: 4576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !832, file: !407, line: 612, baseType: !473, size: 32, offset: 4608)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !832, file: !407, line: 613, baseType: !473, size: 32, offset: 4640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !832, file: !407, line: 614, baseType: !519, size: 64, offset: 4672)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !832, file: !407, line: 615, baseType: !521, size: 64, offset: 4736)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !832, file: !407, line: 616, baseType: !785, size: 64, offset: 4800)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !832, file: !407, line: 617, baseType: !519, size: 64, offset: 4864)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !832, file: !407, line: 618, baseType: !847, size: 64, offset: 4928)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !407, line: 602, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 598, size: 128, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !849, file: !407, line: 599, baseType: !473, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !849, file: !407, line: 600, baseType: !473, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !849, file: !407, line: 601, baseType: !536, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !832, file: !407, line: 619, baseType: !855, size: 64, offset: 4992)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !407, line: 607, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 604, size: 128, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !857, file: !407, line: 605, baseType: !473, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !857, file: !407, line: 606, baseType: !536, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !832, file: !407, line: 620, baseType: !536, size: 64, offset: 5056)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !832, file: !407, line: 621, baseType: !528, size: 64, offset: 5120)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !832, file: !407, line: 622, baseType: !528, size: 64, offset: 5184)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !832, file: !407, line: 623, baseType: !394, size: 64, offset: 5248)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !832, file: !407, line: 623, baseType: !394, size: 64, offset: 5312)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !832, file: !407, line: 623, baseType: !394, size: 64, offset: 5376)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !832, file: !407, line: 624, baseType: !589, size: 32, offset: 5440)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !832, file: !407, line: 625, baseType: !869, size: 64, offset: 5504)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!425}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !832, file: !407, line: 626, baseType: !510, size: 64, offset: 5568)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !832, file: !407, line: 627, baseType: !394, size: 64, offset: 5632)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !832, file: !407, line: 628, baseType: !473, size: 32, offset: 5696)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !832, file: !407, line: 629, baseType: !450, size: 64, offset: 5760)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !832, file: !407, line: 630, baseType: !877, size: 32, offset: 5824)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !832, file: !407, line: 631, baseType: !473, size: 32, offset: 5856)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !832, file: !407, line: 631, baseType: !473, size: 32, offset: 5888)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !832, file: !407, line: 632, baseType: !589, size: 32, offset: 5920)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !832, file: !407, line: 633, baseType: !589, size: 32, offset: 5952)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !832, file: !407, line: 634, baseType: !461, size: 64, offset: 6016)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !832, file: !407, line: 634, baseType: !510, size: 64, offset: 6080)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !832, file: !407, line: 635, baseType: !481, size: 64, offset: 6144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !621, file: !407, line: 100, baseType: !886, size: 64, offset: 3520)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!425, !404, !473, !473, !889, !892}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !891)
!891 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !621, file: !407, line: 101, baseType: !732, size: 64, offset: 3584)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !621, file: !407, line: 102, baseType: !895, size: 64, offset: 3648)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!425, !404, !399, !399, !685}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !621, file: !407, line: 103, baseType: !624, size: 64, offset: 3712)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !621, file: !407, line: 105, baseType: !900, size: 64, offset: 3776)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!425, !404, !399, !399, !684, !685}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !621, file: !407, line: 106, baseType: !732, size: 64, offset: 3840)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !621, file: !407, line: 107, baseType: !905, size: 64, offset: 3904)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!425, !404, !437}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !621, file: !407, line: 108, baseType: !909, size: 64, offset: 3968)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!425, !404, !912, !684, !685}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !450)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !621, file: !407, line: 109, baseType: !869, size: 64, offset: 4032)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !621, file: !407, line: 111, baseType: !915, size: 64, offset: 4096)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!425, !404, !404, !404, !528, !404}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !621, file: !407, line: 112, baseType: !919, size: 64, offset: 4160)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!425, !404, !404, !404, !404}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !621, file: !407, line: 113, baseType: !923, size: 64, offset: 4224)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!425, !404, !926, !926}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !400, line: 30, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !400, line: 30, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !621, file: !407, line: 114, baseType: !624, size: 64, offset: 4288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !621, file: !407, line: 115, baseType: !736, size: 64, offset: 4352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !621, file: !407, line: 117, baseType: !795, size: 64, offset: 4416)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !621, file: !407, line: 118, baseType: !795, size: 64, offset: 4480)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !621, file: !407, line: 119, baseType: !909, size: 64, offset: 4544)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !621, file: !407, line: 120, baseType: !935, size: 64, offset: 4608)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!425, !404, !938, !709}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !621, file: !407, line: 121, baseType: !869, size: 64, offset: 4672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !621, file: !407, line: 123, baseType: !941, size: 64, offset: 4736)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!425, !404, !473, !510}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !621, file: !407, line: 124, baseType: !945, size: 64, offset: 4800)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!425, !404, !830, !394, !510}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !621, file: !407, line: 125, baseType: !949, size: 64, offset: 4864)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!425, !565, !404}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !621, file: !407, line: 126, baseType: !638, size: 64, offset: 4928)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !621, file: !407, line: 127, baseType: !638, size: 64, offset: 4992)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !621, file: !407, line: 129, baseType: !955, size: 64, offset: 5056)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!425, !404, !785}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !621, file: !407, line: 130, baseType: !959, size: 64, offset: 5120)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!425, !404, !962, !962}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !964, file: !60, line: 653, baseType: !473, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !964, file: !60, line: 653, baseType: !394, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !621, file: !407, line: 131, baseType: !959, size: 64, offset: 5184)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !621, file: !407, line: 132, baseType: !970, size: 64, offset: 5248)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!425, !404, !519, !519, !519}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !621, file: !407, line: 133, baseType: !905, size: 64, offset: 5312)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !621, file: !407, line: 135, baseType: !975, size: 64, offset: 5376)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!425, !404, !528, !709}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !621, file: !407, line: 136, baseType: !975, size: 64, offset: 5440)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !621, file: !407, line: 137, baseType: !980, size: 64, offset: 5504)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!425, !404, !709}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !621, file: !407, line: 138, baseType: !624, size: 64, offset: 5568)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !621, file: !407, line: 139, baseType: !985, size: 64, offset: 5632)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!425, !404, !988, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !621, file: !407, line: 141, baseType: !869, size: 64, offset: 5696)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !621, file: !407, line: 142, baseType: !991, size: 64, offset: 5760)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!425, !404, !404, !528, !404}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !621, file: !407, line: 143, baseType: !995, size: 64, offset: 5824)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!425, !404, !404, !404}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !621, file: !407, line: 144, baseType: !869, size: 64, offset: 5888)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !621, file: !407, line: 145, baseType: !991, size: 64, offset: 5952)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !621, file: !407, line: 147, baseType: !995, size: 64, offset: 6016)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !621, file: !407, line: 148, baseType: !869, size: 64, offset: 6080)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !621, file: !407, line: 149, baseType: !991, size: 64, offset: 6144)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !621, file: !407, line: 150, baseType: !995, size: 64, offset: 6208)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !621, file: !407, line: 151, baseType: !1005, size: 64, offset: 6272)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!425, !404, !589}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !621, file: !407, line: 153, baseType: !732, size: 64, offset: 6336)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !621, file: !407, line: 154, baseType: !732, size: 64, offset: 6400)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !621, file: !407, line: 155, baseType: !732, size: 64, offset: 6464)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !621, file: !407, line: 156, baseType: !732, size: 64, offset: 6528)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !621, file: !407, line: 157, baseType: !905, size: 64, offset: 6592)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !621, file: !407, line: 159, baseType: !1014, size: 64, offset: 6656)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!425, !404, !473, !629}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !621, file: !407, line: 160, baseType: !732, size: 64, offset: 6720)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !621, file: !407, line: 161, baseType: !732, size: 64, offset: 6784)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !621, file: !407, line: 162, baseType: !732, size: 64, offset: 6848)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !621, file: !407, line: 163, baseType: !732, size: 64, offset: 6912)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !621, file: !407, line: 165, baseType: !995, size: 64, offset: 6976)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !621, file: !407, line: 166, baseType: !995, size: 64, offset: 7040)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !621, file: !407, line: 167, baseType: !795, size: 64, offset: 7104)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !621, file: !407, line: 168, baseType: !1025, size: 64, offset: 7168)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!425, !404, !394, !473}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !621, file: !407, line: 169, baseType: !1029, size: 64, offset: 7232)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!425, !404, !709, !519}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !621, file: !407, line: 171, baseType: !756, size: 64, offset: 7296)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !621, file: !407, line: 172, baseType: !732, size: 64, offset: 7360)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !621, file: !407, line: 173, baseType: !1035, size: 64, offset: 7424)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!425, !404, !519, !819}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !621, file: !407, line: 174, baseType: !895, size: 64, offset: 7488)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !621, file: !407, line: 175, baseType: !895, size: 64, offset: 7552)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !621, file: !407, line: 177, baseType: !638, size: 64, offset: 7616)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !621, file: !407, line: 178, baseType: !681, size: 64, offset: 7680)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !621, file: !407, line: 179, baseType: !638, size: 64, offset: 7744)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !621, file: !407, line: 180, baseType: !642, size: 64, offset: 7808)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !621, file: !407, line: 181, baseType: !1045, size: 64, offset: 7872)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!425, !404, !429, !684, !685}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !621, file: !407, line: 183, baseType: !955, size: 64, offset: 7936)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !621, file: !407, line: 184, baseType: !716, size: 64, offset: 8000)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !621, file: !407, line: 185, baseType: !1051, size: 64, offset: 8064)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!425, !404, !1054}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !621, file: !407, line: 186, baseType: !1056, size: 64, offset: 8128)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!425, !404, !473, !627, !536}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !621, file: !407, line: 187, baseType: !775, size: 64, offset: 8192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !621, file: !407, line: 189, baseType: !1061, size: 64, offset: 8256)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!425, !404, !473, !473, !519, !629}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !621, file: !407, line: 190, baseType: !869, size: 64, offset: 8320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !621, file: !407, line: 191, baseType: !991, size: 64, offset: 8384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !621, file: !407, line: 192, baseType: !995, size: 64, offset: 8448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !621, file: !407, line: 193, baseType: !1068, size: 64, offset: 8512)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!425, !404, !827, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !407, line: 660, size: 5312, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1073, file: !407, line: 661, baseType: !410, size: 4480)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1073, file: !407, line: 661, baseType: !836, size: 32, offset: 4480)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1073, file: !407, line: 662, baseType: !473, size: 32, offset: 4512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1073, file: !407, line: 662, baseType: !473, size: 32, offset: 4544)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1073, file: !407, line: 662, baseType: !473, size: 32, offset: 4576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1073, file: !407, line: 663, baseType: !473, size: 32, offset: 4608)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1073, file: !407, line: 664, baseType: !473, size: 32, offset: 4640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1073, file: !407, line: 665, baseType: !519, size: 64, offset: 4672)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1073, file: !407, line: 666, baseType: !519, size: 64, offset: 4736)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1073, file: !407, line: 667, baseType: !473, size: 32, offset: 4800)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1073, file: !407, line: 668, baseType: !877, size: 32, offset: 4832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1073, file: !407, line: 670, baseType: !519, size: 64, offset: 4864)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1073, file: !407, line: 670, baseType: !519, size: 64, offset: 4928)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1073, file: !407, line: 671, baseType: !519, size: 64, offset: 4992)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1073, file: !407, line: 672, baseType: !519, size: 64, offset: 5056)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1073, file: !407, line: 673, baseType: !519, size: 64, offset: 5120)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1073, file: !407, line: 674, baseType: !473, size: 32, offset: 5184)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1073, file: !407, line: 675, baseType: !519, size: 64, offset: 5248)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !621, file: !407, line: 195, baseType: !1094, size: 64, offset: 8576)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!425, !1071, !404, !404}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !621, file: !407, line: 196, baseType: !1094, size: 64, offset: 8640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !621, file: !407, line: 197, baseType: !869, size: 64, offset: 8704)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !621, file: !407, line: 198, baseType: !991, size: 64, offset: 8768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !621, file: !407, line: 199, baseType: !995, size: 64, offset: 8832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !621, file: !407, line: 201, baseType: !1102, size: 64, offset: 8896)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!425, !404, !473, !473}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !621, file: !407, line: 202, baseType: !770, size: 64, offset: 8960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !621, file: !407, line: 203, baseType: !642, size: 64, offset: 9024)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !621, file: !407, line: 204, baseType: !824, size: 64, offset: 9088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !621, file: !407, line: 205, baseType: !955, size: 64, offset: 9152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !621, file: !407, line: 206, baseType: !1110, size: 64, offset: 9216)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!425, !429, !404, !473, !684, !685}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !621, file: !407, line: 208, baseType: !1114, size: 64, offset: 9280)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!425, !473, !780}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !621, file: !407, line: 209, baseType: !995, size: 64, offset: 9344)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !621, file: !407, line: 210, baseType: !787, size: 64, offset: 9408)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !406, file: !407, line: 438, baseType: !1120, size: 64, offset: 13952)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !400, line: 60, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1122, file: !114, line: 241, baseType: !429, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !114, line: 242, baseType: !490, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1122, file: !114, line: 243, baseType: !473, size: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1122, file: !114, line: 243, baseType: !473, size: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1122, file: !114, line: 244, baseType: !473, size: 32, offset: 160)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1122, file: !114, line: 244, baseType: !473, size: 32, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1122, file: !114, line: 245, baseType: !519, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1122, file: !114, line: 246, baseType: !589, size: 32, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1122, file: !114, line: 247, baseType: !473, size: 32, offset: 352)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1122, file: !114, line: 251, baseType: !473, size: 32, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1122, file: !114, line: 252, baseType: !926, size: 64, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1122, file: !114, line: 253, baseType: !589, size: 32, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1122, file: !114, line: 254, baseType: !473, size: 32, offset: 544)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1122, file: !114, line: 254, baseType: !473, size: 32, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1122, file: !114, line: 255, baseType: !473, size: 32, offset: 608)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !406, file: !407, line: 438, baseType: !1120, size: 64, offset: 14016)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !407, line: 439, baseType: !510, size: 64, offset: 14080)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !406, file: !407, line: 440, baseType: !1142, size: 32, offset: 14144)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !406, file: !407, line: 441, baseType: !589, size: 32, offset: 14176)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !406, file: !407, line: 442, baseType: !589, size: 32, offset: 14208)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !406, file: !407, line: 443, baseType: !1146, size: 448, offset: 14272)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 448, elements: !1148)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !450)
!1148 = !{!1149}
!1149 = !DISubrange(count: 7)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !406, file: !407, line: 444, baseType: !589, size: 32, offset: 14720)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !406, file: !407, line: 445, baseType: !589, size: 32, offset: 14752)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !406, file: !407, line: 446, baseType: !473, size: 32, offset: 14784)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !406, file: !407, line: 447, baseType: !512, size: 64, offset: 14848)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !406, file: !407, line: 448, baseType: !512, size: 64, offset: 14912)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !406, file: !407, line: 449, baseType: !692, size: 640, offset: 14976)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !406, file: !407, line: 450, baseType: !631, size: 32, offset: 15616)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !406, file: !407, line: 451, baseType: !1158, size: 2880, offset: 15680)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !407, line: 318, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !407, line: 319, size: 2880, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1180, !1181, !1186, !1191, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1206, !1207, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1239, !1240, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1269, !1270}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1159, file: !407, line: 320, baseType: !473, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1159, file: !407, line: 321, baseType: !473, size: 32, offset: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1159, file: !407, line: 322, baseType: !473, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1159, file: !407, line: 323, baseType: !473, size: 32, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1159, file: !407, line: 324, baseType: !473, size: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1159, file: !407, line: 325, baseType: !473, size: 32, offset: 160)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1159, file: !407, line: 326, baseType: !1168, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !407, line: 293, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !407, line: 295, size: 448, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1170, file: !407, line: 296, baseType: !1168, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1170, file: !407, line: 297, baseType: !536, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1170, file: !407, line: 297, baseType: !536, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1170, file: !407, line: 298, baseType: !519, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1170, file: !407, line: 298, baseType: !519, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1170, file: !407, line: 299, baseType: !473, size: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1170, file: !407, line: 300, baseType: !473, size: 32, offset: 352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1170, file: !407, line: 301, baseType: !473, size: 32, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1159, file: !407, line: 326, baseType: !1168, size: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1159, file: !407, line: 328, baseType: !1182, size: 64, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!425, !404, !1185, !519}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1159, file: !407, line: 329, baseType: !1187, size: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!425, !1185, !1190, !521, !521, !539, !519}
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1159, file: !407, line: 330, baseType: !1192, size: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!425, !1185}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1159, file: !407, line: 331, baseType: !1192, size: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1159, file: !407, line: 334, baseType: !429, size: 64, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !407, line: 335, baseType: !490, size: 32, offset: 640)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1159, file: !407, line: 335, baseType: !490, size: 32, offset: 672)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1159, file: !407, line: 336, baseType: !490, size: 32, offset: 704)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1159, file: !407, line: 336, baseType: !490, size: 32, offset: 736)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1159, file: !407, line: 337, baseType: !1202, size: 64, offset: 768)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !430, line: 339, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !430, line: 339, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1159, file: !407, line: 338, baseType: !1202, size: 64, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1159, file: !407, line: 339, baseType: !1208, size: 64, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !430, line: 341, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !430, line: 351, size: 192, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1215, !1216}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1210, file: !430, line: 354, baseType: !72, size: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1210, file: !430, line: 355, baseType: !72, size: 32, offset: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1210, file: !430, line: 356, baseType: !72, size: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1210, file: !430, line: 361, baseType: !72, size: 32, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1210, file: !430, line: 362, baseType: !585, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1159, file: !407, line: 340, baseType: !473, size: 32, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1159, file: !407, line: 340, baseType: !473, size: 32, offset: 992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1159, file: !407, line: 341, baseType: !536, size: 64, offset: 1024)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1159, file: !407, line: 342, baseType: !519, size: 64, offset: 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1159, file: !407, line: 343, baseType: !539, size: 64, offset: 1152)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1159, file: !407, line: 344, baseType: !521, size: 64, offset: 1216)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1159, file: !407, line: 345, baseType: !473, size: 32, offset: 1280)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1159, file: !407, line: 346, baseType: !1190, size: 64, offset: 1344)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1159, file: !407, line: 347, baseType: !589, size: 32, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1159, file: !407, line: 348, baseType: !473, size: 32, offset: 1440)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1159, file: !407, line: 351, baseType: !589, size: 32, offset: 1472)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1159, file: !407, line: 352, baseType: !589, size: 32, offset: 1504)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1159, file: !407, line: 353, baseType: !490, size: 32, offset: 1536)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1159, file: !407, line: 354, baseType: !490, size: 32, offset: 1568)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1159, file: !407, line: 355, baseType: !1190, size: 64, offset: 1600)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1159, file: !407, line: 356, baseType: !1190, size: 64, offset: 1664)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1159, file: !407, line: 357, baseType: !1234, size: 64, offset: 1728)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !407, line: 310, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 308, size: 32, elements: !1237)
!1237 = !{!1238}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1236, file: !407, line: 309, baseType: !473, size: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1159, file: !407, line: 357, baseType: !1234, size: 64, offset: 1792)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1159, file: !407, line: 358, baseType: !1241, size: 64, offset: 1856)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !407, line: 316, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 312, size: 128, elements: !1244)
!1244 = !{!1245, !1246, !1247}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1243, file: !407, line: 313, baseType: !510, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1243, file: !407, line: 314, baseType: !473, size: 32, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1243, file: !407, line: 315, baseType: !452, size: 8, offset: 96)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1159, file: !407, line: 359, baseType: !1241, size: 64, offset: 1920)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1159, file: !407, line: 360, baseType: !1241, size: 64, offset: 1984)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1159, file: !407, line: 361, baseType: !473, size: 32, offset: 2048)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1159, file: !407, line: 362, baseType: !490, size: 32, offset: 2080)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1159, file: !407, line: 363, baseType: !473, size: 32, offset: 2112)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1159, file: !407, line: 364, baseType: !1190, size: 64, offset: 2176)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1159, file: !407, line: 365, baseType: !1208, size: 64, offset: 2240)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1159, file: !407, line: 366, baseType: !490, size: 32, offset: 2304)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1159, file: !407, line: 367, baseType: !490, size: 32, offset: 2336)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1159, file: !407, line: 368, baseType: !1202, size: 64, offset: 2368)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1159, file: !407, line: 369, baseType: !1202, size: 64, offset: 2432)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1159, file: !407, line: 370, baseType: !1260, size: 64, offset: 2496)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1159, file: !407, line: 371, baseType: !1260, size: 64, offset: 2560)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1159, file: !407, line: 372, baseType: !1260, size: 64, offset: 2624)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1159, file: !407, line: 373, baseType: !1266, size: 64, offset: 2688)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !430, line: 331, baseType: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !430, line: 331, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1159, file: !407, line: 374, baseType: !585, size: 64, offset: 2752)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1159, file: !407, line: 375, baseType: !1271, size: 64, offset: 2816)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !406, file: !407, line: 451, baseType: !1158, size: 2880, offset: 18560)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !406, file: !407, line: 452, baseType: !1274, size: 64, offset: 21440)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !407, line: 681, size: 4864, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1276, file: !407, line: 682, baseType: !410, size: 4480)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1276, file: !407, line: 682, baseType: !836, size: 32, offset: 4480)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1276, file: !407, line: 683, baseType: !589, size: 32, offset: 4512)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1276, file: !407, line: 684, baseType: !473, size: 32, offset: 4544)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1276, file: !407, line: 685, baseType: !988, size: 64, offset: 4608)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1276, file: !407, line: 686, baseType: !536, size: 64, offset: 4672)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1276, file: !407, line: 687, baseType: !1285, size: 64, offset: 4736)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!425, !1274, !394, !510}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1276, file: !407, line: 688, baseType: !510, size: 64, offset: 4800)
