; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/impls/visualization/trajvisualization.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/impls/visualization/trajvisualization.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TSTrajectory = type { %struct._p_PetscObject, [1 x %struct._TSTrajectoryOps], %struct._n_TSHistory*, %struct.anon.3, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i8**, i32, i8*, i8*, i8*, i32 (i8*, %struct._p_Vec*, %struct._p_Vec**)*, i32 (i8*)*, i8*, i8* }

!57 = !DIEnumerator(name: "TSEVENT_LOCATED_INTERVAL", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "TSEVENT_PROCESSING", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "TSEVENT_ZERO", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "TSEVENT_RESET_NEXTSTEP", value: 4, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 285, baseType: !5, size: 32, elements: !63)
!62 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 103, baseType: !38, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!70 = !DIEnumerator(name: "TS_CONVERGED_ITERATING", value: 0)
!71 = !DIEnumerator(name: "TS_CONVERGED_TIME", value: 1)
!72 = !DIEnumerator(name: "TS_CONVERGED_ITS", value: 2)
!73 = !DIEnumerator(name: "TS_CONVERGED_USER", value: 3)
!74 = !DIEnumerator(name: "TS_CONVERGED_EVENT", value: 4)
!75 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FATOL", value: 5)
!76 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FRTOL", value: 6)
!77 = !DIEnumerator(name: "TS_DIVERGED_NONLINEAR_SOLVE", value: -1)
!78 = !DIEnumerator(name: "TS_DIVERGED_STEP_REJECTED", value: -2)
!79 = !DIEnumerator(name: "TSFORWARD_DIVERGED_LINEAR_SOLVE", value: -3)
!80 = !DIEnumerator(name: "TSADJOINT_DIVERGED_LINEAR_SOLVE", value: -4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 217, baseType: !5, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 663, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 481, baseType: !38, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!96 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!97 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!98 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!99 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!100 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!103 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!121 = !{!122, !125, !143, !221, !211, !38, !291}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !128, line: 73, size: 4480, elements: !129)
!128 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!129 = !{!130, !132, !182, !183, !185, !188, !189, !190, !191, !199, !200, !202, !206, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222, !224, !225, !226, !228, !229, !231, !233, !234, !235, !236, !237, !240, !242, !243, !244, !245, !246, !249, !251, !252, !253, !263, !265, !266, !270, !271, !320, !325, !327, !328, !329}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !127, file: !128, line: 74, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !38)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !127, file: !128, line: 75, baseType: !133, size: 448, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 448, elements: !180)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !128, line: 53, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 45, size: 448, elements: !136)
!136 = !{!137, !147, !155, !160, !164, !168, !175}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !135, file: !128, line: 46, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !125, !142}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !38)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !144, line: 330, baseType: !145)
!144 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !144, line: 330, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !135, file: !128, line: 47, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!141, !125, !151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !152, line: 16, baseType: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !152, line: 16, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !135, file: !128, line: 48, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!141, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !135, file: !128, line: 49, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!141, !125, !122, !125}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !135, file: !128, line: 50, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!141, !125, !122, !159}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !135, file: !128, line: 51, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!141, !125, !122, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !135, file: !128, line: 52, baseType: !176, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!141, !125, !122, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !127, file: !128, line: 76, baseType: !143, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !128, line: 77, baseType: !184, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !38)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !127, file: !128, line: 78, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !187)
!187 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !127, file: !128, line: 78, baseType: !186, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !127, file: !128, line: 78, baseType: !186, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !127, file: !128, line: 78, baseType: !186, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !127, file: !128, line: 79, baseType: !192, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !195, line: 27, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !197, line: 43, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !127, file: !128, line: 80, baseType: !184, size: 32, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !127, file: !128, line: 81, baseType: !201, size: 32, offset: 992)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !38)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !127, file: !128, line: 82, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !127, file: !128, line: 83, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !127, file: !128, line: 84, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !127, file: !128, line: 85, baseType: !211, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !127, file: !128, line: 86, baseType: !211, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !127, file: !128, line: 87, baseType: !211, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !127, file: !128, line: 88, baseType: !125, size: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !127, file: !128, line: 89, baseType: !192, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 90, baseType: !211, size: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !127, file: !128, line: 91, baseType: !211, size: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !127, file: !128, line: 92, baseType: !184, size: 32, offset: 1664)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !127, file: !128, line: 93, baseType: !221, size: 64, offset: 1728)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !128, line: 94, baseType: !223, size: 64, offset: 1792)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !193)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !127, file: !128, line: 95, baseType: !184, size: 32, offset: 1856)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !127, file: !128, line: 95, baseType: !184, size: 32, offset: 1888)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !127, file: !128, line: 96, baseType: !227, size: 64, offset: 1920)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !127, file: !128, line: 96, baseType: !227, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !127, file: !128, line: 97, baseType: !230, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !127, file: !128, line: 97, baseType: !232, size: 64, offset: 2112)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !127, file: !128, line: 98, baseType: !184, size: 32, offset: 2176)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !127, file: !128, line: 98, baseType: !184, size: 32, offset: 2208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !127, file: !128, line: 99, baseType: !227, size: 64, offset: 2240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !127, file: !128, line: 99, baseType: !227, size: 64, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !127, file: !128, line: 100, baseType: !238, size: 64, offset: 2368)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !187)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !127, file: !128, line: 100, baseType: !241, size: 64, offset: 2432)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !127, file: !128, line: 101, baseType: !184, size: 32, offset: 2496)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !127, file: !128, line: 101, baseType: !184, size: 32, offset: 2528)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !127, file: !128, line: 102, baseType: !227, size: 64, offset: 2560)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !127, file: !128, line: 102, baseType: !227, size: 64, offset: 2624)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !127, file: !128, line: 103, baseType: !247, size: 64, offset: 2688)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !239)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !127, file: !128, line: 103, baseType: !250, size: 64, offset: 2752)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !127, file: !128, line: 104, baseType: !179, size: 64, offset: 2816)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !127, file: !128, line: 105, baseType: !184, size: 32, offset: 2880)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !127, file: !128, line: 106, baseType: !254, size: 128, offset: 2944)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, elements: !261)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !128, line: 64, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 61, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !257, file: !128, line: 62, baseType: !172, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !257, file: !128, line: 63, baseType: !221, size: 64, offset: 64)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !127, file: !128, line: 107, baseType: !264, size: 64, offset: 3072)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !261)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !127, file: !128, line: 108, baseType: !221, size: 64, offset: 3136)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !127, file: !128, line: 109, baseType: !267, size: 64, offset: 3200)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!141, !221}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !127, file: !128, line: 111, baseType: !184, size: 32, offset: 3264)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !127, file: !128, line: 112, baseType: !272, size: 320, offset: 3328)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 320, elements: !318)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!141, !276, !125, !221}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !279)
!279 = !{!280, !281, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !278, file: !10, line: 100, baseType: !184, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !10, line: 101, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !293, !294, !295, !299, !301, !303, !304, !305}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !284, file: !10, line: 84, baseType: !211, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !284, file: !10, line: 85, baseType: !211, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !10, line: 86, baseType: !221, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !284, file: !10, line: 87, baseType: !203, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !284, file: !10, line: 88, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !284, file: !10, line: 89, baseType: !124, size: 8, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !284, file: !10, line: 90, baseType: !211, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !284, file: !10, line: 91, baseType: !296, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !297, line: 46, baseType: !298)
!297 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!298 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !284, file: !10, line: 92, baseType: !300, size: 32, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !10, line: 93, baseType: !302, size: 32, offset: 544)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !10, line: 94, baseType: !282, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !284, file: !10, line: 95, baseType: !211, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !284, file: !10, line: 96, baseType: !221, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !278, file: !10, line: 102, baseType: !211, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !278, file: !10, line: 102, baseType: !211, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !278, file: !10, line: 103, baseType: !211, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !278, file: !10, line: 104, baseType: !143, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !278, file: !10, line: 105, baseType: !300, size: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !278, file: !10, line: 105, baseType: !300, size: 32, offset: 416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !278, file: !10, line: 105, baseType: !300, size: 32, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !278, file: !10, line: 106, baseType: !125, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !278, file: !10, line: 107, baseType: !315, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!318 = !{!319}
!319 = !DISubrange(count: 5)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !127, file: !128, line: 113, baseType: !321, size: 320, offset: 3648)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 320, elements: !318)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!141, !125, !221}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !127, file: !128, line: 114, baseType: !326, size: 320, offset: 3968)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 320, elements: !318)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !127, file: !128, line: 115, baseType: !300, size: 32, offset: 4288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !127, file: !128, line: 120, baseType: !315, size: 64, offset: 4352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !127, file: !128, line: 121, baseType: !300, size: 32, offset: 4416)
!330 = !{i32 7, !"Dwarf Version", i32 4}
!331 = !{i32 2, !"Debug Info Version", i32 3}
!332 = !{i32 1, !"wchar_size", i32 4}
!333 = !{i32 7, !"PIC Level", i32 2}
!334 = !{i32 7, !"uwtable", i32 1}
!335 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!336 = distinct !DISubprogram(name: "TSTrajectoryCreate_Visualization", scope: !337, file: !337, line: 88, type: !338, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !840)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/impls/visualization/trajvisualization.c", directory: "/home/users/ndemeye/xSDK")
!338 = !DISubroutineType(types: !339)
!339 = !{!141, !340, !363}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !33, line: 293, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !54, line: 89, size: 7040, elements: !343)
!343 = !{!344, !346, !788, !792, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !829, !830, !831, !832, !833, !837, !838, !839}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !342, file: !54, line: 90, baseType: !345, size: 4480)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !128, line: 122, baseType: !127)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !54, line: 90, baseType: !347, size: 448, offset: 4480)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 448, elements: !180)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !54, line: 75, size: 448, elements: !349)
!349 = !{!350, !354, !358, !359, !778, !782, !786}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !348, file: !54, line: 76, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!141, !340, !151}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !348, file: !54, line: 77, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!141, !340}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !348, file: !54, line: 78, baseType: !355, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !348, file: !54, line: 79, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!141, !340, !363, !184, !239, !380}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !33, line: 17, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !54, line: 144, size: 17408, elements: !366)
!366 = !{!367, !368, !468, !470, !472, !477, !478, !479, !542, !544, !590, !597, !603, !605, !606, !611, !612, !613, !614, !615, !616, !620, !624, !625, !626, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !654, !658, !662, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !714, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !744, !745, !746, !747, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !776, !777}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !365, file: !54, line: 145, baseType: !345, size: 4480)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !365, file: !54, line: 145, baseType: !369, size: 2048, offset: 4480)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 2048, elements: !180)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !54, line: 33, size: 2048, elements: !371)
!371 = !{!372, !383, !390, !394, !395, !396, !400, !405, !410, !414, !415, !419, !420, !424, !425, !426, !432, !433, !434, !435, !436, !437, !438, !439, !440, !446, !450, !454, !458, !462, !463, !464}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !370, file: !54, line: 34, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!141, !376, !380, !380, !363}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !377, line: 18, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !377, line: 18, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !25, line: 21, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !370, file: !54, line: 35, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!141, !376, !380, !387, !387, !363}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !62, line: 16, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !62, line: 16, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !370, file: !54, line: 36, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!141, !363}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !370, file: !54, line: 37, baseType: !391, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !370, file: !54, line: 38, baseType: !391, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !370, file: !54, line: 39, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!141, !363, !239, !380}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !370, file: !54, line: 40, baseType: !401, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!141, !363, !404, !230, !238}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !370, file: !54, line: 41, baseType: !406, size: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!141, !363, !184, !380, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !370, file: !54, line: 42, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!141, !276, !363}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !370, file: !54, line: 43, baseType: !391, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !370, file: !54, line: 44, baseType: !416, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!141, !363, !151}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !370, file: !54, line: 45, baseType: !391, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !370, file: !54, line: 46, baseType: !421, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!141, !363, !239, !239, !238, !238}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !370, file: !54, line: 47, baseType: !416, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !370, file: !54, line: 48, baseType: !391, size: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !370, file: !54, line: 49, baseType: !427, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!141, !363, !230, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !370, file: !54, line: 50, baseType: !391, size: 64, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !370, file: !54, line: 51, baseType: !391, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !370, file: !54, line: 52, baseType: !391, size: 64, offset: 1152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !370, file: !54, line: 53, baseType: !391, size: 64, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !370, file: !54, line: 54, baseType: !391, size: 64, offset: 1280)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !370, file: !54, line: 55, baseType: !391, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !370, file: !54, line: 56, baseType: !391, size: 64, offset: 1408)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !370, file: !54, line: 57, baseType: !391, size: 64, offset: 1472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !370, file: !54, line: 58, baseType: !441, size: 64, offset: 1536)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!141, !363, !230, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !370, file: !54, line: 59, baseType: !447, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!141, !363, !230, !431}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !370, file: !54, line: 60, baseType: !451, size: 64, offset: 1664)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!141, !363, !431}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !370, file: !54, line: 61, baseType: !455, size: 64, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!141, !363, !184, !431}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !370, file: !54, line: 62, baseType: !459, size: 64, offset: 1792)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!141, !363, !380}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !370, file: !54, line: 63, baseType: !391, size: 64, offset: 1856)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !370, file: !54, line: 64, baseType: !459, size: 64, offset: 1920)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !370, file: !54, line: 65, baseType: !465, size: 64, offset: 1984)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!141, !363, !380, !380}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !365, file: !54, line: 146, baseType: !469, size: 32, offset: 6528)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !33, line: 57, baseType: !32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !365, file: !54, line: 147, baseType: !471, size: 32, offset: 6560)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !33, line: 88, baseType: !37)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !365, file: !54, line: 149, baseType: !473, size: 64, offset: 6592)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !474, line: 14, baseType: !475)
!474 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !474, line: 14, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !365, file: !54, line: 150, baseType: !380, size: 64, offset: 6656)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !365, file: !54, line: 151, baseType: !380, size: 64, offset: 6720)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !365, file: !54, line: 152, baseType: !480, size: 64, offset: 6784)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !33, line: 686, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !54, line: 319, size: 10112, elements: !483)
!483 = !{!484, !485, !507, !508, !512, !527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !482, file: !54, line: 320, baseType: !345, size: 4480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !482, file: !54, line: 320, baseType: !486, size: 384, offset: 4480)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 384, elements: !180)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !54, line: 310, size: 384, elements: !488)
!488 = !{!489, !493, !497, !498, !502, !506}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !487, file: !54, line: 311, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!141, !480, !363, !239, !230, !238, !409, !238, !238, !238}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !487, file: !54, line: 312, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!141, !480}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !487, file: !54, line: 313, baseType: !494, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !487, file: !54, line: 314, baseType: !499, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!141, !480, !151}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !487, file: !54, line: 315, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!141, !276, !480}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !487, file: !54, line: 316, baseType: !499, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !54, line: 321, baseType: !221, size: 64, offset: 4864)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !482, file: !54, line: 322, baseType: !509, size: 64, offset: 4928)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!141, !480, !363, !239, !380, !409}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !482, file: !54, line: 331, baseType: !513, size: 4160, offset: 4992)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !54, line: 323, size: 4160, elements: !514)
!514 = !{!515, !516, !517, !521, !523, !524, !526}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !513, file: !54, line: 324, baseType: !184, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !513, file: !54, line: 325, baseType: !300, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !513, file: !54, line: 326, baseType: !518, size: 1024, offset: 64)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 1024, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !513, file: !54, line: 327, baseType: !522, size: 512, offset: 1088)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 512, elements: !519)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !513, file: !54, line: 328, baseType: !522, size: 512, offset: 1600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !513, file: !54, line: 329, baseType: !525, size: 1024, offset: 2112)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, elements: !519)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !513, file: !54, line: 330, baseType: !525, size: 1024, offset: 3136)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !482, file: !54, line: 332, baseType: !300, size: 32, offset: 9152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !482, file: !54, line: 333, baseType: !239, size: 64, offset: 9216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !482, file: !54, line: 334, baseType: !239, size: 64, offset: 9280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !482, file: !54, line: 335, baseType: !531, size: 128, offset: 9344)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !261)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !482, file: !54, line: 336, baseType: !239, size: 64, offset: 9472)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !482, file: !54, line: 336, baseType: !239, size: 64, offset: 9536)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !482, file: !54, line: 337, baseType: !239, size: 64, offset: 9600)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !482, file: !54, line: 338, baseType: !300, size: 32, offset: 9664)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !482, file: !54, line: 339, baseType: !239, size: 64, offset: 9728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !482, file: !54, line: 340, baseType: !531, size: 128, offset: 9792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !482, file: !54, line: 341, baseType: !404, size: 32, offset: 9920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !482, file: !54, line: 342, baseType: !151, size: 64, offset: 9984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !482, file: !54, line: 343, baseType: !184, size: 32, offset: 10048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !482, file: !54, line: 344, baseType: !184, size: 32, offset: 10080)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !365, file: !54, line: 153, baseType: !543, size: 64, offset: 6848)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !33, line: 695, baseType: !122)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !365, file: !54, line: 154, baseType: !545, size: 64, offset: 6912)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !54, line: 71, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !54, line: 410, size: 1792, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !569, !570, !571, !572, !573, !574, !575, !576, !578, !579, !580, !588, !589}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !547, file: !54, line: 411, baseType: !247, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !547, file: !54, line: 412, baseType: !247, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !547, file: !54, line: 413, baseType: !239, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !547, file: !54, line: 414, baseType: !239, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !547, file: !54, line: 415, baseType: !239, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !547, file: !54, line: 416, baseType: !247, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !547, file: !54, line: 417, baseType: !230, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !547, file: !54, line: 418, baseType: !239, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !547, file: !54, line: 419, baseType: !239, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !547, file: !54, line: 420, baseType: !239, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !547, file: !54, line: 421, baseType: !239, size: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !547, file: !54, line: 422, baseType: !409, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !547, file: !54, line: 423, baseType: !562, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!141, !363, !239, !380, !247, !221}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !547, file: !54, line: 424, baseType: !566, size: 64, offset: 832)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!141, !363, !184, !230, !239, !380, !300, !221}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !547, file: !54, line: 425, baseType: !221, size: 64, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !547, file: !54, line: 426, baseType: !230, size: 64, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !547, file: !54, line: 427, baseType: !409, size: 64, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !547, file: !54, line: 428, baseType: !184, size: 32, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !547, file: !54, line: 429, baseType: !184, size: 32, offset: 1120)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !547, file: !54, line: 430, baseType: !230, size: 64, offset: 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !547, file: !54, line: 431, baseType: !238, size: 64, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !547, file: !54, line: 432, baseType: !577, size: 32, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !54, line: 408, baseType: !53)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !547, file: !54, line: 433, baseType: !184, size: 32, offset: 1312)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !547, file: !54, line: 434, baseType: !151, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !547, file: !54, line: 442, baseType: !581, size: 320, offset: 1408)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !54, line: 436, size: 320, elements: !582)
!582 = !{!583, !584, !585, !586, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !581, file: !54, line: 437, baseType: !184, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !581, file: !54, line: 438, baseType: !238, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !581, file: !54, line: 439, baseType: !230, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !581, file: !54, line: 440, baseType: !230, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !581, file: !54, line: 441, baseType: !232, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !547, file: !54, line: 443, baseType: !184, size: 32, offset: 1728)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !547, file: !54, line: 444, baseType: !184, size: 32, offset: 1760)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !365, file: !54, line: 157, baseType: !591, size: 640, offset: 6976)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 640, elements: !595)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!141, !363, !184, !239, !380, !221}
!595 = !{!596}
!596 = !DISubrange(count: 10)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !365, file: !54, line: 158, baseType: !598, size: 640, offset: 7616)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 640, elements: !595)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!141, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !365, file: !54, line: 159, baseType: !604, size: 640, offset: 8256)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 640, elements: !595)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !365, file: !54, line: 160, baseType: !184, size: 32, offset: 8896)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !365, file: !54, line: 161, baseType: !607, size: 640, offset: 8960)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 640, elements: !595)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!141, !363, !184, !239, !380, !184, !431, !431, !221}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !365, file: !54, line: 162, baseType: !598, size: 640, offset: 9600)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !365, file: !54, line: 163, baseType: !604, size: 640, offset: 10240)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !365, file: !54, line: 164, baseType: !184, size: 32, offset: 10880)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !365, file: !54, line: 165, baseType: !184, size: 32, offset: 10912)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !365, file: !54, line: 167, baseType: !391, size: 64, offset: 10944)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !365, file: !54, line: 168, baseType: !617, size: 64, offset: 11008)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!141, !363, !239}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !365, file: !54, line: 169, baseType: !621, size: 64, offset: 11072)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!141, !363, !239, !184, !431}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !365, file: !54, line: 170, baseType: !391, size: 64, offset: 11136)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !365, file: !54, line: 171, baseType: !391, size: 64, offset: 11200)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !365, file: !54, line: 172, baseType: !627, size: 64, offset: 11264)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!141, !363, !239, !380, !409}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !365, file: !54, line: 175, baseType: !340, size: 64, offset: 11328)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !365, file: !54, line: 176, baseType: !431, size: 64, offset: 11392)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !365, file: !54, line: 177, baseType: !431, size: 64, offset: 11456)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !365, file: !54, line: 178, baseType: !184, size: 32, offset: 11520)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !365, file: !54, line: 179, baseType: !380, size: 64, offset: 11584)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !365, file: !54, line: 180, baseType: !184, size: 32, offset: 11648)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !365, file: !54, line: 181, baseType: !184, size: 32, offset: 11680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !365, file: !54, line: 182, baseType: !184, size: 32, offset: 11712)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !365, file: !54, line: 183, baseType: !300, size: 32, offset: 11744)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !365, file: !54, line: 184, baseType: !300, size: 32, offset: 11776)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !365, file: !54, line: 185, baseType: !380, size: 64, offset: 11840)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !365, file: !54, line: 186, baseType: !387, size: 64, offset: 11904)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !365, file: !54, line: 186, baseType: !387, size: 64, offset: 11968)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !365, file: !54, line: 187, baseType: !221, size: 64, offset: 12032)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !365, file: !54, line: 187, baseType: !221, size: 64, offset: 12096)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !365, file: !54, line: 188, baseType: !221, size: 64, offset: 12160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !365, file: !54, line: 189, baseType: !431, size: 64, offset: 12224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !365, file: !54, line: 190, baseType: !431, size: 64, offset: 12288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !365, file: !54, line: 191, baseType: !380, size: 64, offset: 12352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !365, file: !54, line: 191, baseType: !380, size: 64, offset: 12416)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !365, file: !54, line: 194, baseType: !651, size: 64, offset: 12480)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!141, !363, !239, !380, !387, !221}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !365, file: !54, line: 195, baseType: !655, size: 64, offset: 12544)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!141, !363, !239, !380, !380, !239, !387, !221}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !365, file: !54, line: 196, baseType: !659, size: 64, offset: 12608)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!141, !363, !239, !380, !380, !221}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !365, file: !54, line: 197, baseType: !663, size: 64, offset: 12672)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!141, !363, !239, !380, !431, !221}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !365, file: !54, line: 198, baseType: !663, size: 64, offset: 12736)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !365, file: !54, line: 201, baseType: !431, size: 64, offset: 12800)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !365, file: !54, line: 202, baseType: !431, size: 64, offset: 12864)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !365, file: !54, line: 203, baseType: !380, size: 64, offset: 12928)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !365, file: !54, line: 204, baseType: !431, size: 64, offset: 12992)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !365, file: !54, line: 204, baseType: !431, size: 64, offset: 13056)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !365, file: !54, line: 205, baseType: !431, size: 64, offset: 13120)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !365, file: !54, line: 205, baseType: !431, size: 64, offset: 13184)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !365, file: !54, line: 206, baseType: !431, size: 64, offset: 13248)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !365, file: !54, line: 206, baseType: !431, size: 64, offset: 13312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !365, file: !54, line: 207, baseType: !431, size: 64, offset: 13376)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !365, file: !54, line: 207, baseType: !431, size: 64, offset: 13440)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !365, file: !54, line: 208, baseType: !221, size: 64, offset: 13504)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !365, file: !54, line: 208, baseType: !221, size: 64, offset: 13568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !365, file: !54, line: 209, baseType: !681, size: 64, offset: 13632)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!141, !363, !239, !380, !431, !380, !431, !221}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !365, file: !54, line: 210, baseType: !681, size: 64, offset: 13696)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !365, file: !54, line: 211, baseType: !681, size: 64, offset: 13760)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !365, file: !54, line: 212, baseType: !681, size: 64, offset: 13824)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !365, file: !54, line: 213, baseType: !681, size: 64, offset: 13888)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !365, file: !54, line: 214, baseType: !681, size: 64, offset: 13952)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !365, file: !54, line: 215, baseType: !681, size: 64, offset: 14016)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !365, file: !54, line: 216, baseType: !681, size: 64, offset: 14080)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !365, file: !54, line: 219, baseType: !387, size: 64, offset: 14144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !365, file: !54, line: 220, baseType: !380, size: 64, offset: 14208)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !365, file: !54, line: 221, baseType: !431, size: 64, offset: 14272)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !365, file: !54, line: 222, baseType: !184, size: 32, offset: 14336)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !365, file: !54, line: 223, baseType: !184, size: 32, offset: 14368)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !365, file: !54, line: 224, baseType: !221, size: 64, offset: 14400)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !365, file: !54, line: 225, baseType: !184, size: 32, offset: 14464)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !365, file: !54, line: 226, baseType: !300, size: 32, offset: 14496)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !365, file: !54, line: 227, baseType: !663, size: 64, offset: 14528)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !365, file: !54, line: 231, baseType: !387, size: 64, offset: 14592)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !365, file: !54, line: 232, baseType: !387, size: 64, offset: 14656)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !365, file: !54, line: 233, baseType: !380, size: 64, offset: 14720)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !365, file: !54, line: 247, baseType: !704, size: 384, offset: 14784)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !54, line: 238, size: 384, elements: !705)
!705 = !{!706, !707, !708, !709, !711, !712, !713}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !704, file: !54, line: 239, baseType: !239, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !704, file: !54, line: 240, baseType: !192, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !704, file: !54, line: 241, baseType: !223, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !704, file: !54, line: 242, baseType: !710, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !62, line: 285, baseType: !61)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !704, file: !54, line: 245, baseType: !300, size: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !704, file: !54, line: 246, baseType: !239, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !704, file: !54, line: 246, baseType: !239, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !365, file: !54, line: 251, baseType: !715, size: 64, offset: 15168)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !54, line: 249, size: 64, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !715, file: !54, line: 250, baseType: !239, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !365, file: !54, line: 253, baseType: !710, size: 32, offset: 15232)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !365, file: !54, line: 255, baseType: !376, size: 64, offset: 15296)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !365, file: !54, line: 256, baseType: !300, size: 32, offset: 15360)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !365, file: !54, line: 258, baseType: !184, size: 32, offset: 15392)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !365, file: !54, line: 259, baseType: !184, size: 32, offset: 15424)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !365, file: !54, line: 260, baseType: !184, size: 32, offset: 15456)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !365, file: !54, line: 261, baseType: !184, size: 32, offset: 15488)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !365, file: !54, line: 264, baseType: !184, size: 32, offset: 15520)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !365, file: !54, line: 264, baseType: !184, size: 32, offset: 15552)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !365, file: !54, line: 264, baseType: !184, size: 32, offset: 15584)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !365, file: !54, line: 264, baseType: !184, size: 32, offset: 15616)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !365, file: !54, line: 267, baseType: !184, size: 32, offset: 15648)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !54, line: 268, baseType: !221, size: 64, offset: 15680)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !365, file: !54, line: 269, baseType: !221, size: 64, offset: 15744)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !365, file: !54, line: 272, baseType: !184, size: 32, offset: 15808)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !365, file: !54, line: 273, baseType: !239, size: 64, offset: 15872)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !365, file: !54, line: 277, baseType: !300, size: 32, offset: 15936)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !365, file: !54, line: 278, baseType: !300, size: 32, offset: 15968)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !365, file: !54, line: 279, baseType: !184, size: 32, offset: 16000)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !365, file: !54, line: 280, baseType: !239, size: 64, offset: 16064)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !365, file: !54, line: 281, baseType: !239, size: 64, offset: 16128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !365, file: !54, line: 282, baseType: !239, size: 64, offset: 16192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !365, file: !54, line: 283, baseType: !239, size: 64, offset: 16256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !365, file: !54, line: 284, baseType: !239, size: 64, offset: 16320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !365, file: !54, line: 286, baseType: !743, size: 32, offset: 16384)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !33, line: 115, baseType: !68)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !365, file: !54, line: 287, baseType: !300, size: 32, offset: 16416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !365, file: !54, line: 288, baseType: !184, size: 32, offset: 16448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !365, file: !54, line: 288, baseType: !184, size: 32, offset: 16480)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !365, file: !54, line: 289, baseType: !748, size: 32, offset: 16512)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !33, line: 217, baseType: !81)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !365, file: !54, line: 291, baseType: !239, size: 64, offset: 16576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !365, file: !54, line: 291, baseType: !239, size: 64, offset: 16640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !365, file: !54, line: 292, baseType: !380, size: 64, offset: 16704)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !365, file: !54, line: 292, baseType: !380, size: 64, offset: 16768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !365, file: !54, line: 293, baseType: !239, size: 64, offset: 16832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !365, file: !54, line: 293, baseType: !239, size: 64, offset: 16896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !365, file: !54, line: 295, baseType: !300, size: 32, offset: 16960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !365, file: !54, line: 296, baseType: !300, size: 32, offset: 16992)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !365, file: !54, line: 298, baseType: !184, size: 32, offset: 17024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !365, file: !54, line: 299, baseType: !431, size: 64, offset: 17088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !365, file: !54, line: 302, baseType: !184, size: 32, offset: 17152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !365, file: !54, line: 303, baseType: !761, size: 64, offset: 17216)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !54, line: 135, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !54, line: 136, size: 320, elements: !764)
!764 = !{!765, !766, !767, !772, !773}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !763, file: !54, line: 137, baseType: !363, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !763, file: !54, line: 138, baseType: !211, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !763, file: !54, line: 139, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !769, line: 11, baseType: !770)
!769 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !769, line: 11, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !763, file: !54, line: 140, baseType: !761, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !763, file: !54, line: 141, baseType: !774, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !775, line: 80, baseType: !38)
!775 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!776 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !365, file: !54, line: 304, baseType: !300, size: 32, offset: 17280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !365, file: !54, line: 307, baseType: !363, size: 64, offset: 17344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !348, file: !54, line: 80, baseType: !779, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!141, !340, !363, !184, !238}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !348, file: !54, line: 81, baseType: !783, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!141, !276, !340}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !348, file: !54, line: 82, baseType: !787, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !342, file: !54, line: 91, baseType: !789, size: 64, offset: 4928)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !54, line: 87, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !54, line: 87, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !342, file: !54, line: 116, baseType: !793, size: 1024, offset: 4992)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !342, file: !54, line: 93, size: 1024, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !810}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !793, file: !54, line: 94, baseType: !184, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !793, file: !54, line: 95, baseType: !431, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !793, file: !54, line: 96, baseType: !247, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !793, file: !54, line: 97, baseType: !238, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !793, file: !54, line: 98, baseType: !431, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !793, file: !54, line: 99, baseType: !409, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !793, file: !54, line: 100, baseType: !238, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !793, file: !54, line: 103, baseType: !300, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !793, file: !54, line: 109, baseType: !804, size: 256, offset: 512)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !54, line: 104, size: 256, elements: !805)
!805 = !{!806, !807, !808, !809}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !804, file: !54, line: 105, baseType: !192, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !804, file: !54, line: 106, baseType: !223, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !804, file: !54, line: 107, baseType: !239, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !804, file: !54, line: 108, baseType: !184, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !793, file: !54, line: 115, baseType: !811, size: 256, offset: 768)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !54, line: 110, size: 256, elements: !812)
!812 = !{!813, !814, !815, !816}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !811, file: !54, line: 111, baseType: !192, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !811, file: !54, line: 112, baseType: !223, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !811, file: !54, line: 113, baseType: !239, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !811, file: !54, line: 114, baseType: !184, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !342, file: !54, line: 117, baseType: !380, size: 64, offset: 6016)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !342, file: !54, line: 117, baseType: !380, size: 64, offset: 6080)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !342, file: !54, line: 118, baseType: !300, size: 32, offset: 6144)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !342, file: !54, line: 119, baseType: !300, size: 32, offset: 6176)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !342, file: !54, line: 120, baseType: !300, size: 32, offset: 6208)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !342, file: !54, line: 121, baseType: !151, size: 64, offset: 6272)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !342, file: !54, line: 122, baseType: !184, size: 32, offset: 6336)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !342, file: !54, line: 123, baseType: !184, size: 32, offset: 6368)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !342, file: !54, line: 124, baseType: !184, size: 32, offset: 6400)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !342, file: !54, line: 124, baseType: !184, size: 32, offset: 6432)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !342, file: !54, line: 125, baseType: !828, size: 64, offset: 6464)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !342, file: !54, line: 126, baseType: !300, size: 32, offset: 6528)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !342, file: !54, line: 127, baseType: !211, size: 64, offset: 6592)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !342, file: !54, line: 127, baseType: !211, size: 64, offset: 6656)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !342, file: !54, line: 128, baseType: !211, size: 64, offset: 6720)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !342, file: !54, line: 129, baseType: !834, size: 64, offset: 6784)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!141, !221, !380, !431}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !342, file: !54, line: 130, baseType: !267, size: 64, offset: 6848)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !342, file: !54, line: 131, baseType: !221, size: 64, offset: 6912)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !54, line: 132, baseType: !221, size: 64, offset: 6976)
!840 = !{!841, !842}
!841 = !DILocalVariable(name: "tj", arg: 1, scope: !336, file: !337, line: 88, type: !340)
!842 = !DILocalVariable(name: "ts", arg: 2, scope: !336, file: !337, line: 88, type: !363)
!843 = !DILocation(line: 0, scope: !336)
!844 = !DILocation(line: 90, column: 3, scope: !845)
!845 = distinct !DILexicalBlock(scope: !846, file: !337, line: 90, column: 3)
!846 = distinct !DILexicalBlock(scope: !847, file: !337, line: 90, column: 3)
!847 = distinct !DILexicalBlock(scope: !336, file: !337, line: 90, column: 3)
!848 = !{!849, !849, i64 0}
!849 = !{!"any pointer", !850, i64 0}
!850 = !{!"omnipotent char", !851, i64 0}
!851 = !{!"Simple C/C++ TBAA"}
!852 = !DILocation(line: 90, column: 3, scope: !846)
!853 = !DILocation(line: 91, column: 12, scope: !336)
!854 = !DILocation(line: 91, column: 19, scope: !336)
!855 = !{!856, !849, i64 24}
!856 = !{!"_TSTrajectoryOps", !849, i64 0, !849, i64 8, !849, i64 16, !849, i64 24, !849, i64 32, !849, i64 40, !849, i64 48}
!857 = !DILocation(line: 92, column: 7, scope: !336)
!858 = !DILocation(line: 92, column: 19, scope: !336)
!859 = !{!860, !862, i64 792}
!860 = !{!"_p_TSTrajectory", !861, i64 0, !850, i64 560, !849, i64 616, !865, i64 624, !849, i64 752, !849, i64 760, !850, i64 768, !850, i64 772, !850, i64 776, !849, i64 784, !862, i64 792, !862, i64 796, !862, i64 800, !862, i64 804, !849, i64 808, !850, i64 816, !849, i64 824, !849, i64 832, !849, i64 840, !849, i64 848, !849, i64 856, !849, i64 864, !849, i64 872}
!861 = !{!"_p_PetscObject", !862, i64 0, !850, i64 8, !849, i64 64, !862, i64 72, !863, i64 80, !863, i64 88, !863, i64 96, !863, i64 104, !864, i64 112, !862, i64 120, !862, i64 124, !849, i64 128, !849, i64 136, !849, i64 144, !849, i64 152, !849, i64 160, !849, i64 168, !849, i64 176, !864, i64 184, !849, i64 192, !849, i64 200, !862, i64 208, !849, i64 216, !864, i64 224, !862, i64 232, !862, i64 236, !849, i64 240, !849, i64 248, !849, i64 256, !849, i64 264, !862, i64 272, !862, i64 276, !849, i64 280, !849, i64 288, !849, i64 296, !849, i64 304, !862, i64 312, !862, i64 316, !849, i64 320, !849, i64 328, !849, i64 336, !849, i64 344, !849, i64 352, !862, i64 360, !850, i64 368, !850, i64 384, !849, i64 392, !849, i64 400, !862, i64 408, !850, i64 416, !850, i64 456, !850, i64 496, !850, i64 536, !849, i64 544, !850, i64 552}
!862 = !{!"int", !850, i64 0}
!863 = !{!"double", !850, i64 0}
!864 = !{!"long", !850, i64 0}
!865 = !{!"", !862, i64 0, !849, i64 8, !849, i64 16, !849, i64 24, !849, i64 32, !849, i64 40, !849, i64 48, !850, i64 56, !866, i64 64, !866, i64 96}
!866 = !{!"", !864, i64 0, !864, i64 8, !863, i64 16, !862, i64 24}
!867 = !DILocation(line: 93, column: 3, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !337, line: 93, column: 3)
!869 = distinct !DILexicalBlock(scope: !336, file: !337, line: 93, column: 3)
!870 = !DILocation(line: 90, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !337, line: 90, column: 3)
!872 = distinct !DILexicalBlock(scope: !845, file: !337, line: 90, column: 3)
!873 = !{!874, !862, i64 1536}
!874 = !{!"", !850, i64 0, !850, i64 512, !850, i64 1024, !850, i64 1280, !862, i64 1536, !862, i64 1540, !850, i64 1544}
!875 = !DILocation(line: 90, column: 3, scope: !872)
!876 = !DILocation(line: 90, column: 3, scope: !877)
!877 = distinct !DILexicalBlock(scope: !871, file: !337, line: 90, column: 3)
!878 = !{!862, !862, i64 0}
!879 = !DILocation(line: 93, column: 3, scope: !880)
!880 = distinct !DILexicalBlock(scope: !868, file: !337, line: 93, column: 3)
!881 = !{!874, !862, i64 1540}
!882 = !DILocation(line: 93, column: 3, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !337, line: 93, column: 3)
!884 = distinct !DILexicalBlock(scope: !880, file: !337, line: 93, column: 3)
!885 = !DILocation(line: 93, column: 3, scope: !884)
