; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/cdf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/cdf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_VecTagger = type { %struct._p_PetscObject, [1 x %struct._VecTaggerOps], i8*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!48 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 701, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 472, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 786, baseType: !7, size: 32, elements: !65)
!65 = !{!66, !67, !68}
!66 = !DIEnumerator(name: "VECTAGGER_CDF_GATHER", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "VECTAGGER_CDF_ITERATIVE", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "VECTAGGER_CDF_NUM_METHODS", value: 2, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 663, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!77 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 30, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!102 = !{!103, !131, !135, !136, !209, !335, !338, !219, !127, !171, !301, !7, !121, !130, !341, !126, !253, !342, !120}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger_CDF", file: !105, line: 23, baseType: !106)
!105 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/cdf.c", directory: "/home/users/ndemeye/xSDK")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 16, size: 320, elements: !107)
!107 = !{!108, !123, !124, !125, !128, !129}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "smpl", scope: !106, file: !105, line: 17, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger_Simple", file: !110, line: 7, baseType: !111)
!110 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/utils/tagger/impls/simple.h", directory: "/home/users/ndemeye/xSDK")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 5, size: 64, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !111, file: !110, line: 6, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !27, line: 768, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 765, size: 128, elements: !117)
!117 = !{!118, !122}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !116, file: !27, line: 766, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !121)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !116, file: !27, line: 767, baseType: !119, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !106, file: !105, line: 18, baseType: !120, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !106, file: !105, line: 19, baseType: !120, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "maxit", scope: !106, file: !105, line: 20, baseType: !126, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !127)
!127 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "numMoments", scope: !106, file: !105, line: 21, baseType: !126, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !106, file: !105, line: 22, baseType: !130, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerCDFMethod", file: !27, line: 786, baseType: !64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !132, line: 330, baseType: !133)
!132 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !132, line: 330, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !139, line: 73, size: 4480, elements: !140)
!139 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!140 = !{!141, !143, !192, !193, !194, !196, !197, !198, !199, !207, !208, !210, !214, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !231, !232, !233, !235, !236, !238, !240, !241, !242, !243, !244, !246, !248, !249, !250, !251, !252, !254, !256, !257, !258, !268, !270, !271, !275, !276, !325, !330, !332, !333, !334}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !138, file: !139, line: 74, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !127)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !138, file: !139, line: 75, baseType: !144, size: 448, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 448, elements: !190)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !139, line: 53, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 45, size: 448, elements: !147)
!147 = !{!148, !154, !162, !167, !174, !178, !185}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !146, file: !139, line: 46, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !136, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !127)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !146, file: !139, line: 47, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!152, !136, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !159, line: 16, baseType: !160)
!159 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !159, line: 16, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !146, file: !139, line: 48, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!152, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !146, file: !139, line: 49, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!152, !136, !171, !136}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !146, file: !139, line: 50, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!152, !136, !171, !166}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !146, file: !139, line: 51, baseType: !179, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!152, !136, !171, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !146, file: !139, line: 52, baseType: !186, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!152, !136, !171, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!190 = !{!191}
!191 = !DISubrange(count: 1)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !138, file: !139, line: 76, baseType: !131, size: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !139, line: 77, baseType: !126, size: 32, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !138, file: !139, line: 78, baseType: !195, size: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !121)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !138, file: !139, line: 78, baseType: !195, size: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !138, file: !139, line: 78, baseType: !195, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !138, file: !139, line: 78, baseType: !195, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !139, line: 79, baseType: !200, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !203, line: 27, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !205, line: 43, baseType: !206)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!206 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !138, file: !139, line: 80, baseType: !126, size: 32, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !138, file: !139, line: 81, baseType: !209, size: 32, offset: 992)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !127)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !138, file: !139, line: 82, baseType: !211, size: 64, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !138, file: !139, line: 83, baseType: !215, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !138, file: !139, line: 84, baseType: !219, size: 64, offset: 1152)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !138, file: !139, line: 85, baseType: !219, size: 64, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !138, file: !139, line: 86, baseType: !219, size: 64, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !138, file: !139, line: 87, baseType: !219, size: 64, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !138, file: !139, line: 88, baseType: !136, size: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !138, file: !139, line: 89, baseType: !200, size: 64, offset: 1472)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 90, baseType: !219, size: 64, offset: 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !138, file: !139, line: 91, baseType: !219, size: 64, offset: 1600)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !138, file: !139, line: 92, baseType: !126, size: 32, offset: 1664)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !138, file: !139, line: 93, baseType: !135, size: 64, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !138, file: !139, line: 94, baseType: !230, size: 64, offset: 1792)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !201)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !138, file: !139, line: 95, baseType: !126, size: 32, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !138, file: !139, line: 95, baseType: !126, size: 32, offset: 1888)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !138, file: !139, line: 96, baseType: !234, size: 64, offset: 1920)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !138, file: !139, line: 96, baseType: !234, size: 64, offset: 1984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !138, file: !139, line: 97, baseType: !237, size: 64, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !138, file: !139, line: 97, baseType: !239, size: 64, offset: 2112)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !138, file: !139, line: 98, baseType: !126, size: 32, offset: 2176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !138, file: !139, line: 98, baseType: !126, size: 32, offset: 2208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !138, file: !139, line: 99, baseType: !234, size: 64, offset: 2240)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !138, file: !139, line: 99, baseType: !234, size: 64, offset: 2304)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !138, file: !139, line: 100, baseType: !245, size: 64, offset: 2368)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !138, file: !139, line: 100, baseType: !247, size: 64, offset: 2432)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !138, file: !139, line: 101, baseType: !126, size: 32, offset: 2496)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !138, file: !139, line: 101, baseType: !126, size: 32, offset: 2528)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !138, file: !139, line: 102, baseType: !234, size: 64, offset: 2560)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !138, file: !139, line: 102, baseType: !234, size: 64, offset: 2624)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !138, file: !139, line: 103, baseType: !253, size: 64, offset: 2688)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !138, file: !139, line: 103, baseType: !255, size: 64, offset: 2752)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !138, file: !139, line: 104, baseType: !189, size: 64, offset: 2816)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !138, file: !139, line: 105, baseType: !126, size: 32, offset: 2880)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !138, file: !139, line: 106, baseType: !259, size: 128, offset: 2944)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, elements: !266)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !139, line: 64, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 61, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !262, file: !139, line: 62, baseType: !182, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !262, file: !139, line: 63, baseType: !135, size: 64, offset: 64)
!266 = !{!267}
!267 = !DISubrange(count: 2)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !138, file: !139, line: 107, baseType: !269, size: 64, offset: 3072)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !266)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !138, file: !139, line: 108, baseType: !135, size: 64, offset: 3136)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !138, file: !139, line: 109, baseType: !272, size: 64, offset: 3200)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!152, !135}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !138, file: !139, line: 111, baseType: !126, size: 32, offset: 3264)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !138, file: !139, line: 112, baseType: !277, size: 320, offset: 3328)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 320, elements: !323)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!152, !281, !136, !135}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !284)
!284 = !{!285, !286, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !283, file: !12, line: 100, baseType: !126, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !12, line: 101, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !298, !299, !300, !304, !306, !308, !309, !310}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !289, file: !12, line: 84, baseType: !219, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !289, file: !12, line: 85, baseType: !219, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !12, line: 86, baseType: !135, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !289, file: !12, line: 87, baseType: !211, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !289, file: !12, line: 88, baseType: !296, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !289, file: !12, line: 89, baseType: !173, size: 8, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !289, file: !12, line: 90, baseType: !219, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !289, file: !12, line: 91, baseType: !301, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !302, line: 46, baseType: !303)
!302 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!303 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !289, file: !12, line: 92, baseType: !305, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !12, line: 93, baseType: !307, size: 32, offset: 544)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !12, line: 94, baseType: !287, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !289, file: !12, line: 95, baseType: !219, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !289, file: !12, line: 96, baseType: !135, size: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !283, file: !12, line: 102, baseType: !219, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !283, file: !12, line: 102, baseType: !219, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !283, file: !12, line: 103, baseType: !219, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !283, file: !12, line: 104, baseType: !131, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 416)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !283, file: !12, line: 106, baseType: !136, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !283, file: !12, line: 107, baseType: !320, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!323 = !{!324}
!324 = !DISubrange(count: 5)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !138, file: !139, line: 113, baseType: !326, size: 320, offset: 3648)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 320, elements: !323)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!152, !136, !135}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !138, file: !139, line: 114, baseType: !331, size: 320, offset: 3968)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 320, elements: !323)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !138, file: !139, line: 115, baseType: !305, size: 32, offset: 4288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !138, file: !139, line: 120, baseType: !320, size: 64, offset: 4352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !138, file: !139, line: 121, baseType: !305, size: 32, offset: 4416)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !132, line: 331, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !132, line: 331, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !132, line: 338, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !132, line: 338, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDFStats", file: !105, line: 132, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_CDFStats", file: !105, line: 127, size: 320, elements: !345)
!345 = !{!346, !347, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !344, file: !105, line: 129, baseType: !120, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !344, file: !105, line: 130, baseType: !120, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "moment", scope: !344, file: !105, line: 131, baseType: !349, size: 192, offset: 128)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 3)
!352 = !{!0}
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 128, elements: !266)
!354 = !{i32 7, !"Dwarf Version", i32 4}
!355 = !{i32 2, !"Debug Info Version", i32 3}
!356 = !{i32 1, !"wchar_size", i32 4}
!357 = !{i32 7, !"PIC Level", i32 2}
!358 = !{i32 7, !"uwtable", i32 1}
!359 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!360 = distinct !DISubprogram(name: "VecTaggerCDFSetMethod", scope: !105, file: !105, line: 451, type: !361, scopeLine: 452, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !701)
!361 = !DISubroutineType(types: !362)
!362 = !{!152, !363, !130}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !27, line: 721, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !366, line: 339, size: 5120, elements: !367)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!367 = !{!368, !370, !697, !698, !699, !700}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !365, file: !366, line: 340, baseType: !369, size: 4480)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !139, line: 122, baseType: !138)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !365, file: !366, line: 340, baseType: !371, size: 448, offset: 4480)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 448, elements: !190)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !366, line: 330, size: 448, elements: !373)
!373 = !{!374, !378, !379, !383, !384, !388, !693}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !372, file: !366, line: 331, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!152, !363}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !372, file: !366, line: 332, baseType: !375, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !372, file: !366, line: 333, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!152, !281, !363}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !372, file: !366, line: 334, baseType: !375, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !372, file: !366, line: 335, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!152, !363, !158}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !372, file: !366, line: 336, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!152, !363, !392, !237, !692}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !366, line: 142, size: 12800, elements: !395)
!395 = !{!396, !397, !617, !638, !639, !640, !686, !687, !688, !689, !691}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !394, file: !366, line: 143, baseType: !369, size: 4480)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !394, file: !366, line: 143, baseType: !398, size: 5248, offset: 4480)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 5248, elements: !190)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !366, line: 23, size: 5248, elements: !400)
!400 = !{!401, !406, !411, !415, !419, !425, !430, !431, !432, !436, !440, !441, !442, !446, !450, !456, !457, !461, !465, !469, !470, !477, !481, !482, !486, !490, !491, !492, !496, !497, !504, !509, !510, !511, !515, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !536, !537, !538, !542, !546, !547, !548, !549, !553, !554, !555, !556, !557, !558, !559, !563, !564, !568, !575, !576, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !597, !598, !599, !605, !609, !610, !611}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !399, file: !366, line: 24, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!152, !392, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !399, file: !366, line: 25, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!152, !392, !126, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !399, file: !366, line: 26, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!152, !126, !405}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !399, file: !366, line: 27, baseType: !416, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!152, !392, !392, !253}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !399, file: !366, line: 28, baseType: !420, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!152, !392, !126, !423, !253}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !399, file: !366, line: 29, baseType: !426, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!152, !392, !429, !245}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !399, file: !366, line: 30, baseType: !416, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !399, file: !366, line: 31, baseType: !420, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !399, file: !366, line: 32, baseType: !433, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!152, !392, !119}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !399, file: !366, line: 33, baseType: !437, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!152, !392, !392}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !399, file: !366, line: 34, baseType: !433, size: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !399, file: !366, line: 35, baseType: !437, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !399, file: !366, line: 36, baseType: !443, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!152, !392, !119, !392}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !399, file: !366, line: 37, baseType: !447, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!152, !392, !119, !119, !392}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !399, file: !366, line: 38, baseType: !451, size: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!152, !392, !126, !454, !405}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !399, file: !366, line: 39, baseType: !443, size: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !399, file: !366, line: 40, baseType: !458, size: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!152, !392, !119, !392, !392}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !399, file: !366, line: 41, baseType: !462, size: 64, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!152, !392, !119, !119, !119, !392, !392}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !399, file: !366, line: 42, baseType: !466, size: 64, offset: 1152)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!152, !392, !392, !392}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !399, file: !366, line: 43, baseType: !466, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !399, file: !366, line: 44, baseType: !471, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!152, !392, !126, !474, !454, !476}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !399, file: !366, line: 45, baseType: !478, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!152, !392}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !399, file: !366, line: 46, baseType: !478, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !399, file: !366, line: 47, baseType: !483, size: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!152, !392, !255}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !399, file: !366, line: 48, baseType: !487, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!152, !392, !237}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !399, file: !366, line: 49, baseType: !487, size: 64, offset: 1600)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !399, file: !366, line: 50, baseType: !483, size: 64, offset: 1664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !399, file: !366, line: 51, baseType: !493, size: 64, offset: 1728)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!152, !392, !237, !245}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !399, file: !366, line: 52, baseType: !493, size: 64, offset: 1792)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !399, file: !366, line: 53, baseType: !498, size: 64, offset: 1856)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!152, !392, !501}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !399, file: !366, line: 54, baseType: !505, size: 64, offset: 1920)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!152, !392, !508, !305}
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !399, file: !366, line: 55, baseType: !471, size: 64, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !399, file: !366, line: 56, baseType: !478, size: 64, offset: 2048)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !399, file: !366, line: 57, baseType: !512, size: 64, offset: 2112)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!152, !392, !158}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !399, file: !366, line: 58, baseType: !516, size: 64, offset: 2176)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!152, !392, !454}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !399, file: !366, line: 59, baseType: !516, size: 64, offset: 2240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !399, file: !366, line: 60, baseType: !416, size: 64, offset: 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !399, file: !366, line: 61, baseType: !416, size: 64, offset: 2368)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !399, file: !366, line: 62, baseType: !426, size: 64, offset: 2432)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !399, file: !366, line: 63, baseType: !420, size: 64, offset: 2496)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !399, file: !366, line: 64, baseType: !420, size: 64, offset: 2560)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !399, file: !366, line: 65, baseType: !512, size: 64, offset: 2624)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !399, file: !366, line: 66, baseType: !478, size: 64, offset: 2688)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !399, file: !366, line: 67, baseType: !478, size: 64, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !399, file: !366, line: 68, baseType: !529, size: 64, offset: 2816)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!152, !392, !532}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !533, line: 30, baseType: !534)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !533, line: 30, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !399, file: !366, line: 69, baseType: !471, size: 64, offset: 2880)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !399, file: !366, line: 70, baseType: !478, size: 64, offset: 2944)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !399, file: !366, line: 71, baseType: !539, size: 64, offset: 3008)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!152, !281, !392}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !399, file: !366, line: 72, baseType: !543, size: 64, offset: 3072)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!152, !392, !392, !245}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !399, file: !366, line: 73, baseType: !466, size: 64, offset: 3136)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !399, file: !366, line: 74, baseType: !466, size: 64, offset: 3200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !399, file: !366, line: 75, baseType: !466, size: 64, offset: 3264)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !399, file: !366, line: 76, baseType: !550, size: 64, offset: 3328)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!152, !392, !126, !474, !253}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !399, file: !366, line: 77, baseType: !478, size: 64, offset: 3392)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !399, file: !366, line: 78, baseType: !478, size: 64, offset: 3456)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !399, file: !366, line: 79, baseType: !478, size: 64, offset: 3520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !399, file: !366, line: 80, baseType: !478, size: 64, offset: 3584)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !399, file: !366, line: 81, baseType: !433, size: 64, offset: 3648)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !399, file: !366, line: 82, baseType: !478, size: 64, offset: 3712)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !399, file: !366, line: 83, baseType: !560, size: 64, offset: 3776)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!152, !392, !126, !392, !476}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !399, file: !366, line: 84, baseType: !560, size: 64, offset: 3840)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !399, file: !366, line: 85, baseType: !565, size: 64, offset: 3904)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!152, !392, !392, !253, !253}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !399, file: !366, line: 86, baseType: !569, size: 64, offset: 3968)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!152, !392, !572, !405}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !533, line: 11, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !533, line: 11, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !399, file: !366, line: 87, baseType: !569, size: 64, offset: 4032)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !399, file: !366, line: 88, baseType: !577, size: 64, offset: 4096)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!152, !392, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !399, file: !366, line: 89, baseType: !577, size: 64, offset: 4160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !399, file: !366, line: 90, baseType: !583, size: 64, offset: 4224)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!152, !392, !126, !474, !474, !392, !476}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !399, file: !366, line: 91, baseType: !583, size: 64, offset: 4288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !399, file: !366, line: 92, baseType: !512, size: 64, offset: 4352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !399, file: !366, line: 93, baseType: !512, size: 64, offset: 4416)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !399, file: !366, line: 94, baseType: !437, size: 64, offset: 4480)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !399, file: !366, line: 95, baseType: !437, size: 64, offset: 4544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !399, file: !366, line: 96, baseType: !437, size: 64, offset: 4608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !399, file: !366, line: 97, baseType: !437, size: 64, offset: 4672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !399, file: !366, line: 98, baseType: !594, size: 64, offset: 4736)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!152, !392, !305}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !399, file: !366, line: 99, baseType: !483, size: 64, offset: 4800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !399, file: !366, line: 100, baseType: !483, size: 64, offset: 4864)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !399, file: !366, line: 101, baseType: !600, size: 64, offset: 4928)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!152, !392, !255, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !399, file: !366, line: 102, baseType: !606, size: 64, offset: 4992)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!152, !392, !580, !603}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !399, file: !366, line: 103, baseType: !483, size: 64, offset: 5056)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !399, file: !366, line: 104, baseType: !577, size: 64, offset: 5120)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !399, file: !366, line: 105, baseType: !612, size: 64, offset: 5184)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!152, !126, !423, !405, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !394, file: !366, line: 144, baseType: !618, size: 64, offset: 9728)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !533, line: 60, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !621, line: 240, size: 640, elements: !622)
!621 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !620, file: !621, line: 241, baseType: !131, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !620, file: !621, line: 242, baseType: !209, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !620, file: !621, line: 243, baseType: !126, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !620, file: !621, line: 243, baseType: !126, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !620, file: !621, line: 244, baseType: !126, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !620, file: !621, line: 244, baseType: !126, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !620, file: !621, line: 245, baseType: !237, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !620, file: !621, line: 246, baseType: !305, size: 32, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !620, file: !621, line: 247, baseType: !126, size: 32, offset: 352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !620, file: !621, line: 251, baseType: !126, size: 32, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !620, file: !621, line: 252, baseType: !532, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !620, file: !621, line: 253, baseType: !305, size: 32, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !620, file: !621, line: 254, baseType: !126, size: 32, offset: 544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !620, file: !621, line: 254, baseType: !126, size: 32, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !620, file: !621, line: 255, baseType: !126, size: 32, offset: 608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !394, file: !366, line: 145, baseType: !135, size: 64, offset: 9792)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !394, file: !366, line: 146, baseType: !305, size: 32, offset: 9856)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !394, file: !366, line: 147, baseType: !641, size: 1344, offset: 9920)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !366, line: 140, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 114, size: 1344, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !662, !663, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !642, file: !366, line: 115, baseType: !126, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !642, file: !366, line: 116, baseType: !126, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !642, file: !366, line: 117, baseType: !126, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !642, file: !366, line: 118, baseType: !126, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !642, file: !366, line: 119, baseType: !126, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !642, file: !366, line: 120, baseType: !126, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !642, file: !366, line: 121, baseType: !237, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !642, file: !366, line: 122, baseType: !253, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !642, file: !366, line: 124, baseType: !131, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !642, file: !366, line: 125, baseType: !209, size: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !642, file: !366, line: 125, baseType: !209, size: 32, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !642, file: !366, line: 126, baseType: !209, size: 32, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !642, file: !366, line: 126, baseType: !209, size: 32, offset: 480)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !642, file: !366, line: 127, baseType: !658, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !132, line: 339, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !132, line: 339, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !642, file: !366, line: 128, baseType: !658, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !642, file: !366, line: 129, baseType: !664, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !132, line: 341, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !132, line: 351, size: 192, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !666, file: !132, line: 354, baseType: !127, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !666, file: !132, line: 355, baseType: !127, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !666, file: !132, line: 356, baseType: !127, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !666, file: !132, line: 361, baseType: !127, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !666, file: !132, line: 362, baseType: !301, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !642, file: !366, line: 130, baseType: !126, size: 32, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !642, file: !366, line: 130, baseType: !126, size: 32, offset: 736)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !642, file: !366, line: 131, baseType: !253, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !642, file: !366, line: 131, baseType: !253, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !642, file: !366, line: 132, baseType: !237, size: 64, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !642, file: !366, line: 132, baseType: !237, size: 64, offset: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !642, file: !366, line: 133, baseType: !126, size: 32, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !642, file: !366, line: 134, baseType: !237, size: 64, offset: 1088)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !642, file: !366, line: 135, baseType: !126, size: 32, offset: 1152)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !642, file: !366, line: 136, baseType: !305, size: 32, offset: 1184)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !642, file: !366, line: 137, baseType: !305, size: 32, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !642, file: !366, line: 138, baseType: !476, size: 32, offset: 1248)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !642, file: !366, line: 139, baseType: !237, size: 64, offset: 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !394, file: !366, line: 147, baseType: !641, size: 1344, offset: 11264)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !394, file: !366, line: 148, baseType: !305, size: 32, offset: 12608)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !394, file: !366, line: 149, baseType: !126, size: 32, offset: 12640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !394, file: !366, line: 150, baseType: !690, size: 32, offset: 12672)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !394, file: !366, line: 157, baseType: !219, size: 64, offset: 12736)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !372, file: !366, line: 337, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!152, !363, !392, !616}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !366, line: 341, baseType: !135, size: 64, offset: 4928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !365, file: !366, line: 342, baseType: !126, size: 32, offset: 4992)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !365, file: !366, line: 343, baseType: !305, size: 32, offset: 5024)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !365, file: !366, line: 344, baseType: !305, size: 32, offset: 5056)
!701 = !{!702, !703, !704, !705, !707, !708, !709, !710, !712, !716, !717, !719, !725, !726, !728, !731, !732, !734, !737}
!702 = !DILocalVariable(name: "tagger", arg: 1, scope: !360, file: !105, line: 451, type: !363)
!703 = !DILocalVariable(name: "method", arg: 2, scope: !360, file: !105, line: 451, type: !130)
!704 = !DILocalVariable(name: "cuml", scope: !360, file: !105, line: 453, type: !103)
!705 = !DILocalVariable(name: "_7_ierr", scope: !706, file: !105, line: 457, type: !152)
!706 = distinct !DILexicalBlock(scope: !360, file: !105, line: 457, column: 3)
!707 = !DILocalVariable(name: "b0", scope: !706, file: !105, line: 457, type: !126)
!708 = !DILocalVariable(name: "b1", scope: !706, file: !105, line: 457, type: !269)
!709 = !DILocalVariable(name: "b2", scope: !706, file: !105, line: 457, type: !269)
!710 = !DILocalVariable(name: "_4_ierr", scope: !711, file: !105, line: 457, type: !152)
!711 = distinct !DILexicalBlock(scope: !706, file: !105, line: 457, column: 3)
!712 = !DILocalVariable(name: "a_b1", scope: !711, file: !105, line: 457, type: !713)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 192, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 6)
!716 = !DILocalVariable(name: "a_b2", scope: !711, file: !105, line: 457, type: !713)
!717 = !DILocalVariable(name: "_7_errorcode", scope: !718, file: !105, line: 457, type: !152)
!718 = distinct !DILexicalBlock(scope: !711, file: !105, line: 457, column: 3)
!719 = !DILocalVariable(name: "_7_errorstring", scope: !720, file: !105, line: 457, type: !722)
!720 = distinct !DILexicalBlock(scope: !721, file: !105, line: 457, column: 3)
!721 = distinct !DILexicalBlock(scope: !718, file: !105, line: 457, column: 3)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 2048, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 256)
!725 = !DILocalVariable(name: "_7_resultlen", scope: !720, file: !105, line: 457, type: !209)
!726 = !DILocalVariable(name: "_7_errorcode", scope: !727, file: !105, line: 457, type: !152)
!727 = distinct !DILexicalBlock(scope: !711, file: !105, line: 457, column: 3)
!728 = !DILocalVariable(name: "_7_errorstring", scope: !729, file: !105, line: 457, type: !722)
!729 = distinct !DILexicalBlock(scope: !730, file: !105, line: 457, column: 3)
!730 = distinct !DILexicalBlock(scope: !727, file: !105, line: 457, column: 3)
!731 = !DILocalVariable(name: "_7_resultlen", scope: !729, file: !105, line: 457, type: !209)
!732 = !DILocalVariable(name: "_7_errorcode", scope: !733, file: !105, line: 457, type: !152)
!733 = distinct !DILexicalBlock(scope: !706, file: !105, line: 457, column: 3)
!734 = !DILocalVariable(name: "_7_errorstring", scope: !735, file: !105, line: 457, type: !722)
!735 = distinct !DILexicalBlock(scope: !736, file: !105, line: 457, column: 3)
!736 = distinct !DILexicalBlock(scope: !733, file: !105, line: 457, column: 3)
!737 = !DILocalVariable(name: "_7_resultlen", scope: !735, file: !105, line: 457, type: !209)
!738 = !DILocation(line: 0, scope: !360)
!739 = !DILocation(line: 453, column: 52, scope: !360)
!740 = !{!741, !746, i64 616}
!741 = !{!"_p_VecTagger", !742, i64 0, !744, i64 560, !746, i64 616, !743, i64 624, !744, i64 628, !744, i64 632}
