; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfbasic.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfbasic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70}
!62 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 424, baseType: !5, size: 32, elements: !73)
!72 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!73 = !{!74, !75}
!74 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 238, baseType: !5, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 24, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91}
!90 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!97 = !{!98, !187, !153, !256, !105, !184, !156, !393, !457, !232, !647, !208, !396, !104}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Basic", file: !100, line: 41, baseType: !101)
!100 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 26, size: 1152, elements: !102)
!102 = !{!103, !106, !107, !109, !111, !113, !114, !118, !120, !123, !124, !139, !140, !141, !142, !646}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !101, file: !100, line: 27, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !105)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !101, file: !100, line: 27, baseType: !104, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !101, file: !100, line: 27, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !101, file: !100, line: 27, baseType: !110, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !105)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !101, file: !100, line: 27, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !101, file: !100, line: 27, baseType: !112, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !101, file: !100, line: 27, baseType: !115, size: 128, offset: 320)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 2)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !101, file: !100, line: 27, baseType: !119, size: 64, offset: 448)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !116)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !101, file: !100, line: 27, baseType: !121, size: 64, offset: 512)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !116)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !101, file: !100, line: 27, baseType: !119, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !101, file: !100, line: 27, baseType: !125, size: 128, offset: 640)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !116)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !88, line: 41, size: 576, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !128, file: !88, line: 42, baseType: !112, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !128, file: !88, line: 43, baseType: !110, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !128, file: !88, line: 44, baseType: !112, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !128, file: !88, line: 45, baseType: !112, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !128, file: !88, line: 46, baseType: !112, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !128, file: !88, line: 46, baseType: !112, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !128, file: !88, line: 46, baseType: !112, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !128, file: !88, line: 47, baseType: !112, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !128, file: !88, line: 47, baseType: !112, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !101, file: !100, line: 27, baseType: !125, size: 128, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !101, file: !100, line: 27, baseType: !121, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !101, file: !100, line: 27, baseType: !110, size: 32, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !101, file: !100, line: 27, baseType: !143, size: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !100, line: 6, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !88, line: 52, size: 6592, elements: !146)
!146 = !{!147, !159, !548, !549, !550, !551, !555, !556, !560, !561, !562, !566, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !626, !627, !629, !630, !631, !632, !639, !640, !642, !643, !644, !645}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !145, file: !88, line: 53, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !143, !152, !153, !152, !154, !156}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !105)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 46, baseType: !158)
!157 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!158 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !145, file: !88, line: 54, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!151, !163, !143, !547}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !164, line: 15, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !167)
!167 = !{!168, !366, !462, !477, !478, !479, !480, !481, !482, !483, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !508, !509, !510, !511, !512, !514, !515, !540, !541, !542, !543, !544, !546}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !166, file: !44, line: 67, baseType: !169, size: 4480)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !170, line: 122, baseType: !171)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !170, line: 73, size: 4480, elements: !172)
!172 = !{!173, !175, !229, !230, !231, !234, !235, !236, !237, !245, !246, !247, !251, !255, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !268, !269, !270, !272, !273, !274, !276, !277, !278, !279, !280, !283, !285, !286, !287, !288, !289, !292, !294, !295, !296, !304, !305, !306, !310, !311, !356, !361, !363, !364, !365}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !171, file: !170, line: 74, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !105)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !171, file: !170, line: 75, baseType: !176, size: 448, offset: 64)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 448, elements: !227)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !170, line: 53, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 45, size: 448, elements: !179)
!179 = !{!180, !191, !199, !204, !211, !215, !222}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !178, file: !170, line: 46, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!151, !184, !186}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !188, line: 330, baseType: !189)
!188 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !188, line: 330, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !178, file: !170, line: 47, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!151, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !196, line: 16, baseType: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !196, line: 16, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !178, file: !170, line: 48, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!151, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !178, file: !170, line: 49, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!151, !184, !208, !184}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !178, file: !170, line: 50, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!151, !184, !208, !203}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !178, file: !170, line: 51, baseType: !216, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!151, !184, !208, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !178, file: !170, line: 52, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!151, !184, !208, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!227 = !{!228}
!228 = !DISubrange(count: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !171, file: !170, line: 76, baseType: !187, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !170, line: 77, baseType: !110, size: 32, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !171, file: !170, line: 78, baseType: !232, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !233)
!233 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !171, file: !170, line: 78, baseType: !232, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !171, file: !170, line: 78, baseType: !232, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !171, file: !170, line: 78, baseType: !232, size: 64, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !170, line: 79, baseType: !238, size: 64, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !241, line: 27, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !243, line: 43, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!244 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !171, file: !170, line: 80, baseType: !110, size: 32, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !171, file: !170, line: 81, baseType: !104, size: 32, offset: 992)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !171, file: !170, line: 82, baseType: !248, size: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !171, file: !170, line: 83, baseType: !252, size: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !171, file: !170, line: 84, baseType: !256, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !171, file: !170, line: 85, baseType: !256, size: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !171, file: !170, line: 86, baseType: !256, size: 64, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !171, file: !170, line: 87, baseType: !256, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !170, line: 88, baseType: !184, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !171, file: !170, line: 89, baseType: !238, size: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !170, line: 90, baseType: !256, size: 64, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !171, file: !170, line: 91, baseType: !256, size: 64, offset: 1600)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !171, file: !170, line: 92, baseType: !110, size: 32, offset: 1664)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !171, file: !170, line: 93, baseType: !153, size: 64, offset: 1728)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !170, line: 94, baseType: !267, size: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !239)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !171, file: !170, line: 95, baseType: !110, size: 32, offset: 1856)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !171, file: !170, line: 95, baseType: !110, size: 32, offset: 1888)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !171, file: !170, line: 96, baseType: !271, size: 64, offset: 1920)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !171, file: !170, line: 96, baseType: !271, size: 64, offset: 1984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !171, file: !170, line: 97, baseType: !112, size: 64, offset: 2048)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !171, file: !170, line: 97, baseType: !275, size: 64, offset: 2112)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !171, file: !170, line: 98, baseType: !110, size: 32, offset: 2176)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !171, file: !170, line: 98, baseType: !110, size: 32, offset: 2208)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !171, file: !170, line: 99, baseType: !271, size: 64, offset: 2240)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !171, file: !170, line: 99, baseType: !271, size: 64, offset: 2304)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !171, file: !170, line: 100, baseType: !281, size: 64, offset: 2368)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !233)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !171, file: !170, line: 100, baseType: !284, size: 64, offset: 2432)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !171, file: !170, line: 101, baseType: !110, size: 32, offset: 2496)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !171, file: !170, line: 101, baseType: !110, size: 32, offset: 2528)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !171, file: !170, line: 102, baseType: !271, size: 64, offset: 2560)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !171, file: !170, line: 102, baseType: !271, size: 64, offset: 2624)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !171, file: !170, line: 103, baseType: !290, size: 64, offset: 2688)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !282)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !171, file: !170, line: 103, baseType: !293, size: 64, offset: 2752)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !171, file: !170, line: 104, baseType: !226, size: 64, offset: 2816)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !171, file: !170, line: 105, baseType: !110, size: 32, offset: 2880)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !171, file: !170, line: 106, baseType: !297, size: 128, offset: 2944)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 128, elements: !116)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !170, line: 64, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 61, size: 128, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !300, file: !170, line: 62, baseType: !219, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !300, file: !170, line: 63, baseType: !153, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !171, file: !170, line: 107, baseType: !119, size: 64, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !171, file: !170, line: 108, baseType: !153, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !171, file: !170, line: 109, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!151, !153}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !171, file: !170, line: 111, baseType: !110, size: 32, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !171, file: !170, line: 112, baseType: !312, size: 320, offset: 3328)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !354)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!151, !316, !184, !153}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !319)
!319 = !{!320, !321, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !10, line: 100, baseType: !110, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !10, line: 101, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !333, !334, !335, !336, !337, !339, !340, !341}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !324, file: !10, line: 84, baseType: !256, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !324, file: !10, line: 85, baseType: !256, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !10, line: 86, baseType: !153, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !324, file: !10, line: 87, baseType: !248, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !10, line: 88, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !324, file: !10, line: 89, baseType: !210, size: 8, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !324, file: !10, line: 90, baseType: !256, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !324, file: !10, line: 91, baseType: !156, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !10, line: 92, baseType: !122, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !10, line: 93, baseType: !338, size: 32, offset: 544)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !10, line: 94, baseType: !322, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !324, file: !10, line: 95, baseType: !256, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !324, file: !10, line: 96, baseType: !153, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !10, line: 102, baseType: !256, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !318, file: !10, line: 102, baseType: !256, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !318, file: !10, line: 103, baseType: !256, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !10, line: 104, baseType: !187, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !318, file: !10, line: 105, baseType: !122, size: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !318, file: !10, line: 105, baseType: !122, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !318, file: !10, line: 105, baseType: !122, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !318, file: !10, line: 106, baseType: !184, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !10, line: 107, baseType: !351, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!354 = !{!355}
!355 = !DISubrange(count: 5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !171, file: !170, line: 113, baseType: !357, size: 320, offset: 3648)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !354)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!151, !184, !153}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !171, file: !170, line: 114, baseType: !362, size: 320, offset: 3968)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, elements: !354)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !171, file: !170, line: 115, baseType: !122, size: 32, offset: 4288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !171, file: !170, line: 120, baseType: !351, size: 64, offset: 4352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !171, file: !170, line: 121, baseType: !122, size: 32, offset: 4416)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !44, line: 67, baseType: !367, size: 1344, offset: 4480)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 1344, elements: !227)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !369)
!369 = !{!370, !374, !375, !376, !380, !384, !389, !399, !403, !404, !405, !409, !413, !417, !427, !431, !436, !448, !452, !453, !458}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !368, file: !44, line: 40, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!151, !163}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !368, file: !44, line: 41, baseType: !371, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !368, file: !44, line: 42, baseType: !371, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !368, file: !44, line: 43, baseType: !377, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!151, !316, !163}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !368, file: !44, line: 44, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!151, !163, !195}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !368, file: !44, line: 45, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!151, !163, !388, !163}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !368, file: !44, line: 46, baseType: !390, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!151, !163, !393, !152, !154, !152, !153, !396}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !188, line: 331, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !188, line: 331, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !188, line: 338, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !188, line: 338, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !368, file: !44, line: 47, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!151, !163, !393, !154, !153, !396}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !368, file: !44, line: 48, baseType: !390, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !368, file: !44, line: 49, baseType: !400, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !368, file: !44, line: 50, baseType: !406, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!151, !163, !393, !152, !153, !152, !154, !153, !396}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !368, file: !44, line: 51, baseType: !410, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!151, !163, !393, !153, !154, !153, !396}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !368, file: !44, line: 52, baseType: !414, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!151, !163, !393, !152, !154, !152, !153}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !368, file: !44, line: 53, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!151, !163, !112, !421, !424, !424, !424}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !368, file: !44, line: 54, baseType: !428, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!151, !163, !112, !421, !424, !424}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !368, file: !44, line: 55, baseType: !432, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!151, !163, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !368, file: !44, line: 56, baseType: !437, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!151, !163, !112, !112, !424, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !164, line: 49, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 46, size: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !444, file: !164, line: 47, baseType: !110, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !444, file: !164, line: 48, baseType: !110, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !368, file: !44, line: 57, baseType: !449, size: 64, offset: 1088)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!151, !163, !110, !425, !435}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !368, file: !44, line: 58, baseType: !449, size: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !368, file: !44, line: 60, baseType: !454, size: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!151, !152, !156, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !368, file: !44, line: 61, baseType: !459, size: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!151, !152, !153}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !166, file: !44, line: 78, baseType: !463, size: 512, offset: 5824)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !44, line: 68, size: 512, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !472, !473, !474, !475, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !463, file: !44, line: 69, baseType: !110, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !463, file: !44, line: 69, baseType: !110, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !463, file: !44, line: 70, baseType: !122, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !463, file: !44, line: 71, baseType: !122, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !463, file: !44, line: 72, baseType: !470, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !463, file: !44, line: 73, baseType: !290, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !463, file: !44, line: 74, baseType: !163, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !463, file: !44, line: 75, baseType: !110, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !463, file: !44, line: 76, baseType: !393, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !463, file: !44, line: 77, baseType: !122, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !166, file: !44, line: 81, baseType: !110, size: 32, offset: 6336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !166, file: !44, line: 82, baseType: !110, size: 32, offset: 6368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !166, file: !44, line: 83, baseType: !112, size: 64, offset: 6400)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !166, file: !44, line: 84, baseType: !112, size: 64, offset: 6464)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !166, file: !44, line: 85, baseType: !110, size: 32, offset: 6528)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !166, file: !44, line: 85, baseType: !110, size: 32, offset: 6560)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !166, file: !44, line: 86, baseType: !484, size: 64, offset: 6592)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !166, file: !44, line: 87, baseType: !484, size: 64, offset: 6656)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !166, file: !44, line: 88, baseType: !110, size: 32, offset: 6720)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !166, file: !44, line: 89, baseType: !110, size: 32, offset: 6752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !166, file: !44, line: 90, baseType: !108, size: 64, offset: 6784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !166, file: !44, line: 91, baseType: !112, size: 64, offset: 6848)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !166, file: !44, line: 92, baseType: !112, size: 64, offset: 6912)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !166, file: !44, line: 93, baseType: !115, size: 128, offset: 6976)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !166, file: !44, line: 96, baseType: !119, size: 64, offset: 7104)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !166, file: !44, line: 97, baseType: !121, size: 64, offset: 7168)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !166, file: !44, line: 98, baseType: !119, size: 64, offset: 7232)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !166, file: !44, line: 99, baseType: !125, size: 128, offset: 7296)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !166, file: !44, line: 100, baseType: !125, size: 128, offset: 7424)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !166, file: !44, line: 101, baseType: !121, size: 64, offset: 7552)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !166, file: !44, line: 103, baseType: !110, size: 32, offset: 7616)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !166, file: !44, line: 104, baseType: !112, size: 64, offset: 7680)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !166, file: !44, line: 105, baseType: !122, size: 32, offset: 7744)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !166, file: !44, line: 106, baseType: !112, size: 64, offset: 7808)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !166, file: !44, line: 107, baseType: !112, size: 64, offset: 7872)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !166, file: !44, line: 108, baseType: !122, size: 32, offset: 7936)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !166, file: !44, line: 109, baseType: !505, size: 64, offset: 8000)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !188, line: 336, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !188, line: 336, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !166, file: !44, line: 110, baseType: !505, size: 64, offset: 8064)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !166, file: !44, line: 111, baseType: !163, size: 64, offset: 8128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !166, file: !44, line: 112, baseType: !122, size: 32, offset: 8192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !166, file: !44, line: 113, baseType: !122, size: 32, offset: 8224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !166, file: !44, line: 114, baseType: !513, size: 32, offset: 8256)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !166, file: !44, line: 115, baseType: !122, size: 32, offset: 8288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !166, file: !44, line: 116, baseType: !516, size: 64, offset: 8320)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !517, line: 60, baseType: !518)
!517 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !520, line: 240, size: 640, elements: !521)
!520 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !536, !537, !538, !539}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !519, file: !520, line: 241, baseType: !187, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !520, line: 242, baseType: !104, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !519, file: !520, line: 243, baseType: !110, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !519, file: !520, line: 243, baseType: !110, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !519, file: !520, line: 244, baseType: !110, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !519, file: !520, line: 244, baseType: !110, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !519, file: !520, line: 245, baseType: !112, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !519, file: !520, line: 246, baseType: !122, size: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !519, file: !520, line: 247, baseType: !110, size: 32, offset: 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !519, file: !520, line: 251, baseType: !110, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !519, file: !520, line: 252, baseType: !533, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !517, line: 30, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !517, line: 30, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !519, file: !520, line: 253, baseType: !122, size: 32, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !519, file: !520, line: 254, baseType: !110, size: 32, offset: 544)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !519, file: !520, line: 254, baseType: !110, size: 32, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !519, file: !520, line: 255, baseType: !110, size: 32, offset: 608)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !166, file: !44, line: 117, baseType: !122, size: 32, offset: 8384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !166, file: !44, line: 118, baseType: !122, size: 32, offset: 8416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !166, file: !44, line: 119, baseType: !122, size: 32, offset: 8448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !166, file: !44, line: 120, baseType: !110, size: 32, offset: 8480)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !166, file: !44, line: 121, baseType: !545, size: 32, offset: 8512)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !44, line: 122, baseType: !153, size: 64, offset: 8576)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !50)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !145, file: !88, line: 55, baseType: !160, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !145, file: !88, line: 56, baseType: !160, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !145, file: !88, line: 57, baseType: !160, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !145, file: !88, line: 58, baseType: !552, size: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!151, !143}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !145, file: !88, line: 59, baseType: !552, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !145, file: !88, line: 60, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!151, !163, !143}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !145, file: !88, line: 62, baseType: !160, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !145, file: !88, line: 63, baseType: !160, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !145, file: !88, line: 65, baseType: !563, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!151, !143, !110, !110, !126, !425, !154, !153}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !145, file: !88, line: 66, baseType: !567, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!151, !143, !110, !110, !126, !425, !153, !154}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !145, file: !88, line: 67, baseType: !567, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !145, file: !88, line: 68, baseType: !567, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !145, file: !88, line: 69, baseType: !567, size: 64, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !145, file: !88, line: 70, baseType: !567, size: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !145, file: !88, line: 71, baseType: !567, size: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !145, file: !88, line: 72, baseType: !567, size: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !145, file: !88, line: 73, baseType: !567, size: 64, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !145, file: !88, line: 74, baseType: !567, size: 64, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !145, file: !88, line: 75, baseType: !567, size: 64, offset: 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !145, file: !88, line: 76, baseType: !567, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !145, file: !88, line: 77, baseType: !567, size: 64, offset: 1408)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !145, file: !88, line: 78, baseType: !567, size: 64, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !145, file: !88, line: 79, baseType: !583, size: 64, offset: 1536)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!151, !143, !110, !110, !126, !425, !153, !153}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !145, file: !88, line: 81, baseType: !587, size: 64, offset: 1600)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!151, !143, !110, !110, !126, !425, !154, !110, !126, !425, !153}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !145, file: !88, line: 82, baseType: !587, size: 64, offset: 1664)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !145, file: !88, line: 83, baseType: !587, size: 64, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !145, file: !88, line: 84, baseType: !587, size: 64, offset: 1792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !145, file: !88, line: 85, baseType: !587, size: 64, offset: 1856)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !145, file: !88, line: 86, baseType: !587, size: 64, offset: 1920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !145, file: !88, line: 87, baseType: !587, size: 64, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !145, file: !88, line: 88, baseType: !587, size: 64, offset: 2048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !145, file: !88, line: 89, baseType: !587, size: 64, offset: 2112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !145, file: !88, line: 90, baseType: !587, size: 64, offset: 2176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !145, file: !88, line: 91, baseType: !587, size: 64, offset: 2240)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !145, file: !88, line: 92, baseType: !587, size: 64, offset: 2304)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !145, file: !88, line: 93, baseType: !587, size: 64, offset: 2368)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !145, file: !88, line: 95, baseType: !603, size: 64, offset: 2432)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!151, !143, !110, !110, !126, !425, !153, !110, !126, !425, !154, !153}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !145, file: !88, line: 97, baseType: !122, size: 32, offset: 2496)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !145, file: !88, line: 168, baseType: !104, size: 32, offset: 2528)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !145, file: !88, line: 169, baseType: !393, size: 64, offset: 2560)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !145, file: !88, line: 170, baseType: !393, size: 64, offset: 2624)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !145, file: !88, line: 171, baseType: !122, size: 32, offset: 2688)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !145, file: !88, line: 172, baseType: !156, size: 64, offset: 2752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !145, file: !88, line: 173, baseType: !110, size: 32, offset: 2816)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !145, file: !88, line: 174, baseType: !154, size: 64, offset: 2880)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !145, file: !88, line: 174, baseType: !154, size: 64, offset: 2944)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !145, file: !88, line: 175, baseType: !152, size: 32, offset: 3008)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !145, file: !88, line: 175, baseType: !152, size: 32, offset: 3040)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !145, file: !88, line: 178, baseType: !152, size: 32, offset: 3072)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !145, file: !88, line: 178, baseType: !152, size: 32, offset: 3104)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !145, file: !88, line: 179, baseType: !121, size: 64, offset: 3136)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !145, file: !88, line: 179, baseType: !121, size: 64, offset: 3200)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !145, file: !88, line: 180, baseType: !110, size: 32, offset: 3264)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !145, file: !88, line: 180, baseType: !110, size: 32, offset: 3296)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !145, file: !88, line: 181, baseType: !624, size: 256, offset: 3328)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 256, elements: !625)
!625 = !{!117, !117}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !145, file: !88, line: 182, baseType: !624, size: 256, offset: 3584)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !145, file: !88, line: 183, baseType: !628, size: 256, offset: 3840)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 256, elements: !625)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !145, file: !88, line: 185, baseType: !628, size: 256, offset: 4096)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !145, file: !88, line: 186, baseType: !628, size: 256, offset: 4352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !145, file: !88, line: 187, baseType: !628, size: 256, offset: 4608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !145, file: !88, line: 188, baseType: !633, size: 512, offset: 4864)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 512, elements: !638)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !188, line: 339, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !188, line: 339, flags: DIFlagFwdDecl)
!638 = !{!117, !117, !117}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !145, file: !88, line: 189, baseType: !633, size: 512, offset: 5376)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !145, file: !88, line: 190, baseType: !641, size: 256, offset: 5888)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 256, elements: !638)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !145, file: !88, line: 191, baseType: !641, size: 256, offset: 6144)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !145, file: !88, line: 192, baseType: !634, size: 64, offset: 6400)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !88, line: 193, baseType: !143, size: 64, offset: 6464)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !145, file: !88, line: 195, baseType: !122, size: 32, offset: 6528)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !101, file: !100, line: 27, baseType: !143, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !188, line: 341, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !188, line: 351, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !649, file: !188, line: 354, baseType: !105, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !649, file: !188, line: 355, baseType: !105, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !649, file: !188, line: 356, baseType: !105, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !649, file: !188, line: 361, baseType: !105, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !649, file: !188, line: 362, baseType: !156, size: 64, offset: 128)
!656 = !{i32 7, !"Dwarf Version", i32 4}
!657 = !{i32 2, !"Debug Info Version", i32 3}
!658 = !{i32 1, !"wchar_size", i32 4}
!659 = !{i32 7, !"PIC Level", i32 2}
!660 = !{i32 7, !"uwtable", i32 1}
!661 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!662 = distinct !DISubprogram(name: "PetscSFSetUp_Basic", scope: !663, file: !663, line: 7, type: !372, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !664)
!663 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfbasic.c", directory: "/home/users/ndemeye/xSDK")
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !683, !689, !690, !692, !694, !697, !698, !700, !702, !704, !707, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !731, !734, !735, !739, !741, !745, !747, !750, !751, !753, !756, !757, !759, !762, !763, !765}
!665 = !DILocalVariable(name: "sf", arg: 1, scope: !662, file: !663, line: 7, type: !163)
!666 = !DILocalVariable(name: "ierr", scope: !662, file: !663, line: 9, type: !151)
!667 = !DILocalVariable(name: "bas", scope: !662, file: !663, line: 10, type: !98)
!668 = !DILocalVariable(name: "rlengths", scope: !662, file: !663, line: 11, type: !112)
!669 = !DILocalVariable(name: "ilengths", scope: !662, file: !663, line: 11, type: !112)
!670 = !DILocalVariable(name: "i", scope: !662, file: !663, line: 11, type: !110)
!671 = !DILocalVariable(name: "nRemoteRootRanks", scope: !662, file: !663, line: 11, type: !110)
!672 = !DILocalVariable(name: "nRemoteLeafRanks", scope: !662, file: !663, line: 11, type: !110)
!673 = !DILocalVariable(name: "rank", scope: !662, file: !663, line: 12, type: !104)
!674 = !DILocalVariable(name: "niranks", scope: !662, file: !663, line: 12, type: !104)
!675 = !DILocalVariable(name: "iranks", scope: !662, file: !663, line: 12, type: !108)
!676 = !DILocalVariable(name: "tag", scope: !662, file: !663, line: 12, type: !104)
!677 = !DILocalVariable(name: "comm", scope: !662, file: !663, line: 13, type: !187)
!678 = !DILocalVariable(name: "group", scope: !662, file: !663, line: 14, type: !505)
!679 = !DILocalVariable(name: "rootreqs", scope: !662, file: !663, line: 15, type: !634)
!680 = !DILocalVariable(name: "leafreqs", scope: !662, file: !663, line: 15, type: !634)
!681 = !DILocalVariable(name: "_7_errorcode", scope: !682, file: !663, line: 18, type: !151)
!682 = distinct !DILexicalBlock(scope: !662, file: !663, line: 18, column: 49)
!683 = !DILocalVariable(name: "_7_errorstring", scope: !684, file: !663, line: 18, type: !686)
!684 = distinct !DILexicalBlock(scope: !685, file: !663, line: 18, column: 49)
!685 = distinct !DILexicalBlock(scope: !682, file: !663, line: 18, column: 49)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 2048, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 256)
!689 = !DILocalVariable(name: "_7_resultlen", scope: !684, file: !663, line: 18, type: !104)
!690 = !DILocalVariable(name: "ierr__", scope: !691, file: !663, line: 19, type: !151)
!691 = distinct !DILexicalBlock(scope: !662, file: !663, line: 19, column: 38)
!692 = !DILocalVariable(name: "_7_errorcode", scope: !693, file: !663, line: 20, type: !151)
!693 = distinct !DILexicalBlock(scope: !662, file: !663, line: 20, column: 33)
!694 = !DILocalVariable(name: "_7_errorstring", scope: !695, file: !663, line: 20, type: !686)
!695 = distinct !DILexicalBlock(scope: !696, file: !663, line: 20, column: 33)
!696 = distinct !DILexicalBlock(scope: !693, file: !663, line: 20, column: 33)
!697 = !DILocalVariable(name: "_7_resultlen", scope: !695, file: !663, line: 20, type: !104)
!698 = !DILocalVariable(name: "ierr__", scope: !699, file: !663, line: 21, type: !151)
