; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/ftn-custom/zpreconf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/ftn-custom/zpreconf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type opaque
%struct._p_PetscViewer = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!194 = !DILocalVariable(name: "pc", arg: 1, scope: !192, file: !55, line: 39, type: !58)
!195 = !DILocalVariable(name: "prefix", arg: 2, scope: !192, file: !55, line: 39, type: !145)
!196 = !DILocalVariable(name: "ierr", arg: 3, scope: !192, file: !55, line: 39, type: !68)
!197 = !DILocalVariable(name: "len", arg: 4, scope: !192, file: !55, line: 39, type: !42)
!198 = !DILocalVariable(name: "t", scope: !192, file: !55, line: 41, type: !145)
!199 = !DILocation(line: 0, scope: !192)
!200 = !DILocation(line: 41, column: 3, scope: !192)
!201 = !DILocation(line: 43, column: 3, scope: !202)
!202 = distinct !DILexicalBlock(scope: !203, file: !55, line: 43, column: 3)
!203 = distinct !DILexicalBlock(scope: !192, file: !55, line: 43, column: 3)
!204 = !DILocation(line: 43, column: 3, scope: !203)
!205 = !DILocation(line: 43, column: 3, scope: !206)
!206 = distinct !DILexicalBlock(scope: !202, file: !55, line: 43, column: 3)
!207 = !DILocation(line: 43, column: 3, scope: !208)
!208 = distinct !DILexicalBlock(scope: !202, file: !55, line: 43, column: 3)
!209 = distinct !{!209, !207, !207, !165}
!210 = !DILocation(line: 43, column: 3, scope: !211)
!211 = distinct !DILexicalBlock(scope: !208, file: !55, line: 43, column: 3)
!212 = !DILocation(line: 43, column: 3, scope: !213)
!213 = distinct !DILexicalBlock(scope: !208, file: !55, line: 43, column: 3)
!214 = !DILocation(line: 44, column: 37, scope: !192)
!215 = !DILocation(line: 44, column: 33, scope: !192)
!216 = !DILocation(line: 44, column: 11, scope: !192)
!217 = !DILocation(line: 44, column: 9, scope: !192)
!218 = !DILocation(line: 44, column: 44, scope: !219)
!219 = distinct !DILexicalBlock(scope: !192, file: !55, line: 44, column: 44)
!220 = !DILocation(line: 44, column: 44, scope: !192)
!221 = !DILocation(line: 45, column: 3, scope: !222)
!222 = distinct !DILexicalBlock(scope: !192, file: !55, line: 45, column: 3)
!223 = !DILocation(line: 46, column: 1, scope: !192)
!224 = !DISubprogram(name: "PCAppendOptionsPrefix", scope: !139, file: !139, line: 89, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!225 = distinct !DISubprogram(name: "pcgetoptionsprefix_", scope: !55, file: !55, line: 48, type: !143, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !226)
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DILocalVariable(name: "pc", arg: 1, scope: !225, file: !55, line: 48, type: !58)
!228 = !DILocalVariable(name: "prefix", arg: 2, scope: !225, file: !55, line: 48, type: !145)
!229 = !DILocalVariable(name: "ierr", arg: 3, scope: !225, file: !55, line: 48, type: !68)
!230 = !DILocalVariable(name: "len", arg: 4, scope: !225, file: !55, line: 48, type: !42)
!231 = !DILocalVariable(name: "tname", scope: !225, file: !55, line: 50, type: !184)
!232 = !DILocalVariable(name: "__i", scope: !233, file: !55, line: 54, type: !42)
!233 = distinct !DILexicalBlock(scope: !234, file: !55, line: 54, column: 3)
!234 = distinct !DILexicalBlock(scope: !225, file: !55, line: 54, column: 3)
!235 = !DILocation(line: 0, scope: !225)
!236 = !DILocation(line: 50, column: 3, scope: !225)
!237 = !DILocation(line: 52, column: 30, scope: !225)
!238 = !DILocation(line: 52, column: 11, scope: !225)
!239 = !DILocation(line: 52, column: 9, scope: !225)
!240 = !DILocation(line: 53, column: 31, scope: !225)
!241 = !DILocation(line: 53, column: 11, scope: !225)
!242 = !DILocation(line: 53, column: 9, scope: !225)
!243 = !DILocation(line: 53, column: 46, scope: !244)
!244 = distinct !DILexicalBlock(scope: !225, file: !55, line: 53, column: 46)
!245 = !DILocation(line: 53, column: 46, scope: !225)
!246 = !DILocation(line: 0, scope: !233)
!247 = !DILocation(line: 54, column: 3, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !55, line: 54, column: 3)
!249 = distinct !DILexicalBlock(scope: !233, file: !55, line: 54, column: 3)
!250 = !DILocation(line: 54, column: 3, scope: !249)
!251 = distinct !{!251, !250, !250, !165}
!252 = !DILocation(line: 0, scope: !249)
!253 = !DILocation(line: 54, column: 3, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !55, line: 54, column: 3)
!255 = distinct !DILexicalBlock(scope: !233, file: !55, line: 54, column: 3)
!256 = !DILocation(line: 54, column: 3, scope: !255)
!257 = !DILocation(line: 55, column: 1, scope: !225)
!258 = !DISubprogram(name: "PCGetOptionsPrefix", scope: !139, file: !139, line: 90, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!259 = !DISubroutineType(types: !260)
!260 = !{!70, !61, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!262 = distinct !DISubprogram(name: "pcviewfromoptions_", scope: !55, file: !55, line: 57, type: !263, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !453)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !58, !265, !145, !68, !42}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !268, line: 73, size: 4480, elements: !269)
!268 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!269 = !{!270, !272, !310, !311, !313, !316, !317, !318, !319, !327, !328, !330, !334, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !350, !351, !352, !354, !355, !357, !359, !360, !361, !362, !363, !366, !368, !369, !370, !371, !372, !375, !377, !378, !379, !389, !391, !392, !396, !397, !443, !448, !450, !451, !452}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !267, file: !268, line: 74, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !70)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !267, file: !268, line: 75, baseType: !273, size: 448, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 448, elements: !308)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !268, line: 53, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 45, size: 448, elements: !276)
!276 = !{!277, !282, !286, !291, !295, !299, !303}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !275, file: !268, line: 46, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!69, !265, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !275, file: !268, line: 47, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!69, !265, !64}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !275, file: !268, line: 48, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!69, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !275, file: !268, line: 49, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!69, !265, !184, !265}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !275, file: !268, line: 50, baseType: !296, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!69, !265, !184, !290}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !275, file: !268, line: 51, baseType: !300, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!69, !265, !184, !45}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !275, file: !268, line: 52, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!69, !265, !184, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!308 = !{!309}
!309 = !DISubrange(count: 1)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !267, file: !268, line: 76, baseType: !37, size: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !268, line: 77, baseType: !312, size: 32, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !70)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !267, file: !268, line: 78, baseType: !314, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !315)
!315 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !267, file: !268, line: 78, baseType: !314, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !267, file: !268, line: 78, baseType: !314, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !267, file: !268, line: 78, baseType: !314, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !268, line: 79, baseType: !320, size: 64, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !323, line: 27, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !325, line: 43, baseType: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!326 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !267, file: !268, line: 80, baseType: !312, size: 32, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !267, file: !268, line: 81, baseType: !329, size: 32, offset: 992)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !70)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !267, file: !268, line: 82, baseType: !331, size: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !267, file: !268, line: 83, baseType: !335, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !267, file: !268, line: 84, baseType: !145, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !267, file: !268, line: 85, baseType: !145, size: 64, offset: 1216)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !267, file: !268, line: 86, baseType: !145, size: 64, offset: 1280)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !267, file: !268, line: 87, baseType: !145, size: 64, offset: 1344)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !267, file: !268, line: 88, baseType: !265, size: 64, offset: 1408)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !267, file: !268, line: 89, baseType: !320, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !268, line: 90, baseType: !145, size: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !267, file: !268, line: 91, baseType: !145, size: 64, offset: 1600)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !267, file: !268, line: 92, baseType: !312, size: 32, offset: 1664)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !267, file: !268, line: 93, baseType: !41, size: 64, offset: 1728)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !267, file: !268, line: 94, baseType: !349, size: 64, offset: 1792)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !321)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !267, file: !268, line: 95, baseType: !312, size: 32, offset: 1856)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !267, file: !268, line: 95, baseType: !312, size: 32, offset: 1888)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !267, file: !268, line: 96, baseType: !353, size: 64, offset: 1920)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !267, file: !268, line: 96, baseType: !353, size: 64, offset: 1984)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !267, file: !268, line: 97, baseType: !356, size: 64, offset: 2048)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !267, file: !268, line: 97, baseType: !358, size: 64, offset: 2112)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !267, file: !268, line: 98, baseType: !312, size: 32, offset: 2176)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !267, file: !268, line: 98, baseType: !312, size: 32, offset: 2208)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !267, file: !268, line: 99, baseType: !353, size: 64, offset: 2240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !267, file: !268, line: 99, baseType: !353, size: 64, offset: 2304)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !267, file: !268, line: 100, baseType: !364, size: 64, offset: 2368)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !315)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !267, file: !268, line: 100, baseType: !367, size: 64, offset: 2432)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !267, file: !268, line: 101, baseType: !312, size: 32, offset: 2496)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !267, file: !268, line: 101, baseType: !312, size: 32, offset: 2528)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !267, file: !268, line: 102, baseType: !353, size: 64, offset: 2560)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !267, file: !268, line: 102, baseType: !353, size: 64, offset: 2624)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !267, file: !268, line: 103, baseType: !373, size: 64, offset: 2688)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !365)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !267, file: !268, line: 103, baseType: !376, size: 64, offset: 2752)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !267, file: !268, line: 104, baseType: !307, size: 64, offset: 2816)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !267, file: !268, line: 105, baseType: !312, size: 32, offset: 2880)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !267, file: !268, line: 106, baseType: !380, size: 128, offset: 2944)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 128, elements: !387)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !268, line: 64, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 61, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !383, file: !268, line: 62, baseType: !45, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !383, file: !268, line: 63, baseType: !41, size: 64, offset: 64)
!387 = !{!388}
!388 = !DISubrange(count: 2)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !267, file: !268, line: 107, baseType: !390, size: 64, offset: 3072)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 64, elements: !387)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !267, file: !268, line: 108, baseType: !41, size: 64, offset: 3136)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !267, file: !268, line: 109, baseType: !393, size: 64, offset: 3200)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!69, !41}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !267, file: !268, line: 111, baseType: !312, size: 32, offset: 3264)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !267, file: !268, line: 112, baseType: !398, size: 320, offset: 3328)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 320, elements: !441)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!69, !402, !265, !41}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !405)
!405 = !{!406, !407, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !404, file: !10, line: 100, baseType: !312, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !10, line: 101, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !419, !420, !421, !422, !424, !426, !427, !428}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !410, file: !10, line: 84, baseType: !145, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !410, file: !10, line: 85, baseType: !145, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !10, line: 86, baseType: !41, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !410, file: !10, line: 87, baseType: !331, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !410, file: !10, line: 88, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !410, file: !10, line: 89, baseType: !146, size: 8, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !410, file: !10, line: 90, baseType: !145, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !410, file: !10, line: 91, baseType: !42, size: 64, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !410, file: !10, line: 92, baseType: !423, size: 32, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !10, line: 93, baseType: !425, size: 32, offset: 544)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !10, line: 94, baseType: !408, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !410, file: !10, line: 95, baseType: !145, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !410, file: !10, line: 96, baseType: !41, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !404, file: !10, line: 102, baseType: !145, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !404, file: !10, line: 102, baseType: !145, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !404, file: !10, line: 103, baseType: !145, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !404, file: !10, line: 104, baseType: !37, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !404, file: !10, line: 105, baseType: !423, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !404, file: !10, line: 105, baseType: !423, size: 32, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !404, file: !10, line: 105, baseType: !423, size: 32, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !404, file: !10, line: 106, baseType: !265, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !404, file: !10, line: 107, baseType: !438, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!441 = !{!442}
!442 = !DISubrange(count: 5)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !267, file: !268, line: 113, baseType: !444, size: 320, offset: 3648)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 320, elements: !441)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!69, !265, !41}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !267, file: !268, line: 114, baseType: !449, size: 320, offset: 3968)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 320, elements: !441)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !267, file: !268, line: 115, baseType: !423, size: 32, offset: 4288)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !267, file: !268, line: 120, baseType: !438, size: 64, offset: 4352)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !267, file: !268, line: 121, baseType: !423, size: 32, offset: 4416)
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DILocalVariable(name: "ao", arg: 1, scope: !262, file: !55, line: 57, type: !58)
!455 = !DILocalVariable(name: "obj", arg: 2, scope: !262, file: !55, line: 57, type: !265)
!456 = !DILocalVariable(name: "type", arg: 3, scope: !262, file: !55, line: 57, type: !145)
!457 = !DILocalVariable(name: "ierr", arg: 4, scope: !262, file: !55, line: 57, type: !68)
!458 = !DILocalVariable(name: "len", arg: 5, scope: !262, file: !55, line: 57, type: !42)
!459 = !DILocalVariable(name: "t", scope: !262, file: !55, line: 59, type: !145)
!460 = !DILocation(line: 0, scope: !262)
!461 = !DILocation(line: 59, column: 3, scope: !262)
!462 = !DILocation(line: 61, column: 3, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !55, line: 61, column: 3)
!464 = distinct !DILexicalBlock(scope: !262, file: !55, line: 61, column: 3)
!465 = !DILocation(line: 61, column: 3, scope: !464)
!466 = !DILocation(line: 61, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !55, line: 61, column: 3)
!468 = !DILocation(line: 61, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !463, file: !55, line: 61, column: 3)
!470 = distinct !{!470, !468, !468, !165}
!471 = !DILocation(line: 61, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !469, file: !55, line: 61, column: 3)
!473 = !DILocation(line: 61, column: 3, scope: !474)
!474 = distinct !DILexicalBlock(scope: !469, file: !55, line: 61, column: 3)
!475 = !DILocation(line: 62, column: 3, scope: !476)
!476 = distinct !DILexicalBlock(scope: !262, file: !55, line: 62, column: 3)
!477 = !DILocation(line: 62, column: 3, scope: !262)
!478 = !DILocation(line: 62, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !476, file: !55, line: 62, column: 3)
!480 = !DILocation(line: 62, column: 3, scope: !481)
!481 = distinct !DILexicalBlock(scope: !479, file: !55, line: 62, column: 3)
!482 = !DILocation(line: 63, column: 29, scope: !262)
!483 = !DILocation(line: 63, column: 37, scope: !262)
!484 = !DILocation(line: 63, column: 11, scope: !262)
!485 = !DILocation(line: 63, column: 9, scope: !262)
!486 = !DILocation(line: 63, column: 44, scope: !487)
!487 = distinct !DILexicalBlock(scope: !262, file: !55, line: 63, column: 44)
!488 = !DILocation(line: 63, column: 44, scope: !262)
!489 = !DILocation(line: 64, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !262, file: !55, line: 64, column: 3)
!491 = !DILocation(line: 65, column: 1, scope: !262)
!492 = !DISubprogram(name: "PetscError", scope: !25, file: !25, line: 668, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!493 = !DISubroutineType(types: !494)
!494 = !{!69, !39, !70, !184, !184, !70, !24, !184, null}
!495 = !DISubprogram(name: "PCViewFromOptions", scope: !139, file: !139, line: 86, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!496 = !DISubroutineType(types: !497)
!497 = !{!70, !61, !266, !184}
!498 = distinct !DISubprogram(name: "pcdestroy_", scope: !55, file: !55, line: 67, type: !499, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !502)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !58, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!502 = !{!503, !504}
!503 = !DILocalVariable(name: "x", arg: 1, scope: !498, file: !55, line: 67, type: !58)
!504 = !DILocalVariable(name: "ierr", arg: 2, scope: !498, file: !55, line: 67, type: !501)
!505 = !DILocation(line: 0, scope: !498)
!506 = !DILocation(line: 69, column: 3, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !55, line: 69, column: 3)
!508 = distinct !DILexicalBlock(scope: !498, file: !55, line: 69, column: 3)
