; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/qr/qr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/qr/qr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 161, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63}
!56 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76}
!72 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 612, baseType: !5, size: 32, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "MAT_LOCAL", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "MAT_GLOBAL_MAX", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "MAT_GLOBAL_SUM", value: 3, isUnsigned: true)
!82 = !{!83, !86, !104, !185, !125, !291, !334, !335}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !85)
!84 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!85 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !89, line: 73, size: 4480, elements: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!90 = !{!91, !93, !146, !147, !149, !152, !153, !154, !155, !163, !164, !166, !170, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !188, !189, !190, !192, !193, !195, !197, !198, !199, !200, !201, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !227, !229, !230, !234, !235, !281, !286, !288, !289, !290}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !88, file: !89, line: 74, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !88, file: !89, line: 75, baseType: !94, size: 448, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 448, elements: !144)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !89, line: 53, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 45, size: 448, elements: !97)
!97 = !{!98, !108, !116, !121, !128, !132, !139}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !96, file: !89, line: 46, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !86, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !105, line: 330, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !105, line: 330, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !96, file: !89, line: 47, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!102, !86, !112}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !113, line: 16, baseType: !114)
!113 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !113, line: 16, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !89, line: 48, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!102, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !96, file: !89, line: 49, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!102, !86, !125, !86}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !96, file: !89, line: 50, baseType: !129, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!102, !86, !125, !120}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !96, file: !89, line: 51, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!102, !86, !125, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !96, file: !89, line: 52, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!102, !86, !125, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!144 = !{!145}
!145 = !DISubrange(count: 1)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !88, file: !89, line: 76, baseType: !104, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !89, line: 77, baseType: !148, size: 32, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !88, file: !89, line: 78, baseType: !150, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !151)
!151 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !88, file: !89, line: 78, baseType: !150, size: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !88, file: !89, line: 78, baseType: !150, size: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !88, file: !89, line: 78, baseType: !150, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !88, file: !89, line: 79, baseType: !156, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !159, line: 27, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !161, line: 43, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!162 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !88, file: !89, line: 80, baseType: !148, size: 32, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !88, file: !89, line: 81, baseType: !165, size: 32, offset: 992)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !88, file: !89, line: 82, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !88, file: !89, line: 83, baseType: !171, size: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !88, file: !89, line: 84, baseType: !175, size: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !88, file: !89, line: 85, baseType: !175, size: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !88, file: !89, line: 86, baseType: !175, size: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !88, file: !89, line: 87, baseType: !175, size: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !88, file: !89, line: 88, baseType: !86, size: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !88, file: !89, line: 89, baseType: !156, size: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !89, line: 90, baseType: !175, size: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !88, file: !89, line: 91, baseType: !175, size: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !88, file: !89, line: 92, baseType: !148, size: 32, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !88, file: !89, line: 93, baseType: !185, size: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !88, file: !89, line: 94, baseType: !187, size: 64, offset: 1792)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !157)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !88, file: !89, line: 95, baseType: !148, size: 32, offset: 1856)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !88, file: !89, line: 95, baseType: !148, size: 32, offset: 1888)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !88, file: !89, line: 96, baseType: !191, size: 64, offset: 1920)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !88, file: !89, line: 96, baseType: !191, size: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !88, file: !89, line: 97, baseType: !194, size: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !88, file: !89, line: 97, baseType: !196, size: 64, offset: 2112)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !88, file: !89, line: 98, baseType: !148, size: 32, offset: 2176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !88, file: !89, line: 98, baseType: !148, size: 32, offset: 2208)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !88, file: !89, line: 99, baseType: !191, size: 64, offset: 2240)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !88, file: !89, line: 99, baseType: !191, size: 64, offset: 2304)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !88, file: !89, line: 100, baseType: !202, size: 64, offset: 2368)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !151)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !88, file: !89, line: 100, baseType: !205, size: 64, offset: 2432)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !88, file: !89, line: 101, baseType: !148, size: 32, offset: 2496)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !88, file: !89, line: 101, baseType: !148, size: 32, offset: 2528)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !88, file: !89, line: 102, baseType: !191, size: 64, offset: 2560)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !88, file: !89, line: 102, baseType: !191, size: 64, offset: 2624)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !88, file: !89, line: 103, baseType: !211, size: 64, offset: 2688)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !203)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !88, file: !89, line: 103, baseType: !214, size: 64, offset: 2752)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !88, file: !89, line: 104, baseType: !143, size: 64, offset: 2816)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !88, file: !89, line: 105, baseType: !148, size: 32, offset: 2880)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !88, file: !89, line: 106, baseType: !218, size: 128, offset: 2944)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !225)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !89, line: 64, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 61, size: 128, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !221, file: !89, line: 62, baseType: !136, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !221, file: !89, line: 63, baseType: !185, size: 64, offset: 64)
!225 = !{!226}
!226 = !DISubrange(count: 2)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !88, file: !89, line: 107, baseType: !228, size: 64, offset: 3072)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !225)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !88, file: !89, line: 108, baseType: !185, size: 64, offset: 3136)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !88, file: !89, line: 109, baseType: !231, size: 64, offset: 3200)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!102, !185}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !88, file: !89, line: 111, baseType: !148, size: 32, offset: 3264)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !88, file: !89, line: 112, baseType: !236, size: 320, offset: 3328)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 320, elements: !279)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!102, !240, !86, !185}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !243)
!243 = !{!244, !245, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !242, file: !10, line: 100, baseType: !148, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !10, line: 101, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !257, !258, !259, !260, !262, !264, !265, !266}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !248, file: !10, line: 84, baseType: !175, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !248, file: !10, line: 85, baseType: !175, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !10, line: 86, baseType: !185, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !248, file: !10, line: 87, baseType: !167, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !248, file: !10, line: 88, baseType: !255, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !248, file: !10, line: 89, baseType: !127, size: 8, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !248, file: !10, line: 90, baseType: !175, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !248, file: !10, line: 91, baseType: !83, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !248, file: !10, line: 92, baseType: !261, size: 32, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !10, line: 93, baseType: !263, size: 32, offset: 544)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !10, line: 94, baseType: !246, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !248, file: !10, line: 95, baseType: !175, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !248, file: !10, line: 96, baseType: !185, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !242, file: !10, line: 102, baseType: !175, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !242, file: !10, line: 102, baseType: !175, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !242, file: !10, line: 103, baseType: !175, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !242, file: !10, line: 104, baseType: !104, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !242, file: !10, line: 106, baseType: !86, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !242, file: !10, line: 107, baseType: !276, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!279 = !{!280}
!280 = !DISubrange(count: 5)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !88, file: !89, line: 113, baseType: !282, size: 320, offset: 3648)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!102, !86, !185}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !88, file: !89, line: 114, baseType: !287, size: 320, offset: 3968)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 320, elements: !279)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !88, file: !89, line: 115, baseType: !261, size: 32, offset: 4288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !88, file: !89, line: 120, baseType: !276, size: 64, offset: 4352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !88, file: !89, line: 121, baseType: !261, size: 32, offset: 4416)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_QR", file: !293, line: 12, baseType: !294)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/qr/qr.h", directory: "/home/users/ndemeye/xSDK")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 9, size: 1216, elements: !295)
!295 = !{!296, !329}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !294, file: !293, line: 10, baseType: !297, size: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Factor", file: !298, line: 19, baseType: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/factor.h", directory: "/home/users/ndemeye/xSDK")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 9, size: 1152, elements: !300)
!300 = !{!301, !305, !320, !322, !323, !325, !326, !327, !328}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fact", scope: !299, file: !298, line: 10, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !299, file: !298, line: 11, baseType: !306, size: 704, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !39, line: 1239, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 1226, size: 704, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !307, file: !39, line: 1227, baseType: !203, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !307, file: !39, line: 1228, baseType: !203, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !307, file: !39, line: 1229, baseType: !203, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !307, file: !39, line: 1230, baseType: !203, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !307, file: !39, line: 1231, baseType: !203, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !307, file: !39, line: 1232, baseType: !203, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !307, file: !39, line: 1233, baseType: !203, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !307, file: !39, line: 1234, baseType: !203, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !307, file: !39, line: 1236, baseType: !203, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !307, file: !39, line: 1237, baseType: !203, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !307, file: !39, line: 1238, baseType: !203, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !299, file: !298, line: 12, baseType: !321, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !39, line: 1159, baseType: !125)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !299, file: !298, line: 13, baseType: !175, size: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !299, file: !298, line: 14, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !39, line: 161, baseType: !54)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "actualfill", scope: !299, file: !298, line: 15, baseType: !203, size: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "inplace", scope: !299, file: !298, line: 16, baseType: !261, size: 32, offset: 1024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reuseordering", scope: !299, file: !298, line: 17, baseType: !261, size: 32, offset: 1056)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reusefill", scope: !299, file: !298, line: 18, baseType: !261, size: 32, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !294, file: !293, line: 11, baseType: !330, size: 64, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !331, line: 11, baseType: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !331, line: 11, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!336 = !{i32 7, !"Dwarf Version", i32 4}
!337 = !{i32 2, !"Debug Info Version", i32 3}
!338 = !{i32 1, !"wchar_size", i32 4}
!339 = !{i32 7, !"PIC Level", i32 2}
!340 = !{i32 7, !"uwtable", i32 1}
!341 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!342 = distinct !DISubprogram(name: "PCCreate_QR", scope: !343, file: !343, line: 153, type: !344, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !446)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/qr/qr.c", directory: "/home/users/ndemeye/xSDK")
!344 = !DISubroutineType(types: !345)
!345 = !{!102, !346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !349, line: 37, size: 6720, elements: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!350 = !{!351, !353, !415, !420, !421, !422, !423, !424, !426, !427, !428, !429, !430, !431, !432, !433, !434, !440, !441, !442, !443, !444, !445}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !348, file: !349, line: 38, baseType: !352, size: 4480)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !89, line: 122, baseType: !88)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !348, file: !349, line: 38, baseType: !354, size: 1152, offset: 4480)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 1152, elements: !144)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !349, line: 13, size: 1152, elements: !356)
!356 = !{!357, !359, !367, !371, !377, !382, !383, !387, !391, !399, !400, !405, !406, !407, !408, !409, !413, !414}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !355, file: !349, line: 14, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !355, file: !349, line: 15, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!102, !346, !363, !363}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !364, line: 21, baseType: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !364, line: 21, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !355, file: !349, line: 16, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!102, !346, !302, !302}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !355, file: !349, line: 17, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!102, !346, !363, !363, !363, !203, !203, !203, !148, !261, !194, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !355, file: !349, line: 18, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!102, !346, !381, !363, !363, !363}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !355, file: !349, line: 19, baseType: !360, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !355, file: !349, line: 20, baseType: !384, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!102, !346, !148, !363, !363, !363}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !355, file: !349, line: 21, baseType: !388, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!102, !240, !346}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !355, file: !349, line: 22, baseType: !392, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!102, !346, !395, !363, !363}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !396, line: 22, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !396, line: 22, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !355, file: !349, line: 23, baseType: !392, size: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !355, file: !349, line: 24, baseType: !401, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!102, !346, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !355, file: !349, line: 25, baseType: !360, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !355, file: !349, line: 26, baseType: !360, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !355, file: !349, line: 27, baseType: !358, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !355, file: !349, line: 28, baseType: !358, size: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !355, file: !349, line: 29, baseType: !410, size: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!102, !346, !112}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !355, file: !349, line: 30, baseType: !358, size: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !355, file: !349, line: 31, baseType: !410, size: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !348, file: !349, line: 39, baseType: !416, size: 64, offset: 5632)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !417, line: 14, baseType: !418)
!417 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !417, line: 14, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !348, file: !349, line: 40, baseType: !148, size: 32, offset: 5696)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !348, file: !349, line: 41, baseType: !187, size: 64, offset: 5760)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !348, file: !349, line: 41, baseType: !187, size: 64, offset: 5824)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !348, file: !349, line: 42, baseType: !261, size: 32, offset: 5888)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !349, line: 43, baseType: !425, size: 32, offset: 5920)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !348, file: !349, line: 45, baseType: !148, size: 32, offset: 5952)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !348, file: !349, line: 46, baseType: !261, size: 32, offset: 5984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !348, file: !349, line: 47, baseType: !302, size: 64, offset: 6016)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !348, file: !349, line: 47, baseType: !302, size: 64, offset: 6080)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !348, file: !349, line: 48, baseType: !363, size: 64, offset: 6144)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !348, file: !349, line: 48, baseType: !363, size: 64, offset: 6208)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !348, file: !349, line: 49, baseType: !261, size: 32, offset: 6272)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !348, file: !349, line: 50, baseType: !261, size: 32, offset: 6304)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !348, file: !349, line: 51, baseType: !435, size: 64, offset: 6336)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!102, !346, !148, !438, !438, !404, !185}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !348, file: !349, line: 52, baseType: !185, size: 64, offset: 6400)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !349, line: 53, baseType: !185, size: 64, offset: 6464)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !348, file: !349, line: 54, baseType: !148, size: 32, offset: 6528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !348, file: !349, line: 55, baseType: !185, size: 64, offset: 6592)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !348, file: !349, line: 56, baseType: !335, size: 32, offset: 6656)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !348, file: !349, line: 57, baseType: !335, size: 32, offset: 6688)
!446 = !{!447, !448, !449, !450, !452}
!447 = !DILocalVariable(name: "pc", arg: 1, scope: !342, file: !343, line: 153, type: !346)
!448 = !DILocalVariable(name: "ierr", scope: !342, file: !343, line: 155, type: !102)
!449 = !DILocalVariable(name: "dir", scope: !342, file: !343, line: 156, type: !291)
!450 = !DILocalVariable(name: "ierr__", scope: !451, file: !343, line: 159, type: !102)
!451 = distinct !DILexicalBlock(scope: !342, file: !343, line: 159, column: 35)
!452 = !DILocalVariable(name: "ierr__", scope: !453, file: !343, line: 161, type: !102)
!453 = distinct !DILexicalBlock(scope: !342, file: !343, line: 161, column: 52)
!454 = !DILocation(line: 0, scope: !342)
!455 = !DILocation(line: 156, column: 3, scope: !342)
!456 = !DILocation(line: 158, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !343, line: 158, column: 3)
!458 = distinct !DILexicalBlock(scope: !459, file: !343, line: 158, column: 3)
!459 = distinct !DILexicalBlock(scope: !342, file: !343, line: 158, column: 3)
!460 = !{!461, !461, i64 0}
!461 = !{!"any pointer", !462, i64 0}
!462 = !{!"omnipotent char", !463, i64 0}
!463 = !{!"Simple C/C++ TBAA"}
!464 = !DILocation(line: 158, column: 3, scope: !458)
!465 = !DILocation(line: 158, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !343, line: 158, column: 3)
!467 = distinct !DILexicalBlock(scope: !457, file: !343, line: 158, column: 3)
!468 = !{!469, !470, i64 1536}
!469 = !{!"", !462, i64 0, !462, i64 512, !462, i64 1024, !462, i64 1280, !470, i64 1536, !470, i64 1540, !462, i64 1544}
!470 = !{!"int", !462, i64 0}
!471 = !DILocation(line: 158, column: 3, scope: !467)
!472 = !DILocation(line: 158, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !466, file: !343, line: 158, column: 3)
!474 = !{!470, !470, i64 0}
!475 = !{!469, !470, i64 1540}
!476 = !DILocation(line: 159, column: 14, scope: !342)
!477 = !{!"branch_weights", i32 2146410443, i32 1073205}
!478 = !DILocation(line: 0, scope: !451)
!479 = !DILocation(line: 159, column: 35, scope: !451)
!480 = !{!"branch_weights", i32 2000, i32 1}
!481 = !DILocation(line: 159, column: 35, scope: !482)
!482 = distinct !DILexicalBlock(scope: !451, file: !343, line: 159, column: 35)
!483 = !DILocation(line: 160, column: 21, scope: !342)
!484 = !DILocation(line: 160, column: 7, scope: !342)
!485 = !DILocation(line: 160, column: 12, scope: !342)
!486 = !{!487, !461, i64 808}
!487 = !{!"_p_PC", !488, i64 0, !462, i64 560, !461, i64 704, !470, i64 712, !490, i64 720, !490, i64 728, !462, i64 736, !462, i64 740, !470, i64 744, !462, i64 748, !461, i64 752, !461, i64 760, !461, i64 768, !461, i64 776, !462, i64 784, !462, i64 788, !461, i64 792, !461, i64 800, !461, i64 808, !470, i64 816, !461, i64 824, !462, i64 832, !462, i64 836}
!488 = !{!"_p_PetscObject", !470, i64 0, !462, i64 8, !461, i64 64, !470, i64 72, !489, i64 80, !489, i64 88, !489, i64 96, !489, i64 104, !490, i64 112, !470, i64 120, !470, i64 124, !461, i64 128, !461, i64 136, !461, i64 144, !461, i64 152, !461, i64 160, !461, i64 168, !461, i64 176, !490, i64 184, !461, i64 192, !461, i64 200, !470, i64 208, !461, i64 216, !490, i64 224, !470, i64 232, !470, i64 236, !461, i64 240, !461, i64 248, !461, i64 256, !461, i64 264, !470, i64 272, !470, i64 276, !461, i64 280, !461, i64 288, !461, i64 296, !461, i64 304, !470, i64 312, !470, i64 316, !461, i64 320, !461, i64 328, !461, i64 336, !461, i64 344, !461, i64 352, !470, i64 360, !462, i64 368, !462, i64 384, !461, i64 392, !461, i64 400, !470, i64 408, !462, i64 416, !462, i64 456, !462, i64 496, !462, i64 536, !461, i64 544, !462, i64 552}
!489 = !{!"double", !462, i64 0}
!490 = !{!"long", !462, i64 0}
!491 = !DILocation(line: 161, column: 14, scope: !342)
!492 = !DILocation(line: 0, scope: !453)
!493 = !DILocation(line: 161, column: 52, scope: !494)
!494 = distinct !DILexicalBlock(scope: !453, file: !343, line: 161, column: 52)
!495 = !DILocation(line: 161, column: 52, scope: !453)
!496 = !DILocation(line: 163, column: 3, scope: !342)
!497 = !DILocation(line: 163, column: 8, scope: !342)
!498 = !DILocation(line: 163, column: 30, scope: !342)
!499 = !{!500, !461, i64 144}
!500 = !{!"", !501, i64 0, !461, i64 144}
!501 = !{!"", !461, i64 0, !502, i64 8, !461, i64 96, !461, i64 104, !462, i64 112, !489, i64 120, !462, i64 128, !462, i64 132, !462, i64 136}
!502 = !{!"", !489, i64 0, !489, i64 8, !489, i64 16, !489, i64 24, !489, i64 32, !489, i64 40, !489, i64 48, !489, i64 56, !489, i64 64, !489, i64 72, !489, i64 80}
!503 = !DILocation(line: 164, column: 12, scope: !342)
!504 = !DILocation(line: 164, column: 30, scope: !342)
!505 = !{!506, !461, i64 128}
!506 = !{!"_PCOps", !461, i64 0, !461, i64 8, !461, i64 16, !461, i64 24, !461, i64 32, !461, i64 40, !461, i64 48, !461, i64 56, !461, i64 64, !461, i64 72, !461, i64 80, !461, i64 88, !461, i64 96, !461, i64 104, !461, i64 112, !461, i64 120, !461, i64 128, !461, i64 136}
!507 = !DILocation(line: 165, column: 12, scope: !342)
!508 = !DILocation(line: 165, column: 30, scope: !342)
!509 = !{!506, !461, i64 112}
!510 = !DILocation(line: 166, column: 12, scope: !342)
!511 = !DILocation(line: 166, column: 30, scope: !342)
!512 = !{!506, !461, i64 8}
!513 = !DILocation(line: 167, column: 12, scope: !342)
!514 = !DILocation(line: 167, column: 30, scope: !342)
!515 = !{!506, !461, i64 16}
!516 = !DILocation(line: 168, column: 12, scope: !342)
!517 = !DILocation(line: 168, column: 30, scope: !342)
!518 = !{!506, !461, i64 40}
!519 = !DILocation(line: 169, column: 12, scope: !342)
!520 = !DILocation(line: 169, column: 30, scope: !342)
!521 = !{!506, !461, i64 0}
!522 = !DILocation(line: 170, column: 12, scope: !342)
!523 = !DILocation(line: 170, column: 30, scope: !342)
!524 = !{!506, !461, i64 56}
!525 = !DILocation(line: 171, column: 12, scope: !342)
!526 = !DILocation(line: 171, column: 30, scope: !342)
!527 = !{!506, !461, i64 120}
!528 = !DILocation(line: 172, column: 12, scope: !342)
!529 = !DILocation(line: 172, column: 30, scope: !342)
!530 = !{!506, !461, i64 24}
!531 = !DILocation(line: 173, column: 3, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !343, line: 173, column: 3)
!533 = distinct !DILexicalBlock(scope: !534, file: !343, line: 173, column: 3)
!534 = distinct !DILexicalBlock(scope: !342, file: !343, line: 173, column: 3)
!535 = !DILocation(line: 173, column: 3, scope: !533)
!536 = !DILocation(line: 173, column: 3, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !343, line: 173, column: 3)
!538 = distinct !DILexicalBlock(scope: !532, file: !343, line: 173, column: 3)
!539 = !DILocation(line: 173, column: 3, scope: !538)
!540 = !DILocation(line: 173, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !343, line: 173, column: 3)
!542 = distinct !DILexicalBlock(scope: !537, file: !343, line: 173, column: 3)
!543 = !{!469, !462, i64 1544}
!544 = !DILocation(line: 173, column: 3, scope: !542)
!545 = !DILocation(line: 173, column: 3, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !343, line: 173, column: 3)
!547 = !DILocation(line: 173, column: 3, scope: !548)
!548 = distinct !DILexicalBlock(scope: !537, file: !343, line: 173, column: 3)
!549 = !DILocation(line: 173, column: 3, scope: !550)
!550 = distinct !DILexicalBlock(scope: !548, file: !343, line: 173, column: 3)
!551 = !DILocation(line: 173, column: 3, scope: !552)
!552 = distinct !DILexicalBlock(scope: !553, file: !343, line: 173, column: 3)
!553 = distinct !DILexicalBlock(scope: !550, file: !343, line: 173, column: 3)
!554 = !DILocation(line: 173, column: 3, scope: !553)
!555 = !DILocation(line: 173, column: 3, scope: !556)
!556 = distinct !DILexicalBlock(scope: !552, file: !343, line: 173, column: 3)
!557 = !DILocation(line: 174, column: 1, scope: !342)
!558 = !DISubprogram(name: "PetscMallocA", scope: !559, file: !559, line: 1288, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!559 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!560 = !DISubroutineType(types: !561)
!561 = !{!102, !26, !3, !26, !125, !125, !85, !185, null}
!562 = !{}
!563 = !DISubprogram(name: "PetscLogObjectMemory", scope: !564, file: !564, line: 228, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!564 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!565 = !DISubroutineType(types: !566)
!566 = !{!26, !87, !151}
!567 = !DISubprogram(name: "PetscError", scope: !65, file: !65, line: 668, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!568 = !DISubroutineType(types: !569)
!569 = !{!102, !106, !26, !125, !125, !26, !64, !125, null}
!570 = !DISubprogram(name: "PCFactorInitialize", scope: !298, file: !298, line: 21, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!571 = !DISubroutineType(types: !572)
!572 = !{!26, !347, !54}
!573 = distinct !DISubprogram(name: "PCReset_QR", scope: !343, file: !343, line: 74, type: !344, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !574)
!574 = !{!575, !576, !577, !578, !582}
!575 = !DILocalVariable(name: "pc", arg: 1, scope: !573, file: !343, line: 74, type: !346)
!576 = !DILocalVariable(name: "dir", scope: !573, file: !343, line: 76, type: !291)
!577 = !DILocalVariable(name: "ierr", scope: !573, file: !343, line: 77, type: !102)
!578 = !DILocalVariable(name: "ierr__", scope: !579, file: !343, line: 80, type: !102)
!579 = distinct !DILexicalBlock(scope: !580, file: !343, line: 80, column: 98)
!580 = distinct !DILexicalBlock(scope: !581, file: !343, line: 80, column: 53)
!581 = distinct !DILexicalBlock(scope: !573, file: !343, line: 80, column: 7)
!582 = !DILocalVariable(name: "ierr__", scope: !583, file: !343, line: 81, type: !102)
!583 = distinct !DILexicalBlock(scope: !573, file: !343, line: 81, column: 31)
!584 = !DILocation(line: 0, scope: !573)
!585 = !DILocation(line: 76, column: 37, scope: !573)
!586 = !DILocation(line: 79, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !343, line: 79, column: 3)
!588 = distinct !DILexicalBlock(scope: !589, file: !343, line: 79, column: 3)
!589 = distinct !DILexicalBlock(scope: !573, file: !343, line: 79, column: 3)
!590 = !DILocation(line: 79, column: 3, scope: !588)
!591 = !DILocation(line: 79, column: 3, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !343, line: 79, column: 3)
!593 = distinct !DILexicalBlock(scope: !587, file: !343, line: 79, column: 3)
!594 = !DILocation(line: 79, column: 3, scope: !593)
!595 = !DILocation(line: 79, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !592, file: !343, line: 79, column: 3)
!597 = !DILocation(line: 80, column: 17, scope: !581)
!598 = !{!500, !462, i64 128}
!599 = !DILocation(line: 80, column: 8, scope: !581)
!600 = !DILocation(line: 80, column: 25, scope: !581)
!601 = !DILocation(line: 80, column: 47, scope: !581)
!602 = !{!501, !461, i64 0}
!603 = !DILocation(line: 80, column: 28, scope: !581)
!604 = !DILocation(line: 80, column: 7, scope: !573)
!605 = !DILocation(line: 80, column: 61, scope: !580)
!606 = !DILocation(line: 0, scope: !579)
!607 = !DILocation(line: 80, column: 98, scope: !608)
!608 = distinct !DILexicalBlock(scope: !579, file: !343, line: 80, column: 98)
!609 = !DILocation(line: 80, column: 98, scope: !579)
!610 = !DILocation(line: 81, column: 26, scope: !573)
!611 = !DILocation(line: 81, column: 10, scope: !573)
!612 = !DILocation(line: 0, scope: !583)
!613 = !DILocation(line: 81, column: 31, scope: !614)
!614 = distinct !DILexicalBlock(scope: !583, file: !343, line: 81, column: 31)
!615 = !DILocation(line: 81, column: 31, scope: !583)
!616 = !DILocation(line: 82, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !343, line: 82, column: 3)
!618 = distinct !DILexicalBlock(scope: !619, file: !343, line: 82, column: 3)
!619 = distinct !DILexicalBlock(scope: !573, file: !343, line: 82, column: 3)
!620 = !DILocation(line: 82, column: 3, scope: !618)
!621 = !DILocation(line: 82, column: 3, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !343, line: 82, column: 3)
!623 = distinct !DILexicalBlock(scope: !617, file: !343, line: 82, column: 3)
!624 = !DILocation(line: 82, column: 3, scope: !623)
!625 = !DILocation(line: 82, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !343, line: 82, column: 3)
!627 = distinct !DILexicalBlock(scope: !622, file: !343, line: 82, column: 3)
!628 = !DILocation(line: 82, column: 3, scope: !627)
!629 = !DILocation(line: 82, column: 3, scope: !630)
!630 = distinct !DILexicalBlock(scope: !626, file: !343, line: 82, column: 3)
!631 = !DILocation(line: 82, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !622, file: !343, line: 82, column: 3)
!633 = !DILocation(line: 82, column: 3, scope: !634)
!634 = distinct !DILexicalBlock(scope: !632, file: !343, line: 82, column: 3)
!635 = !DILocation(line: 82, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !343, line: 82, column: 3)
!637 = distinct !DILexicalBlock(scope: !634, file: !343, line: 82, column: 3)
!638 = !DILocation(line: 82, column: 3, scope: !637)
!639 = !DILocation(line: 82, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !343, line: 82, column: 3)
!641 = !DILocation(line: 83, column: 1, scope: !573)
!642 = distinct !DISubprogram(name: "PCDestroy_QR", scope: !343, file: !343, line: 85, type: !344, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !643)
!643 = !{!644, !645, !646, !647, !649, !651, !653}
!644 = !DILocalVariable(name: "pc", arg: 1, scope: !642, file: !343, line: 85, type: !346)
!645 = !DILocalVariable(name: "dir", scope: !642, file: !343, line: 87, type: !291)
!646 = !DILocalVariable(name: "ierr", scope: !642, file: !343, line: 88, type: !102)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !343, line: 91, type: !102)
!648 = distinct !DILexicalBlock(scope: !642, file: !343, line: 91, column: 25)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !343, line: 92, type: !102)
!650 = distinct !DILexicalBlock(scope: !642, file: !343, line: 92, column: 49)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !343, line: 93, type: !102)
!652 = distinct !DILexicalBlock(scope: !642, file: !343, line: 93, column: 51)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !343, line: 94, type: !102)
!654 = distinct !DILexicalBlock(scope: !642, file: !343, line: 94, column: 30)
!655 = !DILocation(line: 0, scope: !642)
!656 = !DILocation(line: 87, column: 37, scope: !642)
!657 = !DILocation(line: 90, column: 3, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !343, line: 90, column: 3)
!659 = distinct !DILexicalBlock(scope: !660, file: !343, line: 90, column: 3)
!660 = distinct !DILexicalBlock(scope: !642, file: !343, line: 90, column: 3)
!661 = !DILocation(line: 90, column: 3, scope: !659)
!662 = !DILocation(line: 90, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !343, line: 90, column: 3)
!664 = distinct !DILexicalBlock(scope: !658, file: !343, line: 90, column: 3)
!665 = !DILocation(line: 90, column: 3, scope: !664)
!666 = !DILocation(line: 90, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !343, line: 90, column: 3)
!668 = !DILocation(line: 91, column: 10, scope: !642)
!669 = !DILocation(line: 0, scope: !648)
!670 = !DILocation(line: 91, column: 25, scope: !671)
!671 = distinct !DILexicalBlock(scope: !648, file: !343, line: 91, column: 25)
!672 = !DILocation(line: 91, column: 25, scope: !648)
!673 = !DILocation(line: 92, column: 10, scope: !642)
!674 = !{!501, !461, i64 96}
!675 = !DILocation(line: 0, scope: !650)
!676 = !DILocation(line: 92, column: 49, scope: !677)
!677 = distinct !DILexicalBlock(scope: !650, file: !343, line: 92, column: 49)
!678 = !DILocation(line: 93, column: 10, scope: !642)
!679 = !{!501, !461, i64 104}
!680 = !DILocation(line: 0, scope: !652)
!681 = !DILocation(line: 93, column: 51, scope: !682)
!682 = distinct !DILexicalBlock(scope: !652, file: !343, line: 93, column: 51)
!683 = !DILocation(line: 94, column: 10, scope: !642)
!684 = !DILocation(line: 0, scope: !654)
!685 = !DILocation(line: 94, column: 30, scope: !686)
!686 = distinct !DILexicalBlock(scope: !654, file: !343, line: 94, column: 30)
!687 = !DILocation(line: 95, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !343, line: 95, column: 3)
!689 = distinct !DILexicalBlock(scope: !690, file: !343, line: 95, column: 3)
!690 = distinct !DILexicalBlock(scope: !642, file: !343, line: 95, column: 3)
!691 = !DILocation(line: 95, column: 3, scope: !689)
!692 = !DILocation(line: 95, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !343, line: 95, column: 3)
!694 = distinct !DILexicalBlock(scope: !688, file: !343, line: 95, column: 3)
!695 = !DILocation(line: 95, column: 3, scope: !694)
!696 = !DILocation(line: 95, column: 3, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !343, line: 95, column: 3)
!698 = distinct !DILexicalBlock(scope: !693, file: !343, line: 95, column: 3)
!699 = !DILocation(line: 95, column: 3, scope: !698)
!700 = !DILocation(line: 95, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !697, file: !343, line: 95, column: 3)
!702 = !DILocation(line: 95, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !693, file: !343, line: 95, column: 3)
!704 = !DILocation(line: 95, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !703, file: !343, line: 95, column: 3)
!706 = !DILocation(line: 95, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !343, line: 95, column: 3)
!708 = distinct !DILexicalBlock(scope: !705, file: !343, line: 95, column: 3)
!709 = !DILocation(line: 95, column: 3, scope: !708)
!710 = !DILocation(line: 95, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !707, file: !343, line: 95, column: 3)
!712 = !DILocation(line: 96, column: 1, scope: !642)
!713 = distinct !DISubprogram(name: "PCApply_QR", scope: !343, file: !343, line: 98, type: !361, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721}
!715 = !DILocalVariable(name: "pc", arg: 1, scope: !713, file: !343, line: 98, type: !346)
!716 = !DILocalVariable(name: "x", arg: 2, scope: !713, file: !343, line: 98, type: !363)
!717 = !DILocalVariable(name: "y", arg: 3, scope: !713, file: !343, line: 98, type: !363)
!718 = !DILocalVariable(name: "dir", scope: !713, file: !343, line: 100, type: !291)
!719 = !DILocalVariable(name: "fact", scope: !713, file: !343, line: 101, type: !302)
!720 = !DILocalVariable(name: "ierr", scope: !713, file: !343, line: 102, type: !102)
!721 = !DILocalVariable(name: "ierr__", scope: !722, file: !343, line: 106, type: !102)
!722 = distinct !DILexicalBlock(scope: !713, file: !343, line: 106, column: 29)
!723 = !DILocation(line: 0, scope: !713)
!724 = !DILocation(line: 100, column: 37, scope: !713)
!725 = !DILocation(line: 104, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !343, line: 104, column: 3)
!727 = distinct !DILexicalBlock(scope: !728, file: !343, line: 104, column: 3)
!728 = distinct !DILexicalBlock(scope: !713, file: !343, line: 104, column: 3)
!729 = !DILocation(line: 104, column: 3, scope: !727)
!730 = !DILocation(line: 104, column: 3, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !343, line: 104, column: 3)
!732 = distinct !DILexicalBlock(scope: !726, file: !343, line: 104, column: 3)
!733 = !DILocation(line: 104, column: 3, scope: !732)
!734 = !DILocation(line: 104, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !731, file: !343, line: 104, column: 3)
!736 = !DILocation(line: 105, column: 19, scope: !713)
!737 = !DILocation(line: 105, column: 10, scope: !713)
!738 = !DILocation(line: 106, column: 10, scope: !713)
!739 = !DILocation(line: 0, scope: !722)
!740 = !DILocation(line: 106, column: 29, scope: !741)
!741 = distinct !DILexicalBlock(scope: !722, file: !343, line: 106, column: 29)
!742 = !DILocation(line: 106, column: 29, scope: !722)
!743 = !DILocation(line: 107, column: 3, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !343, line: 107, column: 3)
!745 = distinct !DILexicalBlock(scope: !746, file: !343, line: 107, column: 3)
!746 = distinct !DILexicalBlock(scope: !713, file: !343, line: 107, column: 3)
!747 = !DILocation(line: 107, column: 3, scope: !745)
!748 = !DILocation(line: 107, column: 3, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !343, line: 107, column: 3)
!750 = distinct !DILexicalBlock(scope: !744, file: !343, line: 107, column: 3)
!751 = !DILocation(line: 107, column: 3, scope: !750)
!752 = !DILocation(line: 107, column: 3, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !343, line: 107, column: 3)
!754 = distinct !DILexicalBlock(scope: !749, file: !343, line: 107, column: 3)
!755 = !DILocation(line: 107, column: 3, scope: !754)
!756 = !DILocation(line: 107, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !343, line: 107, column: 3)
!758 = !DILocation(line: 107, column: 3, scope: !759)
!759 = distinct !DILexicalBlock(scope: !749, file: !343, line: 107, column: 3)
!760 = !DILocation(line: 107, column: 3, scope: !761)
!761 = distinct !DILexicalBlock(scope: !759, file: !343, line: 107, column: 3)
!762 = !DILocation(line: 107, column: 3, scope: !763)
!763 = distinct !DILexicalBlock(scope: !764, file: !343, line: 107, column: 3)
!764 = distinct !DILexicalBlock(scope: !761, file: !343, line: 107, column: 3)
!765 = !DILocation(line: 107, column: 3, scope: !764)
!766 = !DILocation(line: 107, column: 3, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !343, line: 107, column: 3)
!768 = !DILocation(line: 108, column: 1, scope: !713)
!769 = distinct !DISubprogram(name: "PCMatApply_QR", scope: !343, file: !343, line: 110, type: !369, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777}
!771 = !DILocalVariable(name: "pc", arg: 1, scope: !769, file: !343, line: 110, type: !346)
!772 = !DILocalVariable(name: "X", arg: 2, scope: !769, file: !343, line: 110, type: !302)
!773 = !DILocalVariable(name: "Y", arg: 3, scope: !769, file: !343, line: 110, type: !302)
!774 = !DILocalVariable(name: "dir", scope: !769, file: !343, line: 112, type: !291)
!775 = !DILocalVariable(name: "fact", scope: !769, file: !343, line: 113, type: !302)
!776 = !DILocalVariable(name: "ierr", scope: !769, file: !343, line: 114, type: !102)
!777 = !DILocalVariable(name: "ierr__", scope: !778, file: !343, line: 118, type: !102)
!778 = distinct !DILexicalBlock(scope: !769, file: !343, line: 118, column: 32)
!779 = !DILocation(line: 0, scope: !769)
!780 = !DILocation(line: 112, column: 37, scope: !769)
!781 = !DILocation(line: 116, column: 3, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !343, line: 116, column: 3)
!783 = distinct !DILexicalBlock(scope: !784, file: !343, line: 116, column: 3)
!784 = distinct !DILexicalBlock(scope: !769, file: !343, line: 116, column: 3)
!785 = !DILocation(line: 116, column: 3, scope: !783)
!786 = !DILocation(line: 116, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !343, line: 116, column: 3)
!788 = distinct !DILexicalBlock(scope: !782, file: !343, line: 116, column: 3)
!789 = !DILocation(line: 116, column: 3, scope: !788)
!790 = !DILocation(line: 116, column: 3, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !343, line: 116, column: 3)
!792 = !DILocation(line: 117, column: 19, scope: !769)
!793 = !DILocation(line: 117, column: 10, scope: !769)
!794 = !DILocation(line: 118, column: 10, scope: !769)
!795 = !DILocation(line: 0, scope: !778)
!796 = !DILocation(line: 118, column: 32, scope: !797)
!797 = distinct !DILexicalBlock(scope: !778, file: !343, line: 118, column: 32)
!798 = !DILocation(line: 118, column: 32, scope: !778)
!799 = !DILocation(line: 119, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !801, file: !343, line: 119, column: 3)
!801 = distinct !DILexicalBlock(scope: !802, file: !343, line: 119, column: 3)
!802 = distinct !DILexicalBlock(scope: !769, file: !343, line: 119, column: 3)
!803 = !DILocation(line: 119, column: 3, scope: !801)
!804 = !DILocation(line: 119, column: 3, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !343, line: 119, column: 3)
!806 = distinct !DILexicalBlock(scope: !800, file: !343, line: 119, column: 3)
!807 = !DILocation(line: 119, column: 3, scope: !806)
!808 = !DILocation(line: 119, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !343, line: 119, column: 3)
!810 = distinct !DILexicalBlock(scope: !805, file: !343, line: 119, column: 3)
!811 = !DILocation(line: 119, column: 3, scope: !810)
!812 = !DILocation(line: 119, column: 3, scope: !813)
!813 = distinct !DILexicalBlock(scope: !809, file: !343, line: 119, column: 3)
!814 = !DILocation(line: 119, column: 3, scope: !815)
!815 = distinct !DILexicalBlock(scope: !805, file: !343, line: 119, column: 3)
!816 = !DILocation(line: 119, column: 3, scope: !817)
!817 = distinct !DILexicalBlock(scope: !815, file: !343, line: 119, column: 3)
!818 = !DILocation(line: 119, column: 3, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !343, line: 119, column: 3)
!820 = distinct !DILexicalBlock(scope: !817, file: !343, line: 119, column: 3)
!821 = !DILocation(line: 119, column: 3, scope: !820)
!822 = !DILocation(line: 119, column: 3, scope: !823)
!823 = distinct !DILexicalBlock(scope: !819, file: !343, line: 119, column: 3)
!824 = !DILocation(line: 120, column: 1, scope: !769)
!825 = distinct !DISubprogram(name: "PCApplyTranspose_QR", scope: !343, file: !343, line: 122, type: !361, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833}
!827 = !DILocalVariable(name: "pc", arg: 1, scope: !825, file: !343, line: 122, type: !346)
!828 = !DILocalVariable(name: "x", arg: 2, scope: !825, file: !343, line: 122, type: !363)
!829 = !DILocalVariable(name: "y", arg: 3, scope: !825, file: !343, line: 122, type: !363)
!830 = !DILocalVariable(name: "dir", scope: !825, file: !343, line: 124, type: !291)
!831 = !DILocalVariable(name: "fact", scope: !825, file: !343, line: 125, type: !302)
!832 = !DILocalVariable(name: "ierr", scope: !825, file: !343, line: 126, type: !102)
!833 = !DILocalVariable(name: "ierr__", scope: !834, file: !343, line: 130, type: !102)
!834 = distinct !DILexicalBlock(scope: !825, file: !343, line: 130, column: 38)
!835 = !DILocation(line: 0, scope: !825)
!836 = !DILocation(line: 124, column: 37, scope: !825)
!837 = !DILocation(line: 128, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !343, line: 128, column: 3)
!839 = distinct !DILexicalBlock(scope: !840, file: !343, line: 128, column: 3)
!840 = distinct !DILexicalBlock(scope: !825, file: !343, line: 128, column: 3)
!841 = !DILocation(line: 128, column: 3, scope: !839)
!842 = !DILocation(line: 128, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !844, file: !343, line: 128, column: 3)
!844 = distinct !DILexicalBlock(scope: !838, file: !343, line: 128, column: 3)
!845 = !DILocation(line: 128, column: 3, scope: !844)
!846 = !DILocation(line: 128, column: 3, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !343, line: 128, column: 3)
!848 = !DILocation(line: 129, column: 19, scope: !825)
!849 = !DILocation(line: 129, column: 10, scope: !825)
!850 = !DILocation(line: 130, column: 10, scope: !825)
!851 = !DILocation(line: 0, scope: !834)
!852 = !DILocation(line: 130, column: 38, scope: !853)
!853 = distinct !DILexicalBlock(scope: !834, file: !343, line: 130, column: 38)
!854 = !DILocation(line: 130, column: 38, scope: !834)
!855 = !DILocation(line: 131, column: 3, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !343, line: 131, column: 3)
!857 = distinct !DILexicalBlock(scope: !858, file: !343, line: 131, column: 3)
!858 = distinct !DILexicalBlock(scope: !825, file: !343, line: 131, column: 3)
!859 = !DILocation(line: 131, column: 3, scope: !857)
!860 = !DILocation(line: 131, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !343, line: 131, column: 3)
!862 = distinct !DILexicalBlock(scope: !856, file: !343, line: 131, column: 3)
!863 = !DILocation(line: 131, column: 3, scope: !862)
!864 = !DILocation(line: 131, column: 3, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !343, line: 131, column: 3)
!866 = distinct !DILexicalBlock(scope: !861, file: !343, line: 131, column: 3)
!867 = !DILocation(line: 131, column: 3, scope: !866)
!868 = !DILocation(line: 131, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !343, line: 131, column: 3)
!870 = !DILocation(line: 131, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !861, file: !343, line: 131, column: 3)
!872 = !DILocation(line: 131, column: 3, scope: !873)
!873 = distinct !DILexicalBlock(scope: !871, file: !343, line: 131, column: 3)
!874 = !DILocation(line: 131, column: 3, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !343, line: 131, column: 3)
!876 = distinct !DILexicalBlock(scope: !873, file: !343, line: 131, column: 3)
!877 = !DILocation(line: 131, column: 3, scope: !876)
!878 = !DILocation(line: 131, column: 3, scope: !879)
!879 = distinct !DILexicalBlock(scope: !875, file: !343, line: 131, column: 3)
!880 = !DILocation(line: 132, column: 1, scope: !825)
!881 = distinct !DISubprogram(name: "PCSetUp_QR", scope: !343, file: !343, line: 9, type: !344, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !882)
!882 = !{!883, !884, !885, !886, !888, !890, !892, !895, !897, !901, !903, !918, !924, !926, !928, !930, !934, !936, !939, !941, !943, !945, !947, !950, !952}
!883 = !DILocalVariable(name: "pc", arg: 1, scope: !881, file: !343, line: 9, type: !346)
!884 = !DILocalVariable(name: "ierr", scope: !881, file: !343, line: 11, type: !102)
!885 = !DILocalVariable(name: "dir", scope: !881, file: !343, line: 12, type: !291)
!886 = !DILocalVariable(name: "stype", scope: !881, file: !343, line: 13, type: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSolverType", file: !39, line: 126, baseType: !125)
!888 = !DILocalVariable(name: "err", scope: !881, file: !343, line: 14, type: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !39, line: 1203, baseType: !70)
!890 = !DILocalVariable(name: "ierr__", scope: !891, file: !343, line: 20, type: !102)
!891 = distinct !DILexicalBlock(scope: !881, file: !343, line: 20, column: 60)
!892 = !DILocalVariable(name: "ftype", scope: !893, file: !343, line: 22, type: !324)
!893 = distinct !DILexicalBlock(scope: !894, file: !343, line: 21, column: 25)
!894 = distinct !DILexicalBlock(scope: !881, file: !343, line: 21, column: 7)
!895 = !DILocalVariable(name: "ierr__", scope: !896, file: !343, line: 24, type: !102)
!896 = distinct !DILexicalBlock(scope: !893, file: !343, line: 24, column: 47)
!897 = !DILocalVariable(name: "ierr__", scope: !898, file: !343, line: 26, type: !102)
!898 = distinct !DILexicalBlock(scope: !899, file: !343, line: 26, column: 70)
!899 = distinct !DILexicalBlock(scope: !900, file: !343, line: 25, column: 35)
!900 = distinct !DILexicalBlock(scope: !893, file: !343, line: 25, column: 9)
!901 = !DILocalVariable(name: "ierr__", scope: !902, file: !343, line: 27, type: !102)
!902 = distinct !DILexicalBlock(scope: !899, file: !343, line: 27, column: 47)
!903 = !DILocalVariable(name: "info", scope: !904, file: !343, line: 35, type: !905)
!904 = distinct !DILexicalBlock(scope: !894, file: !343, line: 34, column: 10)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !39, line: 600, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 592, size: 640, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !906, file: !39, line: 593, baseType: !150, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !906, file: !39, line: 594, baseType: !150, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !906, file: !39, line: 594, baseType: !150, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !906, file: !39, line: 594, baseType: !150, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !906, file: !39, line: 595, baseType: !150, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !906, file: !39, line: 596, baseType: !150, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !906, file: !39, line: 597, baseType: !150, size: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !906, file: !39, line: 598, baseType: !150, size: 64, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !906, file: !39, line: 598, baseType: !150, size: 64, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !906, file: !39, line: 599, baseType: !150, size: 64, offset: 576)
!918 = !DILocalVariable(name: "ierr__", scope: !919, file: !343, line: 39, type: !102)
!919 = distinct !DILexicalBlock(scope: !920, file: !343, line: 39, column: 108)
!920 = distinct !DILexicalBlock(scope: !921, file: !343, line: 38, column: 37)
!921 = distinct !DILexicalBlock(scope: !922, file: !343, line: 38, column: 11)
!922 = distinct !DILexicalBlock(scope: !923, file: !343, line: 37, column: 27)
!923 = distinct !DILexicalBlock(scope: !904, file: !343, line: 37, column: 9)
!924 = !DILocalVariable(name: "ierr__", scope: !925, file: !343, line: 40, type: !102)
!925 = distinct !DILexicalBlock(scope: !920, file: !343, line: 40, column: 91)
!926 = !DILocalVariable(name: "ierr__", scope: !927, file: !343, line: 42, type: !102)
!927 = distinct !DILexicalBlock(scope: !922, file: !343, line: 42, column: 102)
!928 = !DILocalVariable(name: "ierr__", scope: !929, file: !343, line: 43, type: !102)
!929 = distinct !DILexicalBlock(scope: !922, file: !343, line: 43, column: 66)
!930 = !DILocalVariable(name: "ierr__", scope: !931, file: !343, line: 46, type: !102)
!931 = distinct !DILexicalBlock(scope: !932, file: !343, line: 46, column: 102)
!932 = distinct !DILexicalBlock(scope: !933, file: !343, line: 45, column: 50)
!933 = distinct !DILexicalBlock(scope: !923, file: !343, line: 45, column: 16)
!934 = !DILocalVariable(name: "ierr__", scope: !935, file: !343, line: 47, type: !102)
!935 = distinct !DILexicalBlock(scope: !932, file: !343, line: 47, column: 66)
!936 = !DILocalVariable(name: "ierr__", scope: !937, file: !343, line: 50, type: !102)
!937 = distinct !DILexicalBlock(scope: !938, file: !343, line: 50, column: 62)
!938 = distinct !DILexicalBlock(scope: !933, file: !343, line: 49, column: 12)
!939 = !DILocalVariable(name: "ierr__", scope: !940, file: !343, line: 52, type: !102)
!940 = distinct !DILexicalBlock(scope: !904, file: !343, line: 52, column: 60)
!941 = !DILocalVariable(name: "ierr__", scope: !942, file: !343, line: 58, type: !102)
!942 = distinct !DILexicalBlock(scope: !904, file: !343, line: 58, column: 90)
!943 = !DILocalVariable(name: "ierr__", scope: !944, file: !343, line: 59, type: !102)
!944 = distinct !DILexicalBlock(scope: !904, file: !343, line: 59, column: 60)
!945 = !DILocalVariable(name: "ierr__", scope: !946, file: !343, line: 65, type: !102)
!946 = distinct !DILexicalBlock(scope: !881, file: !343, line: 65, column: 46)
!947 = !DILocalVariable(name: "solverpackage", scope: !948, file: !343, line: 67, type: !887)
!948 = distinct !DILexicalBlock(scope: !949, file: !343, line: 66, column: 15)
!949 = distinct !DILexicalBlock(scope: !881, file: !343, line: 66, column: 7)
!950 = !DILocalVariable(name: "ierr__", scope: !951, file: !343, line: 68, type: !102)
!951 = distinct !DILexicalBlock(scope: !948, file: !343, line: 68, column: 75)
!952 = !DILocalVariable(name: "ierr__", scope: !953, file: !343, line: 69, type: !102)
!953 = distinct !DILexicalBlock(scope: !948, file: !343, line: 69, column: 55)
!954 = !DILocation(line: 0, scope: !881)
!955 = !DILocation(line: 12, column: 45, scope: !881)
!956 = !DILocation(line: 13, column: 3, scope: !881)
!957 = !DILocation(line: 14, column: 3, scope: !881)
!958 = !DILocation(line: 16, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !343, line: 16, column: 3)
!960 = distinct !DILexicalBlock(scope: !961, file: !343, line: 16, column: 3)
!961 = distinct !DILexicalBlock(scope: !881, file: !343, line: 16, column: 3)
!962 = !DILocation(line: 16, column: 3, scope: !960)
!963 = !DILocation(line: 16, column: 3, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !343, line: 16, column: 3)
!965 = distinct !DILexicalBlock(scope: !959, file: !343, line: 16, column: 3)
!966 = !DILocation(line: 16, column: 3, scope: !965)
!967 = !DILocation(line: 16, column: 3, scope: !968)
