; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/ftn-custom/zmodpcff.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/ftn-custom/zmodpcff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.anon = type { i32, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_KSP = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_cb", scope: !2, file: !258, line: 17, type: !259, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !257, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/ftn-custom/zmodpcff.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12, !17, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 55, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!38 = !{!39, !42, !45, !46, !47, !51, !53, !252, !88, !253}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !43, line: 100, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !48, line: 330, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !48, line: 330, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !52, line: 1451, baseType: !39)
!52 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !33, line: 73, size: 4480, elements: !56)
!56 = !{!57, !60, !106, !107, !109, !112, !113, !114, !115, !123, !124, !126, !130, !134, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !148, !149, !151, !152, !154, !156, !157, !158, !159, !160, !163, !165, !166, !167, !168, !169, !172, !174, !175, !176, !186, !188, !189, !193, !194, !242, !247, !249, !250, !251}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !55, file: !33, line: 74, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !59)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !55, file: !33, line: 75, baseType: !61, size: 448, offset: 64)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 448, elements: !104)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !33, line: 53, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 45, size: 448, elements: !64)
!64 = !{!65, !71, !79, !84, !91, !95, !99}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !63, file: !33, line: 46, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !53, !70}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !59)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !63, file: !33, line: 47, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!69, !53, !75}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !76, line: 16, baseType: !77)
!76 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !76, line: 16, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !63, file: !33, line: 48, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!69, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !63, file: !33, line: 49, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!69, !53, !88, !53}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !63, file: !33, line: 50, baseType: !92, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!69, !53, !88, !83}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !63, file: !33, line: 51, baseType: !96, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!69, !53, !88, !39}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !63, file: !33, line: 52, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!69, !53, !88, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !55, file: !33, line: 76, baseType: !47, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !33, line: 77, baseType: !108, size: 32, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !59)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !55, file: !33, line: 78, baseType: !110, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !111)
!111 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !55, file: !33, line: 78, baseType: !110, size: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !55, file: !33, line: 78, baseType: !110, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !55, file: !33, line: 78, baseType: !110, size: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !55, file: !33, line: 79, baseType: !116, size: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !119, line: 27, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !121, line: 43, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!122 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !55, file: !33, line: 80, baseType: !108, size: 32, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !55, file: !33, line: 81, baseType: !125, size: 32, offset: 992)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !59)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !55, file: !33, line: 82, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !55, file: !33, line: 83, baseType: !131, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !55, file: !33, line: 84, baseType: !135, size: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !55, file: !33, line: 85, baseType: !135, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !55, file: !33, line: 86, baseType: !135, size: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !55, file: !33, line: 87, baseType: !135, size: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !55, file: !33, line: 88, baseType: !53, size: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !55, file: !33, line: 89, baseType: !116, size: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !33, line: 90, baseType: !135, size: 64, offset: 1536)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !55, file: !33, line: 91, baseType: !135, size: 64, offset: 1600)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !55, file: !33, line: 92, baseType: !108, size: 32, offset: 1664)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !55, file: !33, line: 93, baseType: !46, size: 64, offset: 1728)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !55, file: !33, line: 94, baseType: !146, size: 64, offset: 1792)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !117)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !55, file: !33, line: 95, baseType: !108, size: 32, offset: 1856)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !55, file: !33, line: 95, baseType: !108, size: 32, offset: 1888)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !55, file: !33, line: 96, baseType: !150, size: 64, offset: 1920)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !55, file: !33, line: 96, baseType: !150, size: 64, offset: 1984)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !55, file: !33, line: 97, baseType: !153, size: 64, offset: 2048)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !55, file: !33, line: 97, baseType: !155, size: 64, offset: 2112)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !55, file: !33, line: 98, baseType: !108, size: 32, offset: 2176)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !55, file: !33, line: 98, baseType: !108, size: 32, offset: 2208)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !55, file: !33, line: 99, baseType: !150, size: 64, offset: 2240)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !55, file: !33, line: 99, baseType: !150, size: 64, offset: 2304)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !55, file: !33, line: 100, baseType: !161, size: 64, offset: 2368)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !111)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !55, file: !33, line: 100, baseType: !164, size: 64, offset: 2432)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !55, file: !33, line: 101, baseType: !108, size: 32, offset: 2496)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !55, file: !33, line: 101, baseType: !108, size: 32, offset: 2528)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !55, file: !33, line: 102, baseType: !150, size: 64, offset: 2560)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !55, file: !33, line: 102, baseType: !150, size: 64, offset: 2624)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !55, file: !33, line: 103, baseType: !170, size: 64, offset: 2688)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !162)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !55, file: !33, line: 103, baseType: !173, size: 64, offset: 2752)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !55, file: !33, line: 104, baseType: !103, size: 64, offset: 2816)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !55, file: !33, line: 105, baseType: !108, size: 32, offset: 2880)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !55, file: !33, line: 106, baseType: !177, size: 128, offset: 2944)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !184)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !33, line: 64, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 61, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !180, file: !33, line: 62, baseType: !39, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !180, file: !33, line: 63, baseType: !46, size: 64, offset: 64)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !55, file: !33, line: 107, baseType: !187, size: 64, offset: 3072)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !55, file: !33, line: 108, baseType: !46, size: 64, offset: 3136)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !55, file: !33, line: 109, baseType: !190, size: 64, offset: 3200)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!69, !46}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !55, file: !33, line: 111, baseType: !108, size: 32, offset: 3264)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !55, file: !33, line: 112, baseType: !195, size: 320, offset: 3328)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !240)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!69, !199, !53, !46}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !202)
!202 = !{!203, !204, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !201, file: !18, line: 100, baseType: !108, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !18, line: 101, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !216, !217, !218, !221, !223, !225, !226, !227}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !207, file: !18, line: 84, baseType: !135, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !207, file: !18, line: 85, baseType: !135, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !18, line: 86, baseType: !46, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !207, file: !18, line: 87, baseType: !127, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !207, file: !18, line: 88, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !207, file: !18, line: 89, baseType: !90, size: 8, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !207, file: !18, line: 90, baseType: !135, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !207, file: !18, line: 91, baseType: !219, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 46, baseType: !44)
!220 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !207, file: !18, line: 92, baseType: !222, size: 32, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !18, line: 93, baseType: !224, size: 32, offset: 544)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !18, line: 94, baseType: !205, size: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !207, file: !18, line: 95, baseType: !135, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !207, file: !18, line: 96, baseType: !46, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !201, file: !18, line: 102, baseType: !135, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !201, file: !18, line: 102, baseType: !135, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !201, file: !18, line: 103, baseType: !135, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !201, file: !18, line: 104, baseType: !47, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !201, file: !18, line: 105, baseType: !222, size: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !201, file: !18, line: 105, baseType: !222, size: 32, offset: 416)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !201, file: !18, line: 105, baseType: !222, size: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !201, file: !18, line: 106, baseType: !53, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !18, line: 107, baseType: !237, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!240 = !{!241}
!241 = !DISubrange(count: 5)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !55, file: !33, line: 113, baseType: !243, size: 320, offset: 3648)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 320, elements: !240)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!69, !53, !46}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !55, file: !33, line: 114, baseType: !248, size: 320, offset: 3968)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 320, elements: !240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !55, file: !33, line: 115, baseType: !222, size: 32, offset: 4288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !55, file: !33, line: 120, baseType: !237, size: 64, offset: 4352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !55, file: !33, line: 121, baseType: !222, size: 32, offset: 4416)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !254, line: 22, baseType: !255)
!254 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !254, line: 22, flags: DIFlagFwdDecl)
!257 = !{!0}
!258 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/fgmres/ftn-custom/zmodpcff.c", directory: "/home/users/ndemeye/xSDK")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 14, size: 64, elements: !260)
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "modify", scope: !259, file: !258, line: 15, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !33, line: 56, baseType: !59)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !259, file: !258, line: 16, baseType: !262, size: 32, offset: 32)
!264 = !{i32 7, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{i32 1, !"wchar_size", i32 4}
!267 = !{i32 7, !"PIC Level", i32 2}
!268 = !{i32 7, !"uwtable", i32 1}
!269 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!270 = distinct !DISubprogram(name: "kspfgmressetmodifypc_", scope: !258, file: !258, line: 33, type: !271, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273, !274, !46, !278, !277}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !273, !153, !153, !161, !46, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !46, !277}
!281 = !{!282, !283, !284, !285, !286}
!282 = !DILocalVariable(name: "ksp", arg: 1, scope: !270, file: !258, line: 33, type: !273)
!283 = !DILocalVariable(name: "fcn", arg: 2, scope: !270, file: !258, line: 33, type: !274)
!284 = !DILocalVariable(name: "ctx", arg: 3, scope: !270, file: !258, line: 33, type: !46)
!285 = !DILocalVariable(name: "d", arg: 4, scope: !270, file: !258, line: 33, type: !278)
!286 = !DILocalVariable(name: "ierr", arg: 5, scope: !270, file: !258, line: 33, type: !277)
!287 = !DILocation(line: 0, scope: !270)
!288 = !DILocation(line: 35, column: 3, scope: !289)
!289 = distinct !DILexicalBlock(scope: !270, file: !258, line: 35, column: 3)
!290 = !{!291, !291, i64 0}
!291 = !{!"any pointer", !292, i64 0}
!292 = !{!"omnipotent char", !293, i64 0}
!293 = !{!"Simple C/C++ TBAA"}
!294 = !DILocation(line: 35, column: 3, scope: !270)
!295 = !DILocation(line: 35, column: 3, scope: !296)
!296 = distinct !DILexicalBlock(scope: !289, file: !258, line: 35, column: 3)
!297 = !DILocation(line: 35, column: 3, scope: !298)
!298 = distinct !DILexicalBlock(scope: !296, file: !258, line: 35, column: 3)
!299 = !DILocation(line: 36, column: 7, scope: !300)
!300 = distinct !DILexicalBlock(scope: !270, file: !258, line: 36, column: 7)
!301 = !DILocation(line: 36, column: 30, scope: !300)
!302 = !DILocation(line: 36, column: 7, scope: !270)
!303 = !DILocation(line: 37, column: 34, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !258, line: 36, column: 75)
!305 = !DILocation(line: 37, column: 13, scope: !304)
!306 = !DILocation(line: 38, column: 3, scope: !304)
!307 = !DILocation(line: 38, column: 37, scope: !308)
!308 = distinct !DILexicalBlock(scope: !300, file: !258, line: 38, column: 14)
!309 = !DILocation(line: 38, column: 14, scope: !300)
!310 = !DILocation(line: 39, column: 34, scope: !311)
!311 = distinct !DILexicalBlock(scope: !308, file: !258, line: 38, column: 87)
!312 = !DILocation(line: 39, column: 13, scope: !311)
!313 = !DILocation(line: 40, column: 3, scope: !311)
!314 = !DILocation(line: 41, column: 56, scope: !315)
!315 = distinct !DILexicalBlock(scope: !308, file: !258, line: 40, column: 10)
!316 = !DILocation(line: 41, column: 13, scope: !315)
!317 = !DILocation(line: 41, column: 11, scope: !315)
!318 = !{!319, !319, i64 0}
!319 = !{!"int", !292, i64 0}
!320 = !DILocation(line: 41, column: 137, scope: !321)
!321 = distinct !DILexicalBlock(scope: !315, file: !258, line: 41, column: 137)
!322 = !DILocation(line: 41, column: 137, scope: !315)
!323 = !DILocation(line: 42, column: 56, scope: !315)
!324 = !DILocation(line: 42, column: 105, scope: !315)
!325 = !DILocation(line: 42, column: 13, scope: !315)
!326 = !DILocation(line: 42, column: 11, scope: !315)
!327 = !DILocation(line: 42, column: 136, scope: !328)
