; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/utils/reconstruct.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/utils/reconstruct.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TSTrajectory = type { %struct._p_PetscObject, [1 x %struct._TSTrajectoryOps], %struct._n_TSHistory*, %struct.anon.3, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i8**, i32, i8*, i8*, i8*, i32 (i8*, %struct._p_Vec*, %struct._p_Vec**)*, i32 (i8*)*, i8*, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 57, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscts.h", directory: "/home/users/ndemeye/xSDK")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "TS_LINEAR", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "TS_NONLINEAR", value: 1, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 74, baseType: !38, size: 32, elements: !39)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!40 = !DIEnumerator(name: "TS_EQ_UNSPECIFIED", value: -1)
!41 = !DIEnumerator(name: "TS_EQ_EXPLICIT", value: 0)
!42 = !DIEnumerator(name: "TS_EQ_ODE_EXPLICIT", value: 1)
!43 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX1", value: 100)
!44 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX2", value: 200)
!45 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX3", value: 300)
!46 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEXHI", value: 500)
!47 = !DIEnumerator(name: "TS_EQ_IMPLICIT", value: 1000)
!48 = !DIEnumerator(name: "TS_EQ_ODE_IMPLICIT", value: 1001)
!49 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX1", value: 1100)
!50 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX2", value: 1200)
!51 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX3", value: 1300)
!52 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEXHI", value: 1500)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 408, baseType: !5, size: 32, elements: !55)
!54 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/tsimpl.h", directory: "/home/users/ndemeye/xSDK")
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "TSEVENT_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "TSEVENT_LOCATED_INTERVAL", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "TSEVENT_PROCESSING", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "TSEVENT_ZERO", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "TSEVENT_RESET_NEXTSTEP", value: 4, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 285, baseType: !5, size: 32, elements: !63)
!62 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 103, baseType: !38, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!70 = !DIEnumerator(name: "TS_CONVERGED_ITERATING", value: 0)
!71 = !DIEnumerator(name: "TS_CONVERGED_TIME", value: 1)
!72 = !DIEnumerator(name: "TS_CONVERGED_ITS", value: 2)
!73 = !DIEnumerator(name: "TS_CONVERGED_USER", value: 3)
!74 = !DIEnumerator(name: "TS_CONVERGED_EVENT", value: 4)
!75 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FATOL", value: 5)
!76 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FRTOL", value: 6)
!77 = !DIEnumerator(name: "TS_DIVERGED_NONLINEAR_SOLVE", value: -1)
!78 = !DIEnumerator(name: "TS_DIVERGED_STEP_REJECTED", value: -2)
!79 = !DIEnumerator(name: "TSFORWARD_DIVERGED_LINEAR_SOLVE", value: -3)
!80 = !DIEnumerator(name: "TSADJOINT_DIVERGED_LINEAR_SOLVE", value: -4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 217, baseType: !5, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 663, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!93 = !{!94, !98, !99, !160, !268, !134, !184}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !95, line: 330, baseType: !96)
!95 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !95, line: 330, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !102, line: 73, size: 4480, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !106, !155, !156, !158, !161, !162, !163, !164, !172, !173, !175, !179, !183, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !196, !197, !198, !200, !201, !203, !205, !206, !207, !208, !209, !212, !214, !215, !216, !217, !218, !221, !223, !224, !225, !235, !237, !238, !242, !243, !292, !297, !299, !300, !301}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !101, file: !102, line: 74, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !38)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !101, file: !102, line: 75, baseType: !107, size: 448, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 448, elements: !153)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !102, line: 53, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 45, size: 448, elements: !110)
!110 = !{!111, !117, !125, !130, !137, !141, !148}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !109, file: !102, line: 46, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !99, !116}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !38)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !109, file: !102, line: 47, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!115, !99, !121}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !122, line: 16, baseType: !123)
!122 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !122, line: 16, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !109, file: !102, line: 48, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!115, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !109, file: !102, line: 49, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!115, !99, !134, !99}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !109, file: !102, line: 50, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!115, !99, !134, !129}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !109, file: !102, line: 51, baseType: !142, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!115, !99, !134, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !109, file: !102, line: 52, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!115, !99, !134, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !101, file: !102, line: 76, baseType: !94, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 77, baseType: !157, size: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !38)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !101, file: !102, line: 78, baseType: !159, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !160)
!160 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !101, file: !102, line: 78, baseType: !159, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !101, file: !102, line: 78, baseType: !159, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !101, file: !102, line: 78, baseType: !159, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !101, file: !102, line: 79, baseType: !165, size: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !168, line: 27, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !170, line: 43, baseType: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!171 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !101, file: !102, line: 80, baseType: !157, size: 32, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !102, line: 81, baseType: !174, size: 32, offset: 992)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !38)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !101, file: !102, line: 82, baseType: !176, size: 64, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !101, file: !102, line: 83, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !101, file: !102, line: 84, baseType: !184, size: 64, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !102, line: 85, baseType: !184, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !101, file: !102, line: 86, baseType: !184, size: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !101, file: !102, line: 87, baseType: !184, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !102, line: 88, baseType: !99, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !101, file: !102, line: 89, baseType: !165, size: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 90, baseType: !184, size: 64, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 91, baseType: !184, size: 64, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !101, file: !102, line: 92, baseType: !157, size: 32, offset: 1664)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !101, file: !102, line: 93, baseType: !98, size: 64, offset: 1728)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !101, file: !102, line: 94, baseType: !195, size: 64, offset: 1792)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !166)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !101, file: !102, line: 95, baseType: !157, size: 32, offset: 1856)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !101, file: !102, line: 95, baseType: !157, size: 32, offset: 1888)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !101, file: !102, line: 96, baseType: !199, size: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !101, file: !102, line: 96, baseType: !199, size: 64, offset: 1984)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !101, file: !102, line: 97, baseType: !202, size: 64, offset: 2048)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !101, file: !102, line: 97, baseType: !204, size: 64, offset: 2112)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !101, file: !102, line: 98, baseType: !157, size: 32, offset: 2176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !101, file: !102, line: 98, baseType: !157, size: 32, offset: 2208)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !101, file: !102, line: 99, baseType: !199, size: 64, offset: 2240)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !101, file: !102, line: 99, baseType: !199, size: 64, offset: 2304)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !101, file: !102, line: 100, baseType: !210, size: 64, offset: 2368)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !101, file: !102, line: 100, baseType: !213, size: 64, offset: 2432)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !101, file: !102, line: 101, baseType: !157, size: 32, offset: 2496)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !101, file: !102, line: 101, baseType: !157, size: 32, offset: 2528)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !101, file: !102, line: 102, baseType: !199, size: 64, offset: 2560)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !101, file: !102, line: 102, baseType: !199, size: 64, offset: 2624)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !101, file: !102, line: 103, baseType: !219, size: 64, offset: 2688)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !211)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !101, file: !102, line: 103, baseType: !222, size: 64, offset: 2752)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !101, file: !102, line: 104, baseType: !152, size: 64, offset: 2816)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !101, file: !102, line: 105, baseType: !157, size: 32, offset: 2880)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !101, file: !102, line: 106, baseType: !226, size: 128, offset: 2944)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 128, elements: !233)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !102, line: 64, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 61, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !229, file: !102, line: 62, baseType: !145, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !229, file: !102, line: 63, baseType: !98, size: 64, offset: 64)
!233 = !{!234}
!234 = !DISubrange(count: 2)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !101, file: !102, line: 107, baseType: !236, size: 64, offset: 3072)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !233)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !101, file: !102, line: 108, baseType: !98, size: 64, offset: 3136)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !101, file: !102, line: 109, baseType: !239, size: 64, offset: 3200)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!115, !98}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !101, file: !102, line: 111, baseType: !157, size: 32, offset: 3264)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !101, file: !102, line: 112, baseType: !244, size: 320, offset: 3328)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 320, elements: !290)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!115, !248, !99, !98}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !251)
!251 = !{!252, !253, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !250, file: !10, line: 100, baseType: !157, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !10, line: 101, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !265, !266, !267, !271, !273, !275, !276, !277}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !256, file: !10, line: 84, baseType: !184, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !256, file: !10, line: 85, baseType: !184, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !10, line: 86, baseType: !98, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !256, file: !10, line: 87, baseType: !176, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !256, file: !10, line: 88, baseType: !263, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !256, file: !10, line: 89, baseType: !136, size: 8, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !256, file: !10, line: 90, baseType: !184, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !256, file: !10, line: 91, baseType: !268, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !269, line: 46, baseType: !270)
!269 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!270 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !256, file: !10, line: 92, baseType: !272, size: 32, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !10, line: 93, baseType: !274, size: 32, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !10, line: 94, baseType: !254, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !256, file: !10, line: 95, baseType: !184, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !256, file: !10, line: 96, baseType: !98, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !250, file: !10, line: 102, baseType: !184, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !250, file: !10, line: 102, baseType: !184, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !250, file: !10, line: 103, baseType: !184, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !250, file: !10, line: 104, baseType: !94, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 416)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !250, file: !10, line: 105, baseType: !272, size: 32, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !250, file: !10, line: 106, baseType: !99, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !250, file: !10, line: 107, baseType: !287, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!290 = !{!291}
!291 = !DISubrange(count: 5)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !101, file: !102, line: 113, baseType: !293, size: 320, offset: 3648)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!115, !99, !98}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !101, file: !102, line: 114, baseType: !298, size: 320, offset: 3968)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 320, elements: !290)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !101, file: !102, line: 115, baseType: !272, size: 32, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !101, file: !102, line: 120, baseType: !287, size: 64, offset: 4352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !101, file: !102, line: 121, baseType: !272, size: 32, offset: 4416)
!302 = !{i32 7, !"Dwarf Version", i32 4}
!303 = !{i32 2, !"Debug Info Version", i32 3}
!304 = !{i32 1, !"wchar_size", i32 4}
!305 = !{i32 7, !"PIC Level", i32 2}
!306 = !{i32 7, !"uwtable", i32 1}
!307 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!308 = distinct !DISubprogram(name: "TSTrajectoryReconstruct_Private", scope: !309, file: !309, line: 46, type: !310, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !814)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/trajectory/utils/reconstruct.c", directory: "/home/users/ndemeye/xSDK")
!310 = !DISubroutineType(types: !311)
!311 = !{!115, !312, !335, !211, !352, !352}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !33, line: 293, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !54, line: 89, size: 7040, elements: !315)
!315 = !{!316, !318, !762, !766, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !803, !804, !805, !806, !807, !811, !812, !813}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !314, file: !54, line: 90, baseType: !317, size: 4480)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !102, line: 122, baseType: !101)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !314, file: !54, line: 90, baseType: !319, size: 448, offset: 4480)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 448, elements: !153)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !54, line: 75, size: 448, elements: !321)
!321 = !{!322, !326, !330, !331, !750, !754, !758}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !320, file: !54, line: 76, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!115, !312, !121}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !320, file: !54, line: 77, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!115, !312}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !320, file: !54, line: 78, baseType: !327, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !54, line: 79, baseType: !332, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!115, !312, !335, !157, !211, !352}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !33, line: 17, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !54, line: 144, size: 17408, elements: !338)
!338 = !{!339, !340, !440, !442, !444, !449, !450, !451, !514, !516, !562, !569, !575, !577, !578, !583, !584, !585, !586, !587, !588, !592, !596, !597, !598, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !626, !630, !634, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !686, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !716, !717, !718, !719, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !748, !749}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !337, file: !54, line: 145, baseType: !317, size: 4480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !337, file: !54, line: 145, baseType: !341, size: 2048, offset: 4480)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 2048, elements: !153)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !54, line: 33, size: 2048, elements: !343)
!343 = !{!344, !355, !362, !366, !367, !368, !372, !377, !382, !386, !387, !391, !392, !396, !397, !398, !404, !405, !406, !407, !408, !409, !410, !411, !412, !418, !422, !426, !430, !434, !435, !436}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !342, file: !54, line: 34, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!115, !348, !352, !352, !335}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !349, line: 18, baseType: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !349, line: 18, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !25, line: 21, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !342, file: !54, line: 35, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!115, !348, !352, !359, !359, !335}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !62, line: 16, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !62, line: 16, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !342, file: !54, line: 36, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!115, !335}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !342, file: !54, line: 37, baseType: !363, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !342, file: !54, line: 38, baseType: !363, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !342, file: !54, line: 39, baseType: !369, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!115, !335, !211, !352}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !342, file: !54, line: 40, baseType: !373, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!115, !335, !376, !202, !210}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !342, file: !54, line: 41, baseType: !378, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!115, !335, !157, !352, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !342, file: !54, line: 42, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!115, !248, !335}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !54, line: 43, baseType: !363, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !54, line: 44, baseType: !388, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!115, !335, !121}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !342, file: !54, line: 45, baseType: !363, size: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !342, file: !54, line: 46, baseType: !393, size: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!115, !335, !211, !211, !210, !210}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !342, file: !54, line: 47, baseType: !388, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !342, file: !54, line: 48, baseType: !363, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !342, file: !54, line: 49, baseType: !399, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!115, !335, !202, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !342, file: !54, line: 50, baseType: !363, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !342, file: !54, line: 51, baseType: !363, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !342, file: !54, line: 52, baseType: !363, size: 64, offset: 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !342, file: !54, line: 53, baseType: !363, size: 64, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !342, file: !54, line: 54, baseType: !363, size: 64, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !342, file: !54, line: 55, baseType: !363, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !342, file: !54, line: 56, baseType: !363, size: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !342, file: !54, line: 57, baseType: !363, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !342, file: !54, line: 58, baseType: !413, size: 64, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!115, !335, !202, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !342, file: !54, line: 59, baseType: !419, size: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!115, !335, !202, !403}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !342, file: !54, line: 60, baseType: !423, size: 64, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!115, !335, !403}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !342, file: !54, line: 61, baseType: !427, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!115, !335, !157, !403}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !342, file: !54, line: 62, baseType: !431, size: 64, offset: 1792)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!115, !335, !352}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !342, file: !54, line: 63, baseType: !363, size: 64, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !342, file: !54, line: 64, baseType: !431, size: 64, offset: 1920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !342, file: !54, line: 65, baseType: !437, size: 64, offset: 1984)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!115, !335, !352, !352}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !337, file: !54, line: 146, baseType: !441, size: 32, offset: 6528)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !33, line: 57, baseType: !32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !337, file: !54, line: 147, baseType: !443, size: 32, offset: 6560)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !33, line: 88, baseType: !37)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !337, file: !54, line: 149, baseType: !445, size: 64, offset: 6592)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !446, line: 14, baseType: !447)
!446 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !446, line: 14, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !337, file: !54, line: 150, baseType: !352, size: 64, offset: 6656)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !337, file: !54, line: 151, baseType: !352, size: 64, offset: 6720)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !337, file: !54, line: 152, baseType: !452, size: 64, offset: 6784)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !33, line: 686, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !54, line: 319, size: 10112, elements: !455)
!455 = !{!456, !457, !479, !480, !484, !499, !500, !501, !502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !454, file: !54, line: 320, baseType: !317, size: 4480)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !454, file: !54, line: 320, baseType: !458, size: 384, offset: 4480)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 384, elements: !153)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !54, line: 310, size: 384, elements: !460)
!460 = !{!461, !465, !469, !470, !474, !478}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !459, file: !54, line: 311, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!115, !452, !335, !211, !202, !210, !381, !210, !210, !210}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !459, file: !54, line: 312, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!115, !452}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !459, file: !54, line: 313, baseType: !466, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !459, file: !54, line: 314, baseType: !471, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!115, !452, !121}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !459, file: !54, line: 315, baseType: !475, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!115, !248, !452}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !459, file: !54, line: 316, baseType: !471, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !54, line: 321, baseType: !98, size: 64, offset: 4864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !454, file: !54, line: 322, baseType: !481, size: 64, offset: 4928)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!115, !452, !335, !211, !352, !381}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !454, file: !54, line: 331, baseType: !485, size: 4160, offset: 4992)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !54, line: 323, size: 4160, elements: !486)
!486 = !{!487, !488, !489, !493, !495, !496, !498}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !485, file: !54, line: 324, baseType: !157, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !485, file: !54, line: 325, baseType: !272, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !54, line: 326, baseType: !490, size: 1024, offset: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1024, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !485, file: !54, line: 327, baseType: !494, size: 512, offset: 1088)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 512, elements: !491)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !485, file: !54, line: 328, baseType: !494, size: 512, offset: 1600)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !485, file: !54, line: 329, baseType: !497, size: 1024, offset: 2112)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1024, elements: !491)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !485, file: !54, line: 330, baseType: !497, size: 1024, offset: 3136)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !454, file: !54, line: 332, baseType: !272, size: 32, offset: 9152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !454, file: !54, line: 333, baseType: !211, size: 64, offset: 9216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !454, file: !54, line: 334, baseType: !211, size: 64, offset: 9280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !454, file: !54, line: 335, baseType: !503, size: 128, offset: 9344)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !233)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !454, file: !54, line: 336, baseType: !211, size: 64, offset: 9472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !454, file: !54, line: 336, baseType: !211, size: 64, offset: 9536)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !454, file: !54, line: 337, baseType: !211, size: 64, offset: 9600)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !454, file: !54, line: 338, baseType: !272, size: 32, offset: 9664)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !454, file: !54, line: 339, baseType: !211, size: 64, offset: 9728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !454, file: !54, line: 340, baseType: !503, size: 128, offset: 9792)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !454, file: !54, line: 341, baseType: !376, size: 32, offset: 9920)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !454, file: !54, line: 342, baseType: !121, size: 64, offset: 9984)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !454, file: !54, line: 343, baseType: !157, size: 32, offset: 10048)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !454, file: !54, line: 344, baseType: !157, size: 32, offset: 10080)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !337, file: !54, line: 153, baseType: !515, size: 64, offset: 6848)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !33, line: 695, baseType: !134)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !337, file: !54, line: 154, baseType: !517, size: 64, offset: 6912)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !54, line: 71, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !54, line: 410, size: 1792, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !537, !541, !542, !543, !544, !545, !546, !547, !548, !550, !551, !552, !560, !561}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !519, file: !54, line: 411, baseType: !219, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !519, file: !54, line: 412, baseType: !219, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !519, file: !54, line: 413, baseType: !211, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !519, file: !54, line: 414, baseType: !211, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !519, file: !54, line: 415, baseType: !211, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !519, file: !54, line: 416, baseType: !219, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !519, file: !54, line: 417, baseType: !202, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !519, file: !54, line: 418, baseType: !211, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !519, file: !54, line: 419, baseType: !211, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !519, file: !54, line: 420, baseType: !211, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !519, file: !54, line: 421, baseType: !211, size: 64, offset: 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !519, file: !54, line: 422, baseType: !381, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !519, file: !54, line: 423, baseType: !534, size: 64, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!115, !335, !211, !352, !219, !98}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !519, file: !54, line: 424, baseType: !538, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!115, !335, !157, !202, !211, !352, !272, !98}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !519, file: !54, line: 425, baseType: !98, size: 64, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !519, file: !54, line: 426, baseType: !202, size: 64, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !519, file: !54, line: 427, baseType: !381, size: 64, offset: 1024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !519, file: !54, line: 428, baseType: !157, size: 32, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !519, file: !54, line: 429, baseType: !157, size: 32, offset: 1120)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !519, file: !54, line: 430, baseType: !202, size: 64, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !519, file: !54, line: 431, baseType: !210, size: 64, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !519, file: !54, line: 432, baseType: !549, size: 32, offset: 1280)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !54, line: 408, baseType: !53)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !519, file: !54, line: 433, baseType: !157, size: 32, offset: 1312)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !519, file: !54, line: 434, baseType: !121, size: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !519, file: !54, line: 442, baseType: !553, size: 320, offset: 1408)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !54, line: 436, size: 320, elements: !554)
!554 = !{!555, !556, !557, !558, !559}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !553, file: !54, line: 437, baseType: !157, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !553, file: !54, line: 438, baseType: !210, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !553, file: !54, line: 439, baseType: !202, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !553, file: !54, line: 440, baseType: !202, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !553, file: !54, line: 441, baseType: !204, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !519, file: !54, line: 443, baseType: !157, size: 32, offset: 1728)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !519, file: !54, line: 444, baseType: !157, size: 32, offset: 1760)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !337, file: !54, line: 157, baseType: !563, size: 640, offset: 6976)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 640, elements: !567)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!115, !335, !157, !211, !352, !98}
!567 = !{!568}
!568 = !DISubrange(count: 10)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !337, file: !54, line: 158, baseType: !570, size: 640, offset: 7616)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 640, elements: !567)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!115, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !337, file: !54, line: 159, baseType: !576, size: 640, offset: 8256)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 640, elements: !567)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !337, file: !54, line: 160, baseType: !157, size: 32, offset: 8896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !337, file: !54, line: 161, baseType: !579, size: 640, offset: 8960)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 640, elements: !567)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!115, !335, !157, !211, !352, !157, !403, !403, !98}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !337, file: !54, line: 162, baseType: !570, size: 640, offset: 9600)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !337, file: !54, line: 163, baseType: !576, size: 640, offset: 10240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !337, file: !54, line: 164, baseType: !157, size: 32, offset: 10880)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !337, file: !54, line: 165, baseType: !157, size: 32, offset: 10912)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !337, file: !54, line: 167, baseType: !363, size: 64, offset: 10944)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !337, file: !54, line: 168, baseType: !589, size: 64, offset: 11008)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!115, !335, !211}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !337, file: !54, line: 169, baseType: !593, size: 64, offset: 11072)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!115, !335, !211, !157, !403}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !337, file: !54, line: 170, baseType: !363, size: 64, offset: 11136)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !337, file: !54, line: 171, baseType: !363, size: 64, offset: 11200)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !337, file: !54, line: 172, baseType: !599, size: 64, offset: 11264)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!115, !335, !211, !352, !381}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !337, file: !54, line: 175, baseType: !312, size: 64, offset: 11328)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !337, file: !54, line: 176, baseType: !403, size: 64, offset: 11392)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !337, file: !54, line: 177, baseType: !403, size: 64, offset: 11456)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !337, file: !54, line: 178, baseType: !157, size: 32, offset: 11520)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !337, file: !54, line: 179, baseType: !352, size: 64, offset: 11584)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !337, file: !54, line: 180, baseType: !157, size: 32, offset: 11648)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !337, file: !54, line: 181, baseType: !157, size: 32, offset: 11680)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !337, file: !54, line: 182, baseType: !157, size: 32, offset: 11712)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !337, file: !54, line: 183, baseType: !272, size: 32, offset: 11744)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !337, file: !54, line: 184, baseType: !272, size: 32, offset: 11776)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !337, file: !54, line: 185, baseType: !352, size: 64, offset: 11840)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !337, file: !54, line: 186, baseType: !359, size: 64, offset: 11904)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !337, file: !54, line: 186, baseType: !359, size: 64, offset: 11968)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !337, file: !54, line: 187, baseType: !98, size: 64, offset: 12032)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !337, file: !54, line: 187, baseType: !98, size: 64, offset: 12096)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !337, file: !54, line: 188, baseType: !98, size: 64, offset: 12160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !337, file: !54, line: 189, baseType: !403, size: 64, offset: 12224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !337, file: !54, line: 190, baseType: !403, size: 64, offset: 12288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !337, file: !54, line: 191, baseType: !352, size: 64, offset: 12352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !337, file: !54, line: 191, baseType: !352, size: 64, offset: 12416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !337, file: !54, line: 194, baseType: !623, size: 64, offset: 12480)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!115, !335, !211, !352, !359, !98}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !337, file: !54, line: 195, baseType: !627, size: 64, offset: 12544)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!115, !335, !211, !352, !352, !211, !359, !98}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !337, file: !54, line: 196, baseType: !631, size: 64, offset: 12608)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!115, !335, !211, !352, !352, !98}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !337, file: !54, line: 197, baseType: !635, size: 64, offset: 12672)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!115, !335, !211, !352, !403, !98}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !337, file: !54, line: 198, baseType: !635, size: 64, offset: 12736)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !337, file: !54, line: 201, baseType: !403, size: 64, offset: 12800)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !337, file: !54, line: 202, baseType: !403, size: 64, offset: 12864)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !337, file: !54, line: 203, baseType: !352, size: 64, offset: 12928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !337, file: !54, line: 204, baseType: !403, size: 64, offset: 12992)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !337, file: !54, line: 204, baseType: !403, size: 64, offset: 13056)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !337, file: !54, line: 205, baseType: !403, size: 64, offset: 13120)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !337, file: !54, line: 205, baseType: !403, size: 64, offset: 13184)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !337, file: !54, line: 206, baseType: !403, size: 64, offset: 13248)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !337, file: !54, line: 206, baseType: !403, size: 64, offset: 13312)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !337, file: !54, line: 207, baseType: !403, size: 64, offset: 13376)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !337, file: !54, line: 207, baseType: !403, size: 64, offset: 13440)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !337, file: !54, line: 208, baseType: !98, size: 64, offset: 13504)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !337, file: !54, line: 208, baseType: !98, size: 64, offset: 13568)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !337, file: !54, line: 209, baseType: !653, size: 64, offset: 13632)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!115, !335, !211, !352, !403, !352, !403, !98}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !337, file: !54, line: 210, baseType: !653, size: 64, offset: 13696)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !337, file: !54, line: 211, baseType: !653, size: 64, offset: 13760)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !337, file: !54, line: 212, baseType: !653, size: 64, offset: 13824)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !337, file: !54, line: 213, baseType: !653, size: 64, offset: 13888)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !337, file: !54, line: 214, baseType: !653, size: 64, offset: 13952)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !337, file: !54, line: 215, baseType: !653, size: 64, offset: 14016)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !337, file: !54, line: 216, baseType: !653, size: 64, offset: 14080)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !337, file: !54, line: 219, baseType: !359, size: 64, offset: 14144)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !337, file: !54, line: 220, baseType: !352, size: 64, offset: 14208)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !337, file: !54, line: 221, baseType: !403, size: 64, offset: 14272)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !337, file: !54, line: 222, baseType: !157, size: 32, offset: 14336)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !337, file: !54, line: 223, baseType: !157, size: 32, offset: 14368)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !337, file: !54, line: 224, baseType: !98, size: 64, offset: 14400)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !337, file: !54, line: 225, baseType: !157, size: 32, offset: 14464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !337, file: !54, line: 226, baseType: !272, size: 32, offset: 14496)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !337, file: !54, line: 227, baseType: !635, size: 64, offset: 14528)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !337, file: !54, line: 231, baseType: !359, size: 64, offset: 14592)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !337, file: !54, line: 232, baseType: !359, size: 64, offset: 14656)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !337, file: !54, line: 233, baseType: !352, size: 64, offset: 14720)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !337, file: !54, line: 247, baseType: !676, size: 384, offset: 14784)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !54, line: 238, size: 384, elements: !677)
!677 = !{!678, !679, !680, !681, !683, !684, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !676, file: !54, line: 239, baseType: !211, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !676, file: !54, line: 240, baseType: !165, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !676, file: !54, line: 241, baseType: !195, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !676, file: !54, line: 242, baseType: !682, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !62, line: 285, baseType: !61)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !676, file: !54, line: 245, baseType: !272, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !676, file: !54, line: 246, baseType: !211, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !676, file: !54, line: 246, baseType: !211, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !337, file: !54, line: 251, baseType: !687, size: 64, offset: 15168)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !54, line: 249, size: 64, elements: !688)
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !687, file: !54, line: 250, baseType: !211, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !337, file: !54, line: 253, baseType: !682, size: 32, offset: 15232)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !337, file: !54, line: 255, baseType: !348, size: 64, offset: 15296)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !337, file: !54, line: 256, baseType: !272, size: 32, offset: 15360)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !337, file: !54, line: 258, baseType: !157, size: 32, offset: 15392)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !337, file: !54, line: 259, baseType: !157, size: 32, offset: 15424)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !337, file: !54, line: 260, baseType: !157, size: 32, offset: 15456)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !337, file: !54, line: 261, baseType: !157, size: 32, offset: 15488)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !337, file: !54, line: 264, baseType: !157, size: 32, offset: 15520)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !337, file: !54, line: 264, baseType: !157, size: 32, offset: 15552)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !337, file: !54, line: 264, baseType: !157, size: 32, offset: 15584)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !337, file: !54, line: 264, baseType: !157, size: 32, offset: 15616)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !337, file: !54, line: 267, baseType: !157, size: 32, offset: 15648)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !54, line: 268, baseType: !98, size: 64, offset: 15680)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !337, file: !54, line: 269, baseType: !98, size: 64, offset: 15744)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !337, file: !54, line: 272, baseType: !157, size: 32, offset: 15808)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !337, file: !54, line: 273, baseType: !211, size: 64, offset: 15872)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !337, file: !54, line: 277, baseType: !272, size: 32, offset: 15936)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !337, file: !54, line: 278, baseType: !272, size: 32, offset: 15968)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !337, file: !54, line: 279, baseType: !157, size: 32, offset: 16000)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !337, file: !54, line: 280, baseType: !211, size: 64, offset: 16064)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !337, file: !54, line: 281, baseType: !211, size: 64, offset: 16128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !337, file: !54, line: 282, baseType: !211, size: 64, offset: 16192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !337, file: !54, line: 283, baseType: !211, size: 64, offset: 16256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !337, file: !54, line: 284, baseType: !211, size: 64, offset: 16320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !337, file: !54, line: 286, baseType: !715, size: 32, offset: 16384)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !33, line: 115, baseType: !68)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !337, file: !54, line: 287, baseType: !272, size: 32, offset: 16416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !337, file: !54, line: 288, baseType: !157, size: 32, offset: 16448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !337, file: !54, line: 288, baseType: !157, size: 32, offset: 16480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !337, file: !54, line: 289, baseType: !720, size: 32, offset: 16512)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !33, line: 217, baseType: !81)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !337, file: !54, line: 291, baseType: !211, size: 64, offset: 16576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !337, file: !54, line: 291, baseType: !211, size: 64, offset: 16640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !337, file: !54, line: 292, baseType: !352, size: 64, offset: 16704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !337, file: !54, line: 292, baseType: !352, size: 64, offset: 16768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !337, file: !54, line: 293, baseType: !211, size: 64, offset: 16832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !337, file: !54, line: 293, baseType: !211, size: 64, offset: 16896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !337, file: !54, line: 295, baseType: !272, size: 32, offset: 16960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !337, file: !54, line: 296, baseType: !272, size: 32, offset: 16992)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !337, file: !54, line: 298, baseType: !157, size: 32, offset: 17024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !337, file: !54, line: 299, baseType: !403, size: 64, offset: 17088)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !337, file: !54, line: 302, baseType: !157, size: 32, offset: 17152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !337, file: !54, line: 303, baseType: !733, size: 64, offset: 17216)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !54, line: 135, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !54, line: 136, size: 320, elements: !736)
!736 = !{!737, !738, !739, !744, !745}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !735, file: !54, line: 137, baseType: !335, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !735, file: !54, line: 138, baseType: !184, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !735, file: !54, line: 139, baseType: !740, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !741, line: 11, baseType: !742)
!741 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !741, line: 11, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !54, line: 140, baseType: !733, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !735, file: !54, line: 141, baseType: !746, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !747, line: 80, baseType: !38)
!747 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!748 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !337, file: !54, line: 304, baseType: !272, size: 32, offset: 17280)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !337, file: !54, line: 307, baseType: !335, size: 64, offset: 17344)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !320, file: !54, line: 80, baseType: !751, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!115, !312, !335, !157, !210}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !320, file: !54, line: 81, baseType: !755, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!115, !248, !312}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !320, file: !54, line: 82, baseType: !759, size: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!115, !312, !335}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !314, file: !54, line: 91, baseType: !763, size: 64, offset: 4928)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !54, line: 87, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !54, line: 87, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !314, file: !54, line: 116, baseType: !767, size: 1024, offset: 4992)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !54, line: 93, size: 1024, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !784}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !767, file: !54, line: 94, baseType: !157, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !767, file: !54, line: 95, baseType: !403, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !767, file: !54, line: 96, baseType: !219, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !767, file: !54, line: 97, baseType: !210, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !767, file: !54, line: 98, baseType: !403, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !767, file: !54, line: 99, baseType: !381, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !767, file: !54, line: 100, baseType: !210, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !767, file: !54, line: 103, baseType: !272, size: 32, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !767, file: !54, line: 109, baseType: !778, size: 256, offset: 512)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !54, line: 104, size: 256, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !778, file: !54, line: 105, baseType: !165, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !778, file: !54, line: 106, baseType: !195, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !778, file: !54, line: 107, baseType: !211, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !778, file: !54, line: 108, baseType: !157, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !767, file: !54, line: 115, baseType: !785, size: 256, offset: 768)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !54, line: 110, size: 256, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !785, file: !54, line: 111, baseType: !165, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !785, file: !54, line: 112, baseType: !195, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !785, file: !54, line: 113, baseType: !211, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !785, file: !54, line: 114, baseType: !157, size: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !314, file: !54, line: 117, baseType: !352, size: 64, offset: 6016)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !314, file: !54, line: 117, baseType: !352, size: 64, offset: 6080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !314, file: !54, line: 118, baseType: !272, size: 32, offset: 6144)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !314, file: !54, line: 119, baseType: !272, size: 32, offset: 6176)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !314, file: !54, line: 120, baseType: !272, size: 32, offset: 6208)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !314, file: !54, line: 121, baseType: !121, size: 64, offset: 6272)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !314, file: !54, line: 122, baseType: !157, size: 32, offset: 6336)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !314, file: !54, line: 123, baseType: !157, size: 32, offset: 6368)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !314, file: !54, line: 124, baseType: !157, size: 32, offset: 6400)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !314, file: !54, line: 124, baseType: !157, size: 32, offset: 6432)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !314, file: !54, line: 125, baseType: !802, size: 64, offset: 6464)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !314, file: !54, line: 126, baseType: !272, size: 32, offset: 6528)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !314, file: !54, line: 127, baseType: !184, size: 64, offset: 6592)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !314, file: !54, line: 127, baseType: !184, size: 64, offset: 6656)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !314, file: !54, line: 128, baseType: !184, size: 64, offset: 6720)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !314, file: !54, line: 129, baseType: !808, size: 64, offset: 6784)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!115, !98, !352, !403}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !314, file: !54, line: 130, baseType: !239, size: 64, offset: 6848)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !314, file: !54, line: 131, baseType: !98, size: 64, offset: 6912)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !54, line: 132, baseType: !98, size: 64, offset: 6976)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !824, !827, !828, !829, !830, !831, !832, !834, !836, !839, !840, !844, !847, !849, !851, !853, !856, !857, !858, !859, !863, !867, !868, !872, !876, !877, !883, !886, !888, !890, !894, !898, !900, !903, !907, !909, !917, !920, !922, !924, !928, !932, !934, !936, !938, !942, !948, !950, !952, !954, !956, !962, !964, !966, !968}
!815 = !DILocalVariable(name: "tj", arg: 1, scope: !308, file: !309, line: 46, type: !312)
!816 = !DILocalVariable(name: "ts", arg: 2, scope: !308, file: !309, line: 46, type: !335)
!817 = !DILocalVariable(name: "t", arg: 3, scope: !308, file: !309, line: 46, type: !211)
!818 = !DILocalVariable(name: "U", arg: 4, scope: !308, file: !309, line: 46, type: !352)
!819 = !DILocalVariable(name: "Udot", arg: 5, scope: !308, file: !309, line: 46, type: !352)
!820 = !DILocalVariable(name: "tsh", scope: !308, file: !309, line: 48, type: !763)
!821 = !DILocalVariable(name: "tshhist", scope: !308, file: !309, line: 49, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!824 = !DILocalVariable(name: "tshhist_id", scope: !308, file: !309, line: 50, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!827 = !DILocalVariable(name: "id", scope: !308, file: !309, line: 51, type: !157)
!828 = !DILocalVariable(name: "cnt", scope: !308, file: !309, line: 51, type: !157)
!829 = !DILocalVariable(name: "i", scope: !308, file: !309, line: 51, type: !157)
!830 = !DILocalVariable(name: "tshn", scope: !308, file: !309, line: 51, type: !157)
!831 = !DILocalVariable(name: "ierr", scope: !308, file: !309, line: 52, type: !115)
!832 = !DILocalVariable(name: "ierr__", scope: !833, file: !309, line: 55, type: !115)
!833 = distinct !DILexicalBlock(scope: !308, file: !309, line: 55, column: 45)
!834 = !DILocalVariable(name: "ierr__", scope: !835, file: !309, line: 56, type: !115)
!835 = distinct !DILexicalBlock(scope: !308, file: !309, line: 56, column: 67)
!836 = !DILocalVariable(name: "t0", scope: !837, file: !309, line: 58, type: !211)
!837 = distinct !DILexicalBlock(scope: !838, file: !309, line: 57, column: 36)
!838 = distinct !DILexicalBlock(scope: !308, file: !309, line: 57, column: 7)
!839 = !DILocalVariable(name: "tf", scope: !837, file: !309, line: 59, type: !211)
!840 = !DILocalVariable(name: "ierr__", scope: !841, file: !309, line: 63, type: !115)
!841 = distinct !DILexicalBlock(scope: !842, file: !309, line: 63, column: 112)
!842 = distinct !DILexicalBlock(scope: !843, file: !309, line: 62, column: 20)
!843 = distinct !DILexicalBlock(scope: !308, file: !309, line: 62, column: 7)
!844 = !DILocalVariable(name: "o", scope: !845, file: !309, line: 66, type: !157)
!845 = distinct !DILexicalBlock(scope: !846, file: !309, line: 65, column: 19)
!846 = distinct !DILexicalBlock(scope: !308, file: !309, line: 65, column: 7)
!847 = !DILocalVariable(name: "ierr__", scope: !848, file: !309, line: 67, type: !115)
!848 = distinct !DILexicalBlock(scope: !845, file: !309, line: 67, column: 96)
!849 = !DILocalVariable(name: "ierr__", scope: !850, file: !309, line: 69, type: !115)
!850 = distinct !DILexicalBlock(scope: !845, file: !309, line: 69, column: 56)
!851 = !DILocalVariable(name: "ierr__", scope: !852, file: !309, line: 72, type: !115)
!852 = distinct !DILexicalBlock(scope: !308, file: !309, line: 72, column: 57)
!853 = !DILocalVariable(name: "s", scope: !854, file: !309, line: 74, type: !157)
!854 = distinct !DILexicalBlock(scope: !855, file: !309, line: 73, column: 23)
!855 = distinct !DILexicalBlock(scope: !308, file: !309, line: 73, column: 7)
!856 = !DILocalVariable(name: "nid", scope: !854, file: !309, line: 74, type: !157)
