; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/ascii/vcreatea.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/ascii/vcreatea.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscViewer = type { %struct._p_PetscObject, [1 x %struct._PetscViewerOps], i32, [25 x i32], i32, i8*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!55 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 663, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 481, baseType: !98, size: 32, elements: !99)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!101 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!102 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!103 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!104 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!105 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!106 = !{!107, !111, !112, !98, !114, !115, !117, !197, !276, !359, !202}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !108, line: 330, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !108, line: 330, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !98)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !120, line: 73, size: 4480, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !124, !261, !262, !263, !266, !267, !268, !269, !277, !278, !279, !280, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !300, !301, !302, !304, !305, !306, !307, !308, !311, !313, !314, !315, !316, !317, !320, !322, !323, !324, !334, !336, !337, !341, !342, !349, !354, !356, !357, !358}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !119, file: !120, line: 74, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !98)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !119, file: !120, line: 75, baseType: !125, size: 448, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 448, elements: !225)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !120, line: 53, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 45, size: 448, elements: !128)
!128 = !{!129, !135, !236, !241, !245, !249, !256}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !127, file: !120, line: 46, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !117, !134}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !98)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !127, file: !120, line: 47, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!133, !117, !139}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !140, line: 16, baseType: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !143, line: 28, size: 6016, elements: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/viewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!144 = !{!145, !147, !227, !229, !233, !234, !235}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !142, file: !143, line: 29, baseType: !146, size: 4480)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !120, line: 122, baseType: !119)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !142, file: !143, line: 29, baseType: !148, size: 512, offset: 4480)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, elements: !225)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscViewerOps", file: !143, line: 11, size: 512, elements: !150)
!150 = !{!151, !155, !159, !160, !165, !166, !173, !224}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !149, file: !143, line: 12, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!133, !139}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !149, file: !143, line: 13, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!133, !139, !139}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !149, file: !143, line: 14, baseType: !152, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "getsubviewer", scope: !149, file: !143, line: 15, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!133, !139, !107, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubviewer", scope: !149, file: !143, line: 16, baseType: !161, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !149, file: !143, line: 17, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!133, !139, !111, !170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !98)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !6, line: 389, baseType: !26)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !149, file: !143, line: 18, baseType: !174, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!133, !177, !139}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !180)
!180 = !{!181, !182, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !179, file: !12, line: 100, baseType: !170, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !12, line: 101, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !186)
!186 = !{!187, !188, !189, !190, !194, !199, !200, !201, !205, !207, !209, !210, !211}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !185, file: !12, line: 84, baseType: !112, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !185, file: !12, line: 85, baseType: !112, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !185, file: !12, line: 86, baseType: !111, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !185, file: !12, line: 87, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !185, file: !12, line: 88, baseType: !195, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !185, file: !12, line: 89, baseType: !113, size: 8, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !185, file: !12, line: 90, baseType: !112, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !185, file: !12, line: 91, baseType: !202, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!204 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !185, file: !12, line: 92, baseType: !206, size: 32, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !12, line: 93, baseType: !208, size: 32, offset: 544)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !12, line: 94, baseType: !183, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !185, file: !12, line: 95, baseType: !112, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !185, file: !12, line: 96, baseType: !111, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !179, file: !12, line: 102, baseType: !112, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !179, file: !12, line: 102, baseType: !112, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !179, file: !12, line: 103, baseType: !112, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !179, file: !12, line: 104, baseType: !107, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !179, file: !12, line: 105, baseType: !206, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !179, file: !12, line: 105, baseType: !206, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !179, file: !12, line: 105, baseType: !206, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !179, file: !12, line: 106, baseType: !117, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !179, file: !12, line: 107, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !149, file: !143, line: 19, baseType: !152, size: 64, offset: 448)
!225 = !{!226}
!226 = !DISubrange(count: 1)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !142, file: !143, line: 30, baseType: !228, size: 32, offset: 4992)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !47, line: 162, baseType: !46)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !142, file: !143, line: 30, baseType: !230, size: 800, offset: 5024)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 800, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !142, file: !143, line: 31, baseType: !98, size: 32, offset: 5824)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !143, line: 32, baseType: !111, size: 64, offset: 5888)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !142, file: !143, line: 33, baseType: !206, size: 32, offset: 5952)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !127, file: !120, line: 48, baseType: !237, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!133, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !127, file: !120, line: 49, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!133, !117, !197, !117}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !127, file: !120, line: 50, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!133, !117, !197, !240}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !127, file: !120, line: 51, baseType: !250, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!133, !117, !197, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !127, file: !120, line: 52, baseType: !257, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!133, !117, !197, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !119, file: !120, line: 76, baseType: !107, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !120, line: 77, baseType: !170, size: 32, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !119, file: !120, line: 78, baseType: !264, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !265)
!265 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !119, file: !120, line: 78, baseType: !264, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !119, file: !120, line: 78, baseType: !264, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !119, file: !120, line: 78, baseType: !264, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !120, line: 79, baseType: !270, size: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !273, line: 27, baseType: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !275, line: 43, baseType: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!276 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !119, file: !120, line: 80, baseType: !170, size: 32, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !119, file: !120, line: 81, baseType: !116, size: 32, offset: 992)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !119, file: !120, line: 82, baseType: !191, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !119, file: !120, line: 83, baseType: !281, size: 64, offset: 1088)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !119, file: !120, line: 84, baseType: !112, size: 64, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !119, file: !120, line: 85, baseType: !112, size: 64, offset: 1216)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !119, file: !120, line: 86, baseType: !112, size: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !119, file: !120, line: 87, baseType: !112, size: 64, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !119, file: !120, line: 88, baseType: !117, size: 64, offset: 1408)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !119, file: !120, line: 89, baseType: !270, size: 64, offset: 1472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 90, baseType: !112, size: 64, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !119, file: !120, line: 91, baseType: !112, size: 64, offset: 1600)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !119, file: !120, line: 92, baseType: !170, size: 32, offset: 1664)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !119, file: !120, line: 93, baseType: !111, size: 64, offset: 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 94, baseType: !295, size: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !271)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !119, file: !120, line: 95, baseType: !170, size: 32, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !119, file: !120, line: 95, baseType: !170, size: 32, offset: 1888)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !119, file: !120, line: 96, baseType: !299, size: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !119, file: !120, line: 96, baseType: !299, size: 64, offset: 1984)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !119, file: !120, line: 97, baseType: !171, size: 64, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !119, file: !120, line: 97, baseType: !303, size: 64, offset: 2112)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !119, file: !120, line: 98, baseType: !170, size: 32, offset: 2176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !119, file: !120, line: 98, baseType: !170, size: 32, offset: 2208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !119, file: !120, line: 99, baseType: !299, size: 64, offset: 2240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !119, file: !120, line: 99, baseType: !299, size: 64, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !119, file: !120, line: 100, baseType: !309, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !265)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !119, file: !120, line: 100, baseType: !312, size: 64, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !119, file: !120, line: 101, baseType: !170, size: 32, offset: 2496)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !119, file: !120, line: 101, baseType: !170, size: 32, offset: 2528)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !119, file: !120, line: 102, baseType: !299, size: 64, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !119, file: !120, line: 102, baseType: !299, size: 64, offset: 2624)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !119, file: !120, line: 103, baseType: !318, size: 64, offset: 2688)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !310)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !119, file: !120, line: 103, baseType: !321, size: 64, offset: 2752)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !119, file: !120, line: 104, baseType: !260, size: 64, offset: 2816)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !119, file: !120, line: 105, baseType: !170, size: 32, offset: 2880)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !119, file: !120, line: 106, baseType: !325, size: 128, offset: 2944)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 128, elements: !332)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !120, line: 64, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 61, size: 128, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !328, file: !120, line: 62, baseType: !253, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !328, file: !120, line: 63, baseType: !111, size: 64, offset: 64)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !119, file: !120, line: 107, baseType: !335, size: 64, offset: 3072)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !332)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !119, file: !120, line: 108, baseType: !111, size: 64, offset: 3136)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !119, file: !120, line: 109, baseType: !338, size: 64, offset: 3200)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!133, !111}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !119, file: !120, line: 111, baseType: !170, size: 32, offset: 3264)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !119, file: !120, line: 112, baseType: !343, size: 320, offset: 3328)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 320, elements: !347)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!133, !177, !117, !111}
!347 = !{!348}
!348 = !DISubrange(count: 5)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !119, file: !120, line: 113, baseType: !350, size: 320, offset: 3648)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!133, !117, !111}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !119, file: !120, line: 114, baseType: !355, size: 320, offset: 3968)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 320, elements: !347)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !119, file: !120, line: 115, baseType: !206, size: 32, offset: 4288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !119, file: !120, line: 120, baseType: !221, size: 64, offset: 4352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !119, file: !120, line: 121, baseType: !206, size: 32, offset: 4416)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer_ASCII", file: !361, line: 20, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/viewer/impls/ascii/asciiimpl.h", directory: "/home/users/ndemeye/xSDK")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 5, size: 768, elements: !363)
!363 = !{!364, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !437, !438}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !362, file: !361, line: 6, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !367, line: 7, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !369, line: 245, size: 1728, elements: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !391, !392, !393, !394, !396, !398, !400, !402, !405, !407, !408, !409, !410, !411, !412, !413}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !368, file: !369, line: 246, baseType: !98, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !368, file: !369, line: 251, baseType: !112, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !368, file: !369, line: 252, baseType: !112, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !368, file: !369, line: 253, baseType: !112, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !368, file: !369, line: 254, baseType: !112, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !368, file: !369, line: 255, baseType: !112, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !368, file: !369, line: 256, baseType: !112, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !368, file: !369, line: 257, baseType: !112, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !368, file: !369, line: 258, baseType: !112, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !368, file: !369, line: 260, baseType: !112, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !368, file: !369, line: 261, baseType: !112, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !368, file: !369, line: 262, baseType: !112, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !368, file: !369, line: 264, baseType: !384, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !369, line: 160, size: 192, elements: !386)
!386 = !{!387, !388, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !385, file: !369, line: 161, baseType: !384, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !385, file: !369, line: 162, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !385, file: !369, line: 166, baseType: !98, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !368, file: !369, line: 266, baseType: !389, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !368, file: !369, line: 268, baseType: !98, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !368, file: !369, line: 272, baseType: !98, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !368, file: !369, line: 274, baseType: !395, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !275, line: 140, baseType: !276)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !368, file: !369, line: 278, baseType: !397, size: 16, offset: 1024)
!397 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !368, file: !369, line: 279, baseType: !399, size: 8, offset: 1040)
!399 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !368, file: !369, line: 280, baseType: !401, size: 8, offset: 1048)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 8, elements: !225)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !368, file: !369, line: 284, baseType: !403, size: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !369, line: 154, baseType: null)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !368, file: !369, line: 293, baseType: !406, size: 64, offset: 1152)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !275, line: 141, baseType: !276)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !368, file: !369, line: 301, baseType: !111, size: 64, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !368, file: !369, line: 302, baseType: !111, size: 64, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !368, file: !369, line: 303, baseType: !111, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !368, file: !369, line: 304, baseType: !111, size: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !368, file: !369, line: 306, baseType: !202, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !368, file: !369, line: 307, baseType: !98, size: 32, offset: 1536)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !368, file: !369, line: 309, baseType: !414, size: 160, offset: 1568)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 160, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 20)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !362, file: !361, line: 7, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFileMode", file: !6, line: 481, baseType: !97)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !362, file: !361, line: 8, baseType: !170, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tab_store", scope: !362, file: !361, line: 9, baseType: !170, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bviewer", scope: !362, file: !361, line: 10, baseType: !139, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sviewer", scope: !362, file: !361, line: 11, baseType: !139, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "subviewer", scope: !362, file: !361, line: 12, baseType: !139, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !362, file: !361, line: 13, baseType: !112, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "storecompressed", scope: !362, file: !361, line: 14, baseType: !206, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "closefile", scope: !362, file: !361, line: 15, baseType: !206, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "allowsynchronized", scope: !362, file: !361, line: 16, baseType: !170, size: 32, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "petsc_printfqueue", scope: !362, file: !361, line: 18, baseType: !429, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrintfQueue", file: !430, line: 9, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/fileio/mprint.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrintfQueue", file: !430, line: 10, size: 192, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !432, file: !430, line: 11, baseType: !112, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !432, file: !430, line: 12, baseType: !98, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !430, line: 13, baseType: !429, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "petsc_printfqueuebase", scope: !362, file: !361, line: 18, baseType: !429, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "petsc_printfqueuelength", scope: !362, file: !361, line: 19, baseType: !98, size: 32, offset: 704)
!439 = !{!0, !440, !443}
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "Petsc_Viewer_Stderr_keyval", scope: !2, file: !442, line: 90, type: !116, isLocal: false, isDefinition: true)
!442 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/ascii/vcreatea.c", directory: "/home/users/ndemeye/xSDK")
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "Petsc_Viewer_keyval", scope: !2, file: !442, line: 163, type: !116, isLocal: false, isDefinition: true)
!445 = !{i32 7, !"Dwarf Version", i32 4}
!446 = !{i32 2, !"Debug Info Version", i32 3}
!447 = !{i32 1, !"wchar_size", i32 4}
!448 = !{i32 7, !"PIC Level", i32 2}
!449 = !{i32 7, !"uwtable", i32 1}
!450 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!451 = distinct !DISubprogram(name: "PetscViewerASCIIGetStdout", scope: !442, file: !442, line: 30, type: !452, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!133, !107, !164}
!454 = !{!455, !456, !457, !458, !459, !460, !462, !464, !468, !474, !475, !477, !480, !481, !485, !487, !489, !492, !493, !495}
!455 = !DILocalVariable(name: "comm", arg: 1, scope: !451, file: !442, line: 30, type: !107)
!456 = !DILocalVariable(name: "viewer", arg: 2, scope: !451, file: !442, line: 30, type: !164)
!457 = !DILocalVariable(name: "ierr", scope: !451, file: !442, line: 32, type: !133)
!458 = !DILocalVariable(name: "flg", scope: !451, file: !442, line: 33, type: !206)
!459 = !DILocalVariable(name: "ncomm", scope: !451, file: !442, line: 34, type: !107)
!460 = !DILocalVariable(name: "ierr__", scope: !461, file: !442, line: 37, type: !133)
!461 = distinct !DILexicalBlock(scope: !451, file: !442, line: 37, column: 61)
!462 = !DILocalVariable(name: "ierr__", scope: !463, file: !442, line: 38, type: !133)
!463 = distinct !DILexicalBlock(scope: !451, file: !442, line: 38, column: 47)
!464 = !DILocalVariable(name: "_7_errorcode", scope: !465, file: !442, line: 40, type: !133)
!465 = distinct !DILexicalBlock(scope: !466, file: !442, line: 40, column: 115)
!466 = distinct !DILexicalBlock(scope: !467, file: !442, line: 39, column: 57)
!467 = distinct !DILexicalBlock(scope: !451, file: !442, line: 39, column: 7)
!468 = !DILocalVariable(name: "_7_errorstring", scope: !469, file: !442, line: 40, type: !471)
!469 = distinct !DILexicalBlock(scope: !470, file: !442, line: 40, column: 115)
!470 = distinct !DILexicalBlock(scope: !465, file: !442, line: 40, column: 115)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 256)
!474 = !DILocalVariable(name: "_7_resultlen", scope: !469, file: !442, line: 40, type: !116)
!475 = !DILocalVariable(name: "_7_errorcode", scope: !476, file: !442, line: 42, type: !133)
!476 = distinct !DILexicalBlock(scope: !451, file: !442, line: 42, column: 96)
!477 = !DILocalVariable(name: "_7_errorstring", scope: !478, file: !442, line: 42, type: !471)
!478 = distinct !DILexicalBlock(scope: !479, file: !442, line: 42, column: 96)
!479 = distinct !DILexicalBlock(scope: !476, file: !442, line: 42, column: 96)
!480 = !DILocalVariable(name: "_7_resultlen", scope: !478, file: !442, line: 42, type: !116)
!481 = !DILocalVariable(name: "ierr__", scope: !482, file: !442, line: 44, type: !133)
!482 = distinct !DILexicalBlock(scope: !483, file: !442, line: 44, column: 56)
!483 = distinct !DILexicalBlock(scope: !484, file: !442, line: 43, column: 13)
!484 = distinct !DILexicalBlock(scope: !451, file: !442, line: 43, column: 7)
!485 = !DILocalVariable(name: "ierr__", scope: !486, file: !442, line: 45, type: !133)
!486 = distinct !DILexicalBlock(scope: !483, file: !442, line: 45, column: 61)
!487 = !DILocalVariable(name: "_7_errorcode", scope: !488, file: !442, line: 46, type: !133)
!488 = distinct !DILexicalBlock(scope: !483, file: !442, line: 46, column: 79)
!489 = !DILocalVariable(name: "_7_errorstring", scope: !490, file: !442, line: 46, type: !471)
!490 = distinct !DILexicalBlock(scope: !491, file: !442, line: 46, column: 79)
!491 = distinct !DILexicalBlock(scope: !488, file: !442, line: 46, column: 79)
!492 = !DILocalVariable(name: "_7_resultlen", scope: !490, file: !442, line: 46, type: !116)
!493 = !DILocalVariable(name: "ierr__", scope: !494, file: !442, line: 48, type: !133)
!494 = distinct !DILexicalBlock(scope: !451, file: !442, line: 48, column: 35)
!495 = !DILocalVariable(name: "ierr__", scope: !496, file: !442, line: 49, type: !133)
!496 = distinct !DILexicalBlock(scope: !451, file: !442, line: 49, column: 63)
!497 = !DILocation(line: 0, scope: !451)
!498 = !DILocation(line: 33, column: 3, scope: !451)
!499 = !DILocation(line: 34, column: 3, scope: !451)
!500 = !DILocation(line: 36, column: 3, scope: !501)
!501 = distinct !DILexicalBlock(scope: !502, file: !442, line: 36, column: 3)
!502 = distinct !DILexicalBlock(scope: !503, file: !442, line: 36, column: 3)
!503 = distinct !DILexicalBlock(scope: !451, file: !442, line: 36, column: 3)
!504 = !{!505, !505, i64 0}
!505 = !{!"any pointer", !506, i64 0}
!506 = !{!"omnipotent char", !507, i64 0}
!507 = !{!"Simple C/C++ TBAA"}
!508 = !DILocation(line: 36, column: 3, scope: !502)
!509 = !DILocation(line: 36, column: 3, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !442, line: 36, column: 3)
!511 = distinct !DILexicalBlock(scope: !501, file: !442, line: 36, column: 3)
!512 = !{!513, !514, i64 1536}
!513 = !{!"", !506, i64 0, !506, i64 512, !506, i64 1024, !506, i64 1280, !514, i64 1536, !514, i64 1540, !506, i64 1544}
!514 = !{!"int", !506, i64 0}
!515 = !DILocation(line: 36, column: 3, scope: !511)
!516 = !DILocation(line: 36, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !510, file: !442, line: 36, column: 3)
!518 = !{!514, !514, i64 0}
!519 = !{!513, !514, i64 1540}
!520 = !DILocation(line: 38, column: 10, scope: !451)
!521 = !DILocation(line: 0, scope: !463)
!522 = !DILocation(line: 38, column: 47, scope: !523)
!523 = distinct !DILexicalBlock(scope: !463, file: !442, line: 38, column: 47)
!524 = !DILocation(line: 38, column: 47, scope: !463)
!525 = !{!"branch_weights", i32 2000, i32 1}
!526 = !DILocation(line: 39, column: 7, scope: !467)
!527 = !DILocation(line: 39, column: 34, scope: !467)
!528 = !DILocation(line: 39, column: 7, scope: !451)
!529 = !DILocation(line: 40, column: 12, scope: !466)
!530 = !DILocation(line: 0, scope: !465)
!531 = !DILocation(line: 40, column: 115, scope: !470)
!532 = !DILocation(line: 40, column: 115, scope: !465)
!533 = !DILocation(line: 42, column: 34, scope: !451)
!534 = !DILocation(line: 40, column: 115, scope: !469)
!535 = !DILocation(line: 0, scope: !469)
!536 = !DILocation(line: 42, column: 28, scope: !451)
!537 = !DILocation(line: 42, column: 61, scope: !451)
!538 = !DILocation(line: 42, column: 10, scope: !451)
!539 = !DILocation(line: 0, scope: !476)
!540 = !DILocation(line: 42, column: 96, scope: !479)
!541 = !DILocation(line: 42, column: 96, scope: !476)
!542 = !DILocation(line: 42, column: 96, scope: !478)
!543 = !DILocation(line: 0, scope: !478)
!544 = !DILocation(line: 43, column: 8, scope: !484)
!545 = !{!506, !506, i64 0}
!546 = !DILocation(line: 43, column: 7, scope: !451)
!547 = !DILocation(line: 44, column: 33, scope: !483)
!548 = !DILocation(line: 44, column: 12, scope: !483)
!549 = !DILocation(line: 0, scope: !482)
!550 = !DILocation(line: 44, column: 56, scope: !551)
!551 = distinct !DILexicalBlock(scope: !482, file: !442, line: 44, column: 56)
!552 = !DILocation(line: 44, column: 56, scope: !482)
!553 = !DILocation(line: 45, column: 52, scope: !483)
!554 = !DILocation(line: 45, column: 12, scope: !483)
!555 = !DILocation(line: 0, scope: !486)
!556 = !DILocation(line: 45, column: 61, scope: !557)
!557 = distinct !DILexicalBlock(scope: !486, file: !442, line: 45, column: 61)
!558 = !DILocation(line: 45, column: 61, scope: !486)
!559 = !DILocation(line: 46, column: 30, scope: !483)
!560 = !DILocation(line: 46, column: 36, scope: !483)
!561 = !DILocation(line: 46, column: 70, scope: !483)
!562 = !DILocation(line: 46, column: 12, scope: !483)
!563 = !DILocation(line: 0, scope: !488)
!564 = !DILocation(line: 46, column: 79, scope: !491)
!565 = !DILocation(line: 46, column: 79, scope: !488)
!566 = !DILocation(line: 46, column: 79, scope: !490)
!567 = !DILocation(line: 0, scope: !490)
!568 = !DILocation(line: 48, column: 10, scope: !451)
!569 = !DILocation(line: 0, scope: !494)
!570 = !DILocation(line: 48, column: 35, scope: !571)
!571 = distinct !DILexicalBlock(scope: !494, file: !442, line: 48, column: 35)
!572 = !DILocation(line: 48, column: 35, scope: !494)
!573 = !DILocation(line: 50, column: 3, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !442, line: 50, column: 3)
!575 = distinct !DILexicalBlock(scope: !576, file: !442, line: 50, column: 3)
!576 = distinct !DILexicalBlock(scope: !451, file: !442, line: 50, column: 3)
!577 = !DILocation(line: 50, column: 3, scope: !575)
!578 = !DILocation(line: 50, column: 3, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !442, line: 50, column: 3)
!580 = distinct !DILexicalBlock(scope: !574, file: !442, line: 50, column: 3)
!581 = !DILocation(line: 50, column: 3, scope: !580)
!582 = !DILocation(line: 50, column: 3, scope: !583)
!583 = distinct !DILexicalBlock(scope: !584, file: !442, line: 50, column: 3)
!584 = distinct !DILexicalBlock(scope: !579, file: !442, line: 50, column: 3)
!585 = !{!513, !506, i64 1544}
!586 = !DILocation(line: 50, column: 3, scope: !584)
!587 = !DILocation(line: 50, column: 3, scope: !588)
!588 = distinct !DILexicalBlock(scope: !583, file: !442, line: 50, column: 3)
!589 = !DILocation(line: 50, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !579, file: !442, line: 50, column: 3)
!591 = !DILocation(line: 50, column: 3, scope: !592)
!592 = distinct !DILexicalBlock(scope: !590, file: !442, line: 50, column: 3)
!593 = !DILocation(line: 50, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !442, line: 50, column: 3)
!595 = distinct !DILexicalBlock(scope: !592, file: !442, line: 50, column: 3)
!596 = !DILocation(line: 50, column: 3, scope: !595)
!597 = !DILocation(line: 50, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !594, file: !442, line: 50, column: 3)
!599 = !DILocation(line: 51, column: 1, scope: !451)
!600 = !DISubprogram(name: "PetscError", scope: !92, file: !92, line: 668, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!133, !109, !98, !197, !197, !98, !91, !197, null}
!603 = !{}
!604 = !DISubprogram(name: "PetscCommDuplicate", scope: !605, file: !605, line: 532, type: !606, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
!605 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!606 = !DISubroutineType(types: !607)
!607 = !{!98, !109, !608, !609}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!610 = !DISubprogram(name: "MPI_Comm_create_keyval", scope: !108, file: !108, line: 1282, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
!611 = !DISubroutineType(types: !612)
!612 = !{!98, !613, !616, !609, !111}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!98, !109, !98, !111, !111, !111, !609}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!98, !109, !98, !111, !111}
!619 = !DISubprogram(name: "MPI_Error_string", scope: !108, file: !108, line: 1357, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
!620 = !DISubroutineType(types: !621)
!621 = !{!98, !98, !112, !609}
!622 = !DISubprogram(name: "MPI_Comm_get_attr", scope: !108, file: !108, line: 1295, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
!623 = !DISubroutineType(types: !624)
!624 = !{!98, !109, !98, !111, !609}
!625 = distinct !DISubprogram(name: "PetscViewerASCIIOpen", scope: !442, file: !442, line: 217, type: !626, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{!133, !107, !197, !164}
!628 = !{!629, !630, !631, !632, !633, !641, !642, !643, !644, !645, !647, !651, !653, !655, !659, !662, !663, !665, !667, !670, !671, !676, !680, !682, !684, !686, !688, !692, !694, !698, !701, !702, !705, !708, !709, !713, !716, !717, !719}
!629 = !DILocalVariable(name: "comm", arg: 1, scope: !625, file: !442, line: 217, type: !107)
!630 = !DILocalVariable(name: "name", arg: 2, scope: !625, file: !442, line: 217, type: !197)
!631 = !DILocalVariable(name: "lab", arg: 3, scope: !625, file: !442, line: 217, type: !164)
!632 = !DILocalVariable(name: "ierr", scope: !625, file: !442, line: 219, type: !133)
!633 = !DILocalVariable(name: "vlink", scope: !625, file: !442, line: 220, type: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerLink", file: !361, line: 22, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscViewerLink_t", file: !361, line: 23, size: 128, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !636, file: !361, line: 24, baseType: !139, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !361, line: 25, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!641 = !DILocalVariable(name: "nv", scope: !625, file: !442, line: 220, type: !634)
!642 = !DILocalVariable(name: "flg", scope: !625, file: !442, line: 221, type: !206)
!643 = !DILocalVariable(name: "eq", scope: !625, file: !442, line: 221, type: !206)
!644 = !DILocalVariable(name: "len", scope: !625, file: !442, line: 222, type: !202)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !442, line: 225, type: !133)
!646 = distinct !DILexicalBlock(scope: !625, file: !442, line: 225, column: 33)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !442, line: 227, type: !133)
!648 = distinct !DILexicalBlock(scope: !649, file: !442, line: 227, column: 48)
!649 = distinct !DILexicalBlock(scope: !650, file: !442, line: 226, column: 13)
!650 = distinct !DILexicalBlock(scope: !625, file: !442, line: 226, column: 7)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !442, line: 228, type: !133)
!652 = distinct !DILexicalBlock(scope: !649, file: !442, line: 228, column: 52)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !442, line: 231, type: !133)
!654 = distinct !DILexicalBlock(scope: !625, file: !442, line: 231, column: 59)
!655 = !DILocalVariable(name: "_7_errorcode", scope: !656, file: !442, line: 233, type: !133)
!656 = distinct !DILexicalBlock(scope: !657, file: !442, line: 233, column: 104)
!657 = distinct !DILexicalBlock(scope: !658, file: !442, line: 232, column: 50)
!658 = distinct !DILexicalBlock(scope: !625, file: !442, line: 232, column: 7)
!659 = !DILocalVariable(name: "_7_errorstring", scope: !660, file: !442, line: 233, type: !471)
!660 = distinct !DILexicalBlock(scope: !661, file: !442, line: 233, column: 104)
!661 = distinct !DILexicalBlock(scope: !656, file: !442, line: 233, column: 104)
!662 = !DILocalVariable(name: "_7_resultlen", scope: !660, file: !442, line: 233, type: !116)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !442, line: 243, type: !133)
!664 = distinct !DILexicalBlock(scope: !625, file: !442, line: 243, column: 46)
!665 = !DILocalVariable(name: "_7_errorcode", scope: !666, file: !442, line: 245, type: !133)
!666 = distinct !DILexicalBlock(scope: !625, file: !442, line: 245, column: 88)
!667 = !DILocalVariable(name: "_7_errorstring", scope: !668, file: !442, line: 245, type: !471)
!668 = distinct !DILexicalBlock(scope: !669, file: !442, line: 245, column: 88)
!669 = distinct !DILexicalBlock(scope: !666, file: !442, line: 245, column: 88)
!670 = !DILocalVariable(name: "_7_resultlen", scope: !668, file: !442, line: 245, type: !116)
!671 = !DILocalVariable(name: "ierr__", scope: !672, file: !442, line: 248, type: !133)
!672 = distinct !DILexicalBlock(scope: !673, file: !442, line: 248, column: 90)
!673 = distinct !DILexicalBlock(scope: !674, file: !442, line: 247, column: 19)
!674 = distinct !DILexicalBlock(scope: !675, file: !442, line: 246, column: 12)
!675 = distinct !DILexicalBlock(scope: !625, file: !442, line: 246, column: 7)
!676 = !DILocalVariable(name: "ierr__", scope: !677, file: !442, line: 250, type: !133)
!677 = distinct !DILexicalBlock(scope: !678, file: !442, line: 250, column: 65)
!678 = distinct !DILexicalBlock(scope: !679, file: !442, line: 249, column: 15)
!679 = distinct !DILexicalBlock(scope: !673, file: !442, line: 249, column: 11)
!680 = !DILocalVariable(name: "ierr__", scope: !681, file: !442, line: 252, type: !133)
!681 = distinct !DILexicalBlock(scope: !678, file: !442, line: 252, column: 40)
!682 = !DILocalVariable(name: "ierr__", scope: !683, file: !442, line: 253, type: !133)
!683 = distinct !DILexicalBlock(scope: !678, file: !442, line: 253, column: 67)
!684 = !DILocalVariable(name: "ierr__", scope: !685, file: !442, line: 259, type: !133)
!685 = distinct !DILexicalBlock(scope: !625, file: !442, line: 259, column: 38)
