; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/telescope/telescope.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct.ompi_communicator_t = type opaque
%struct.ompi_group_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_op_t = type opaque
%struct._p_DM = type opaque
%struct._PC_Telescope = type { %struct._n_PetscSubcomm*, i32, %struct.ompi_communicator_t*, i32, %struct._p_KSP*, %struct._p_IS*, %struct._p_PetscSF*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, i32, i32, i32, i32, i8*, i32 (%struct._p_PC*, %struct._PC_Telescope*)*, i32 (%struct._p_PC*, %struct._PC_Telescope*, i32, %struct._p_Mat**)*, i32 (%struct._p_PC*, %struct._PC_Telescope*, %struct._p_Mat*)*, i32 (%struct._p_PC*)* }
%struct._n_PetscSubcomm = type { %struct.ompi_communicator_t*, %struct.ompi_communicator_t*, %struct.ompi_communicator_t*, i32, i32, i32*, i32, i8* }
%struct._p_KSP = type opaque
%struct._p_IS = type opaque
%struct._p_PetscSF = type opaque

!299 = !{!300, !301, !302, !303, !304, !305, !306}
!300 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!301 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!303 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!304 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !308, line: 6, baseType: !7, size: 32, elements: !309)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/telescope/telescope.h", directory: "/home/users/ndemeye/xSDK")
!309 = !{!310, !311, !312, !313}
!310 = !DIEnumerator(name: "TELESCOPE_DEFAULT", value: 0, isUnsigned: true)
!311 = !DIEnumerator(name: "TELESCOPE_DMDA", value: 1, isUnsigned: true)
!312 = !DIEnumerator(name: "TELESCOPE_DMPLEX", value: 2, isUnsigned: true)
!313 = !DIEnumerator(name: "TELESCOPE_COARSEDM", value: 3, isUnsigned: true)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 98, baseType: !85, size: 32, elements: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!316 = !{!317, !318, !319, !320}
!317 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!318 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!319 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!320 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 85, baseType: !85, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!324 = !DIEnumerator(name: "PC_LEFT", value: 0)
!325 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!326 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 395, baseType: !85, size: 32, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335}
!329 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!330 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!331 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!332 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!333 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!334 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!335 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !7, size: 32, elements: !337)
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!339 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!340 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!341 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!342 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!346 = !{!347, !351, !352, !85, !354, !357, !360, !363, !365, !397, !1349, !1350, !1352, !1426, !1494, !1495}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !348, line: 330, baseType: !349)
!348 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !348, line: 330, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !348, line: 331, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !348, line: 331, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !348, line: 338, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !348, line: 338, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !361, line: 46, baseType: !362)
!361 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!362 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Telescope_DMDACtx", file: !308, line: 36, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 29, size: 704, elements: !368)
!368 = !{!369, !374, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dmrepart", scope: !367, file: !308, line: 30, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !371, line: 14, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !371, line: 14, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "permutation", scope: !367, file: !308, line: 31, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !49, line: 16, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !378, line: 436, size: 23424, elements: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!379 = !{!380, !578, !1085, !1105, !1106, !1107, !1109, !1110, !1111, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1235, !1236, !1252, !1253, !1254, !1255, !1256, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1291, !1311, !1312, !1314, !1315, !1316, !1317, !1318, !1319, !1337, !1338}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !377, file: !378, line: 437, baseType: !381, size: 4480)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !382, line: 122, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !382, line: 73, size: 4480, elements: !384)
!384 = !{!385, !387, !435, !436, !438, !441, !442, !443, !444, !452, !453, !455, !459, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !475, !476, !477, !479, !480, !482, !484, !485, !486, !487, !488, !491, !493, !494, !495, !496, !497, !500, !502, !503, !504, !514, !516, !517, !521, !522, !568, !573, !575, !576, !577}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !383, file: !382, line: 74, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !85)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !383, file: !382, line: 75, baseType: !388, size: 448, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 448, elements: !433)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !382, line: 53, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 45, size: 448, elements: !391)
!391 = !{!392, !400, !408, !413, !417, !421, !428}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !390, file: !382, line: 46, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !397, !399}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !85)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !390, file: !382, line: 47, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!396, !397, !404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !405, line: 16, baseType: !406)
!405 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !405, line: 16, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !390, file: !382, line: 48, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!396, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !390, file: !382, line: 49, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!396, !397, !363, !397}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !390, file: !382, line: 50, baseType: !418, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!396, !397, !363, !412}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !390, file: !382, line: 51, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!396, !397, !363, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !390, file: !382, line: 52, baseType: !429, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!396, !397, !363, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!433 = !{!434}
!434 = !DISubrange(count: 1)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !383, file: !382, line: 76, baseType: !347, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !382, line: 77, baseType: !437, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !85)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !383, file: !382, line: 78, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !440)
!440 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !383, file: !382, line: 78, baseType: !439, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !383, file: !382, line: 78, baseType: !439, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !383, file: !382, line: 78, baseType: !439, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !382, line: 79, baseType: !445, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !448, line: 27, baseType: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !450, line: 43, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!451 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !383, file: !382, line: 80, baseType: !437, size: 32, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !383, file: !382, line: 81, baseType: !454, size: 32, offset: 992)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !85)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !383, file: !382, line: 82, baseType: !456, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !383, file: !382, line: 83, baseType: !460, size: 64, offset: 1088)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !383, file: !382, line: 84, baseType: !352, size: 64, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !383, file: !382, line: 85, baseType: !352, size: 64, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !383, file: !382, line: 86, baseType: !352, size: 64, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !383, file: !382, line: 87, baseType: !352, size: 64, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !383, file: !382, line: 88, baseType: !397, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !383, file: !382, line: 89, baseType: !445, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !382, line: 90, baseType: !352, size: 64, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !383, file: !382, line: 91, baseType: !352, size: 64, offset: 1600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !383, file: !382, line: 92, baseType: !437, size: 32, offset: 1664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !383, file: !382, line: 93, baseType: !351, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !383, file: !382, line: 94, baseType: !474, size: 64, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !446)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !383, file: !382, line: 95, baseType: !437, size: 32, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !383, file: !382, line: 95, baseType: !437, size: 32, offset: 1888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !383, file: !382, line: 96, baseType: !478, size: 64, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !383, file: !382, line: 96, baseType: !478, size: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !383, file: !382, line: 97, baseType: !481, size: 64, offset: 2048)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !383, file: !382, line: 97, baseType: !483, size: 64, offset: 2112)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !383, file: !382, line: 98, baseType: !437, size: 32, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !383, file: !382, line: 98, baseType: !437, size: 32, offset: 2208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !383, file: !382, line: 99, baseType: !478, size: 64, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !383, file: !382, line: 99, baseType: !478, size: 64, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !383, file: !382, line: 100, baseType: !489, size: 64, offset: 2368)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !440)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !383, file: !382, line: 100, baseType: !492, size: 64, offset: 2432)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !383, file: !382, line: 101, baseType: !437, size: 32, offset: 2496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !383, file: !382, line: 101, baseType: !437, size: 32, offset: 2528)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !383, file: !382, line: 102, baseType: !478, size: 64, offset: 2560)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !383, file: !382, line: 102, baseType: !478, size: 64, offset: 2624)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !383, file: !382, line: 103, baseType: !498, size: 64, offset: 2688)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !490)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !383, file: !382, line: 103, baseType: !501, size: 64, offset: 2752)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !383, file: !382, line: 104, baseType: !432, size: 64, offset: 2816)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !383, file: !382, line: 105, baseType: !437, size: 32, offset: 2880)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !383, file: !382, line: 106, baseType: !505, size: 128, offset: 2944)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 128, elements: !512)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !382, line: 64, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 61, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !508, file: !382, line: 62, baseType: !425, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !508, file: !382, line: 63, baseType: !351, size: 64, offset: 64)
!512 = !{!513}
!513 = !DISubrange(count: 2)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !383, file: !382, line: 107, baseType: !515, size: 64, offset: 3072)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 64, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !383, file: !382, line: 108, baseType: !351, size: 64, offset: 3136)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !383, file: !382, line: 109, baseType: !518, size: 64, offset: 3200)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!396, !351}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !383, file: !382, line: 111, baseType: !437, size: 32, offset: 3264)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !383, file: !382, line: 112, baseType: !523, size: 320, offset: 3328)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !566)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!396, !527, !397, !351}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !23, line: 108, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !23, line: 99, size: 640, elements: !530)
!530 = !{!531, !532, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !529, file: !23, line: 100, baseType: !437, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !23, line: 101, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !23, line: 82, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !23, line: 83, size: 768, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !544, !545, !546, !547, !549, !551, !552, !553}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !535, file: !23, line: 84, baseType: !352, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !535, file: !23, line: 85, baseType: !352, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !23, line: 86, baseType: !351, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !535, file: !23, line: 87, baseType: !456, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !535, file: !23, line: 88, baseType: !542, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !535, file: !23, line: 89, baseType: !353, size: 8, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !535, file: !23, line: 90, baseType: !352, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !535, file: !23, line: 91, baseType: !360, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !535, file: !23, line: 92, baseType: !548, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !23, line: 93, baseType: !550, size: 32, offset: 544)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !23, line: 81, baseType: !22)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !23, line: 94, baseType: !533, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !535, file: !23, line: 95, baseType: !352, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !535, file: !23, line: 96, baseType: !351, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !529, file: !23, line: 102, baseType: !352, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !529, file: !23, line: 102, baseType: !352, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !529, file: !23, line: 103, baseType: !352, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !529, file: !23, line: 104, baseType: !347, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !529, file: !23, line: 105, baseType: !548, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !529, file: !23, line: 105, baseType: !548, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !529, file: !23, line: 105, baseType: !548, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !529, file: !23, line: 106, baseType: !397, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !529, file: !23, line: 107, baseType: !563, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !23, line: 10, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !23, line: 10, flags: DIFlagFwdDecl)
!566 = !{!567}
!567 = !DISubrange(count: 5)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !383, file: !382, line: 113, baseType: !569, size: 320, offset: 3648)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 320, elements: !566)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!396, !397, !351}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !383, file: !382, line: 114, baseType: !574, size: 320, offset: 3968)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !566)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !383, file: !382, line: 115, baseType: !548, size: 32, offset: 4288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !383, file: !382, line: 120, baseType: !563, size: 64, offset: 4352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !383, file: !382, line: 121, baseType: !548, size: 32, offset: 4416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !377, file: !378, line: 437, baseType: !579, size: 9472, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 9472, elements: !433)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !378, line: 32, size: 9472, elements: !581)
!581 = !{!582, !591, !595, !596, !603, !607, !608, !609, !610, !611, !612, !613, !637, !641, !646, !652, !671, !676, !680, !681, !686, !691, !692, !697, !701, !705, !709, !713, !717, !718, !719, !720, !721, !725, !726, !731, !732, !733, !734, !735, !740, !747, !752, !756, !760, !764, !768, !769, !773, !774, !781, !786, !787, !788, !789, !851, !859, !860, !864, !865, !869, !870, !874, !879, !880, !884, !888, !895, !896, !897, !898, !899, !900, !905, !906, !910, !914, !918, !919, !920, !924, !934, !935, !939, !940, !944, !945, !949, !950, !955, !956, !960, !964, !965, !966, !967, !968, !969, !970, !974, !975, !976, !977, !978, !979, !983, !984, !985, !986, !987, !988, !989, !990, !994, !998, !999, !1000, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1014, !1015, !1016, !1021, !1025, !1026, !1030, !1031, !1032, !1033, !1059, !1063, !1064, !1065, !1066, !1067, !1071, !1072, !1073, !1074, !1075, !1079, !1083, !1084}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !580, file: !378, line: 34, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!396, !375, !437, !586, !437, !586, !588, !590}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !37)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !580, file: !378, line: 35, baseType: !592, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!396, !375, !437, !481, !483, !501}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !580, file: !378, line: 36, baseType: !592, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !580, file: !378, line: 37, baseType: !597, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!396, !375, !600, !600}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !73, line: 21, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !73, line: 21, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !580, file: !378, line: 38, baseType: !604, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!396, !375, !600, !600, !600}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !580, file: !378, line: 40, baseType: !597, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !580, file: !378, line: 41, baseType: !604, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !580, file: !378, line: 42, baseType: !597, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !580, file: !378, line: 43, baseType: !604, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !580, file: !378, line: 44, baseType: !597, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !580, file: !378, line: 46, baseType: !604, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !580, file: !378, line: 47, baseType: !614, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!396, !375, !617, !617, !621}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !618, line: 11, baseType: !619)
!618 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !618, line: 11, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !49, line: 1239, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 1226, size: 704, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !624, file: !49, line: 1227, baseType: !490, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !624, file: !49, line: 1228, baseType: !490, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !624, file: !49, line: 1229, baseType: !490, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !624, file: !49, line: 1230, baseType: !490, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !624, file: !49, line: 1231, baseType: !490, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !624, file: !49, line: 1232, baseType: !490, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !624, file: !49, line: 1233, baseType: !490, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !624, file: !49, line: 1234, baseType: !490, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !624, file: !49, line: 1236, baseType: !490, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !624, file: !49, line: 1237, baseType: !490, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !624, file: !49, line: 1238, baseType: !490, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !580, file: !378, line: 48, baseType: !638, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!396, !375, !617, !621}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !580, file: !378, line: 49, baseType: !642, size: 64, offset: 832)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!396, !375, !600, !490, !645, !490, !437, !437, !600}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !49, line: 1291, baseType: !48)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !580, file: !378, line: 50, baseType: !647, size: 64, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!396, !375, !650, !651}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !49, line: 238, baseType: !61)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !580, file: !378, line: 52, baseType: !653, size: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!396, !375, !656, !657}
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !49, line: 612, baseType: !67)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !49, line: 600, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 592, size: 640, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !659, file: !49, line: 593, baseType: !439, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !659, file: !49, line: 594, baseType: !439, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !659, file: !49, line: 594, baseType: !439, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !659, file: !49, line: 594, baseType: !439, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !659, file: !49, line: 595, baseType: !439, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !659, file: !49, line: 596, baseType: !439, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !659, file: !49, line: 597, baseType: !439, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !659, file: !49, line: 598, baseType: !439, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !659, file: !49, line: 598, baseType: !439, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !659, file: !49, line: 599, baseType: !439, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !580, file: !378, line: 53, baseType: !672, size: 64, offset: 1024)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!396, !375, !375, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !580, file: !378, line: 54, baseType: !677, size: 64, offset: 1088)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!396, !375, !600}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !580, file: !378, line: 55, baseType: !597, size: 64, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !580, file: !378, line: 56, baseType: !682, size: 64, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!396, !375, !685, !489}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !73, line: 155, baseType: !72)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !580, file: !378, line: 58, baseType: !687, size: 64, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!396, !375, !690}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !49, line: 424, baseType: !80)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !580, file: !378, line: 59, baseType: !687, size: 64, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !580, file: !378, line: 60, baseType: !693, size: 64, offset: 1408)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!396, !375, !696, !548}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !49, line: 469, baseType: !84)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !580, file: !378, line: 61, baseType: !698, size: 64, offset: 1472)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!396, !375}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !580, file: !378, line: 63, baseType: !702, size: 64, offset: 1536)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!396, !375, !437, !586, !499, !600, !600}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !580, file: !378, line: 64, baseType: !706, size: 64, offset: 1600)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!396, !375, !375, !617, !617, !621}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !580, file: !378, line: 65, baseType: !710, size: 64, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!396, !375, !375, !621}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !580, file: !378, line: 66, baseType: !714, size: 64, offset: 1728)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!396, !375, !375, !617, !621}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !580, file: !378, line: 67, baseType: !710, size: 64, offset: 1792)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !580, file: !378, line: 69, baseType: !698, size: 64, offset: 1856)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !580, file: !378, line: 70, baseType: !706, size: 64, offset: 1920)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !580, file: !378, line: 71, baseType: !714, size: 64, offset: 1984)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !580, file: !378, line: 72, baseType: !722, size: 64, offset: 2048)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!396, !375, !651}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !580, file: !378, line: 73, baseType: !698, size: 64, offset: 2112)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !580, file: !378, line: 75, baseType: !727, size: 64, offset: 2176)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!396, !375, !730, !651}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !49, line: 563, baseType: !115)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !580, file: !378, line: 76, baseType: !597, size: 64, offset: 2240)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !580, file: !378, line: 77, baseType: !597, size: 64, offset: 2304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !580, file: !378, line: 78, baseType: !614, size: 64, offset: 2368)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !580, file: !378, line: 79, baseType: !638, size: 64, offset: 2432)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !580, file: !378, line: 81, baseType: !736, size: 64, offset: 2496)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!396, !375, !499, !375, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !49, line: 285, baseType: !120)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !580, file: !378, line: 82, baseType: !741, size: 64, offset: 2560)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!396, !375, !437, !744, !744, !650, !746}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !580, file: !378, line: 83, baseType: !748, size: 64, offset: 2624)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!396, !375, !437, !751, !437}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !580, file: !378, line: 84, baseType: !753, size: 64, offset: 2688)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!396, !375, !437, !586, !437, !586, !498}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !580, file: !378, line: 85, baseType: !757, size: 64, offset: 2752)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!396, !375, !375, !739}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !580, file: !378, line: 87, baseType: !761, size: 64, offset: 2816)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!396, !375, !600, !481}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !580, file: !378, line: 88, baseType: !765, size: 64, offset: 2880)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!396, !375, !499}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !580, file: !378, line: 89, baseType: !765, size: 64, offset: 2944)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !580, file: !378, line: 90, baseType: !770, size: 64, offset: 3008)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!396, !375, !600, !590}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !580, file: !378, line: 91, baseType: !702, size: 64, offset: 3072)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !580, file: !378, line: 93, baseType: !775, size: 64, offset: 3136)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!396, !375, !778}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !580, file: !378, line: 94, baseType: !782, size: 64, offset: 3200)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!396, !375, !437, !548, !548, !481, !785, !785, !675}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !580, file: !378, line: 95, baseType: !782, size: 64, offset: 3264)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !580, file: !378, line: 96, baseType: !782, size: 64, offset: 3328)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !580, file: !378, line: 97, baseType: !782, size: 64, offset: 3392)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !580, file: !378, line: 99, baseType: !790, size: 64, offset: 3456)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!396, !375, !793, !796}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !618, line: 51, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !618, line: 51, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !49, line: 1378, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !378, line: 609, size: 6208, elements: !799)
!799 = !{!800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !820, !827, !828, !829, !830, !831, !832, !833, !834, !838, !839, !840, !841, !842, !844, !845, !846, !847, !848, !849, !850}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !798, file: !378, line: 610, baseType: !381, size: 4480)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !798, file: !378, line: 610, baseType: !802, size: 32, offset: 4480)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 32, elements: !433)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !798, file: !378, line: 611, baseType: !437, size: 32, offset: 4512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !798, file: !378, line: 611, baseType: !437, size: 32, offset: 4544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !798, file: !378, line: 611, baseType: !437, size: 32, offset: 4576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !798, file: !378, line: 612, baseType: !437, size: 32, offset: 4608)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !798, file: !378, line: 613, baseType: !437, size: 32, offset: 4640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !798, file: !378, line: 614, baseType: !481, size: 64, offset: 4672)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !798, file: !378, line: 615, baseType: !483, size: 64, offset: 4736)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !798, file: !378, line: 616, baseType: !751, size: 64, offset: 4800)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !798, file: !378, line: 617, baseType: !481, size: 64, offset: 4864)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !798, file: !378, line: 618, baseType: !813, size: 64, offset: 4928)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !378, line: 602, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 598, size: 128, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !815, file: !378, line: 599, baseType: !437, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !815, file: !378, line: 600, baseType: !437, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !815, file: !378, line: 601, baseType: !498, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !798, file: !378, line: 619, baseType: !821, size: 64, offset: 4992)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !378, line: 607, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 604, size: 128, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !823, file: !378, line: 605, baseType: !437, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !823, file: !378, line: 606, baseType: !498, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !798, file: !378, line: 620, baseType: !498, size: 64, offset: 5056)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !798, file: !378, line: 621, baseType: !490, size: 64, offset: 5120)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !798, file: !378, line: 622, baseType: !490, size: 64, offset: 5184)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !798, file: !378, line: 623, baseType: !600, size: 64, offset: 5248)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !798, file: !378, line: 623, baseType: !600, size: 64, offset: 5312)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !798, file: !378, line: 623, baseType: !600, size: 64, offset: 5376)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !798, file: !378, line: 624, baseType: !548, size: 32, offset: 5440)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !798, file: !378, line: 625, baseType: !835, size: 64, offset: 5504)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!396}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !798, file: !378, line: 626, baseType: !351, size: 64, offset: 5568)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !798, file: !378, line: 627, baseType: !600, size: 64, offset: 5632)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !798, file: !378, line: 628, baseType: !437, size: 32, offset: 5696)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !798, file: !378, line: 629, baseType: !363, size: 64, offset: 5760)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !798, file: !378, line: 630, baseType: !843, size: 32, offset: 5824)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !127, line: 213, baseType: !126)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !798, file: !378, line: 631, baseType: !437, size: 32, offset: 5856)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !798, file: !378, line: 631, baseType: !437, size: 32, offset: 5888)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !798, file: !378, line: 632, baseType: !548, size: 32, offset: 5920)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !798, file: !378, line: 633, baseType: !548, size: 32, offset: 5952)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !798, file: !378, line: 634, baseType: !425, size: 64, offset: 6016)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !798, file: !378, line: 634, baseType: !351, size: 64, offset: 6080)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !798, file: !378, line: 635, baseType: !445, size: 64, offset: 6144)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !580, file: !378, line: 100, baseType: !852, size: 64, offset: 3520)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!396, !375, !437, !437, !855, !858}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !127, line: 215, baseType: !857)
!857 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !580, file: !378, line: 101, baseType: !698, size: 64, offset: 3584)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !580, file: !378, line: 102, baseType: !861, size: 64, offset: 3648)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!396, !375, !617, !617, !651}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !580, file: !378, line: 103, baseType: !583, size: 64, offset: 3712)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !580, file: !378, line: 105, baseType: !866, size: 64, offset: 3776)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!396, !375, !617, !617, !650, !651}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !580, file: !378, line: 106, baseType: !698, size: 64, offset: 3840)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !580, file: !378, line: 107, baseType: !871, size: 64, offset: 3904)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!396, !375, !404}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !580, file: !378, line: 108, baseType: !875, size: 64, offset: 3968)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!396, !375, !878, !650, !651}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !49, line: 25, baseType: !363)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !580, file: !378, line: 109, baseType: !835, size: 64, offset: 4032)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !580, file: !378, line: 111, baseType: !881, size: 64, offset: 4096)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!396, !375, !375, !375, !490, !375}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !580, file: !378, line: 112, baseType: !885, size: 64, offset: 4160)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!396, !375, !375, !375, !375}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !580, file: !378, line: 113, baseType: !889, size: 64, offset: 4224)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!396, !375, !892, !892}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !618, line: 30, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !618, line: 30, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !580, file: !378, line: 114, baseType: !583, size: 64, offset: 4288)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !580, file: !378, line: 115, baseType: !702, size: 64, offset: 4352)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !580, file: !378, line: 117, baseType: !761, size: 64, offset: 4416)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !580, file: !378, line: 118, baseType: !761, size: 64, offset: 4480)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !580, file: !378, line: 119, baseType: !875, size: 64, offset: 4544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !580, file: !378, line: 120, baseType: !901, size: 64, offset: 4608)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!396, !375, !904, !675}
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !49, line: 1675, baseType: !131)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !580, file: !378, line: 121, baseType: !835, size: 64, offset: 4672)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !580, file: !378, line: 123, baseType: !907, size: 64, offset: 4736)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!396, !375, !437, !351}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !580, file: !378, line: 124, baseType: !911, size: 64, offset: 4800)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!396, !375, !796, !600, !351}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !580, file: !378, line: 125, baseType: !915, size: 64, offset: 4864)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!396, !527, !375}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !580, file: !378, line: 126, baseType: !597, size: 64, offset: 4928)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !580, file: !378, line: 127, baseType: !597, size: 64, offset: 4992)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !580, file: !378, line: 129, baseType: !921, size: 64, offset: 5056)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!396, !375, !751}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !580, file: !378, line: 130, baseType: !925, size: 64, offset: 5120)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!396, !375, !928, !928}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !73, line: 654, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !73, line: 653, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !930, file: !73, line: 653, baseType: !437, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !930, file: !73, line: 653, baseType: !600, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !580, file: !378, line: 131, baseType: !925, size: 64, offset: 5184)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !580, file: !378, line: 132, baseType: !936, size: 64, offset: 5248)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!396, !375, !481, !481, !481}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !580, file: !378, line: 133, baseType: !871, size: 64, offset: 5312)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !580, file: !378, line: 135, baseType: !941, size: 64, offset: 5376)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!396, !375, !490, !675}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !580, file: !378, line: 136, baseType: !941, size: 64, offset: 5440)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !580, file: !378, line: 137, baseType: !946, size: 64, offset: 5504)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!396, !375, !675}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !580, file: !378, line: 138, baseType: !583, size: 64, offset: 5568)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !580, file: !378, line: 139, baseType: !951, size: 64, offset: 5632)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!396, !375, !954, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !580, file: !378, line: 141, baseType: !835, size: 64, offset: 5696)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !580, file: !378, line: 142, baseType: !957, size: 64, offset: 5760)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!396, !375, !375, !490, !375}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !580, file: !378, line: 143, baseType: !961, size: 64, offset: 5824)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!396, !375, !375, !375}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !580, file: !378, line: 144, baseType: !835, size: 64, offset: 5888)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !580, file: !378, line: 145, baseType: !957, size: 64, offset: 5952)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !580, file: !378, line: 147, baseType: !961, size: 64, offset: 6016)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !580, file: !378, line: 148, baseType: !835, size: 64, offset: 6080)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !580, file: !378, line: 149, baseType: !957, size: 64, offset: 6144)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !580, file: !378, line: 150, baseType: !961, size: 64, offset: 6208)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !580, file: !378, line: 151, baseType: !971, size: 64, offset: 6272)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!396, !375, !548}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !580, file: !378, line: 153, baseType: !698, size: 64, offset: 6336)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !580, file: !378, line: 154, baseType: !698, size: 64, offset: 6400)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !580, file: !378, line: 155, baseType: !698, size: 64, offset: 6464)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !580, file: !378, line: 156, baseType: !698, size: 64, offset: 6528)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !580, file: !378, line: 157, baseType: !871, size: 64, offset: 6592)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !580, file: !378, line: 159, baseType: !980, size: 64, offset: 6656)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!396, !375, !437, !588}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !580, file: !378, line: 160, baseType: !698, size: 64, offset: 6720)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !580, file: !378, line: 161, baseType: !698, size: 64, offset: 6784)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !580, file: !378, line: 162, baseType: !698, size: 64, offset: 6848)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !580, file: !378, line: 163, baseType: !698, size: 64, offset: 6912)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !580, file: !378, line: 165, baseType: !961, size: 64, offset: 6976)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !580, file: !378, line: 166, baseType: !961, size: 64, offset: 7040)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !580, file: !378, line: 167, baseType: !761, size: 64, offset: 7104)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !580, file: !378, line: 168, baseType: !991, size: 64, offset: 7168)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!396, !375, !600, !437}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !580, file: !378, line: 169, baseType: !995, size: 64, offset: 7232)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!396, !375, !675, !481}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !580, file: !378, line: 171, baseType: !722, size: 64, offset: 7296)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !580, file: !378, line: 172, baseType: !698, size: 64, offset: 7360)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !580, file: !378, line: 173, baseType: !1001, size: 64, offset: 7424)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!396, !375, !481, !785}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !580, file: !378, line: 174, baseType: !861, size: 64, offset: 7488)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !580, file: !378, line: 175, baseType: !861, size: 64, offset: 7552)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !580, file: !378, line: 177, baseType: !597, size: 64, offset: 7616)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !580, file: !378, line: 178, baseType: !647, size: 64, offset: 7680)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !580, file: !378, line: 179, baseType: !597, size: 64, offset: 7744)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !580, file: !378, line: 180, baseType: !604, size: 64, offset: 7808)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !580, file: !378, line: 181, baseType: !1011, size: 64, offset: 7872)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!396, !375, !347, !650, !651}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !580, file: !378, line: 183, baseType: !921, size: 64, offset: 7936)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !580, file: !378, line: 184, baseType: !682, size: 64, offset: 8000)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !580, file: !378, line: 185, baseType: !1017, size: 64, offset: 8064)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!396, !375, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !580, file: !378, line: 186, baseType: !1022, size: 64, offset: 8128)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!396, !375, !437, !586, !498}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !580, file: !378, line: 187, baseType: !741, size: 64, offset: 8192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !580, file: !378, line: 189, baseType: !1027, size: 64, offset: 8256)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!396, !375, !437, !437, !481, !588}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !580, file: !378, line: 190, baseType: !835, size: 64, offset: 8320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !580, file: !378, line: 191, baseType: !957, size: 64, offset: 8384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !580, file: !378, line: 192, baseType: !961, size: 64, offset: 8448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !580, file: !378, line: 193, baseType: !1034, size: 64, offset: 8512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!396, !375, !793, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !49, line: 1401, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !378, line: 660, size: 5312, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1039, file: !378, line: 661, baseType: !381, size: 4480)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1039, file: !378, line: 661, baseType: !802, size: 32, offset: 4480)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1039, file: !378, line: 662, baseType: !437, size: 32, offset: 4512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1039, file: !378, line: 662, baseType: !437, size: 32, offset: 4544)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1039, file: !378, line: 662, baseType: !437, size: 32, offset: 4576)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1039, file: !378, line: 663, baseType: !437, size: 32, offset: 4608)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1039, file: !378, line: 664, baseType: !437, size: 32, offset: 4640)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1039, file: !378, line: 665, baseType: !481, size: 64, offset: 4672)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1039, file: !378, line: 666, baseType: !481, size: 64, offset: 4736)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1039, file: !378, line: 667, baseType: !437, size: 32, offset: 4800)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1039, file: !378, line: 668, baseType: !843, size: 32, offset: 4832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1039, file: !378, line: 670, baseType: !481, size: 64, offset: 4864)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1039, file: !378, line: 670, baseType: !481, size: 64, offset: 4928)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1039, file: !378, line: 671, baseType: !481, size: 64, offset: 4992)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1039, file: !378, line: 672, baseType: !481, size: 64, offset: 5056)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1039, file: !378, line: 673, baseType: !481, size: 64, offset: 5120)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1039, file: !378, line: 674, baseType: !437, size: 32, offset: 5184)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1039, file: !378, line: 675, baseType: !481, size: 64, offset: 5248)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !580, file: !378, line: 195, baseType: !1060, size: 64, offset: 8576)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!396, !1037, !375, !375}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !580, file: !378, line: 196, baseType: !1060, size: 64, offset: 8640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !580, file: !378, line: 197, baseType: !835, size: 64, offset: 8704)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !580, file: !378, line: 198, baseType: !957, size: 64, offset: 8768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !580, file: !378, line: 199, baseType: !961, size: 64, offset: 8832)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !580, file: !378, line: 201, baseType: !1068, size: 64, offset: 8896)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!396, !375, !437, !437}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !580, file: !378, line: 202, baseType: !736, size: 64, offset: 8960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !580, file: !378, line: 203, baseType: !604, size: 64, offset: 9024)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !580, file: !378, line: 204, baseType: !790, size: 64, offset: 9088)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !580, file: !378, line: 205, baseType: !921, size: 64, offset: 9152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !580, file: !378, line: 206, baseType: !1076, size: 64, offset: 9216)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!396, !347, !375, !437, !650, !651}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !580, file: !378, line: 208, baseType: !1080, size: 64, offset: 9280)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!396, !437, !746}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !580, file: !378, line: 209, baseType: !961, size: 64, offset: 9344)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !580, file: !378, line: 210, baseType: !753, size: 64, offset: 9408)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !377, file: !378, line: 438, baseType: !1086, size: 64, offset: 13952)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !618, line: 60, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !127, line: 240, size: 640, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1088, file: !127, line: 241, baseType: !347, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1088, file: !127, line: 242, baseType: !454, size: 32, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1088, file: !127, line: 243, baseType: !437, size: 32, offset: 96)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1088, file: !127, line: 243, baseType: !437, size: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1088, file: !127, line: 244, baseType: !437, size: 32, offset: 160)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1088, file: !127, line: 244, baseType: !437, size: 32, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1088, file: !127, line: 245, baseType: !481, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1088, file: !127, line: 246, baseType: !548, size: 32, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1088, file: !127, line: 247, baseType: !437, size: 32, offset: 352)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1088, file: !127, line: 251, baseType: !437, size: 32, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1088, file: !127, line: 252, baseType: !892, size: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1088, file: !127, line: 253, baseType: !548, size: 32, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1088, file: !127, line: 254, baseType: !437, size: 32, offset: 544)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1088, file: !127, line: 254, baseType: !437, size: 32, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1088, file: !127, line: 255, baseType: !437, size: 32, offset: 608)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !377, file: !378, line: 438, baseType: !1086, size: 64, offset: 14016)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !377, file: !378, line: 439, baseType: !351, size: 64, offset: 14080)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !377, file: !378, line: 440, baseType: !1108, size: 32, offset: 14144)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !49, line: 161, baseType: !276)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !377, file: !378, line: 441, baseType: !548, size: 32, offset: 14176)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !377, file: !378, line: 442, baseType: !548, size: 32, offset: 14208)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !377, file: !378, line: 443, baseType: !1112, size: 448, offset: 14272)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 448, elements: !1114)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !49, line: 1159, baseType: !363)
!1114 = !{!1115}
!1115 = !DISubrange(count: 7)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !377, file: !378, line: 444, baseType: !548, size: 32, offset: 14720)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !377, file: !378, line: 445, baseType: !548, size: 32, offset: 14752)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !377, file: !378, line: 446, baseType: !437, size: 32, offset: 14784)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !377, file: !378, line: 447, baseType: !474, size: 64, offset: 14848)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !377, file: !378, line: 448, baseType: !474, size: 64, offset: 14912)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !377, file: !378, line: 449, baseType: !658, size: 640, offset: 14976)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !377, file: !378, line: 450, baseType: !590, size: 32, offset: 15616)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !377, file: !378, line: 451, baseType: !1124, size: 2880, offset: 15680)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !378, line: 318, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !378, line: 319, size: 2880, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1133, !1146, !1147, !1152, !1157, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1172, !1173, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1205, !1206, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1229, !1230, !1231, !1232, !1233}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1125, file: !378, line: 320, baseType: !437, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1125, file: !378, line: 321, baseType: !437, size: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1125, file: !378, line: 322, baseType: !437, size: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1125, file: !378, line: 323, baseType: !437, size: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1125, file: !378, line: 324, baseType: !437, size: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1125, file: !378, line: 325, baseType: !437, size: 32, offset: 160)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1125, file: !378, line: 326, baseType: !1134, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !378, line: 293, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !378, line: 295, size: 448, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1136, file: !378, line: 296, baseType: !1134, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1136, file: !378, line: 297, baseType: !498, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1136, file: !378, line: 297, baseType: !498, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1136, file: !378, line: 298, baseType: !481, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1136, file: !378, line: 298, baseType: !481, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1136, file: !378, line: 299, baseType: !437, size: 32, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1136, file: !378, line: 300, baseType: !437, size: 32, offset: 352)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1136, file: !378, line: 301, baseType: !437, size: 32, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1125, file: !378, line: 326, baseType: !1134, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1125, file: !378, line: 328, baseType: !1148, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!396, !375, !1151, !481}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1125, file: !378, line: 329, baseType: !1153, size: 64, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!396, !1151, !1156, !483, !483, !501, !481}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1125, file: !378, line: 330, baseType: !1158, size: 64, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!396, !1151}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1125, file: !378, line: 331, baseType: !1158, size: 64, offset: 512)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1125, file: !378, line: 334, baseType: !347, size: 64, offset: 576)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1125, file: !378, line: 335, baseType: !454, size: 32, offset: 640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1125, file: !378, line: 335, baseType: !454, size: 32, offset: 672)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1125, file: !378, line: 336, baseType: !454, size: 32, offset: 704)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1125, file: !378, line: 336, baseType: !454, size: 32, offset: 736)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1125, file: !378, line: 337, baseType: !1168, size: 64, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !348, line: 339, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !348, line: 339, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1125, file: !378, line: 338, baseType: !1168, size: 64, offset: 832)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1125, file: !378, line: 339, baseType: !1174, size: 64, offset: 896)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !348, line: 341, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !348, line: 351, size: 192, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1176, file: !348, line: 354, baseType: !85, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1176, file: !348, line: 355, baseType: !85, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1176, file: !348, line: 356, baseType: !85, size: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1176, file: !348, line: 361, baseType: !85, size: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1176, file: !348, line: 362, baseType: !360, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1125, file: !378, line: 340, baseType: !437, size: 32, offset: 960)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1125, file: !378, line: 340, baseType: !437, size: 32, offset: 992)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1125, file: !378, line: 341, baseType: !498, size: 64, offset: 1024)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1125, file: !378, line: 342, baseType: !481, size: 64, offset: 1088)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1125, file: !378, line: 343, baseType: !501, size: 64, offset: 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1125, file: !378, line: 344, baseType: !483, size: 64, offset: 1216)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1125, file: !378, line: 345, baseType: !437, size: 32, offset: 1280)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1125, file: !378, line: 346, baseType: !1156, size: 64, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1125, file: !378, line: 347, baseType: !548, size: 32, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1125, file: !378, line: 348, baseType: !437, size: 32, offset: 1440)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1125, file: !378, line: 351, baseType: !548, size: 32, offset: 1472)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1125, file: !378, line: 352, baseType: !548, size: 32, offset: 1504)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1125, file: !378, line: 353, baseType: !454, size: 32, offset: 1536)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1125, file: !378, line: 354, baseType: !454, size: 32, offset: 1568)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1125, file: !378, line: 355, baseType: !1156, size: 64, offset: 1600)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1125, file: !378, line: 356, baseType: !1156, size: 64, offset: 1664)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1125, file: !378, line: 357, baseType: !1200, size: 64, offset: 1728)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !378, line: 310, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 308, size: 32, elements: !1203)
!1203 = !{!1204}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1202, file: !378, line: 309, baseType: !437, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1125, file: !378, line: 357, baseType: !1200, size: 64, offset: 1792)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1125, file: !378, line: 358, baseType: !1207, size: 64, offset: 1856)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !378, line: 316, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 312, size: 128, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1209, file: !378, line: 313, baseType: !351, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1209, file: !378, line: 314, baseType: !437, size: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1209, file: !378, line: 315, baseType: !353, size: 8, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1125, file: !378, line: 359, baseType: !1207, size: 64, offset: 1920)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1125, file: !378, line: 360, baseType: !1207, size: 64, offset: 1984)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1125, file: !378, line: 361, baseType: !437, size: 32, offset: 2048)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1125, file: !378, line: 362, baseType: !454, size: 32, offset: 2080)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1125, file: !378, line: 363, baseType: !437, size: 32, offset: 2112)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1125, file: !378, line: 364, baseType: !1156, size: 64, offset: 2176)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1125, file: !378, line: 365, baseType: !1174, size: 64, offset: 2240)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1125, file: !378, line: 366, baseType: !454, size: 32, offset: 2304)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1125, file: !378, line: 367, baseType: !454, size: 32, offset: 2336)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1125, file: !378, line: 368, baseType: !1168, size: 64, offset: 2368)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1125, file: !378, line: 369, baseType: !1168, size: 64, offset: 2432)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1125, file: !378, line: 370, baseType: !1226, size: 64, offset: 2496)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1125, file: !378, line: 371, baseType: !1226, size: 64, offset: 2560)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1125, file: !378, line: 372, baseType: !1226, size: 64, offset: 2624)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1125, file: !378, line: 373, baseType: !354, size: 64, offset: 2688)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1125, file: !378, line: 374, baseType: !360, size: 64, offset: 2752)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1125, file: !378, line: 375, baseType: !1234, size: 64, offset: 2816)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !377, file: !378, line: 451, baseType: !1124, size: 2880, offset: 18560)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !377, file: !378, line: 452, baseType: !1237, size: 64, offset: 21440)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !49, line: 1723, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !378, line: 681, size: 4864, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1251}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1239, file: !378, line: 682, baseType: !381, size: 4480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1239, file: !378, line: 682, baseType: !802, size: 32, offset: 4480)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1239, file: !378, line: 683, baseType: !548, size: 32, offset: 4512)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1239, file: !378, line: 684, baseType: !437, size: 32, offset: 4544)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1239, file: !378, line: 685, baseType: !954, size: 64, offset: 4608)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1239, file: !378, line: 686, baseType: !498, size: 64, offset: 4672)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1239, file: !378, line: 687, baseType: !1248, size: 64, offset: 4736)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!396, !1237, !600, !351}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1239, file: !378, line: 688, baseType: !351, size: 64, offset: 4800)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !377, file: !378, line: 453, baseType: !1237, size: 64, offset: 21504)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !377, file: !378, line: 454, baseType: !1237, size: 64, offset: 21568)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !377, file: !378, line: 455, baseType: !437, size: 32, offset: 21632)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !377, file: !378, line: 456, baseType: !548, size: 32, offset: 21664)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !377, file: !378, line: 457, baseType: !1257, size: 320, offset: 21696)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !378, line: 399, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 394, size: 320, elements: !1259)
!1259 = !{!1260, !1261, !1265, !1266}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1258, file: !378, line: 395, baseType: !437, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1258, file: !378, line: 396, baseType: !1262, size: 128, offset: 32)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !1263)
!1263 = !{!1264}
