; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/pheap.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/pheap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._PetscHeap = type { i32, i32, i32, %struct.HeapNode* }
%struct.HeapNode = type { i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct._p_PetscViewer = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/pheap.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !15, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 663, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!17 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 81, baseType: !5, size: 32, elements: !37)
!36 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!44 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!45 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!46 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!48 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!49 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!50 = !{!51, !54, !58, !59, !62, !260, !118}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 46, baseType: !53)
!52 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !55, line: 330, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !55, line: 330, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !65, line: 73, size: 4480, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !70, !116, !117, !119, !122, !123, !124, !125, !133, !134, !136, !140, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !161, !162, !164, !166, !167, !168, !169, !170, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !196, !198, !199, !203, !204, !250, !255, !257, !258, !259}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !64, file: !65, line: 74, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !69)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !64, file: !65, line: 75, baseType: !71, size: 448, offset: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 448, elements: !114)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !65, line: 53, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 45, size: 448, elements: !74)
!74 = !{!75, !81, !89, !94, !98, !102, !109}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !73, file: !65, line: 46, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !62, !80}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !69)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !73, file: !65, line: 47, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!79, !62, !85}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !86, line: 16, baseType: !87)
!86 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !86, line: 16, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !73, file: !65, line: 48, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!79, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !73, file: !65, line: 49, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!79, !62, !59, !62}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !73, file: !65, line: 50, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!79, !62, !59, !93}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !73, file: !65, line: 51, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!79, !62, !59, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !73, file: !65, line: 52, baseType: !110, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!79, !62, !59, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !64, file: !65, line: 76, baseType: !54, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !65, line: 77, baseType: !118, size: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !69)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !64, file: !65, line: 78, baseType: !120, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !121)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !64, file: !65, line: 78, baseType: !120, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !64, file: !65, line: 78, baseType: !120, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !64, file: !65, line: 78, baseType: !120, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !65, line: 79, baseType: !126, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !129, line: 27, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !64, file: !65, line: 80, baseType: !118, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !64, file: !65, line: 81, baseType: !135, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !69)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !64, file: !65, line: 82, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !64, file: !65, line: 83, baseType: !141, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !64, file: !65, line: 84, baseType: !145, size: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !64, file: !65, line: 85, baseType: !145, size: 64, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !64, file: !65, line: 86, baseType: !145, size: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !64, file: !65, line: 87, baseType: !145, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !64, file: !65, line: 88, baseType: !62, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !64, file: !65, line: 89, baseType: !126, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !65, line: 90, baseType: !145, size: 64, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !64, file: !65, line: 91, baseType: !145, size: 64, offset: 1600)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !64, file: !65, line: 92, baseType: !118, size: 32, offset: 1664)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !64, file: !65, line: 93, baseType: !58, size: 64, offset: 1728)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !64, file: !65, line: 94, baseType: !156, size: 64, offset: 1792)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !127)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !64, file: !65, line: 95, baseType: !118, size: 32, offset: 1856)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !64, file: !65, line: 95, baseType: !118, size: 32, offset: 1888)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !64, file: !65, line: 96, baseType: !160, size: 64, offset: 1920)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !64, file: !65, line: 96, baseType: !160, size: 64, offset: 1984)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !64, file: !65, line: 97, baseType: !163, size: 64, offset: 2048)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !64, file: !65, line: 97, baseType: !165, size: 64, offset: 2112)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !64, file: !65, line: 98, baseType: !118, size: 32, offset: 2176)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !64, file: !65, line: 98, baseType: !118, size: 32, offset: 2208)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !64, file: !65, line: 99, baseType: !160, size: 64, offset: 2240)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !64, file: !65, line: 99, baseType: !160, size: 64, offset: 2304)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !64, file: !65, line: 100, baseType: !171, size: 64, offset: 2368)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !121)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !64, file: !65, line: 100, baseType: !174, size: 64, offset: 2432)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !64, file: !65, line: 101, baseType: !118, size: 32, offset: 2496)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !64, file: !65, line: 101, baseType: !118, size: 32, offset: 2528)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !64, file: !65, line: 102, baseType: !160, size: 64, offset: 2560)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !64, file: !65, line: 102, baseType: !160, size: 64, offset: 2624)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !64, file: !65, line: 103, baseType: !180, size: 64, offset: 2688)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !172)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !64, file: !65, line: 103, baseType: !183, size: 64, offset: 2752)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !64, file: !65, line: 104, baseType: !113, size: 64, offset: 2816)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !64, file: !65, line: 105, baseType: !118, size: 32, offset: 2880)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !64, file: !65, line: 106, baseType: !187, size: 128, offset: 2944)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !194)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !65, line: 64, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 61, size: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !190, file: !65, line: 62, baseType: !106, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !190, file: !65, line: 63, baseType: !58, size: 64, offset: 64)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !64, file: !65, line: 107, baseType: !197, size: 64, offset: 3072)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !194)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !64, file: !65, line: 108, baseType: !58, size: 64, offset: 3136)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !64, file: !65, line: 109, baseType: !200, size: 64, offset: 3200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!79, !58}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !64, file: !65, line: 111, baseType: !118, size: 32, offset: 3264)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !64, file: !65, line: 112, baseType: !205, size: 320, offset: 3328)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 320, elements: !248)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!79, !209, !62, !58}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !36, line: 108, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !36, line: 99, size: 640, elements: !212)
!212 = !{!213, !214, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !211, file: !36, line: 100, baseType: !118, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !36, line: 101, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !36, line: 82, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !36, line: 83, size: 768, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !226, !227, !228, !229, !231, !233, !234, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !217, file: !36, line: 84, baseType: !145, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !217, file: !36, line: 85, baseType: !145, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !36, line: 86, baseType: !58, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !217, file: !36, line: 87, baseType: !137, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !217, file: !36, line: 88, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !217, file: !36, line: 89, baseType: !61, size: 8, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !217, file: !36, line: 90, baseType: !145, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !217, file: !36, line: 91, baseType: !51, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !217, file: !36, line: 92, baseType: !230, size: 32, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !36, line: 93, baseType: !232, size: 32, offset: 544)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !36, line: 81, baseType: !35)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !36, line: 94, baseType: !215, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !217, file: !36, line: 95, baseType: !145, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !217, file: !36, line: 96, baseType: !58, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !211, file: !36, line: 102, baseType: !145, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !211, file: !36, line: 102, baseType: !145, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !211, file: !36, line: 103, baseType: !145, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !211, file: !36, line: 104, baseType: !54, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !211, file: !36, line: 105, baseType: !230, size: 32, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !211, file: !36, line: 105, baseType: !230, size: 32, offset: 416)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !211, file: !36, line: 105, baseType: !230, size: 32, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !211, file: !36, line: 106, baseType: !62, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !211, file: !36, line: 107, baseType: !245, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !36, line: 10, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !36, line: 10, flags: DIFlagFwdDecl)
!248 = !{!249}
!249 = !DISubrange(count: 5)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !64, file: !65, line: 113, baseType: !251, size: 320, offset: 3648)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 320, elements: !248)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!79, !62, !58}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !64, file: !65, line: 114, baseType: !256, size: 320, offset: 3968)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 320, elements: !248)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !64, file: !65, line: 115, baseType: !230, size: 32, offset: 4288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !64, file: !65, line: 120, baseType: !245, size: 64, offset: 4352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !64, file: !65, line: 121, baseType: !230, size: 32, offset: 4416)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!262 = !{i32 7, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{i32 7, !"PIC Level", i32 2}
!266 = !{i32 7, !"uwtable", i32 1}
!267 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!268 = distinct !DISubprogram(name: "PetscHeapCreate", scope: !269, file: !269, line: 63, type: !270, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !287)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/pheap.c", directory: "/home/users/ndemeye/xSDK")
!270 = !DISubroutineType(types: !271)
!271 = !{!79, !118, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHeap", file: !4, line: 666, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHeap", file: !269, line: 10, size: 192, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !275, file: !269, line: 11, baseType: !118, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !275, file: !269, line: 12, baseType: !118, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !275, file: !269, line: 13, baseType: !118, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !275, file: !269, line: 14, baseType: !281, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeapNode", file: !269, line: 8, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 5, size: 64, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !283, file: !269, line: 6, baseType: !118, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !269, line: 7, baseType: !118, size: 32, offset: 32)
!287 = !{!288, !289, !290, !291, !292, !294}
!288 = !DILocalVariable(name: "maxsize", arg: 1, scope: !268, file: !269, line: 63, type: !118)
!289 = !DILocalVariable(name: "heap", arg: 2, scope: !268, file: !269, line: 63, type: !272)
!290 = !DILocalVariable(name: "ierr", scope: !268, file: !269, line: 65, type: !79)
!291 = !DILocalVariable(name: "h", scope: !268, file: !269, line: 66, type: !273)
!292 = !DILocalVariable(name: "ierr__", scope: !293, file: !269, line: 70, type: !79)
!293 = distinct !DILexicalBlock(scope: !268, file: !269, line: 70, column: 41)
!294 = !DILocalVariable(name: "ierr__", scope: !295, file: !269, line: 74, type: !79)
!295 = distinct !DILexicalBlock(scope: !268, file: !269, line: 74, column: 54)
!296 = !DILocation(line: 0, scope: !268)
!297 = !DILocation(line: 66, column: 3, scope: !268)
!298 = !DILocation(line: 68, column: 3, scope: !299)
!299 = distinct !DILexicalBlock(scope: !300, file: !269, line: 68, column: 3)
!300 = distinct !DILexicalBlock(scope: !301, file: !269, line: 68, column: 3)
!301 = distinct !DILexicalBlock(scope: !268, file: !269, line: 68, column: 3)
!302 = !{!303, !303, i64 0}
!303 = !{!"any pointer", !304, i64 0}
!304 = !{!"omnipotent char", !305, i64 0}
!305 = !{!"Simple C/C++ TBAA"}
!306 = !DILocation(line: 68, column: 3, scope: !300)
!307 = !DILocation(line: 68, column: 3, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !269, line: 68, column: 3)
!309 = distinct !DILexicalBlock(scope: !299, file: !269, line: 68, column: 3)
!310 = !{!311, !312, i64 1536}
!311 = !{!"", !304, i64 0, !304, i64 512, !304, i64 1024, !304, i64 1280, !312, i64 1536, !312, i64 1540, !304, i64 1544}
!312 = !{!"int", !304, i64 0}
!313 = !DILocation(line: 68, column: 3, scope: !309)
!314 = !DILocation(line: 68, column: 3, scope: !315)
!315 = distinct !DILexicalBlock(scope: !308, file: !269, line: 68, column: 3)
!316 = !{!312, !312, i64 0}
!317 = !{!311, !312, i64 1540}
!318 = !DILocation(line: 69, column: 20, scope: !268)
!319 = !DILocation(line: 70, column: 22, scope: !268)
!320 = !DILocation(line: 0, scope: !293)
!321 = !DILocation(line: 70, column: 41, scope: !322)
!322 = distinct !DILexicalBlock(scope: !293, file: !269, line: 70, column: 41)
!323 = !DILocation(line: 70, column: 41, scope: !293)
!324 = !{!"branch_weights", i32 2000, i32 1}
!325 = !DILocation(line: 71, column: 3, scope: !268)
!326 = !DILocation(line: 71, column: 6, scope: !268)
!327 = !DILocation(line: 71, column: 20, scope: !268)
!328 = !{!329, !312, i64 0}
!329 = !{!"_PetscHeap", !312, i64 0, !312, i64 4, !312, i64 8, !303, i64 16}
!330 = !DILocation(line: 72, column: 29, scope: !268)
!331 = !DILocation(line: 72, column: 6, scope: !268)
!332 = !DILocation(line: 72, column: 20, scope: !268)
!333 = !{!329, !312, i64 4}
!334 = !DILocation(line: 73, column: 6, scope: !268)
!335 = !DILocation(line: 73, column: 20, scope: !268)
!336 = !{!329, !312, i64 8}
!337 = !DILocation(line: 74, column: 22, scope: !268)
!338 = !DILocation(line: 0, scope: !295)
!339 = !DILocation(line: 74, column: 54, scope: !340)
!340 = distinct !DILexicalBlock(scope: !295, file: !269, line: 74, column: 54)
!341 = !DILocation(line: 74, column: 54, scope: !295)
!342 = !DILocation(line: 75, column: 3, scope: !268)
!343 = !DILocation(line: 75, column: 6, scope: !268)
!344 = !{!329, !303, i64 16}
!345 = !DILocation(line: 75, column: 14, scope: !268)
!346 = !DILocation(line: 75, column: 20, scope: !268)
!347 = !{!348, !312, i64 0}
!348 = !{!"", !312, i64 0, !312, i64 4}
!349 = !DILocation(line: 76, column: 14, scope: !268)
!350 = !DILocation(line: 76, column: 20, scope: !268)
!351 = !{!348, !312, i64 4}
!352 = !DILocation(line: 77, column: 20, scope: !268)
!353 = !DILocation(line: 78, column: 3, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !269, line: 78, column: 3)
