; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/interface/tsadapt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/interface/tsadapt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!92 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 624, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!117 = !{!118, !119, !120, !121}
!118 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !123)
!123 = !{!124}
!124 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 238, baseType: !40, size: 32, elements: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!128 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!129 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!130 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!131 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!132 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!133 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!134 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!135 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!136 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!137 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!138 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!139 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!140 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!141 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!142 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!143 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!144 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!145 = !{!146, !149, !150, !155, !158, !355, !237, !40, !213, !227, !356, !359, !362, !363, !264, !321, !364, !365, !7}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !116, line: 330, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !116, line: 330, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !151, line: 1451, baseType: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !161, line: 73, size: 4480, elements: !162)
!161 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!162 = !{!163, !165, !208, !209, !211, !214, !215, !216, !217, !225, !226, !228, !232, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !249, !250, !251, !253, !254, !256, !258, !259, !260, !261, !262, !265, !267, !268, !269, !270, !271, !274, !276, !277, !278, !288, !290, !291, !295, !296, !345, !350, !352, !353, !354}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !160, file: !161, line: 74, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !160, file: !161, line: 75, baseType: !166, size: 448, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 448, elements: !206)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !161, line: 53, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 45, size: 448, elements: !169)
!169 = !{!170, !176, !184, !189, !193, !197, !201}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !168, file: !161, line: 46, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !158, !175}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !168, file: !161, line: 47, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!174, !158, !180}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !181, line: 16, baseType: !182)
!181 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !181, line: 16, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !168, file: !161, line: 48, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!174, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !168, file: !161, line: 49, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!174, !158, !155, !158}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !168, file: !161, line: 50, baseType: !194, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!174, !158, !155, !188}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !168, file: !161, line: 51, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!174, !158, !155, !152}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !168, file: !161, line: 52, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!174, !158, !155, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!206 = !{!207}
!207 = !DISubrange(count: 1)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !160, file: !161, line: 76, baseType: !146, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !161, line: 77, baseType: !210, size: 32, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !160, file: !161, line: 78, baseType: !212, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !213)
!213 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !160, file: !161, line: 78, baseType: !212, size: 64, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !160, file: !161, line: 78, baseType: !212, size: 64, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !160, file: !161, line: 78, baseType: !212, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !161, line: 79, baseType: !218, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !221, line: 27, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !223, line: 43, baseType: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!224 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !160, file: !161, line: 80, baseType: !210, size: 32, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !160, file: !161, line: 81, baseType: !227, size: 32, offset: 992)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !160, file: !161, line: 82, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !160, file: !161, line: 83, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !160, file: !161, line: 84, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !160, file: !161, line: 85, baseType: !237, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !160, file: !161, line: 86, baseType: !237, size: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !160, file: !161, line: 87, baseType: !237, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !160, file: !161, line: 88, baseType: !158, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !160, file: !161, line: 89, baseType: !218, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 90, baseType: !237, size: 64, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !160, file: !161, line: 91, baseType: !237, size: 64, offset: 1600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !160, file: !161, line: 92, baseType: !210, size: 32, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !160, file: !161, line: 93, baseType: !149, size: 64, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !160, file: !161, line: 94, baseType: !248, size: 64, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !219)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !160, file: !161, line: 95, baseType: !210, size: 32, offset: 1856)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !160, file: !161, line: 95, baseType: !210, size: 32, offset: 1888)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !160, file: !161, line: 96, baseType: !252, size: 64, offset: 1920)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !160, file: !161, line: 96, baseType: !252, size: 64, offset: 1984)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !160, file: !161, line: 97, baseType: !255, size: 64, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !160, file: !161, line: 97, baseType: !257, size: 64, offset: 2112)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !160, file: !161, line: 98, baseType: !210, size: 32, offset: 2176)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !160, file: !161, line: 98, baseType: !210, size: 32, offset: 2208)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !160, file: !161, line: 99, baseType: !252, size: 64, offset: 2240)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !160, file: !161, line: 99, baseType: !252, size: 64, offset: 2304)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !160, file: !161, line: 100, baseType: !263, size: 64, offset: 2368)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !213)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !160, file: !161, line: 100, baseType: !266, size: 64, offset: 2432)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !160, file: !161, line: 101, baseType: !210, size: 32, offset: 2496)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !160, file: !161, line: 101, baseType: !210, size: 32, offset: 2528)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !160, file: !161, line: 102, baseType: !252, size: 64, offset: 2560)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !160, file: !161, line: 102, baseType: !252, size: 64, offset: 2624)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !160, file: !161, line: 103, baseType: !272, size: 64, offset: 2688)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !160, file: !161, line: 103, baseType: !275, size: 64, offset: 2752)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !160, file: !161, line: 104, baseType: !205, size: 64, offset: 2816)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !160, file: !161, line: 105, baseType: !210, size: 32, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !160, file: !161, line: 106, baseType: !279, size: 128, offset: 2944)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, elements: !286)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !161, line: 64, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 61, size: 128, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !282, file: !161, line: 62, baseType: !152, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !282, file: !161, line: 63, baseType: !149, size: 64, offset: 64)
!286 = !{!287}
!287 = !DISubrange(count: 2)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !160, file: !161, line: 107, baseType: !289, size: 64, offset: 3072)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 64, elements: !286)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !160, file: !161, line: 108, baseType: !149, size: 64, offset: 3136)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !160, file: !161, line: 109, baseType: !292, size: 64, offset: 3200)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!174, !149}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !160, file: !161, line: 111, baseType: !210, size: 32, offset: 3264)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !160, file: !161, line: 112, baseType: !297, size: 320, offset: 3328)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 320, elements: !343)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!174, !301, !158, !149}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !304)
!304 = !{!305, !306, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !303, file: !12, line: 100, baseType: !210, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !12, line: 101, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !318, !319, !320, !324, !326, !328, !329, !330}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !309, file: !12, line: 84, baseType: !237, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !309, file: !12, line: 85, baseType: !237, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !12, line: 86, baseType: !149, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !309, file: !12, line: 87, baseType: !229, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !309, file: !12, line: 88, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !309, file: !12, line: 89, baseType: !157, size: 8, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !309, file: !12, line: 90, baseType: !237, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !309, file: !12, line: 91, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 46, baseType: !323)
!322 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!323 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !12, line: 92, baseType: !325, size: 32, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !12, line: 93, baseType: !327, size: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !12, line: 94, baseType: !307, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !309, file: !12, line: 95, baseType: !237, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !309, file: !12, line: 96, baseType: !149, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !303, file: !12, line: 102, baseType: !237, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !303, file: !12, line: 102, baseType: !237, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !303, file: !12, line: 103, baseType: !237, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !303, file: !12, line: 104, baseType: !146, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !303, file: !12, line: 105, baseType: !325, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !303, file: !12, line: 105, baseType: !325, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !303, file: !12, line: 105, baseType: !325, size: 32, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !303, file: !12, line: 106, baseType: !158, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !303, file: !12, line: 107, baseType: !340, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!343 = !{!344}
!344 = !DISubrange(count: 5)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !160, file: !161, line: 113, baseType: !346, size: 320, offset: 3648)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 320, elements: !343)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!174, !158, !149}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !160, file: !161, line: 114, baseType: !351, size: 320, offset: 3968)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !343)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !160, file: !161, line: 115, baseType: !325, size: 32, offset: 4288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !161, line: 120, baseType: !340, size: 64, offset: 4352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !160, file: !161, line: 121, baseType: !325, size: 32, offset: 4416)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !116, line: 331, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !116, line: 331, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !116, line: 338, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !116, line: 338, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !122)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !161, line: 130, baseType: !185)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !161, line: 131, baseType: !177)
!366 = !{!367, !0, !370, !372}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "TSADAPT_CLASSID", scope: !2, file: !369, line: 4, type: !164, isLocal: false, isDefinition: true)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/interface/tsadapt.c", directory: "/home/users/ndemeye/xSDK")
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "TSAdaptPackageInitialized", scope: !2, file: !369, line: 7, type: !325, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "TSAdaptRegisterAllCalled", scope: !2, file: !369, line: 8, type: !325, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!375 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!376 = !{i32 7, !"Dwarf Version", i32 4}
!377 = !{i32 2, !"Debug Info Version", i32 3}
!378 = !{i32 1, !"wchar_size", i32 4}
!379 = !{i32 7, !"PIC Level", i32 2}
!380 = !{i32 7, !"uwtable", i32 1}
!381 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!382 = distinct !DISubprogram(name: "TSAdaptRegister", scope: !369, file: !369, line: 43, type: !383, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !886)
!383 = !DISubroutineType(types: !384)
!384 = !{!174, !155, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!174, !388}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !35, line: 686, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !56, line: 319, size: 10112, elements: !391)
!391 = !{!392, !394, !851, !852, !856, !871, !872, !873, !874, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !390, file: !56, line: 320, baseType: !393, size: 4480)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !161, line: 122, baseType: !160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !390, file: !56, line: 320, baseType: !395, size: 384, offset: 4480)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 384, elements: !206)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !56, line: 310, size: 384, elements: !397)
!397 = !{!398, !840, !841, !842, !846, !850}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !396, file: !56, line: 311, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!174, !388, !402, !264, !255, !263, !447, !263, !263, !263}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !35, line: 17, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !56, line: 144, size: 17408, elements: !405)
!405 = !{!406, !407, !506, !508, !510, !515, !516, !517, !518, !520, !566, !573, !579, !581, !582, !587, !588, !589, !590, !591, !592, !596, !600, !601, !602, !606, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !716, !720, !724, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !776, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !806, !807, !808, !809, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !838, !839}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !404, file: !56, line: 145, baseType: !393, size: 4480)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !404, file: !56, line: 145, baseType: !408, size: 2048, offset: 4480)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 2048, elements: !206)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !56, line: 33, size: 2048, elements: !410)
!410 = !{!411, !421, !428, !432, !433, !434, !438, !443, !448, !452, !453, !457, !458, !462, !463, !464, !470, !471, !472, !473, !474, !475, !476, !477, !478, !484, !488, !492, !496, !500, !501, !502}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !409, file: !56, line: 34, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!174, !415, !418, !418, !402}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !126, line: 18, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !126, line: 18, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !27, line: 21, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !409, file: !56, line: 35, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!174, !415, !418, !425, !425, !402}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !64, line: 16, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !64, line: 16, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !409, file: !56, line: 36, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!174, !402}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !409, file: !56, line: 37, baseType: !429, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !409, file: !56, line: 38, baseType: !429, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !409, file: !56, line: 39, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!174, !402, !264, !418}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !409, file: !56, line: 40, baseType: !439, size: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!174, !402, !442, !255, !263}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !409, file: !56, line: 41, baseType: !444, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!174, !402, !210, !418, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !409, file: !56, line: 42, baseType: !449, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!174, !301, !402}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !409, file: !56, line: 43, baseType: !429, size: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !409, file: !56, line: 44, baseType: !454, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!174, !402, !180}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !409, file: !56, line: 45, baseType: !429, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !409, file: !56, line: 46, baseType: !459, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!174, !402, !264, !264, !263, !263}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !409, file: !56, line: 47, baseType: !454, size: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !409, file: !56, line: 48, baseType: !429, size: 64, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !409, file: !56, line: 49, baseType: !465, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!174, !402, !255, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !409, file: !56, line: 50, baseType: !429, size: 64, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !409, file: !56, line: 51, baseType: !429, size: 64, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !409, file: !56, line: 52, baseType: !429, size: 64, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !409, file: !56, line: 53, baseType: !429, size: 64, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !409, file: !56, line: 54, baseType: !429, size: 64, offset: 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !409, file: !56, line: 55, baseType: !429, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !409, file: !56, line: 56, baseType: !429, size: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !409, file: !56, line: 57, baseType: !429, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !409, file: !56, line: 58, baseType: !479, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!174, !402, !255, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !409, file: !56, line: 59, baseType: !485, size: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!174, !402, !255, !469}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !409, file: !56, line: 60, baseType: !489, size: 64, offset: 1664)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!174, !402, !469}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !409, file: !56, line: 61, baseType: !493, size: 64, offset: 1728)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!174, !402, !210, !469}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !409, file: !56, line: 62, baseType: !497, size: 64, offset: 1792)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!174, !402, !418}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !409, file: !56, line: 63, baseType: !429, size: 64, offset: 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !409, file: !56, line: 64, baseType: !497, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !409, file: !56, line: 65, baseType: !503, size: 64, offset: 1984)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!174, !402, !418, !418}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !404, file: !56, line: 146, baseType: !507, size: 32, offset: 6528)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !35, line: 57, baseType: !34)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !404, file: !56, line: 147, baseType: !509, size: 32, offset: 6560)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !35, line: 88, baseType: !39)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !404, file: !56, line: 149, baseType: !511, size: 64, offset: 6592)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !512, line: 14, baseType: !513)
!512 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !512, line: 14, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !404, file: !56, line: 150, baseType: !418, size: 64, offset: 6656)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !404, file: !56, line: 151, baseType: !418, size: 64, offset: 6720)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !404, file: !56, line: 152, baseType: !388, size: 64, offset: 6784)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !404, file: !56, line: 153, baseType: !519, size: 64, offset: 6848)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !35, line: 695, baseType: !155)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !404, file: !56, line: 154, baseType: !521, size: 64, offset: 6912)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !56, line: 71, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !56, line: 410, size: 1792, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !541, !545, !546, !547, !548, !549, !550, !551, !552, !554, !555, !556, !564, !565}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !523, file: !56, line: 411, baseType: !272, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !523, file: !56, line: 412, baseType: !272, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !523, file: !56, line: 413, baseType: !264, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !523, file: !56, line: 414, baseType: !264, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !523, file: !56, line: 415, baseType: !264, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !523, file: !56, line: 416, baseType: !272, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !523, file: !56, line: 417, baseType: !255, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !523, file: !56, line: 418, baseType: !264, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !523, file: !56, line: 419, baseType: !264, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !523, file: !56, line: 420, baseType: !264, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !523, file: !56, line: 421, baseType: !264, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !523, file: !56, line: 422, baseType: !447, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !523, file: !56, line: 423, baseType: !538, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!174, !402, !264, !418, !272, !149}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !523, file: !56, line: 424, baseType: !542, size: 64, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!174, !402, !210, !255, !264, !418, !325, !149}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !523, file: !56, line: 425, baseType: !149, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !523, file: !56, line: 426, baseType: !255, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !523, file: !56, line: 427, baseType: !447, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !523, file: !56, line: 428, baseType: !210, size: 32, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !523, file: !56, line: 429, baseType: !210, size: 32, offset: 1120)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !523, file: !56, line: 430, baseType: !255, size: 64, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !523, file: !56, line: 431, baseType: !263, size: 64, offset: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !523, file: !56, line: 432, baseType: !553, size: 32, offset: 1280)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !56, line: 408, baseType: !55)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !523, file: !56, line: 433, baseType: !210, size: 32, offset: 1312)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !523, file: !56, line: 434, baseType: !180, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !523, file: !56, line: 442, baseType: !557, size: 320, offset: 1408)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !56, line: 436, size: 320, elements: !558)
!558 = !{!559, !560, !561, !562, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !557, file: !56, line: 437, baseType: !210, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !557, file: !56, line: 438, baseType: !263, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !557, file: !56, line: 439, baseType: !255, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !557, file: !56, line: 440, baseType: !255, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !557, file: !56, line: 441, baseType: !257, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !523, file: !56, line: 443, baseType: !210, size: 32, offset: 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !523, file: !56, line: 444, baseType: !210, size: 32, offset: 1760)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !404, file: !56, line: 157, baseType: !567, size: 640, offset: 6976)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 640, elements: !571)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!174, !402, !210, !264, !418, !149}
!571 = !{!572}
!572 = !DISubrange(count: 10)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !404, file: !56, line: 158, baseType: !574, size: 640, offset: 7616)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 640, elements: !571)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!174, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !404, file: !56, line: 159, baseType: !580, size: 640, offset: 8256)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 640, elements: !571)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !404, file: !56, line: 160, baseType: !210, size: 32, offset: 8896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !404, file: !56, line: 161, baseType: !583, size: 640, offset: 8960)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 640, elements: !571)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!174, !402, !210, !264, !418, !210, !469, !469, !149}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !404, file: !56, line: 162, baseType: !574, size: 640, offset: 9600)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !404, file: !56, line: 163, baseType: !580, size: 640, offset: 10240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !404, file: !56, line: 164, baseType: !210, size: 32, offset: 10880)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !404, file: !56, line: 165, baseType: !210, size: 32, offset: 10912)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !404, file: !56, line: 167, baseType: !429, size: 64, offset: 10944)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !404, file: !56, line: 168, baseType: !593, size: 64, offset: 11008)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!174, !402, !264}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !404, file: !56, line: 169, baseType: !597, size: 64, offset: 11072)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!174, !402, !264, !210, !469}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !404, file: !56, line: 170, baseType: !429, size: 64, offset: 11136)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !404, file: !56, line: 171, baseType: !429, size: 64, offset: 11200)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !404, file: !56, line: 172, baseType: !603, size: 64, offset: 11264)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!174, !402, !264, !418, !447}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !404, file: !56, line: 175, baseType: !607, size: 64, offset: 11328)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !35, line: 293, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !56, line: 89, size: 7040, elements: !610)
!610 = !{!611, !612, !641, !645, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !690, !691, !692}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !609, file: !56, line: 90, baseType: !393, size: 4480)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !609, file: !56, line: 90, baseType: !613, size: 448, offset: 4480)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 448, elements: !206)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !56, line: 75, size: 448, elements: !615)
!615 = !{!616, !620, !624, !625, !629, !633, !637}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !614, file: !56, line: 76, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!174, !607, !180}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !614, file: !56, line: 77, baseType: !621, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!174, !607}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !614, file: !56, line: 78, baseType: !621, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !614, file: !56, line: 79, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!174, !607, !402, !210, !264, !418}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !614, file: !56, line: 80, baseType: !630, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!174, !607, !402, !210, !263}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !614, file: !56, line: 81, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!174, !301, !607}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !614, file: !56, line: 82, baseType: !638, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!174, !607, !402}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !609, file: !56, line: 91, baseType: !642, size: 64, offset: 4928)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !56, line: 87, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !56, line: 87, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !609, file: !56, line: 116, baseType: !646, size: 1024, offset: 4992)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !609, file: !56, line: 93, size: 1024, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !663}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !646, file: !56, line: 94, baseType: !210, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !646, file: !56, line: 95, baseType: !469, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !646, file: !56, line: 96, baseType: !272, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !646, file: !56, line: 97, baseType: !263, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !646, file: !56, line: 98, baseType: !469, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !646, file: !56, line: 99, baseType: !447, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !646, file: !56, line: 100, baseType: !263, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !646, file: !56, line: 103, baseType: !325, size: 32, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !646, file: !56, line: 109, baseType: !657, size: 256, offset: 512)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !56, line: 104, size: 256, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !657, file: !56, line: 105, baseType: !218, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !657, file: !56, line: 106, baseType: !248, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !657, file: !56, line: 107, baseType: !264, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !657, file: !56, line: 108, baseType: !210, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !646, file: !56, line: 115, baseType: !664, size: 256, offset: 768)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !56, line: 110, size: 256, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !664, file: !56, line: 111, baseType: !218, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !664, file: !56, line: 112, baseType: !248, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !664, file: !56, line: 113, baseType: !264, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !664, file: !56, line: 114, baseType: !210, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !609, file: !56, line: 117, baseType: !418, size: 64, offset: 6016)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !609, file: !56, line: 117, baseType: !418, size: 64, offset: 6080)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !609, file: !56, line: 118, baseType: !325, size: 32, offset: 6144)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !609, file: !56, line: 119, baseType: !325, size: 32, offset: 6176)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !609, file: !56, line: 120, baseType: !325, size: 32, offset: 6208)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !609, file: !56, line: 121, baseType: !180, size: 64, offset: 6272)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !609, file: !56, line: 122, baseType: !210, size: 32, offset: 6336)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !609, file: !56, line: 123, baseType: !210, size: 32, offset: 6368)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !609, file: !56, line: 124, baseType: !210, size: 32, offset: 6400)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !609, file: !56, line: 124, baseType: !210, size: 32, offset: 6432)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !609, file: !56, line: 125, baseType: !681, size: 64, offset: 6464)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !609, file: !56, line: 126, baseType: !325, size: 32, offset: 6528)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !609, file: !56, line: 127, baseType: !237, size: 64, offset: 6592)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !609, file: !56, line: 127, baseType: !237, size: 64, offset: 6656)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !609, file: !56, line: 128, baseType: !237, size: 64, offset: 6720)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !609, file: !56, line: 129, baseType: !687, size: 64, offset: 6784)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!174, !149, !418, !469}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !609, file: !56, line: 130, baseType: !292, size: 64, offset: 6848)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !609, file: !56, line: 131, baseType: !149, size: 64, offset: 6912)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !609, file: !56, line: 132, baseType: !149, size: 64, offset: 6976)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !404, file: !56, line: 176, baseType: !469, size: 64, offset: 11392)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !404, file: !56, line: 177, baseType: !469, size: 64, offset: 11456)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !404, file: !56, line: 178, baseType: !210, size: 32, offset: 11520)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !404, file: !56, line: 179, baseType: !418, size: 64, offset: 11584)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !404, file: !56, line: 180, baseType: !210, size: 32, offset: 11648)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !404, file: !56, line: 181, baseType: !210, size: 32, offset: 11680)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !404, file: !56, line: 182, baseType: !210, size: 32, offset: 11712)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !404, file: !56, line: 183, baseType: !325, size: 32, offset: 11744)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !404, file: !56, line: 184, baseType: !325, size: 32, offset: 11776)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !404, file: !56, line: 185, baseType: !418, size: 64, offset: 11840)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !404, file: !56, line: 186, baseType: !425, size: 64, offset: 11904)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !404, file: !56, line: 186, baseType: !425, size: 64, offset: 11968)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !404, file: !56, line: 187, baseType: !149, size: 64, offset: 12032)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !404, file: !56, line: 187, baseType: !149, size: 64, offset: 12096)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !404, file: !56, line: 188, baseType: !149, size: 64, offset: 12160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !404, file: !56, line: 189, baseType: !469, size: 64, offset: 12224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !404, file: !56, line: 190, baseType: !469, size: 64, offset: 12288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !404, file: !56, line: 191, baseType: !418, size: 64, offset: 12352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !404, file: !56, line: 191, baseType: !418, size: 64, offset: 12416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !404, file: !56, line: 194, baseType: !713, size: 64, offset: 12480)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!174, !402, !264, !418, !425, !149}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !404, file: !56, line: 195, baseType: !717, size: 64, offset: 12544)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!174, !402, !264, !418, !418, !264, !425, !149}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !404, file: !56, line: 196, baseType: !721, size: 64, offset: 12608)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!174, !402, !264, !418, !418, !149}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !404, file: !56, line: 197, baseType: !725, size: 64, offset: 12672)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!174, !402, !264, !418, !469, !149}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !404, file: !56, line: 198, baseType: !725, size: 64, offset: 12736)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !404, file: !56, line: 201, baseType: !469, size: 64, offset: 12800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !404, file: !56, line: 202, baseType: !469, size: 64, offset: 12864)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !404, file: !56, line: 203, baseType: !418, size: 64, offset: 12928)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !404, file: !56, line: 204, baseType: !469, size: 64, offset: 12992)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !404, file: !56, line: 204, baseType: !469, size: 64, offset: 13056)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !404, file: !56, line: 205, baseType: !469, size: 64, offset: 13120)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !404, file: !56, line: 205, baseType: !469, size: 64, offset: 13184)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !404, file: !56, line: 206, baseType: !469, size: 64, offset: 13248)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !404, file: !56, line: 206, baseType: !469, size: 64, offset: 13312)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !404, file: !56, line: 207, baseType: !469, size: 64, offset: 13376)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !404, file: !56, line: 207, baseType: !469, size: 64, offset: 13440)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !404, file: !56, line: 208, baseType: !149, size: 64, offset: 13504)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !404, file: !56, line: 208, baseType: !149, size: 64, offset: 13568)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !404, file: !56, line: 209, baseType: !743, size: 64, offset: 13632)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!174, !402, !264, !418, !469, !418, !469, !149}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !404, file: !56, line: 210, baseType: !743, size: 64, offset: 13696)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !404, file: !56, line: 211, baseType: !743, size: 64, offset: 13760)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !404, file: !56, line: 212, baseType: !743, size: 64, offset: 13824)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !404, file: !56, line: 213, baseType: !743, size: 64, offset: 13888)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !404, file: !56, line: 214, baseType: !743, size: 64, offset: 13952)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !404, file: !56, line: 215, baseType: !743, size: 64, offset: 14016)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !404, file: !56, line: 216, baseType: !743, size: 64, offset: 14080)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !404, file: !56, line: 219, baseType: !425, size: 64, offset: 14144)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !404, file: !56, line: 220, baseType: !418, size: 64, offset: 14208)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !404, file: !56, line: 221, baseType: !469, size: 64, offset: 14272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !404, file: !56, line: 222, baseType: !210, size: 32, offset: 14336)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !404, file: !56, line: 223, baseType: !210, size: 32, offset: 14368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !404, file: !56, line: 224, baseType: !149, size: 64, offset: 14400)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !404, file: !56, line: 225, baseType: !210, size: 32, offset: 14464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !404, file: !56, line: 226, baseType: !325, size: 32, offset: 14496)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !404, file: !56, line: 227, baseType: !725, size: 64, offset: 14528)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !404, file: !56, line: 231, baseType: !425, size: 64, offset: 14592)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !404, file: !56, line: 232, baseType: !425, size: 64, offset: 14656)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !404, file: !56, line: 233, baseType: !418, size: 64, offset: 14720)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !404, file: !56, line: 247, baseType: !766, size: 384, offset: 14784)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !56, line: 238, size: 384, elements: !767)
!767 = !{!768, !769, !770, !771, !773, !774, !775}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !766, file: !56, line: 239, baseType: !264, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !766, file: !56, line: 240, baseType: !218, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !766, file: !56, line: 241, baseType: !248, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !766, file: !56, line: 242, baseType: !772, size: 32, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !64, line: 285, baseType: !63)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !766, file: !56, line: 245, baseType: !325, size: 32, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !766, file: !56, line: 246, baseType: !264, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !766, file: !56, line: 246, baseType: !264, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !404, file: !56, line: 251, baseType: !777, size: 64, offset: 15168)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !56, line: 249, size: 64, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !777, file: !56, line: 250, baseType: !264, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !404, file: !56, line: 253, baseType: !772, size: 32, offset: 15232)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !404, file: !56, line: 255, baseType: !415, size: 64, offset: 15296)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !404, file: !56, line: 256, baseType: !325, size: 32, offset: 15360)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !404, file: !56, line: 258, baseType: !210, size: 32, offset: 15392)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !404, file: !56, line: 259, baseType: !210, size: 32, offset: 15424)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !404, file: !56, line: 260, baseType: !210, size: 32, offset: 15456)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !404, file: !56, line: 261, baseType: !210, size: 32, offset: 15488)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !404, file: !56, line: 264, baseType: !210, size: 32, offset: 15520)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !404, file: !56, line: 264, baseType: !210, size: 32, offset: 15552)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !404, file: !56, line: 264, baseType: !210, size: 32, offset: 15584)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !404, file: !56, line: 264, baseType: !210, size: 32, offset: 15616)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !404, file: !56, line: 267, baseType: !210, size: 32, offset: 15648)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !56, line: 268, baseType: !149, size: 64, offset: 15680)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !404, file: !56, line: 269, baseType: !149, size: 64, offset: 15744)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !404, file: !56, line: 272, baseType: !210, size: 32, offset: 15808)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !404, file: !56, line: 273, baseType: !264, size: 64, offset: 15872)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !404, file: !56, line: 277, baseType: !325, size: 32, offset: 15936)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !404, file: !56, line: 278, baseType: !325, size: 32, offset: 15968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !404, file: !56, line: 279, baseType: !210, size: 32, offset: 16000)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !404, file: !56, line: 280, baseType: !264, size: 64, offset: 16064)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !404, file: !56, line: 281, baseType: !264, size: 64, offset: 16128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !404, file: !56, line: 282, baseType: !264, size: 64, offset: 16192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !404, file: !56, line: 283, baseType: !264, size: 64, offset: 16256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !404, file: !56, line: 284, baseType: !264, size: 64, offset: 16320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !404, file: !56, line: 286, baseType: !805, size: 32, offset: 16384)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !35, line: 115, baseType: !70)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !404, file: !56, line: 287, baseType: !325, size: 32, offset: 16416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !404, file: !56, line: 288, baseType: !210, size: 32, offset: 16448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !404, file: !56, line: 288, baseType: !210, size: 32, offset: 16480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !404, file: !56, line: 289, baseType: !810, size: 32, offset: 16512)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !35, line: 217, baseType: !83)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !404, file: !56, line: 291, baseType: !264, size: 64, offset: 16576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !404, file: !56, line: 291, baseType: !264, size: 64, offset: 16640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !404, file: !56, line: 292, baseType: !418, size: 64, offset: 16704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !404, file: !56, line: 292, baseType: !418, size: 64, offset: 16768)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !404, file: !56, line: 293, baseType: !264, size: 64, offset: 16832)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !404, file: !56, line: 293, baseType: !264, size: 64, offset: 16896)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !404, file: !56, line: 295, baseType: !325, size: 32, offset: 16960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !404, file: !56, line: 296, baseType: !325, size: 32, offset: 16992)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !404, file: !56, line: 298, baseType: !210, size: 32, offset: 17024)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !404, file: !56, line: 299, baseType: !469, size: 64, offset: 17088)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !404, file: !56, line: 302, baseType: !210, size: 32, offset: 17152)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !404, file: !56, line: 303, baseType: !823, size: 64, offset: 17216)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !56, line: 135, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !56, line: 136, size: 320, elements: !826)
!826 = !{!827, !828, !829, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !825, file: !56, line: 137, baseType: !402, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !825, file: !56, line: 138, baseType: !237, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !825, file: !56, line: 139, baseType: !830, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !831, line: 11, baseType: !832)
!831 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !831, line: 11, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !56, line: 140, baseType: !823, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !825, file: !56, line: 141, baseType: !836, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !837, line: 80, baseType: !40)
!837 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !404, file: !56, line: 304, baseType: !325, size: 32, offset: 17280)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !404, file: !56, line: 307, baseType: !402, size: 64, offset: 17344)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !396, file: !56, line: 312, baseType: !385, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !396, file: !56, line: 313, baseType: !385, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !56, line: 314, baseType: !843, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!174, !388, !180}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !396, file: !56, line: 315, baseType: !847, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!174, !301, !388}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !396, file: !56, line: 316, baseType: !843, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !56, line: 321, baseType: !149, size: 64, offset: 4864)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !390, file: !56, line: 322, baseType: !853, size: 64, offset: 4928)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!174, !388, !402, !264, !418, !447}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !390, file: !56, line: 331, baseType: !857, size: 4160, offset: 4992)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !56, line: 323, size: 4160, elements: !858)
!858 = !{!859, !860, !861, !865, !867, !868, !870}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !857, file: !56, line: 324, baseType: !210, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !857, file: !56, line: 325, baseType: !325, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !857, file: !56, line: 326, baseType: !862, size: 1024, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1024, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 16)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !857, file: !56, line: 327, baseType: !866, size: 512, offset: 1088)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 512, elements: !863)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !857, file: !56, line: 328, baseType: !866, size: 512, offset: 1600)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !857, file: !56, line: 329, baseType: !869, size: 1024, offset: 2112)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1024, elements: !863)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !857, file: !56, line: 330, baseType: !869, size: 1024, offset: 3136)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !390, file: !56, line: 332, baseType: !325, size: 32, offset: 9152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !390, file: !56, line: 333, baseType: !264, size: 64, offset: 9216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !390, file: !56, line: 334, baseType: !264, size: 64, offset: 9280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !390, file: !56, line: 335, baseType: !875, size: 128, offset: 9344)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 128, elements: !286)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !390, file: !56, line: 336, baseType: !264, size: 64, offset: 9472)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !390, file: !56, line: 336, baseType: !264, size: 64, offset: 9536)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !390, file: !56, line: 337, baseType: !264, size: 64, offset: 9600)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !390, file: !56, line: 338, baseType: !325, size: 32, offset: 9664)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !390, file: !56, line: 339, baseType: !264, size: 64, offset: 9728)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !390, file: !56, line: 340, baseType: !875, size: 128, offset: 9792)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !390, file: !56, line: 341, baseType: !442, size: 32, offset: 9920)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !390, file: !56, line: 342, baseType: !180, size: 64, offset: 9984)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !390, file: !56, line: 343, baseType: !210, size: 32, offset: 10048)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !390, file: !56, line: 344, baseType: !210, size: 32, offset: 10080)
!886 = !{!887, !888, !889, !890, !892}
!887 = !DILocalVariable(name: "sname", arg: 1, scope: !382, file: !369, line: 43, type: !155)
!888 = !DILocalVariable(name: "function", arg: 2, scope: !382, file: !369, line: 43, type: !385)
!889 = !DILocalVariable(name: "ierr", scope: !382, file: !369, line: 45, type: !174)
!890 = !DILocalVariable(name: "ierr__", scope: !891, file: !369, line: 48, type: !174)
!891 = distinct !DILexicalBlock(scope: !382, file: !369, line: 48, column: 37)
!892 = !DILocalVariable(name: "ierr__", scope: !893, file: !369, line: 49, type: !174)
!893 = distinct !DILexicalBlock(scope: !382, file: !369, line: 49, column: 60)
!894 = !DILocation(line: 0, scope: !382)
!895 = !DILocation(line: 47, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !369, line: 47, column: 3)
!897 = distinct !DILexicalBlock(scope: !898, file: !369, line: 47, column: 3)
!898 = distinct !DILexicalBlock(scope: !382, file: !369, line: 47, column: 3)
!899 = !{!900, !900, i64 0}
!900 = !{!"any pointer", !901, i64 0}
!901 = !{!"omnipotent char", !902, i64 0}
!902 = !{!"Simple C/C++ TBAA"}
!903 = !DILocation(line: 47, column: 3, scope: !897)
!904 = !DILocation(line: 47, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !369, line: 47, column: 3)
!906 = distinct !DILexicalBlock(scope: !896, file: !369, line: 47, column: 3)
!907 = !{!908, !909, i64 1536}
!908 = !{!"", !901, i64 0, !901, i64 512, !901, i64 1024, !901, i64 1280, !909, i64 1536, !909, i64 1540, !901, i64 1544}
!909 = !{!"int", !901, i64 0}
!910 = !DILocation(line: 47, column: 3, scope: !906)
!911 = !DILocation(line: 47, column: 3, scope: !912)
!912 = distinct !DILexicalBlock(scope: !905, file: !369, line: 47, column: 3)
!913 = !{!909, !909, i64 0}
!914 = !{!908, !909, i64 1540}
!915 = !DILocation(line: 48, column: 10, scope: !382)
!916 = !DILocation(line: 0, scope: !891)
!917 = !DILocation(line: 48, column: 37, scope: !918)
!918 = distinct !DILexicalBlock(scope: !891, file: !369, line: 48, column: 37)
!919 = !DILocation(line: 48, column: 37, scope: !891)
!920 = !{!"branch_weights", i32 2000, i32 1}
!921 = !DILocation(line: 49, column: 10, scope: !382)
!922 = !DILocation(line: 0, scope: !893)
!923 = !DILocation(line: 49, column: 60, scope: !924)
!924 = distinct !DILexicalBlock(scope: !893, file: !369, line: 49, column: 60)
!925 = !DILocation(line: 49, column: 60, scope: !893)
!926 = !DILocation(line: 50, column: 3, scope: !927)
!927 = distinct !DILexicalBlock(scope: !928, file: !369, line: 50, column: 3)
!928 = distinct !DILexicalBlock(scope: !929, file: !369, line: 50, column: 3)
!929 = distinct !DILexicalBlock(scope: !382, file: !369, line: 50, column: 3)
!930 = !DILocation(line: 50, column: 3, scope: !928)
!931 = !DILocation(line: 50, column: 3, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !369, line: 50, column: 3)
!933 = distinct !DILexicalBlock(scope: !927, file: !369, line: 50, column: 3)
!934 = !DILocation(line: 50, column: 3, scope: !933)
!935 = !DILocation(line: 50, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !369, line: 50, column: 3)
!937 = distinct !DILexicalBlock(scope: !932, file: !369, line: 50, column: 3)
!938 = !{!908, !901, i64 1544}
!939 = !DILocation(line: 50, column: 3, scope: !937)
!940 = !DILocation(line: 50, column: 3, scope: !941)
!941 = distinct !DILexicalBlock(scope: !936, file: !369, line: 50, column: 3)
!942 = !DILocation(line: 50, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !932, file: !369, line: 50, column: 3)
!944 = !DILocation(line: 50, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !943, file: !369, line: 50, column: 3)
!946 = !DILocation(line: 50, column: 3, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !369, line: 50, column: 3)
