; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/destroy.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/destroy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "incall", scope: !2, file: !3, line: 113, type: !187, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "PetscObjectViewFromOptions", scope: !3, file: !3, line: 108, type: !4, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !328)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/objects/destroy.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !9, !47}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !12, line: 73, size: 4480, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !16, !68, !69, !71, !74, !75, !76, !77, !85, !86, !88, !92, !96, !98, !99, !100, !101, !102, !103, !104, !105, !106, !108, !110, !111, !112, !114, !115, !117, !119, !120, !121, !122, !123, !126, !128, !129, !130, !131, !132, !135, !137, !138, !139, !149, !151, !152, !156, !157, !226, !231, !233, !234, !235}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !11, file: !12, line: 74, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !11, file: !12, line: 75, baseType: !17, size: 448, offset: 64)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 448, elements: !66)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !12, line: 53, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 45, size: 448, elements: !20)
!20 = !{!21, !30, !38, !43, !50, !54, !61}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !19, file: !12, line: 46, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!6, !9, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !27, line: 330, baseType: !28)
!27 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !27, line: 330, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !19, file: !12, line: 47, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!6, !9, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !35, line: 16, baseType: !36)
!35 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !35, line: 16, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !19, file: !12, line: 48, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !19, file: !12, line: 49, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!6, !9, !47, !9}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !19, file: !12, line: 50, baseType: !51, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!6, !9, !47, !42}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !19, file: !12, line: 51, baseType: !55, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !9, !47, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !19, file: !12, line: 52, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!6, !9, !47, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!66 = !{!67}
!67 = !DISubrange(count: 1)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !11, file: !12, line: 76, baseType: !26, size: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !11, file: !12, line: 77, baseType: !70, size: 32, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !11, file: !12, line: 78, baseType: !72, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !73)
!73 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !11, file: !12, line: 78, baseType: !72, size: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !11, file: !12, line: 78, baseType: !72, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !11, file: !12, line: 78, baseType: !72, size: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !11, file: !12, line: 79, baseType: !78, size: 64, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !81, line: 27, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !83, line: 43, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !11, file: !12, line: 80, baseType: !70, size: 32, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !11, file: !12, line: 81, baseType: !87, size: 32, offset: 992)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !11, file: !12, line: 82, baseType: !89, size: 64, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !11, file: !12, line: 83, baseType: !93, size: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !11, file: !12, line: 84, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !11, file: !12, line: 85, baseType: !97, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !11, file: !12, line: 86, baseType: !97, size: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !11, file: !12, line: 87, baseType: !97, size: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !11, file: !12, line: 88, baseType: !9, size: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !11, file: !12, line: 89, baseType: !78, size: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !12, line: 90, baseType: !97, size: 64, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !11, file: !12, line: 91, baseType: !97, size: 64, offset: 1600)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !11, file: !12, line: 92, baseType: !70, size: 32, offset: 1664)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !11, file: !12, line: 93, baseType: !107, size: 64, offset: 1728)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !12, line: 94, baseType: !109, size: 64, offset: 1792)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !79)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !11, file: !12, line: 95, baseType: !70, size: 32, offset: 1856)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !11, file: !12, line: 95, baseType: !70, size: 32, offset: 1888)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !11, file: !12, line: 96, baseType: !113, size: 64, offset: 1920)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !11, file: !12, line: 96, baseType: !113, size: 64, offset: 1984)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !11, file: !12, line: 97, baseType: !116, size: 64, offset: 2048)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !11, file: !12, line: 97, baseType: !118, size: 64, offset: 2112)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !11, file: !12, line: 98, baseType: !70, size: 32, offset: 2176)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !11, file: !12, line: 98, baseType: !70, size: 32, offset: 2208)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !11, file: !12, line: 99, baseType: !113, size: 64, offset: 2240)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !11, file: !12, line: 99, baseType: !113, size: 64, offset: 2304)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !11, file: !12, line: 100, baseType: !124, size: 64, offset: 2368)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !73)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !11, file: !12, line: 100, baseType: !127, size: 64, offset: 2432)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !11, file: !12, line: 101, baseType: !70, size: 32, offset: 2496)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !11, file: !12, line: 101, baseType: !70, size: 32, offset: 2528)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !11, file: !12, line: 102, baseType: !113, size: 64, offset: 2560)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !11, file: !12, line: 102, baseType: !113, size: 64, offset: 2624)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !11, file: !12, line: 103, baseType: !133, size: 64, offset: 2688)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !125)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !11, file: !12, line: 103, baseType: !136, size: 64, offset: 2752)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !11, file: !12, line: 104, baseType: !65, size: 64, offset: 2816)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !11, file: !12, line: 105, baseType: !70, size: 32, offset: 2880)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !11, file: !12, line: 106, baseType: !140, size: 128, offset: 2944)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !147)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !12, line: 64, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 61, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !143, file: !12, line: 62, baseType: !58, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !143, file: !12, line: 63, baseType: !107, size: 64, offset: 64)
!147 = !{!148}
!148 = !DISubrange(count: 2)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !11, file: !12, line: 107, baseType: !150, size: 64, offset: 3072)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, elements: !147)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !11, file: !12, line: 108, baseType: !107, size: 64, offset: 3136)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !11, file: !12, line: 109, baseType: !153, size: 64, offset: 3200)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!6, !107}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !11, file: !12, line: 111, baseType: !70, size: 32, offset: 3264)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !11, file: !12, line: 112, baseType: !158, size: 320, offset: 3328)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 320, elements: !224)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!6, !162, !9, !107}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !164, line: 108, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !164, line: 99, size: 640, elements: !166)
!166 = !{!167, !168, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !165, file: !164, line: 100, baseType: !70, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !164, line: 101, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !164, line: 82, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !164, line: 83, size: 768, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !180, !181, !182, !186, !193, !209, !210, !211}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !171, file: !164, line: 84, baseType: !97, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !171, file: !164, line: 85, baseType: !97, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !164, line: 86, baseType: !107, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !171, file: !164, line: 87, baseType: !89, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !171, file: !164, line: 88, baseType: !178, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !171, file: !164, line: 89, baseType: !49, size: 8, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !171, file: !164, line: 90, baseType: !97, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !171, file: !164, line: 91, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 46, baseType: !185)
!184 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!185 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !171, file: !164, line: 92, baseType: !187, size: 32, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !189, size: 32, elements: !190)
!189 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!190 = !{!191, !192}
!191 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!192 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !164, line: 93, baseType: !194, size: 32, offset: 544)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !164, line: 81, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 81, baseType: !189, size: 32, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!197 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!198 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!199 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!200 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!201 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!202 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!203 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!204 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!205 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !164, line: 94, baseType: !169, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !171, file: !164, line: 95, baseType: !97, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !171, file: !164, line: 96, baseType: !107, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !165, file: !164, line: 102, baseType: !97, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !165, file: !164, line: 102, baseType: !97, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !165, file: !164, line: 103, baseType: !97, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !165, file: !164, line: 104, baseType: !26, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !165, file: !164, line: 105, baseType: !187, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !165, file: !164, line: 105, baseType: !187, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !165, file: !164, line: 105, baseType: !187, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !165, file: !164, line: 106, baseType: !9, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !165, file: !164, line: 107, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !164, line: 10, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !164, line: 10, flags: DIFlagFwdDecl)
!224 = !{!225}
!225 = !DISubrange(count: 5)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !11, file: !12, line: 113, baseType: !227, size: 320, offset: 3648)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 320, elements: !224)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!6, !9, !107}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !11, file: !12, line: 114, baseType: !232, size: 320, offset: 3968)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 320, elements: !224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !11, file: !12, line: 115, baseType: !187, size: 32, offset: 4288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !11, file: !12, line: 120, baseType: !221, size: 64, offset: 4352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !11, file: !12, line: 121, baseType: !187, size: 32, offset: 4416)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !238, retainedTypes: !310, globals: !311, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/destroy.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!238 = !{!188, !195, !239, !245, !265}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 663, baseType: !189, size: 32, elements: !241)
!240 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!241 = !{!242, !243, !244}
!242 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 385, baseType: !189, size: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!247 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!248 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!251 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!253 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!254 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!255 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!256 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!257 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!258 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!259 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!260 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!261 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!262 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!263 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 119, baseType: !189, size: 32, elements: !267)
!266 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!268 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!269 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!272 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!273 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!274 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!275 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!276 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!277 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!278 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!279 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!280 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!281 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!282 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!283 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!284 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!285 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!286 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!287 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!288 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!289 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!290 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!291 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!292 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!293 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!294 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!295 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!296 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!297 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!302 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!310 = !{!107, !26, !47, !9, !97}
!311 = !{!312, !313, !318, !324, !326}
!312 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "PetscObjectRegisterDestroy_Objects", scope: !236, file: !3, line: 286, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 16384, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 256)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "PetscRegisterFinalize_Functions", scope: !236, file: !3, line: 341, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 16384, elements: !316)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!6}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "PetscObjectRegisterDestroy_Count", scope: !236, file: !3, line: 285, type: !8, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "PetscRegisterFinalize_Count", scope: !236, file: !3, line: 340, type: !8, isLocal: true, isDefinition: true)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !337, !338, !340, !344, !346, !348, !350}
!329 = !DILocalVariable(name: "obj", arg: 1, scope: !2, file: !3, line: 108, type: !9)
!330 = !DILocalVariable(name: "bobj", arg: 2, scope: !2, file: !3, line: 108, type: !9)
!331 = !DILocalVariable(name: "optionname", arg: 3, scope: !2, file: !3, line: 108, type: !47)
!332 = !DILocalVariable(name: "ierr", scope: !2, file: !3, line: 110, type: !6)
!333 = !DILocalVariable(name: "viewer", scope: !2, file: !3, line: 111, type: !34)
!334 = !DILocalVariable(name: "flg", scope: !2, file: !3, line: 112, type: !187)
!335 = !DILocalVariable(name: "format", scope: !2, file: !3, line: 114, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !266, line: 162, baseType: !265)
!337 = !DILocalVariable(name: "prefix", scope: !2, file: !3, line: 115, type: !47)
!338 = !DILocalVariable(name: "ierr__", scope: !339, file: !3, line: 121, type: !6)
!339 = distinct !DILexicalBlock(scope: !2, file: !3, line: 121, column: 121)
!340 = !DILocalVariable(name: "ierr__", scope: !341, file: !3, line: 123, type: !6)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 123, column: 49)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 122, column: 12)
!343 = distinct !DILexicalBlock(scope: !2, file: !3, line: 122, column: 7)
!344 = !DILocalVariable(name: "ierr__", scope: !345, file: !3, line: 124, type: !6)
!345 = distinct !DILexicalBlock(scope: !342, file: !3, line: 124, column: 40)
!346 = !DILocalVariable(name: "ierr__", scope: !347, file: !3, line: 125, type: !6)
!347 = distinct !DILexicalBlock(scope: !342, file: !3, line: 125, column: 37)
!348 = !DILocalVariable(name: "ierr__", scope: !349, file: !3, line: 126, type: !6)
!349 = distinct !DILexicalBlock(scope: !342, file: !3, line: 126, column: 41)
!350 = !DILocalVariable(name: "ierr__", scope: !351, file: !3, line: 127, type: !6)
!351 = distinct !DILexicalBlock(scope: !342, file: !3, line: 127, column: 40)
!352 = !{i32 7, !"Dwarf Version", i32 4}
!353 = !{i32 2, !"Debug Info Version", i32 3}
!354 = !{i32 1, !"wchar_size", i32 4}
!355 = !{i32 7, !"PIC Level", i32 2}
!356 = !{i32 7, !"uwtable", i32 1}
!357 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!358 = distinct !DISubprogram(name: "PetscComposedQuantitiesDestroy", scope: !3, file: !3, line: 8, type: !359, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!6, !9}
!361 = !{!362, !363, !364, !365, !372, !374, !381, !383, !390, !392, !394, !396}
!362 = !DILocalVariable(name: "obj", arg: 1, scope: !358, file: !3, line: 8, type: !9)
!363 = !DILocalVariable(name: "ierr", scope: !358, file: !3, line: 10, type: !6)
!364 = !DILocalVariable(name: "i", scope: !358, file: !3, line: 11, type: !70)
!365 = !DILocalVariable(name: "ierr__", scope: !366, file: !3, line: 16, type: !6)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 16, column: 53)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 15, column: 42)
!368 = distinct !DILexicalBlock(scope: !369, file: !3, line: 15, column: 5)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 15, column: 5)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 14, column: 29)
!371 = distinct !DILexicalBlock(scope: !358, file: !3, line: 14, column: 7)
!372 = !DILocalVariable(name: "ierr__", scope: !373, file: !3, line: 18, type: !6)
!373 = distinct !DILexicalBlock(scope: !370, file: !3, line: 18, column: 75)
!374 = !DILocalVariable(name: "ierr__", scope: !375, file: !3, line: 22, type: !6)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 22, column: 54)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 21, column: 43)
!377 = distinct !DILexicalBlock(scope: !378, file: !3, line: 21, column: 5)
!378 = distinct !DILexicalBlock(scope: !379, file: !3, line: 21, column: 5)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 20, column: 30)
!380 = distinct !DILexicalBlock(scope: !358, file: !3, line: 20, column: 7)
!381 = !DILocalVariable(name: "ierr__", scope: !382, file: !3, line: 24, type: !6)
!382 = distinct !DILexicalBlock(scope: !379, file: !3, line: 24, column: 77)
!383 = !DILocalVariable(name: "ierr__", scope: !384, file: !3, line: 28, type: !6)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 28, column: 56)
!385 = distinct !DILexicalBlock(scope: !386, file: !3, line: 27, column: 45)
!386 = distinct !DILexicalBlock(scope: !387, file: !3, line: 27, column: 5)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 27, column: 5)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 26, column: 32)
!389 = distinct !DILexicalBlock(scope: !358, file: !3, line: 26, column: 7)
!390 = !DILocalVariable(name: "ierr__", scope: !391, file: !3, line: 30, type: !6)
!391 = distinct !DILexicalBlock(scope: !388, file: !3, line: 30, column: 81)
!392 = !DILocalVariable(name: "ierr__", scope: !393, file: !3, line: 32, type: !6)
!393 = distinct !DILexicalBlock(scope: !358, file: !3, line: 32, column: 65)
!394 = !DILocalVariable(name: "ierr__", scope: !395, file: !3, line: 33, type: !6)
!395 = distinct !DILexicalBlock(scope: !358, file: !3, line: 33, column: 67)
!396 = !DILocalVariable(name: "ierr__", scope: !397, file: !3, line: 34, type: !6)
!397 = distinct !DILexicalBlock(scope: !358, file: !3, line: 34, column: 71)
!398 = !DILocation(line: 0, scope: !358)
!399 = !DILocation(line: 13, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 13, column: 3)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 13, column: 3)
!402 = distinct !DILexicalBlock(scope: !358, file: !3, line: 13, column: 3)
!403 = !{!404, !404, i64 0}
!404 = !{!"any pointer", !405, i64 0}
!405 = !{!"omnipotent char", !406, i64 0}
!406 = !{!"Simple C/C++ TBAA"}
!407 = !DILocation(line: 13, column: 3, scope: !401)
!408 = !DILocation(line: 13, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 13, column: 3)
!410 = distinct !DILexicalBlock(scope: !400, file: !3, line: 13, column: 3)
!411 = !{!412, !413, i64 1536}
!412 = !{!"", !405, i64 0, !405, i64 512, !405, i64 1024, !405, i64 1280, !413, i64 1536, !413, i64 1540, !405, i64 1544}
!413 = !{!"int", !405, i64 0}
!414 = !DILocation(line: 13, column: 3, scope: !410)
!415 = !DILocation(line: 13, column: 3, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !3, line: 13, column: 3)
!417 = !{!413, !413, i64 0}
!418 = !{!412, !413, i64 1540}
!419 = !DILocation(line: 14, column: 12, scope: !371)
!420 = !{!421, !413, i64 236}
!421 = !{!"_p_PetscObject", !413, i64 0, !405, i64 8, !404, i64 64, !413, i64 72, !422, i64 80, !422, i64 88, !422, i64 96, !422, i64 104, !423, i64 112, !413, i64 120, !413, i64 124, !404, i64 128, !404, i64 136, !404, i64 144, !404, i64 152, !404, i64 160, !404, i64 168, !404, i64 176, !423, i64 184, !404, i64 192, !404, i64 200, !413, i64 208, !404, i64 216, !423, i64 224, !413, i64 232, !413, i64 236, !404, i64 240, !404, i64 248, !404, i64 256, !404, i64 264, !413, i64 272, !413, i64 276, !404, i64 280, !404, i64 288, !404, i64 296, !404, i64 304, !413, i64 312, !413, i64 316, !404, i64 320, !404, i64 328, !404, i64 336, !404, i64 344, !404, i64 352, !413, i64 360, !405, i64 368, !405, i64 384, !404, i64 392, !404, i64 400, !413, i64 408, !405, i64 416, !405, i64 456, !405, i64 496, !405, i64 536, !404, i64 544, !405, i64 552}
!422 = !{!"double", !405, i64 0}
!423 = !{!"long", !405, i64 0}
!424 = !DILocation(line: 14, column: 25, scope: !371)
!425 = !DILocation(line: 14, column: 7, scope: !358)
!426 = !DILocation(line: 15, column: 5, scope: !369)
!427 = !DILocation(line: 16, column: 14, scope: !367)
!428 = !{!421, !404, i64 264}
!429 = !DILocation(line: 0, scope: !366)
!430 = !DILocation(line: 16, column: 53, scope: !431)
!431 = distinct !DILexicalBlock(scope: !366, file: !3, line: 16, column: 53)
!432 = !DILocation(line: 15, column: 38, scope: !368)
!433 = !DILocation(line: 15, column: 22, scope: !368)
!434 = !DILocation(line: 15, column: 16, scope: !368)
!435 = distinct !{!435, !426, !436, !437}
!436 = !DILocation(line: 17, column: 5, scope: !369)
!437 = !{!"llvm.loop.mustprogress"}
!438 = !DILocation(line: 18, column: 12, scope: !370)
!439 = !DILocation(line: 0, scope: !373)
!440 = !DILocation(line: 18, column: 75, scope: !441)
!441 = distinct !DILexicalBlock(scope: !373, file: !3, line: 18, column: 75)
!442 = !DILocation(line: 18, column: 75, scope: !373)
!443 = !{!"branch_weights", i32 2000, i32 1}
!444 = !DILocation(line: 20, column: 12, scope: !380)
!445 = !{!421, !413, i64 276}
!446 = !DILocation(line: 20, column: 26, scope: !380)
!447 = !DILocation(line: 20, column: 7, scope: !358)
!448 = !DILocation(line: 21, column: 5, scope: !378)
!449 = !DILocation(line: 22, column: 14, scope: !376)
!450 = !{!421, !404, i64 304}
!451 = !DILocation(line: 0, scope: !375)
!452 = !DILocation(line: 22, column: 54, scope: !453)
!453 = distinct !DILexicalBlock(scope: !375, file: !3, line: 22, column: 54)
!454 = !DILocation(line: 21, column: 39, scope: !377)
!455 = !DILocation(line: 21, column: 22, scope: !377)
!456 = !DILocation(line: 21, column: 16, scope: !377)
!457 = distinct !{!457, !448, !458, !437}
!458 = !DILocation(line: 23, column: 5, scope: !378)
!459 = !DILocation(line: 24, column: 12, scope: !379)
!460 = !DILocation(line: 0, scope: !382)
!461 = !DILocation(line: 24, column: 77, scope: !462)
!462 = distinct !DILexicalBlock(scope: !382, file: !3, line: 24, column: 77)
!463 = !DILocation(line: 24, column: 77, scope: !382)
!464 = !DILocation(line: 26, column: 12, scope: !389)
!465 = !{!421, !413, i64 316}
!466 = !DILocation(line: 26, column: 28, scope: !389)
!467 = !DILocation(line: 26, column: 7, scope: !358)
!468 = !DILocation(line: 27, column: 5, scope: !387)
!469 = !DILocation(line: 28, column: 14, scope: !385)
!470 = !{!421, !404, i64 344}
!471 = !DILocation(line: 0, scope: !384)
!472 = !DILocation(line: 28, column: 56, scope: !473)
!473 = distinct !DILexicalBlock(scope: !384, file: !3, line: 28, column: 56)
!474 = !DILocation(line: 27, column: 41, scope: !386)
!475 = !DILocation(line: 27, column: 22, scope: !386)
!476 = !DILocation(line: 27, column: 16, scope: !386)
!477 = distinct !{!477, !468, !478, !437}
!478 = !DILocation(line: 29, column: 5, scope: !387)
!479 = !DILocation(line: 30, column: 12, scope: !388)
!480 = !DILocation(line: 0, scope: !391)
!481 = !DILocation(line: 30, column: 81, scope: !482)
!482 = distinct !DILexicalBlock(scope: !391, file: !3, line: 30, column: 81)
!483 = !DILocation(line: 30, column: 81, scope: !391)
!484 = !DILocation(line: 32, column: 10, scope: !358)
!485 = !DILocation(line: 0, scope: !393)
!486 = !DILocation(line: 32, column: 65, scope: !487)
!487 = distinct !DILexicalBlock(scope: !393, file: !3, line: 32, column: 65)
!488 = !DILocation(line: 32, column: 65, scope: !393)
!489 = !DILocation(line: 33, column: 10, scope: !358)
!490 = !DILocation(line: 0, scope: !395)
!491 = !DILocation(line: 33, column: 67, scope: !492)
!492 = distinct !DILexicalBlock(scope: !395, file: !3, line: 33, column: 67)
!493 = !DILocation(line: 33, column: 67, scope: !395)
!494 = !DILocation(line: 34, column: 10, scope: !358)
!495 = !DILocation(line: 0, scope: !397)
!496 = !DILocation(line: 34, column: 71, scope: !497)
!497 = distinct !DILexicalBlock(scope: !397, file: !3, line: 34, column: 71)
!498 = !DILocation(line: 34, column: 71, scope: !397)
!499 = !DILocation(line: 35, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 35, column: 3)
!501 = distinct !DILexicalBlock(scope: !502, file: !3, line: 35, column: 3)
!502 = distinct !DILexicalBlock(scope: !358, file: !3, line: 35, column: 3)
!503 = !DILocation(line: 35, column: 3, scope: !501)
!504 = !DILocation(line: 35, column: 3, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !3, line: 35, column: 3)
!506 = distinct !DILexicalBlock(scope: !500, file: !3, line: 35, column: 3)
!507 = !DILocation(line: 35, column: 3, scope: !506)
!508 = !DILocation(line: 35, column: 3, scope: !509)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 35, column: 3)
!510 = distinct !DILexicalBlock(scope: !505, file: !3, line: 35, column: 3)
!511 = !{!412, !405, i64 1544}
!512 = !DILocation(line: 35, column: 3, scope: !510)
!513 = !DILocation(line: 35, column: 3, scope: !514)
!514 = distinct !DILexicalBlock(scope: !509, file: !3, line: 35, column: 3)
!515 = !DILocation(line: 35, column: 3, scope: !516)
!516 = distinct !DILexicalBlock(scope: !505, file: !3, line: 35, column: 3)
!517 = !DILocation(line: 35, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !516, file: !3, line: 35, column: 3)
!519 = !DILocation(line: 35, column: 3, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !3, line: 35, column: 3)
!521 = distinct !DILexicalBlock(scope: !518, file: !3, line: 35, column: 3)
!522 = !DILocation(line: 35, column: 3, scope: !521)
!523 = !DILocation(line: 35, column: 3, scope: !524)
!524 = distinct !DILexicalBlock(scope: !520, file: !3, line: 35, column: 3)
!525 = !DILocation(line: 36, column: 1, scope: !358)
!526 = !DISubprogram(name: "PetscError", scope: !240, file: !240, line: 668, type: !527, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{!6, !28, !8, !47, !47, !8, !239, !47, null}
!529 = !{}
!530 = !DISubprogram(name: "PetscFreeA", scope: !531, file: !531, line: 1289, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!531 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!532 = !DISubroutineType(types: !533)
!533 = !{!6, !8, !8, !47, !47, !107, null}
!534 = distinct !DISubprogram(name: "PetscObjectDestroy", scope: !3, file: !3, line: 51, type: !40, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !535)
!535 = !{!536, !537, !538}
!536 = !DILocalVariable(name: "obj", arg: 1, scope: !534, file: !3, line: 51, type: !42)
!537 = !DILocalVariable(name: "ierr", scope: !534, file: !3, line: 53, type: !6)
!538 = !DILocalVariable(name: "ierr__", scope: !539, file: !3, line: 59, type: !6)
!539 = distinct !DILexicalBlock(scope: !540, file: !3, line: 59, column: 42)
!540 = distinct !DILexicalBlock(scope: !541, file: !3, line: 58, column: 38)
!541 = distinct !DILexicalBlock(scope: !534, file: !3, line: 58, column: 7)
!542 = !DILocation(line: 0, scope: !534)
!543 = !DILocation(line: 55, column: 3, scope: !544)
!544 = distinct !DILexicalBlock(scope: !545, file: !3, line: 55, column: 3)
!545 = distinct !DILexicalBlock(scope: !546, file: !3, line: 55, column: 3)
!546 = distinct !DILexicalBlock(scope: !534, file: !3, line: 55, column: 3)
!547 = !DILocation(line: 55, column: 3, scope: !545)
!548 = !DILocation(line: 55, column: 3, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !3, line: 55, column: 3)
!550 = distinct !DILexicalBlock(scope: !544, file: !3, line: 55, column: 3)
!551 = !DILocation(line: 55, column: 3, scope: !550)
!552 = !DILocation(line: 55, column: 3, scope: !553)
!553 = distinct !DILexicalBlock(scope: !549, file: !3, line: 55, column: 3)
!554 = !DILocation(line: 56, column: 8, scope: !555)
!555 = distinct !DILexicalBlock(scope: !534, file: !3, line: 56, column: 7)
!556 = !DILocation(line: 56, column: 7, scope: !534)
!557 = !DILocation(line: 56, column: 14, scope: !558)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 56, column: 14)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 56, column: 14)
!560 = distinct !DILexicalBlock(scope: !561, file: !3, line: 56, column: 14)
!561 = distinct !DILexicalBlock(scope: !562, file: !3, line: 56, column: 14)
!562 = distinct !DILexicalBlock(scope: !555, file: !3, line: 56, column: 14)
!563 = !DILocation(line: 56, column: 14, scope: !559)
!564 = !DILocation(line: 56, column: 14, scope: !565)
!565 = distinct !DILexicalBlock(scope: !566, file: !3, line: 56, column: 14)
!566 = distinct !DILexicalBlock(scope: !558, file: !3, line: 56, column: 14)
!567 = !DILocation(line: 56, column: 14, scope: !566)
!568 = !DILocation(line: 56, column: 14, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !3, line: 56, column: 14)
!570 = !DILocation(line: 56, column: 14, scope: !571)
!571 = distinct !DILexicalBlock(scope: !558, file: !3, line: 56, column: 14)
!572 = !DILocation(line: 56, column: 14, scope: !573)
!573 = distinct !DILexicalBlock(scope: !571, file: !3, line: 56, column: 14)
!574 = !DILocation(line: 56, column: 14, scope: !575)
!575 = distinct !DILexicalBlock(scope: !576, file: !3, line: 56, column: 14)
!576 = distinct !DILexicalBlock(scope: !573, file: !3, line: 56, column: 14)
!577 = !DILocation(line: 56, column: 14, scope: !576)
!578 = !DILocation(line: 56, column: 14, scope: !579)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 56, column: 14)
!580 = !DILocation(line: 57, column: 3, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !3, line: 57, column: 3)
!582 = distinct !DILexicalBlock(scope: !534, file: !3, line: 57, column: 3)
!583 = !DILocation(line: 57, column: 3, scope: !582)
!584 = !DILocation(line: 57, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !582, file: !3, line: 57, column: 3)
!586 = !{!421, !413, i64 0}
!587 = !DILocation(line: 57, column: 3, scope: !588)
!588 = distinct !DILexicalBlock(scope: !585, file: !3, line: 57, column: 3)
!589 = !DILocation(line: 58, column: 29, scope: !541)
!590 = !{!591, !404, i64 16}
!591 = !{!"", !404, i64 0, !404, i64 8, !404, i64 16, !404, i64 24, !404, i64 32, !404, i64 40, !404, i64 48}
!592 = !DILocation(line: 58, column: 15, scope: !541)
!593 = !DILocation(line: 58, column: 7, scope: !534)
!594 = !DILocation(line: 59, column: 12, scope: !540)
!595 = !DILocation(line: 0, scope: !539)
!596 = !DILocation(line: 59, column: 42, scope: !597)
!597 = distinct !DILexicalBlock(scope: !539, file: !3, line: 59, column: 42)
!598 = !DILocation(line: 59, column: 42, scope: !539)
!599 = !DILocation(line: 60, column: 20, scope: !600)
!600 = distinct !DILexicalBlock(scope: !541, file: !3, line: 60, column: 14)
!601 = !{!421, !404, i64 144}
!602 = !DILocation(line: 61, column: 3, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !3, line: 61, column: 3)
!604 = distinct !DILexicalBlock(scope: !605, file: !3, line: 61, column: 3)
!605 = distinct !DILexicalBlock(scope: !534, file: !3, line: 61, column: 3)
!606 = !DILocation(line: 61, column: 3, scope: !604)
!607 = !DILocation(line: 61, column: 3, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 61, column: 3)
!609 = distinct !DILexicalBlock(scope: !603, file: !3, line: 61, column: 3)
!610 = !DILocation(line: 61, column: 3, scope: !609)
!611 = !DILocation(line: 61, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 61, column: 3)
!613 = distinct !DILexicalBlock(scope: !608, file: !3, line: 61, column: 3)
!614 = !DILocation(line: 61, column: 3, scope: !613)
!615 = !DILocation(line: 61, column: 3, scope: !616)
!616 = distinct !DILexicalBlock(scope: !612, file: !3, line: 61, column: 3)
!617 = !DILocation(line: 61, column: 3, scope: !618)
!618 = distinct !DILexicalBlock(scope: !608, file: !3, line: 61, column: 3)
!619 = !DILocation(line: 61, column: 3, scope: !620)
!620 = distinct !DILexicalBlock(scope: !618, file: !3, line: 61, column: 3)
!621 = !DILocation(line: 61, column: 3, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 61, column: 3)
!623 = distinct !DILexicalBlock(scope: !620, file: !3, line: 61, column: 3)
!624 = !DILocation(line: 61, column: 3, scope: !623)
!625 = !DILocation(line: 61, column: 3, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !3, line: 61, column: 3)
!627 = !DILocation(line: 62, column: 1, scope: !534)
!628 = !DISubprogram(name: "PetscCheckPointer", scope: !12, file: !12, line: 183, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!629 = !DISubroutineType(types: !630)
!630 = !{!188, !631, !245}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!633 = distinct !DISubprogram(name: "PetscObjectView", scope: !3, file: !3, line: 78, type: !32, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !634)
!634 = !{!635, !636, !637, !638, !642}
!635 = !DILocalVariable(name: "obj", arg: 1, scope: !633, file: !3, line: 78, type: !9)
!636 = !DILocalVariable(name: "viewer", arg: 2, scope: !633, file: !3, line: 78, type: !34)
!637 = !DILocalVariable(name: "ierr", scope: !633, file: !3, line: 80, type: !6)
!638 = !DILocalVariable(name: "ierr__", scope: !639, file: !3, line: 85, type: !6)
!639 = distinct !DILexicalBlock(scope: !640, file: !3, line: 85, column: 57)
!640 = distinct !DILexicalBlock(scope: !641, file: !3, line: 84, column: 16)
!641 = distinct !DILexicalBlock(scope: !633, file: !3, line: 84, column: 7)
!642 = !DILocalVariable(name: "ierr__", scope: !643, file: !3, line: 90, type: !6)
!643 = distinct !DILexicalBlock(scope: !644, file: !3, line: 90, column: 43)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 89, column: 24)
!645 = distinct !DILexicalBlock(scope: !633, file: !3, line: 89, column: 7)
!646 = !DILocation(line: 0, scope: !633)
!647 = !DILocation(line: 82, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 82, column: 3)
!649 = distinct !DILexicalBlock(scope: !650, file: !3, line: 82, column: 3)
!650 = distinct !DILexicalBlock(scope: !633, file: !3, line: 82, column: 3)
!651 = !DILocation(line: 82, column: 3, scope: !649)
!652 = !DILocation(line: 82, column: 3, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !3, line: 82, column: 3)
!654 = distinct !DILexicalBlock(scope: !648, file: !3, line: 82, column: 3)
!655 = !DILocation(line: 82, column: 3, scope: !654)
!656 = !DILocation(line: 82, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !653, file: !3, line: 82, column: 3)
!658 = !DILocation(line: 83, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !3, line: 83, column: 3)
!660 = distinct !DILexicalBlock(scope: !633, file: !3, line: 83, column: 3)
!661 = !DILocation(line: 83, column: 3, scope: !660)
!662 = !DILocation(line: 83, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !660, file: !3, line: 83, column: 3)
!664 = !DILocation(line: 83, column: 3, scope: !665)
!665 = distinct !DILexicalBlock(scope: !660, file: !3, line: 83, column: 3)
!666 = !DILocation(line: 83, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !665, file: !3, line: 83, column: 3)
!668 = !DILocation(line: 84, column: 8, scope: !641)
!669 = !DILocation(line: 84, column: 7, scope: !633)
!670 = !DILocation(line: 85, column: 43, scope: !640)
!671 = !{!421, !404, i64 64}
!672 = !DILocation(line: 85, column: 12, scope: !640)
!673 = !DILocation(line: 0, scope: !639)
!674 = !DILocation(line: 85, column: 57, scope: !675)
!675 = distinct !DILexicalBlock(scope: !639, file: !3, line: 85, column: 57)
!676 = !DILocation(line: 85, column: 57, scope: !639)
!677 = !DILocation(line: 87, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 87, column: 3)
!679 = distinct !DILexicalBlock(scope: !633, file: !3, line: 87, column: 3)
!680 = !DILocation(line: 87, column: 3, scope: !679)
!681 = !DILocation(line: 87, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !679, file: !3, line: 87, column: 3)
!683 = !DILocation(line: 87, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !679, file: !3, line: 87, column: 3)
!685 = !DILocation(line: 87, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 87, column: 3)
!687 = distinct !DILexicalBlock(scope: !684, file: !3, line: 87, column: 3)
!688 = !DILocation(line: 87, column: 3, scope: !687)
!689 = !DILocation(line: 89, column: 18, scope: !645)
!690 = !{!591, !404, i64 8}
!691 = !DILocation(line: 89, column: 7, scope: !645)
!692 = !DILocation(line: 89, column: 7, scope: !633)
!693 = !DILocation(line: 90, column: 12, scope: !644)
!694 = !DILocation(line: 0, scope: !643)
!695 = !DILocation(line: 90, column: 43, scope: !696)
!696 = distinct !DILexicalBlock(scope: !643, file: !3, line: 90, column: 43)
!697 = !DILocation(line: 90, column: 43, scope: !643)
!698 = !DILocation(line: 91, column: 10, scope: !645)
!699 = !DILocation(line: 92, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 92, column: 3)
!701 = distinct !DILexicalBlock(scope: !702, file: !3, line: 92, column: 3)
!702 = distinct !DILexicalBlock(scope: !633, file: !3, line: 92, column: 3)
!703 = !DILocation(line: 92, column: 3, scope: !701)
!704 = !DILocation(line: 92, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !706, file: !3, line: 92, column: 3)
!706 = distinct !DILexicalBlock(scope: !700, file: !3, line: 92, column: 3)
!707 = !DILocation(line: 92, column: 3, scope: !706)
!708 = !DILocation(line: 92, column: 3, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !3, line: 92, column: 3)
!710 = distinct !DILexicalBlock(scope: !705, file: !3, line: 92, column: 3)
!711 = !DILocation(line: 92, column: 3, scope: !710)
!712 = !DILocation(line: 92, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !709, file: !3, line: 92, column: 3)
!714 = !DILocation(line: 92, column: 3, scope: !715)
!715 = distinct !DILexicalBlock(scope: !705, file: !3, line: 92, column: 3)
!716 = !DILocation(line: 92, column: 3, scope: !717)
!717 = distinct !DILexicalBlock(scope: !715, file: !3, line: 92, column: 3)
!718 = !DILocation(line: 92, column: 3, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 92, column: 3)
!720 = distinct !DILexicalBlock(scope: !717, file: !3, line: 92, column: 3)
!721 = !DILocation(line: 92, column: 3, scope: !720)
!722 = !DILocation(line: 92, column: 3, scope: !723)
!723 = distinct !DILexicalBlock(scope: !719, file: !3, line: 92, column: 3)
!724 = !DILocation(line: 93, column: 1, scope: !633)
!725 = !DISubprogram(name: "PetscViewerASCIIGetStdout", scope: !266, file: !266, line: 282, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!726 = !DISubroutineType(types: !727)
!727 = !{!8, !28, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!729 = !DILocation(line: 0, scope: !2)
!730 = !DILocation(line: 111, column: 3, scope: !2)
!731 = !DILocation(line: 112, column: 3, scope: !2)
!732 = !DILocation(line: 114, column: 3, scope: !2)
!733 = !DILocation(line: 117, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 117, column: 3)
!735 = distinct !DILexicalBlock(scope: !736, file: !3, line: 117, column: 3)
!736 = distinct !DILexicalBlock(scope: !2, file: !3, line: 117, column: 3)
!737 = !DILocation(line: 117, column: 3, scope: !735)
!738 = !DILocation(line: 117, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !3, line: 117, column: 3)
!740 = distinct !DILexicalBlock(scope: !734, file: !3, line: 117, column: 3)
!741 = !DILocation(line: 117, column: 3, scope: !740)
!742 = !DILocation(line: 117, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !739, file: !3, line: 117, column: 3)
!744 = !DILocation(line: 118, column: 7, scope: !745)
!745 = distinct !DILexicalBlock(scope: !2, file: !3, line: 118, column: 7)
!746 = !DILocation(line: 118, column: 7, scope: !2)
!747 = !DILocation(line: 118, column: 15, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 118, column: 15)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 118, column: 15)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 118, column: 15)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 118, column: 15)
!752 = distinct !DILexicalBlock(scope: !745, file: !3, line: 118, column: 15)
!753 = !DILocation(line: 118, column: 15, scope: !749)
!754 = !DILocation(line: 118, column: 15, scope: !755)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 118, column: 15)
!756 = distinct !DILexicalBlock(scope: !748, file: !3, line: 118, column: 15)
!757 = !DILocation(line: 118, column: 15, scope: !756)
!758 = !DILocation(line: 118, column: 15, scope: !759)
!759 = distinct !DILexicalBlock(scope: !755, file: !3, line: 118, column: 15)
!760 = !DILocation(line: 118, column: 15, scope: !761)
!761 = distinct !DILexicalBlock(scope: !748, file: !3, line: 118, column: 15)
!762 = !DILocation(line: 118, column: 15, scope: !763)
!763 = distinct !DILexicalBlock(scope: !761, file: !3, line: 118, column: 15)
!764 = !DILocation(line: 118, column: 15, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 118, column: 15)
!766 = distinct !DILexicalBlock(scope: !763, file: !3, line: 118, column: 15)
!767 = !DILocation(line: 118, column: 15, scope: !766)
!768 = !DILocation(line: 118, column: 15, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 118, column: 15)
!770 = !DILocation(line: 119, column: 10, scope: !2)
!771 = !DILocation(line: 120, column: 12, scope: !2)
!772 = !{!421, !404, i64 200}
!773 = !DILocation(line: 121, column: 34, scope: !2)
!774 = !DILocation(line: 121, column: 73, scope: !2)
!775 = !{!421, !404, i64 544}
!776 = !DILocation(line: 121, column: 12, scope: !2)
!777 = !DILocation(line: 0, scope: !339)
!778 = !DILocation(line: 121, column: 121, scope: !779)
!779 = distinct !DILexicalBlock(scope: !339, file: !3, line: 121, column: 121)
!780 = !DILocation(line: 121, column: 121, scope: !339)
!781 = !DILocation(line: 122, column: 7, scope: !343)
!782 = !{!405, !405, i64 0}
!783 = !DILocation(line: 122, column: 7, scope: !2)
!784 = !DILocation(line: 123, column: 34, scope: !342)
!785 = !DILocation(line: 123, column: 41, scope: !342)
!786 = !DILocation(line: 123, column: 12, scope: !342)
!787 = !DILocation(line: 0, scope: !341)
!788 = !DILocation(line: 123, column: 49, scope: !789)
!789 = distinct !DILexicalBlock(scope: !341, file: !3, line: 123, column: 49)
!790 = !DILocation(line: 123, column: 49, scope: !341)
!791 = !DILocation(line: 124, column: 32, scope: !342)
!792 = !DILocation(line: 124, column: 12, scope: !342)
!793 = !DILocation(line: 0, scope: !345)
!794 = !DILocation(line: 124, column: 40, scope: !795)
!795 = distinct !DILexicalBlock(scope: !345, file: !3, line: 124, column: 40)
!796 = !DILocation(line: 124, column: 40, scope: !345)
!797 = !DILocation(line: 125, column: 29, scope: !342)
!798 = !DILocation(line: 125, column: 12, scope: !342)
!799 = !DILocation(line: 0, scope: !347)
!800 = !DILocation(line: 125, column: 37, scope: !801)
!801 = distinct !DILexicalBlock(scope: !347, file: !3, line: 125, column: 37)
!802 = !DILocation(line: 125, column: 37, scope: !347)
!803 = !DILocation(line: 126, column: 33, scope: !342)
!804 = !DILocation(line: 126, column: 12, scope: !342)
!805 = !DILocation(line: 0, scope: !349)
!806 = !DILocation(line: 126, column: 41, scope: !807)
!807 = distinct !DILexicalBlock(scope: !349, file: !3, line: 126, column: 41)
!808 = !DILocation(line: 126, column: 41, scope: !349)
!809 = !DILocation(line: 127, column: 12, scope: !342)
!810 = !DILocation(line: 0, scope: !351)
!811 = !DILocation(line: 127, column: 40, scope: !812)
!812 = distinct !DILexicalBlock(scope: !351, file: !3, line: 127, column: 40)
!813 = !DILocation(line: 127, column: 40, scope: !351)
!814 = !DILocation(line: 129, column: 10, scope: !2)
!815 = !DILocation(line: 130, column: 3, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 130, column: 3)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 130, column: 3)
!818 = distinct !DILexicalBlock(scope: !2, file: !3, line: 130, column: 3)
!819 = !DILocation(line: 130, column: 3, scope: !817)
!820 = !DILocation(line: 130, column: 3, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 130, column: 3)
!822 = distinct !DILexicalBlock(scope: !816, file: !3, line: 130, column: 3)
!823 = !DILocation(line: 130, column: 3, scope: !822)
!824 = !DILocation(line: 130, column: 3, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 130, column: 3)
!826 = distinct !DILexicalBlock(scope: !821, file: !3, line: 130, column: 3)
!827 = !DILocation(line: 130, column: 3, scope: !826)
!828 = !DILocation(line: 130, column: 3, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !3, line: 130, column: 3)
!830 = !DILocation(line: 130, column: 3, scope: !831)
!831 = distinct !DILexicalBlock(scope: !821, file: !3, line: 130, column: 3)
!832 = !DILocation(line: 130, column: 3, scope: !833)
!833 = distinct !DILexicalBlock(scope: !831, file: !3, line: 130, column: 3)
!834 = !DILocation(line: 130, column: 3, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !3, line: 130, column: 3)
!836 = distinct !DILexicalBlock(scope: !833, file: !3, line: 130, column: 3)
!837 = !DILocation(line: 130, column: 3, scope: !836)
!838 = !DILocation(line: 130, column: 3, scope: !839)
!839 = distinct !DILexicalBlock(scope: !835, file: !3, line: 130, column: 3)
!840 = !DILocation(line: 131, column: 1, scope: !2)
!841 = !DISubprogram(name: "PetscOptionsGetViewer", scope: !266, file: !266, line: 174, type: !842, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!842 = !DISubroutineType(types: !843)
!843 = !{!8, !28, !222, !47, !47, !728, !844, !845}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!846 = !DISubprogram(name: "PetscObjectComm", scope: !531, file: !531, line: 2649, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!847 = !DISubroutineType(types: !848)
!848 = !{!28, !10}
!849 = !DISubprogram(name: "PetscViewerPushFormat", scope: !266, file: !266, line: 166, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!850 = !DISubroutineType(types: !851)
!851 = !{!8, !36, !265}
!852 = !DISubprogram(name: "PetscViewerFlush", scope: !266, file: !266, line: 169, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!853 = !DISubroutineType(types: !854)
!854 = !{!8, !36}
!855 = !DISubprogram(name: "PetscViewerPopFormat", scope: !266, file: !266, line: 167, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!856 = !DISubprogram(name: "PetscViewerDestroy", scope: !266, file: !266, line: 92, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!857 = !DISubroutineType(types: !858)
!858 = !{!8, !728}
!859 = distinct !DISubprogram(name: "PetscObjectTypeCompare", scope: !3, file: !3, line: 152, type: !860, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !863)
!860 = !DISubroutineType(types: !861)
!861 = !{!6, !9, !47, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!863 = !{!864, !865, !866, !867, !868}
!864 = !DILocalVariable(name: "obj", arg: 1, scope: !859, file: !3, line: 152, type: !9)
!865 = !DILocalVariable(name: "type_name", arg: 2, scope: !859, file: !3, line: 152, type: !47)
!866 = !DILocalVariable(name: "same", arg: 3, scope: !859, file: !3, line: 152, type: !862)
!867 = !DILocalVariable(name: "ierr", scope: !859, file: !3, line: 154, type: !6)
!868 = !DILocalVariable(name: "ierr__", scope: !869, file: !3, line: 164, type: !6)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 164, column: 64)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 161, column: 8)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 160, column: 12)
!872 = distinct !DILexicalBlock(scope: !873, file: !3, line: 159, column: 12)
!873 = distinct !DILexicalBlock(scope: !859, file: !3, line: 158, column: 7)
!874 = !DILocation(line: 0, scope: !859)
!875 = !DILocation(line: 156, column: 3, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !3, line: 156, column: 3)
!877 = distinct !DILexicalBlock(scope: !878, file: !3, line: 156, column: 3)
!878 = distinct !DILexicalBlock(scope: !859, file: !3, line: 156, column: 3)
!879 = !DILocation(line: 156, column: 3, scope: !877)
!880 = !DILocation(line: 156, column: 3, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 156, column: 3)
!882 = distinct !DILexicalBlock(scope: !876, file: !3, line: 156, column: 3)
!883 = !DILocation(line: 156, column: 3, scope: !882)
!884 = !DILocation(line: 156, column: 3, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !3, line: 156, column: 3)
!886 = !DILocation(line: 157, column: 3, scope: !887)
!887 = distinct !DILexicalBlock(scope: !888, file: !3, line: 157, column: 3)
!888 = distinct !DILexicalBlock(scope: !859, file: !3, line: 157, column: 3)
!889 = !DILocation(line: 157, column: 3, scope: !888)
!890 = !DILocation(line: 157, column: 3, scope: !891)
!891 = distinct !DILexicalBlock(scope: !888, file: !3, line: 157, column: 3)
!892 = !DILocation(line: 158, column: 8, scope: !873)
!893 = !DILocation(line: 158, column: 7, scope: !859)
!894 = !DILocation(line: 159, column: 13, scope: !872)
!895 = !DILocation(line: 0, scope: !872)
!896 = !{!421, !404, i64 168}
!897 = !DILocation(line: 159, column: 23, scope: !872)
!898 = !DILocation(line: 159, column: 12, scope: !873)
!899 = !DILocation(line: 160, column: 12, scope: !872)
!900 = !DILocation(line: 160, column: 43, scope: !871)
!901 = !DILocation(line: 162, column: 5, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 162, column: 5)
!903 = distinct !DILexicalBlock(scope: !870, file: !3, line: 162, column: 5)
!904 = !DILocation(line: 162, column: 5, scope: !903)
!905 = !DILocation(line: 162, column: 5, scope: !906)
!906 = distinct !DILexicalBlock(scope: !903, file: !3, line: 162, column: 5)
!907 = !DILocation(line: 162, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !906, file: !3, line: 162, column: 5)
!909 = !DILocation(line: 163, column: 5, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 163, column: 5)
!911 = distinct !DILexicalBlock(scope: !870, file: !3, line: 163, column: 5)
!912 = !DILocation(line: 163, column: 5, scope: !911)
!913 = !DILocation(line: 164, column: 37, scope: !870)
!914 = !DILocation(line: 164, column: 12, scope: !870)
!915 = !DILocation(line: 0, scope: !869)
!916 = !DILocation(line: 164, column: 64, scope: !917)
!917 = distinct !DILexicalBlock(scope: !869, file: !3, line: 164, column: 64)
!918 = !DILocation(line: 164, column: 64, scope: !869)
!919 = !DILocation(line: 0, scope: !873)
!920 = !DILocation(line: 166, column: 3, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 166, column: 3)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 166, column: 3)
!923 = distinct !DILexicalBlock(scope: !859, file: !3, line: 166, column: 3)
!924 = !DILocation(line: 166, column: 3, scope: !922)
!925 = !DILocation(line: 166, column: 3, scope: !926)
!926 = distinct !DILexicalBlock(scope: !927, file: !3, line: 166, column: 3)
!927 = distinct !DILexicalBlock(scope: !921, file: !3, line: 166, column: 3)
!928 = !DILocation(line: 166, column: 3, scope: !927)
!929 = !DILocation(line: 166, column: 3, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 166, column: 3)
!931 = distinct !DILexicalBlock(scope: !926, file: !3, line: 166, column: 3)
!932 = !DILocation(line: 166, column: 3, scope: !931)
!933 = !DILocation(line: 166, column: 3, scope: !934)
!934 = distinct !DILexicalBlock(scope: !930, file: !3, line: 166, column: 3)
!935 = !DILocation(line: 166, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !926, file: !3, line: 166, column: 3)
!937 = !DILocation(line: 166, column: 3, scope: !938)
!938 = distinct !DILexicalBlock(scope: !936, file: !3, line: 166, column: 3)
!939 = !DILocation(line: 166, column: 3, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 166, column: 3)
!941 = distinct !DILexicalBlock(scope: !938, file: !3, line: 166, column: 3)
!942 = !DILocation(line: 166, column: 3, scope: !941)
!943 = !DILocation(line: 166, column: 3, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !3, line: 166, column: 3)
!945 = !DILocation(line: 167, column: 1, scope: !859)
!946 = !DISubprogram(name: "PetscStrcmp", scope: !531, file: !531, line: 1346, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!947 = !DISubroutineType(types: !948)
!948 = !{!8, !47, !47, !845}
!949 = distinct !DISubprogram(name: "PetscObjectBaseTypeCompare", scope: !3, file: !3, line: 186, type: !860, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !950)
!950 = !{!951, !952, !953, !954, !955}
!951 = !DILocalVariable(name: "obj", arg: 1, scope: !949, file: !3, line: 186, type: !9)
!952 = !DILocalVariable(name: "type_name", arg: 2, scope: !949, file: !3, line: 186, type: !47)
!953 = !DILocalVariable(name: "same", arg: 3, scope: !949, file: !3, line: 186, type: !862)
!954 = !DILocalVariable(name: "ierr", scope: !949, file: !3, line: 188, type: !6)
!955 = !DILocalVariable(name: "ierr__", scope: !956, file: !3, line: 198, type: !6)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 198, column: 71)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 195, column: 8)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 194, column: 12)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 193, column: 12)
!960 = distinct !DILexicalBlock(scope: !949, file: !3, line: 192, column: 7)
!961 = !DILocation(line: 0, scope: !949)
!962 = !DILocation(line: 190, column: 3, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 190, column: 3)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 190, column: 3)
!965 = distinct !DILexicalBlock(scope: !949, file: !3, line: 190, column: 3)
!966 = !DILocation(line: 190, column: 3, scope: !964)
!967 = !DILocation(line: 190, column: 3, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !3, line: 190, column: 3)
!969 = distinct !DILexicalBlock(scope: !963, file: !3, line: 190, column: 3)
!970 = !DILocation(line: 190, column: 3, scope: !969)
!971 = !DILocation(line: 190, column: 3, scope: !972)
!972 = distinct !DILexicalBlock(scope: !968, file: !3, line: 190, column: 3)
!973 = !DILocation(line: 191, column: 3, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 191, column: 3)
!975 = distinct !DILexicalBlock(scope: !949, file: !3, line: 191, column: 3)
!976 = !DILocation(line: 191, column: 3, scope: !975)
!977 = !DILocation(line: 191, column: 3, scope: !978)
!978 = distinct !DILexicalBlock(scope: !975, file: !3, line: 191, column: 3)
!979 = !DILocation(line: 192, column: 8, scope: !960)
!980 = !DILocation(line: 192, column: 7, scope: !949)
!981 = !DILocation(line: 193, column: 13, scope: !959)
!982 = !DILocation(line: 0, scope: !959)
!983 = !DILocation(line: 193, column: 23, scope: !959)
!984 = !DILocation(line: 193, column: 12, scope: !960)
!985 = !DILocation(line: 194, column: 12, scope: !959)
!986 = !DILocation(line: 194, column: 43, scope: !958)
!987 = !DILocation(line: 196, column: 5, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 196, column: 5)
!989 = distinct !DILexicalBlock(scope: !957, file: !3, line: 196, column: 5)
!990 = !DILocation(line: 196, column: 5, scope: !989)
!991 = !DILocation(line: 196, column: 5, scope: !992)
!992 = distinct !DILexicalBlock(scope: !989, file: !3, line: 196, column: 5)
!993 = !DILocation(line: 196, column: 5, scope: !994)
!994 = distinct !DILexicalBlock(scope: !992, file: !3, line: 196, column: 5)
!995 = !DILocation(line: 197, column: 5, scope: !996)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 197, column: 5)
!997 = distinct !DILexicalBlock(scope: !957, file: !3, line: 197, column: 5)
!998 = !DILocation(line: 197, column: 5, scope: !997)
!999 = !DILocation(line: 198, column: 44, scope: !957)
!1000 = !DILocation(line: 198, column: 12, scope: !957)
!1001 = !DILocation(line: 0, scope: !956)
!1002 = !DILocation(line: 198, column: 71, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !956, file: !3, line: 198, column: 71)
!1004 = !DILocation(line: 198, column: 71, scope: !956)
!1005 = !DILocation(line: 0, scope: !960)
!1006 = !DILocation(line: 200, column: 3, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 200, column: 3)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 200, column: 3)
!1009 = distinct !DILexicalBlock(scope: !949, file: !3, line: 200, column: 3)
!1010 = !DILocation(line: 200, column: 3, scope: !1008)
!1011 = !DILocation(line: 200, column: 3, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 200, column: 3)
!1013 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 200, column: 3)
!1014 = !DILocation(line: 200, column: 3, scope: !1013)
!1015 = !DILocation(line: 200, column: 3, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 200, column: 3)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 200, column: 3)
!1018 = !DILocation(line: 200, column: 3, scope: !1017)
!1019 = !DILocation(line: 200, column: 3, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 200, column: 3)
!1021 = !DILocation(line: 200, column: 3, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 200, column: 3)
!1023 = !DILocation(line: 200, column: 3, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 200, column: 3)
!1025 = !DILocation(line: 200, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 200, column: 3)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 200, column: 3)
!1028 = !DILocation(line: 200, column: 3, scope: !1027)
!1029 = !DILocation(line: 200, column: 3, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 200, column: 3)
!1031 = !DILocation(line: 201, column: 1, scope: !949)
!1032 = !DISubprogram(name: "PetscStrbeginswith", scope: !531, file: !531, line: 1361, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !529)
!1033 = distinct !DISubprogram(name: "PetscObjectTypeCompareAny", scope: !3, file: !3, line: 221, type: !1034, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!6, !9, !862, !47, null}
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1054, !1056}
!1037 = !DILocalVariable(name: "obj", arg: 1, scope: !1033, file: !3, line: 221, type: !9)
!1038 = !DILocalVariable(name: "match", arg: 2, scope: !1033, file: !3, line: 221, type: !862)
!1039 = !DILocalVariable(name: "type_name", arg: 3, scope: !1033, file: !3, line: 221, type: !47)
!1040 = !DILocalVariable(name: "ierr", scope: !1033, file: !3, line: 223, type: !6)
!1041 = !DILocalVariable(name: "Argp", scope: !1033, file: !3, line: 224, type: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1043, line: 46, baseType: !1044)
!1043 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1045, line: 32, baseType: !1046)
!1045 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stdarg.h", directory: "/home/users")
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !1047)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 192, elements: !66)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1048, file: !3, line: 224, baseType: !189, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1048, file: !3, line: 224, baseType: !189, size: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1048, file: !3, line: 224, baseType: !107, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1048, file: !3, line: 224, baseType: !107, size: 64, offset: 128)
!1054 = !DILocalVariable(name: "found", scope: !1055, file: !3, line: 232, type: !187)
!1055 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 231, column: 37)
!1056 = !DILocalVariable(name: "ierr__", scope: !1057, file: !3, line: 233, type: !6)
!1057 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 233, column: 57)
!1058 = !DILocation(line: 0, scope: !1033)
!1059 = !DILocation(line: 224, column: 3, scope: !1033)
!1060 = !DILocation(line: 224, column: 18, scope: !1033)
!1061 = !DILocation(line: 226, column: 3, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 226, column: 3)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 226, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 226, column: 3)
!1065 = !DILocation(line: 226, column: 3, scope: !1063)
!1066 = !DILocation(line: 226, column: 3, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 226, column: 3)
!1068 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 226, column: 3)
!1069 = !DILocation(line: 226, column: 3, scope: !1068)
!1070 = !DILocation(line: 226, column: 3, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 226, column: 3)
!1072 = !DILocation(line: 227, column: 3, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 227, column: 3)
!1074 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 227, column: 3)
!1075 = !DILocation(line: 227, column: 3, scope: !1074)
!1076 = !DILocation(line: 227, column: 3, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 227, column: 3)
!1078 = !DILocation(line: 228, column: 10, scope: !1033)
!1079 = !DILocation(line: 229, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 229, column: 7)
!1081 = !DILocation(line: 229, column: 7, scope: !1033)
!1082 = !DILocation(line: 229, column: 13, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 229, column: 13)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 229, column: 13)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 229, column: 13)
!1086 = !DILocation(line: 229, column: 13, scope: !1084)
!1087 = !DILocation(line: 229, column: 13, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 229, column: 13)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 229, column: 13)
!1090 = !DILocation(line: 229, column: 13, scope: !1089)
!1091 = !DILocation(line: 229, column: 13, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 229, column: 13)
!1093 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 229, column: 13)
!1094 = !DILocation(line: 229, column: 13, scope: !1093)
!1095 = !DILocation(line: 229, column: 13, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 229, column: 13)
!1097 = !DILocation(line: 229, column: 13, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 229, column: 13)
!1099 = !DILocation(line: 229, column: 13, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 229, column: 13)
!1101 = !DILocation(line: 229, column: 13, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 229, column: 13)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 229, column: 13)
!1104 = !DILocation(line: 229, column: 13, scope: !1103)
!1105 = !DILocation(line: 229, column: 13, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 229, column: 13)
!1107 = !DILocation(line: 230, column: 3, scope: !1033)
!1108 = !DILocation(line: 231, column: 10, scope: !1033)
!1109 = !DILocation(line: 231, column: 20, scope: !1033)
!1110 = !DILocation(line: 231, column: 23, scope: !1033)
