; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/axpy.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/axpy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 624, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!327 = !{!328, !331, !332, !444, !407, !535, !538, !417, !72, !453, !367, !541, !385, !501, !544, !5}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !321, line: 330, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !321, line: 330, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !335, line: 73, size: 4480, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !339, !388, !389, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !433, !434, !436, !438, !439, !440, !441, !442, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !468, !470, !471, !475, !476, !525, !530, !532, !533, !534}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !334, file: !335, line: 74, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !334, file: !335, line: 75, baseType: !340, size: 448, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 448, elements: !386)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !335, line: 53, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 45, size: 448, elements: !343)
!343 = !{!344, !350, !358, !363, !370, !374, !381}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !342, file: !335, line: 46, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !332, !349}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !335, line: 47, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!348, !332, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !355, line: 16, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !355, line: 16, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !335, line: 48, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!348, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !342, file: !335, line: 49, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!348, !332, !367, !332}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !342, file: !335, line: 50, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!348, !332, !367, !362}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !342, file: !335, line: 51, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!348, !332, !367, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !342, file: !335, line: 52, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!348, !332, !367, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !334, file: !335, line: 76, baseType: !328, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !335, line: 77, baseType: !390, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !334, file: !335, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !334, file: !335, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !334, file: !335, line: 80, baseType: !390, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !334, file: !335, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !334, file: !335, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !334, file: !335, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !334, file: !335, line: 84, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !334, file: !335, line: 85, baseType: !417, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !334, file: !335, line: 86, baseType: !417, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !334, file: !335, line: 87, baseType: !417, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !334, file: !335, line: 88, baseType: !332, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !334, file: !335, line: 89, baseType: !398, size: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !335, line: 90, baseType: !417, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !334, file: !335, line: 91, baseType: !417, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !334, file: !335, line: 92, baseType: !390, size: 32, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !334, file: !335, line: 93, baseType: !331, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !335, line: 94, baseType: !428, size: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !399)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !334, file: !335, line: 95, baseType: !390, size: 32, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !334, file: !335, line: 95, baseType: !390, size: 32, offset: 1888)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !334, file: !335, line: 96, baseType: !432, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !334, file: !335, line: 96, baseType: !432, size: 64, offset: 1984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !334, file: !335, line: 97, baseType: !435, size: 64, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !334, file: !335, line: 97, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !334, file: !335, line: 98, baseType: !390, size: 32, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !334, file: !335, line: 98, baseType: !390, size: 32, offset: 2208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !334, file: !335, line: 99, baseType: !432, size: 64, offset: 2240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !334, file: !335, line: 99, baseType: !432, size: 64, offset: 2304)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !334, file: !335, line: 100, baseType: !443, size: 64, offset: 2368)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !334, file: !335, line: 100, baseType: !446, size: 64, offset: 2432)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !334, file: !335, line: 101, baseType: !390, size: 32, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !334, file: !335, line: 101, baseType: !390, size: 32, offset: 2528)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !334, file: !335, line: 102, baseType: !432, size: 64, offset: 2560)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !334, file: !335, line: 102, baseType: !432, size: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !334, file: !335, line: 103, baseType: !452, size: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !444)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !334, file: !335, line: 103, baseType: !455, size: 64, offset: 2752)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !334, file: !335, line: 104, baseType: !385, size: 64, offset: 2816)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !334, file: !335, line: 105, baseType: !390, size: 32, offset: 2880)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !334, file: !335, line: 106, baseType: !459, size: 128, offset: 2944)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !466)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !335, line: 64, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 61, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !462, file: !335, line: 62, baseType: !378, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !462, file: !335, line: 63, baseType: !331, size: 64, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 2)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !334, file: !335, line: 107, baseType: !469, size: 64, offset: 3072)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !466)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !334, file: !335, line: 108, baseType: !331, size: 64, offset: 3136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !334, file: !335, line: 109, baseType: !472, size: 64, offset: 3200)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!348, !331}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !334, file: !335, line: 111, baseType: !390, size: 32, offset: 3264)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !334, file: !335, line: 112, baseType: !477, size: 320, offset: 3328)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !523)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!348, !481, !332, !331}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !484)
!484 = !{!485, !486, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !483, file: !10, line: 100, baseType: !390, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 101, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !498, !499, !500, !504, !506, !508, !509, !510}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !489, file: !10, line: 84, baseType: !417, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !489, file: !10, line: 85, baseType: !417, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !10, line: 86, baseType: !331, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !489, file: !10, line: 87, baseType: !409, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !489, file: !10, line: 88, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !489, file: !10, line: 89, baseType: !369, size: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !489, file: !10, line: 90, baseType: !417, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !489, file: !10, line: 91, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !502, line: 46, baseType: !503)
!502 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!503 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !489, file: !10, line: 92, baseType: !505, size: 32, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !10, line: 93, baseType: !507, size: 32, offset: 544)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !10, line: 94, baseType: !487, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !489, file: !10, line: 95, baseType: !417, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !489, file: !10, line: 96, baseType: !331, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !483, file: !10, line: 103, baseType: !417, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !483, file: !10, line: 104, baseType: !328, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !483, file: !10, line: 106, baseType: !332, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !483, file: !10, line: 107, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!523 = !{!524}
!524 = !DISubrange(count: 5)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !334, file: !335, line: 113, baseType: !526, size: 320, offset: 3648)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!348, !332, !331}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !334, file: !335, line: 114, baseType: !531, size: 320, offset: 3968)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 320, elements: !523)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !334, file: !335, line: 115, baseType: !505, size: 32, offset: 4288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !334, file: !335, line: 120, baseType: !520, size: 64, offset: 4352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !334, file: !335, line: 121, baseType: !505, size: 32, offset: 4416)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !321, line: 331, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !321, line: 331, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !321, line: 338, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !321, line: 338, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !543, line: 1451, baseType: !378)
!543 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!545 = !{i32 7, !"Dwarf Version", i32 4}
!546 = !{i32 2, !"Debug Info Version", i32 3}
!547 = !{i32 1, !"wchar_size", i32 4}
!548 = !{i32 7, !"PIC Level", i32 2}
!549 = !{i32 7, !"uwtable", i32 1}
!550 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!551 = distinct !DISubprogram(name: "MatAXPY", scope: !552, file: !552, line: 54, type: !553, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1321)
!552 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/axpy.c", directory: "/home/users/ndemeye/xSDK")
!553 = !DISubroutineType(types: !554)
!554 = !{!348, !555, !453, !555, !741}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !558, line: 436, size: 23424, elements: !559)
!558 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!559 = !{!560, !562, !1067, !1087, !1088, !1089, !1091, !1092, !1093, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1217, !1218, !1234, !1235, !1236, !1237, !1238, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1273, !1293, !1294, !1296, !1297, !1298, !1299, !1300, !1301, !1319, !1320}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !557, file: !558, line: 437, baseType: !561, size: 4480)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !335, line: 122, baseType: !334)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !557, file: !558, line: 437, baseType: !563, size: 9472, offset: 4480)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 9472, elements: !386)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !558, line: 32, size: 9472, elements: !565)
!565 = !{!566, !575, !579, !580, !587, !591, !592, !593, !594, !595, !596, !597, !621, !625, !630, !636, !655, !660, !664, !665, !670, !675, !676, !681, !685, !689, !693, !697, !701, !702, !703, !704, !705, !709, !710, !715, !716, !717, !718, !719, !721, !728, !733, !737, !742, !746, !750, !751, !755, !756, !763, !768, !769, !770, !771, !833, !841, !842, !846, !847, !851, !852, !856, !861, !862, !866, !870, !877, !878, !879, !880, !881, !882, !887, !888, !892, !896, !900, !901, !902, !906, !916, !917, !921, !922, !926, !927, !931, !932, !937, !938, !942, !946, !947, !948, !949, !950, !951, !952, !956, !957, !958, !959, !960, !961, !965, !966, !967, !968, !969, !970, !971, !972, !976, !980, !981, !982, !986, !987, !988, !989, !990, !991, !992, !996, !997, !998, !1003, !1007, !1008, !1012, !1013, !1014, !1015, !1041, !1045, !1046, !1047, !1048, !1049, !1053, !1054, !1055, !1056, !1057, !1061, !1065, !1066}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !564, file: !558, line: 34, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!348, !555, !390, !570, !390, !570, !572, !574}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !564, file: !558, line: 35, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!348, !555, !390, !435, !437, !455}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !564, file: !558, line: 36, baseType: !576, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !564, file: !558, line: 37, baseType: !581, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!348, !555, !584, !584}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !564, file: !558, line: 38, baseType: !588, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!348, !555, !584, !584, !584}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !564, file: !558, line: 40, baseType: !581, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !564, file: !558, line: 41, baseType: !588, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !564, file: !558, line: 42, baseType: !581, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !564, file: !558, line: 43, baseType: !588, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !564, file: !558, line: 44, baseType: !581, size: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !564, file: !558, line: 46, baseType: !588, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !564, file: !558, line: 47, baseType: !598, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!348, !555, !601, !601, !605}
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !602, line: 11, baseType: !603)
!602 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !602, line: 11, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !608, file: !36, line: 1227, baseType: !444, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !608, file: !36, line: 1228, baseType: !444, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !608, file: !36, line: 1229, baseType: !444, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !608, file: !36, line: 1230, baseType: !444, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !608, file: !36, line: 1231, baseType: !444, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !608, file: !36, line: 1232, baseType: !444, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !608, file: !36, line: 1233, baseType: !444, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !608, file: !36, line: 1234, baseType: !444, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !608, file: !36, line: 1236, baseType: !444, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !608, file: !36, line: 1237, baseType: !444, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !608, file: !36, line: 1238, baseType: !444, size: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !564, file: !558, line: 48, baseType: !622, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!348, !555, !601, !605}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !564, file: !558, line: 49, baseType: !626, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!348, !555, !584, !444, !629, !444, !390, !390, !584}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !564, file: !558, line: 50, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!348, !555, !634, !635}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !564, file: !558, line: 52, baseType: !637, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!348, !555, !640, !641}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !643, file: !36, line: 593, baseType: !392, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !643, file: !36, line: 594, baseType: !392, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !643, file: !36, line: 594, baseType: !392, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !643, file: !36, line: 594, baseType: !392, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !643, file: !36, line: 595, baseType: !392, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !643, file: !36, line: 596, baseType: !392, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !643, file: !36, line: 597, baseType: !392, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !643, file: !36, line: 598, baseType: !392, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !643, file: !36, line: 598, baseType: !392, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !643, file: !36, line: 599, baseType: !392, size: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !564, file: !558, line: 53, baseType: !656, size: 64, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!348, !555, !555, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !564, file: !558, line: 54, baseType: !661, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!348, !555, !584}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !564, file: !558, line: 55, baseType: !581, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !564, file: !558, line: 56, baseType: !666, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!348, !555, !669, !443}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !564, file: !558, line: 58, baseType: !671, size: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!348, !555, !674}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !564, file: !558, line: 59, baseType: !671, size: 64, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !564, file: !558, line: 60, baseType: !677, size: 64, offset: 1408)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!348, !555, !680, !505}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !564, file: !558, line: 61, baseType: !682, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!348, !555}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !564, file: !558, line: 63, baseType: !686, size: 64, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!348, !555, !390, !570, !453, !584, !584}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !564, file: !558, line: 64, baseType: !690, size: 64, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!348, !555, !555, !601, !601, !605}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !564, file: !558, line: 65, baseType: !694, size: 64, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!348, !555, !555, !605}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !564, file: !558, line: 66, baseType: !698, size: 64, offset: 1728)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!348, !555, !555, !601, !605}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !564, file: !558, line: 67, baseType: !694, size: 64, offset: 1792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !564, file: !558, line: 69, baseType: !682, size: 64, offset: 1856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !564, file: !558, line: 70, baseType: !690, size: 64, offset: 1920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !564, file: !558, line: 71, baseType: !698, size: 64, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !564, file: !558, line: 72, baseType: !706, size: 64, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!348, !555, !635}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !564, file: !558, line: 73, baseType: !682, size: 64, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !564, file: !558, line: 75, baseType: !711, size: 64, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!348, !555, !714, !635}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !564, file: !558, line: 76, baseType: !581, size: 64, offset: 2240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !564, file: !558, line: 77, baseType: !581, size: 64, offset: 2304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !564, file: !558, line: 78, baseType: !598, size: 64, offset: 2368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !564, file: !558, line: 79, baseType: !622, size: 64, offset: 2432)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !564, file: !558, line: 81, baseType: !720, size: 64, offset: 2496)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !564, file: !558, line: 82, baseType: !722, size: 64, offset: 2560)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!348, !555, !390, !725, !725, !634, !727}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !564, file: !558, line: 83, baseType: !729, size: 64, offset: 2624)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!348, !555, !390, !732, !390}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !564, file: !558, line: 84, baseType: !734, size: 64, offset: 2688)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!348, !555, !390, !570, !390, !570, !452}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !564, file: !558, line: 85, baseType: !738, size: 64, offset: 2752)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!348, !555, !555, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !564, file: !558, line: 87, baseType: !743, size: 64, offset: 2816)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!348, !555, !584, !435}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !564, file: !558, line: 88, baseType: !747, size: 64, offset: 2880)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!348, !555, !453}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !564, file: !558, line: 89, baseType: !747, size: 64, offset: 2944)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !564, file: !558, line: 90, baseType: !752, size: 64, offset: 3008)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!348, !555, !584, !574}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !564, file: !558, line: 91, baseType: !686, size: 64, offset: 3072)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !564, file: !558, line: 93, baseType: !757, size: 64, offset: 3136)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!348, !555, !760}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !564, file: !558, line: 94, baseType: !764, size: 64, offset: 3200)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!348, !555, !390, !505, !505, !435, !767, !767, !659}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !564, file: !558, line: 95, baseType: !764, size: 64, offset: 3264)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !564, file: !558, line: 96, baseType: !764, size: 64, offset: 3328)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !564, file: !558, line: 97, baseType: !764, size: 64, offset: 3392)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !564, file: !558, line: 99, baseType: !772, size: 64, offset: 3456)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!348, !555, !775, !778}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !602, line: 51, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !602, line: 51, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !558, line: 609, size: 6208, elements: !781)
!781 = !{!782, !783, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !802, !809, !810, !811, !812, !813, !814, !815, !816, !820, !821, !822, !823, !824, !826, !827, !828, !829, !830, !831, !832}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !780, file: !558, line: 610, baseType: !561, size: 4480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !780, file: !558, line: 610, baseType: !784, size: 32, offset: 4480)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !386)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !780, file: !558, line: 611, baseType: !390, size: 32, offset: 4512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !780, file: !558, line: 611, baseType: !390, size: 32, offset: 4544)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !780, file: !558, line: 611, baseType: !390, size: 32, offset: 4576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !780, file: !558, line: 612, baseType: !390, size: 32, offset: 4608)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !780, file: !558, line: 613, baseType: !390, size: 32, offset: 4640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !780, file: !558, line: 614, baseType: !435, size: 64, offset: 4672)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !780, file: !558, line: 615, baseType: !437, size: 64, offset: 4736)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !780, file: !558, line: 616, baseType: !732, size: 64, offset: 4800)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !780, file: !558, line: 617, baseType: !435, size: 64, offset: 4864)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !780, file: !558, line: 618, baseType: !795, size: 64, offset: 4928)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !558, line: 602, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 598, size: 128, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !797, file: !558, line: 599, baseType: !390, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !797, file: !558, line: 600, baseType: !390, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !797, file: !558, line: 601, baseType: !452, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !780, file: !558, line: 619, baseType: !803, size: 64, offset: 4992)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !558, line: 607, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 604, size: 128, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !805, file: !558, line: 605, baseType: !390, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !805, file: !558, line: 606, baseType: !452, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !780, file: !558, line: 620, baseType: !452, size: 64, offset: 5056)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !780, file: !558, line: 621, baseType: !444, size: 64, offset: 5120)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !780, file: !558, line: 622, baseType: !444, size: 64, offset: 5184)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !780, file: !558, line: 623, baseType: !584, size: 64, offset: 5248)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !780, file: !558, line: 623, baseType: !584, size: 64, offset: 5312)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !780, file: !558, line: 623, baseType: !584, size: 64, offset: 5376)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !780, file: !558, line: 624, baseType: !505, size: 32, offset: 5440)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !780, file: !558, line: 625, baseType: !817, size: 64, offset: 5504)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!348}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !780, file: !558, line: 626, baseType: !331, size: 64, offset: 5568)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !780, file: !558, line: 627, baseType: !584, size: 64, offset: 5632)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !780, file: !558, line: 628, baseType: !390, size: 32, offset: 5696)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !780, file: !558, line: 629, baseType: !367, size: 64, offset: 5760)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !780, file: !558, line: 630, baseType: !825, size: 32, offset: 5824)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !780, file: !558, line: 631, baseType: !390, size: 32, offset: 5856)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !780, file: !558, line: 631, baseType: !390, size: 32, offset: 5888)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !780, file: !558, line: 632, baseType: !505, size: 32, offset: 5920)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !780, file: !558, line: 633, baseType: !505, size: 32, offset: 5952)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !780, file: !558, line: 634, baseType: !378, size: 64, offset: 6016)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !780, file: !558, line: 634, baseType: !331, size: 64, offset: 6080)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !780, file: !558, line: 635, baseType: !398, size: 64, offset: 6144)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !564, file: !558, line: 100, baseType: !834, size: 64, offset: 3520)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!348, !555, !390, !390, !837, !840}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !839)
!839 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !564, file: !558, line: 101, baseType: !682, size: 64, offset: 3584)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !564, file: !558, line: 102, baseType: !843, size: 64, offset: 3648)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!348, !555, !601, !601, !635}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !564, file: !558, line: 103, baseType: !567, size: 64, offset: 3712)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !564, file: !558, line: 105, baseType: !848, size: 64, offset: 3776)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!348, !555, !601, !601, !634, !635}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !564, file: !558, line: 106, baseType: !682, size: 64, offset: 3840)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !564, file: !558, line: 107, baseType: !853, size: 64, offset: 3904)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!348, !555, !354}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !564, file: !558, line: 108, baseType: !857, size: 64, offset: 3968)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!348, !555, !860, !634, !635}
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !367)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !564, file: !558, line: 109, baseType: !817, size: 64, offset: 4032)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !564, file: !558, line: 111, baseType: !863, size: 64, offset: 4096)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!348, !555, !555, !555, !444, !555}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !564, file: !558, line: 112, baseType: !867, size: 64, offset: 4160)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!348, !555, !555, !555, !555}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !564, file: !558, line: 113, baseType: !871, size: 64, offset: 4224)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!348, !555, !874, !874}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !602, line: 30, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !602, line: 30, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !564, file: !558, line: 114, baseType: !567, size: 64, offset: 4288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !564, file: !558, line: 115, baseType: !686, size: 64, offset: 4352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !564, file: !558, line: 117, baseType: !743, size: 64, offset: 4416)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !564, file: !558, line: 118, baseType: !743, size: 64, offset: 4480)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !564, file: !558, line: 119, baseType: !857, size: 64, offset: 4544)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !564, file: !558, line: 120, baseType: !883, size: 64, offset: 4608)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!348, !555, !886, !659}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !564, file: !558, line: 121, baseType: !817, size: 64, offset: 4672)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !564, file: !558, line: 123, baseType: !889, size: 64, offset: 4736)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!348, !555, !390, !331}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !564, file: !558, line: 124, baseType: !893, size: 64, offset: 4800)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!348, !555, !778, !584, !331}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !564, file: !558, line: 125, baseType: !897, size: 64, offset: 4864)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!348, !481, !555}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !564, file: !558, line: 126, baseType: !581, size: 64, offset: 4928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !564, file: !558, line: 127, baseType: !581, size: 64, offset: 4992)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !564, file: !558, line: 129, baseType: !903, size: 64, offset: 5056)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!348, !555, !732}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !564, file: !558, line: 130, baseType: !907, size: 64, offset: 5120)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!348, !555, !910, !910}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !912, file: !60, line: 653, baseType: !390, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !912, file: !60, line: 653, baseType: !584, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !564, file: !558, line: 131, baseType: !907, size: 64, offset: 5184)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !564, file: !558, line: 132, baseType: !918, size: 64, offset: 5248)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!348, !555, !435, !435, !435}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !564, file: !558, line: 133, baseType: !853, size: 64, offset: 5312)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !564, file: !558, line: 135, baseType: !923, size: 64, offset: 5376)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!348, !555, !444, !659}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !564, file: !558, line: 136, baseType: !923, size: 64, offset: 5440)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !564, file: !558, line: 137, baseType: !928, size: 64, offset: 5504)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!348, !555, !659}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !564, file: !558, line: 138, baseType: !567, size: 64, offset: 5568)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !564, file: !558, line: 139, baseType: !933, size: 64, offset: 5632)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!348, !555, !936, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !564, file: !558, line: 141, baseType: !817, size: 64, offset: 5696)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !564, file: !558, line: 142, baseType: !939, size: 64, offset: 5760)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!348, !555, !555, !444, !555}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !564, file: !558, line: 143, baseType: !943, size: 64, offset: 5824)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!348, !555, !555, !555}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !564, file: !558, line: 144, baseType: !817, size: 64, offset: 5888)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !564, file: !558, line: 145, baseType: !939, size: 64, offset: 5952)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !564, file: !558, line: 147, baseType: !943, size: 64, offset: 6016)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !564, file: !558, line: 148, baseType: !817, size: 64, offset: 6080)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !564, file: !558, line: 149, baseType: !939, size: 64, offset: 6144)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !564, file: !558, line: 150, baseType: !943, size: 64, offset: 6208)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !564, file: !558, line: 151, baseType: !953, size: 64, offset: 6272)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!348, !555, !505}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !564, file: !558, line: 153, baseType: !682, size: 64, offset: 6336)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !564, file: !558, line: 154, baseType: !682, size: 64, offset: 6400)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !564, file: !558, line: 155, baseType: !682, size: 64, offset: 6464)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !564, file: !558, line: 156, baseType: !682, size: 64, offset: 6528)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !564, file: !558, line: 157, baseType: !853, size: 64, offset: 6592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !564, file: !558, line: 159, baseType: !962, size: 64, offset: 6656)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!348, !555, !390, !572}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !564, file: !558, line: 160, baseType: !682, size: 64, offset: 6720)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !564, file: !558, line: 161, baseType: !682, size: 64, offset: 6784)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !564, file: !558, line: 162, baseType: !682, size: 64, offset: 6848)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !564, file: !558, line: 163, baseType: !682, size: 64, offset: 6912)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !564, file: !558, line: 165, baseType: !943, size: 64, offset: 6976)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !564, file: !558, line: 166, baseType: !943, size: 64, offset: 7040)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !564, file: !558, line: 167, baseType: !743, size: 64, offset: 7104)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !564, file: !558, line: 168, baseType: !973, size: 64, offset: 7168)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!348, !555, !584, !390}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !564, file: !558, line: 169, baseType: !977, size: 64, offset: 7232)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!348, !555, !659, !435}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !564, file: !558, line: 171, baseType: !706, size: 64, offset: 7296)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !564, file: !558, line: 172, baseType: !682, size: 64, offset: 7360)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !564, file: !558, line: 173, baseType: !983, size: 64, offset: 7424)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!348, !555, !435, !767}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !564, file: !558, line: 174, baseType: !843, size: 64, offset: 7488)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !564, file: !558, line: 175, baseType: !843, size: 64, offset: 7552)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !564, file: !558, line: 177, baseType: !581, size: 64, offset: 7616)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !564, file: !558, line: 178, baseType: !631, size: 64, offset: 7680)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !564, file: !558, line: 179, baseType: !581, size: 64, offset: 7744)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !564, file: !558, line: 180, baseType: !588, size: 64, offset: 7808)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !564, file: !558, line: 181, baseType: !993, size: 64, offset: 7872)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!348, !555, !328, !634, !635}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !564, file: !558, line: 183, baseType: !903, size: 64, offset: 7936)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !564, file: !558, line: 184, baseType: !666, size: 64, offset: 8000)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !564, file: !558, line: 185, baseType: !999, size: 64, offset: 8064)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!348, !555, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !564, file: !558, line: 186, baseType: !1004, size: 64, offset: 8128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!348, !555, !390, !570, !452}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !564, file: !558, line: 187, baseType: !722, size: 64, offset: 8192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !564, file: !558, line: 189, baseType: !1009, size: 64, offset: 8256)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!348, !555, !390, !390, !435, !572}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !564, file: !558, line: 190, baseType: !817, size: 64, offset: 8320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !564, file: !558, line: 191, baseType: !939, size: 64, offset: 8384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !564, file: !558, line: 192, baseType: !943, size: 64, offset: 8448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !564, file: !558, line: 193, baseType: !1016, size: 64, offset: 8512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!348, !555, !775, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !558, line: 660, size: 5312, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1021, file: !558, line: 661, baseType: !561, size: 4480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1021, file: !558, line: 661, baseType: !784, size: 32, offset: 4480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1021, file: !558, line: 662, baseType: !390, size: 32, offset: 4512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1021, file: !558, line: 662, baseType: !390, size: 32, offset: 4544)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1021, file: !558, line: 662, baseType: !390, size: 32, offset: 4576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1021, file: !558, line: 663, baseType: !390, size: 32, offset: 4608)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1021, file: !558, line: 664, baseType: !390, size: 32, offset: 4640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1021, file: !558, line: 665, baseType: !435, size: 64, offset: 4672)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1021, file: !558, line: 666, baseType: !435, size: 64, offset: 4736)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1021, file: !558, line: 667, baseType: !390, size: 32, offset: 4800)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1021, file: !558, line: 668, baseType: !825, size: 32, offset: 4832)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1021, file: !558, line: 670, baseType: !435, size: 64, offset: 4864)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1021, file: !558, line: 670, baseType: !435, size: 64, offset: 4928)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1021, file: !558, line: 671, baseType: !435, size: 64, offset: 4992)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1021, file: !558, line: 672, baseType: !435, size: 64, offset: 5056)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1021, file: !558, line: 673, baseType: !435, size: 64, offset: 5120)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1021, file: !558, line: 674, baseType: !390, size: 32, offset: 5184)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1021, file: !558, line: 675, baseType: !435, size: 64, offset: 5248)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !564, file: !558, line: 195, baseType: !1042, size: 64, offset: 8576)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!348, !1019, !555, !555}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !564, file: !558, line: 196, baseType: !1042, size: 64, offset: 8640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !564, file: !558, line: 197, baseType: !817, size: 64, offset: 8704)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !564, file: !558, line: 198, baseType: !939, size: 64, offset: 8768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !564, file: !558, line: 199, baseType: !943, size: 64, offset: 8832)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !564, file: !558, line: 201, baseType: !1050, size: 64, offset: 8896)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!348, !555, !390, !390}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !564, file: !558, line: 202, baseType: !720, size: 64, offset: 8960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !564, file: !558, line: 203, baseType: !588, size: 64, offset: 9024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !564, file: !558, line: 204, baseType: !772, size: 64, offset: 9088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !564, file: !558, line: 205, baseType: !903, size: 64, offset: 9152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !564, file: !558, line: 206, baseType: !1058, size: 64, offset: 9216)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!348, !328, !555, !390, !634, !635}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !564, file: !558, line: 208, baseType: !1062, size: 64, offset: 9280)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!348, !390, !727}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !564, file: !558, line: 209, baseType: !943, size: 64, offset: 9344)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !564, file: !558, line: 210, baseType: !734, size: 64, offset: 9408)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !557, file: !558, line: 438, baseType: !1068, size: 64, offset: 13952)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !602, line: 60, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1070, file: !114, line: 241, baseType: !328, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !114, line: 242, baseType: !407, size: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1070, file: !114, line: 243, baseType: !390, size: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1070, file: !114, line: 243, baseType: !390, size: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1070, file: !114, line: 244, baseType: !390, size: 32, offset: 160)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1070, file: !114, line: 244, baseType: !390, size: 32, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1070, file: !114, line: 245, baseType: !435, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1070, file: !114, line: 246, baseType: !505, size: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1070, file: !114, line: 247, baseType: !390, size: 32, offset: 352)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1070, file: !114, line: 251, baseType: !390, size: 32, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1070, file: !114, line: 252, baseType: !874, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1070, file: !114, line: 253, baseType: !505, size: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1070, file: !114, line: 254, baseType: !390, size: 32, offset: 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1070, file: !114, line: 254, baseType: !390, size: 32, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1070, file: !114, line: 255, baseType: !390, size: 32, offset: 608)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !557, file: !558, line: 438, baseType: !1068, size: 64, offset: 14016)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !557, file: !558, line: 439, baseType: !331, size: 64, offset: 14080)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !557, file: !558, line: 440, baseType: !1090, size: 32, offset: 14144)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !557, file: !558, line: 441, baseType: !505, size: 32, offset: 14176)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !557, file: !558, line: 442, baseType: !505, size: 32, offset: 14208)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !557, file: !558, line: 443, baseType: !1094, size: 448, offset: 14272)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 448, elements: !1096)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !367)
!1096 = !{!1097}
!1097 = !DISubrange(count: 7)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !557, file: !558, line: 444, baseType: !505, size: 32, offset: 14720)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !557, file: !558, line: 445, baseType: !505, size: 32, offset: 14752)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !557, file: !558, line: 446, baseType: !390, size: 32, offset: 14784)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !557, file: !558, line: 447, baseType: !428, size: 64, offset: 14848)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !557, file: !558, line: 448, baseType: !428, size: 64, offset: 14912)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !557, file: !558, line: 449, baseType: !642, size: 640, offset: 14976)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !557, file: !558, line: 450, baseType: !574, size: 32, offset: 15616)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !557, file: !558, line: 451, baseType: !1106, size: 2880, offset: 15680)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !558, line: 318, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !558, line: 319, size: 2880, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1129, !1134, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1154, !1155, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1187, !1188, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1107, file: !558, line: 320, baseType: !390, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1107, file: !558, line: 321, baseType: !390, size: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1107, file: !558, line: 322, baseType: !390, size: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1107, file: !558, line: 323, baseType: !390, size: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1107, file: !558, line: 324, baseType: !390, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1107, file: !558, line: 325, baseType: !390, size: 32, offset: 160)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1107, file: !558, line: 326, baseType: !1116, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !558, line: 293, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !558, line: 295, size: 448, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1118, file: !558, line: 296, baseType: !1116, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1118, file: !558, line: 297, baseType: !452, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1118, file: !558, line: 297, baseType: !452, size: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1118, file: !558, line: 298, baseType: !435, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1118, file: !558, line: 298, baseType: !435, size: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1118, file: !558, line: 299, baseType: !390, size: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1118, file: !558, line: 300, baseType: !390, size: 32, offset: 352)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1118, file: !558, line: 301, baseType: !390, size: 32, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1107, file: !558, line: 326, baseType: !1116, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1107, file: !558, line: 328, baseType: !1130, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!348, !555, !1133, !435}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1107, file: !558, line: 329, baseType: !1135, size: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!348, !1133, !1138, !437, !437, !455, !435}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1107, file: !558, line: 330, baseType: !1140, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!348, !1133}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1107, file: !558, line: 331, baseType: !1140, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1107, file: !558, line: 334, baseType: !328, size: 64, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !558, line: 335, baseType: !407, size: 32, offset: 640)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1107, file: !558, line: 335, baseType: !407, size: 32, offset: 672)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1107, file: !558, line: 336, baseType: !407, size: 32, offset: 704)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1107, file: !558, line: 336, baseType: !407, size: 32, offset: 736)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1107, file: !558, line: 337, baseType: !1150, size: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !321, line: 339, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !321, line: 339, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1107, file: !558, line: 338, baseType: !1150, size: 64, offset: 832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1107, file: !558, line: 339, baseType: !1156, size: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !321, line: 341, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !321, line: 351, size: 192, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1158, file: !321, line: 354, baseType: !72, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1158, file: !321, line: 355, baseType: !72, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1158, file: !321, line: 356, baseType: !72, size: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1158, file: !321, line: 361, baseType: !72, size: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1158, file: !321, line: 362, baseType: !501, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1107, file: !558, line: 340, baseType: !390, size: 32, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1107, file: !558, line: 340, baseType: !390, size: 32, offset: 992)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1107, file: !558, line: 341, baseType: !452, size: 64, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1107, file: !558, line: 342, baseType: !435, size: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1107, file: !558, line: 343, baseType: !455, size: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1107, file: !558, line: 344, baseType: !437, size: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1107, file: !558, line: 345, baseType: !390, size: 32, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1107, file: !558, line: 346, baseType: !1138, size: 64, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1107, file: !558, line: 347, baseType: !505, size: 32, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1107, file: !558, line: 348, baseType: !390, size: 32, offset: 1440)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1107, file: !558, line: 351, baseType: !505, size: 32, offset: 1472)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1107, file: !558, line: 352, baseType: !505, size: 32, offset: 1504)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1107, file: !558, line: 353, baseType: !407, size: 32, offset: 1536)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1107, file: !558, line: 354, baseType: !407, size: 32, offset: 1568)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1107, file: !558, line: 355, baseType: !1138, size: 64, offset: 1600)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1107, file: !558, line: 356, baseType: !1138, size: 64, offset: 1664)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1107, file: !558, line: 357, baseType: !1182, size: 64, offset: 1728)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !558, line: 310, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 308, size: 32, elements: !1185)
!1185 = !{!1186}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1184, file: !558, line: 309, baseType: !390, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1107, file: !558, line: 357, baseType: !1182, size: 64, offset: 1792)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1107, file: !558, line: 358, baseType: !1189, size: 64, offset: 1856)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !558, line: 316, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 312, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1191, file: !558, line: 313, baseType: !331, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1191, file: !558, line: 314, baseType: !390, size: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1191, file: !558, line: 315, baseType: !369, size: 8, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1107, file: !558, line: 359, baseType: !1189, size: 64, offset: 1920)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1107, file: !558, line: 360, baseType: !1189, size: 64, offset: 1984)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1107, file: !558, line: 361, baseType: !390, size: 32, offset: 2048)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1107, file: !558, line: 362, baseType: !407, size: 32, offset: 2080)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1107, file: !558, line: 363, baseType: !390, size: 32, offset: 2112)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1107, file: !558, line: 364, baseType: !1138, size: 64, offset: 2176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1107, file: !558, line: 365, baseType: !1156, size: 64, offset: 2240)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1107, file: !558, line: 366, baseType: !407, size: 32, offset: 2304)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1107, file: !558, line: 367, baseType: !407, size: 32, offset: 2336)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1107, file: !558, line: 368, baseType: !1150, size: 64, offset: 2368)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1107, file: !558, line: 369, baseType: !1150, size: 64, offset: 2432)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1107, file: !558, line: 370, baseType: !1208, size: 64, offset: 2496)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1107, file: !558, line: 371, baseType: !1208, size: 64, offset: 2560)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1107, file: !558, line: 372, baseType: !1208, size: 64, offset: 2624)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1107, file: !558, line: 373, baseType: !535, size: 64, offset: 2688)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1107, file: !558, line: 374, baseType: !501, size: 64, offset: 2752)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1107, file: !558, line: 375, baseType: !1216, size: 64, offset: 2816)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !557, file: !558, line: 451, baseType: !1106, size: 2880, offset: 18560)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !557, file: !558, line: 452, baseType: !1219, size: 64, offset: 21440)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !558, line: 681, size: 4864, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1233}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1221, file: !558, line: 682, baseType: !561, size: 4480)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1221, file: !558, line: 682, baseType: !784, size: 32, offset: 4480)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1221, file: !558, line: 683, baseType: !505, size: 32, offset: 4512)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1221, file: !558, line: 684, baseType: !390, size: 32, offset: 4544)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1221, file: !558, line: 685, baseType: !936, size: 64, offset: 4608)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1221, file: !558, line: 686, baseType: !452, size: 64, offset: 4672)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1221, file: !558, line: 687, baseType: !1230, size: 64, offset: 4736)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!348, !1219, !584, !331}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1221, file: !558, line: 688, baseType: !331, size: 64, offset: 4800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !557, file: !558, line: 453, baseType: !1219, size: 64, offset: 21504)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !557, file: !558, line: 454, baseType: !1219, size: 64, offset: 21568)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !557, file: !558, line: 455, baseType: !390, size: 32, offset: 21632)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !557, file: !558, line: 456, baseType: !505, size: 32, offset: 21664)
