; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lsc/lsc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lsc/lsc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!2 = !{!3, !9, !24, !32, !38, !45, !54, !60}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 238, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!66 = !{!67, !70, !88, !169, !109, !275, !104}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 46, baseType: !69)
!68 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !73, line: 73, size: 4480, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !77, !130, !131, !133, !136, !137, !138, !139, !147, !148, !150, !154, !158, !160, !161, !162, !163, !164, !165, !166, !167, !168, !170, !172, !173, !174, !176, !177, !179, !181, !182, !183, !184, !185, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !211, !213, !214, !218, !219, !265, !270, !272, !273, !274}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !72, file: !73, line: 74, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !72, file: !73, line: 75, baseType: !78, size: 448, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 448, elements: !128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !73, line: 53, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 45, size: 448, elements: !81)
!81 = !{!82, !92, !100, !105, !112, !116, !123}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !80, file: !73, line: 46, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !70, !87}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !89, line: 330, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !89, line: 330, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !80, file: !73, line: 47, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!86, !70, !96}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !97, line: 16, baseType: !98)
!97 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !97, line: 16, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !80, file: !73, line: 48, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!86, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !80, file: !73, line: 49, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!86, !70, !109, !70}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !80, file: !73, line: 50, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!86, !70, !109, !104}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !80, file: !73, line: 51, baseType: !117, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!86, !70, !109, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !80, file: !73, line: 52, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!86, !70, !109, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!128 = !{!129}
!129 = !DISubrange(count: 1)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !72, file: !73, line: 76, baseType: !88, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !73, line: 77, baseType: !132, size: 32, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !72, file: !73, line: 78, baseType: !134, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !135)
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !72, file: !73, line: 78, baseType: !134, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !72, file: !73, line: 78, baseType: !134, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !72, file: !73, line: 78, baseType: !134, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !73, line: 79, baseType: !140, size: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !143, line: 27, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !145, line: 43, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!146 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !72, file: !73, line: 80, baseType: !132, size: 32, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !72, file: !73, line: 81, baseType: !149, size: 32, offset: 992)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !72, file: !73, line: 82, baseType: !151, size: 64, offset: 1024)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !72, file: !73, line: 83, baseType: !155, size: 64, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !72, file: !73, line: 84, baseType: !159, size: 64, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !72, file: !73, line: 85, baseType: !159, size: 64, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !72, file: !73, line: 86, baseType: !159, size: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !72, file: !73, line: 87, baseType: !159, size: 64, offset: 1344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !72, file: !73, line: 88, baseType: !70, size: 64, offset: 1408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !72, file: !73, line: 89, baseType: !140, size: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 90, baseType: !159, size: 64, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !72, file: !73, line: 91, baseType: !159, size: 64, offset: 1600)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !72, file: !73, line: 92, baseType: !132, size: 32, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !72, file: !73, line: 93, baseType: !169, size: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !72, file: !73, line: 94, baseType: !171, size: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !141)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !72, file: !73, line: 95, baseType: !132, size: 32, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !72, file: !73, line: 95, baseType: !132, size: 32, offset: 1888)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !72, file: !73, line: 96, baseType: !175, size: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !72, file: !73, line: 96, baseType: !175, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !72, file: !73, line: 97, baseType: !178, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !72, file: !73, line: 97, baseType: !180, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !72, file: !73, line: 98, baseType: !132, size: 32, offset: 2176)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !72, file: !73, line: 98, baseType: !132, size: 32, offset: 2208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !72, file: !73, line: 99, baseType: !175, size: 64, offset: 2240)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !72, file: !73, line: 99, baseType: !175, size: 64, offset: 2304)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !72, file: !73, line: 100, baseType: !186, size: 64, offset: 2368)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !135)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !72, file: !73, line: 100, baseType: !189, size: 64, offset: 2432)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !72, file: !73, line: 101, baseType: !132, size: 32, offset: 2496)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !72, file: !73, line: 101, baseType: !132, size: 32, offset: 2528)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !72, file: !73, line: 102, baseType: !175, size: 64, offset: 2560)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !72, file: !73, line: 102, baseType: !175, size: 64, offset: 2624)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !72, file: !73, line: 103, baseType: !195, size: 64, offset: 2688)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !187)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !72, file: !73, line: 103, baseType: !198, size: 64, offset: 2752)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !72, file: !73, line: 104, baseType: !127, size: 64, offset: 2816)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !72, file: !73, line: 105, baseType: !132, size: 32, offset: 2880)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !72, file: !73, line: 106, baseType: !202, size: 128, offset: 2944)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !209)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !73, line: 64, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 61, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !205, file: !73, line: 62, baseType: !120, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !205, file: !73, line: 63, baseType: !169, size: 64, offset: 64)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !72, file: !73, line: 107, baseType: !212, size: 64, offset: 3072)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !209)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !72, file: !73, line: 108, baseType: !169, size: 64, offset: 3136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !72, file: !73, line: 109, baseType: !215, size: 64, offset: 3200)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!86, !169}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !72, file: !73, line: 111, baseType: !132, size: 32, offset: 3264)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !72, file: !73, line: 112, baseType: !220, size: 320, offset: 3328)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 320, elements: !263)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!86, !224, !70, !169}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !227)
!227 = !{!228, !229, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !226, file: !10, line: 100, baseType: !132, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !10, line: 101, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !241, !242, !243, !244, !246, !248, !249, !250}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !232, file: !10, line: 84, baseType: !159, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !232, file: !10, line: 85, baseType: !159, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !10, line: 86, baseType: !169, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !232, file: !10, line: 87, baseType: !151, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !232, file: !10, line: 88, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !232, file: !10, line: 89, baseType: !111, size: 8, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !232, file: !10, line: 90, baseType: !159, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !232, file: !10, line: 91, baseType: !67, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !232, file: !10, line: 92, baseType: !245, size: 32, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !10, line: 93, baseType: !247, size: 32, offset: 544)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !10, line: 94, baseType: !230, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !232, file: !10, line: 95, baseType: !159, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !232, file: !10, line: 96, baseType: !169, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !226, file: !10, line: 102, baseType: !159, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !226, file: !10, line: 102, baseType: !159, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !226, file: !10, line: 103, baseType: !159, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !226, file: !10, line: 104, baseType: !88, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !226, file: !10, line: 105, baseType: !245, size: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !226, file: !10, line: 105, baseType: !245, size: 32, offset: 416)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !226, file: !10, line: 105, baseType: !245, size: 32, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !226, file: !10, line: 106, baseType: !70, size: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !226, file: !10, line: 107, baseType: !260, size: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!263 = !{!264}
!264 = !DISubrange(count: 5)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !72, file: !73, line: 113, baseType: !266, size: 320, offset: 3648)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 320, elements: !263)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!86, !70, !169}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !72, file: !73, line: 114, baseType: !271, size: 320, offset: 3968)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 320, elements: !263)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !72, file: !73, line: 115, baseType: !245, size: 32, offset: 4288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !72, file: !73, line: 120, baseType: !260, size: 64, offset: 4352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !72, file: !73, line: 121, baseType: !245, size: 32, offset: 4416)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_LSC", file: !277, line: 10, baseType: !278)
!277 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/lsc/lsc.c", directory: "/home/users/ndemeye/xSDK")
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 3, size: 448, elements: !279)
!279 = !{!280, !281, !282, !287, !292, !293, !294, !295}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !278, file: !277, line: 4, baseType: !245, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalediag", scope: !278, file: !277, line: 5, baseType: !245, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "kspL", scope: !278, file: !277, line: 6, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !284, line: 22, baseType: !285)
!284 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !284, line: 22, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !278, file: !277, line: 7, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !289, line: 21, baseType: !290)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !289, line: 21, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !278, file: !277, line: 8, baseType: !288, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !278, file: !277, line: 8, baseType: !288, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !278, file: !277, line: 8, baseType: !288, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !278, file: !277, line: 9, baseType: !296, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!299 = !{i32 7, !"Dwarf Version", i32 4}
!300 = !{i32 2, !"Debug Info Version", i32 3}
!301 = !{i32 1, !"wchar_size", i32 4}
!302 = !{i32 7, !"PIC Level", i32 2}
!303 = !{i32 7, !"uwtable", i32 1}
!304 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!305 = distinct !DISubprogram(name: "PCCreate_LSC", scope: !277, file: !277, line: 213, type: !306, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!306 = !DISubroutineType(types: !307)
!307 = !{!86, !308}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !311, line: 37, size: 6720, elements: !312)
!311 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!312 = !{!313, !315, !369, !374, !375, !376, !377, !378, !380, !381, !382, !383, !384, !385, !386, !387, !388, !398, !399, !400, !401, !402, !404}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !310, file: !311, line: 38, baseType: !314, size: 4480)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !73, line: 122, baseType: !72)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !310, file: !311, line: 38, baseType: !316, size: 1152, offset: 4480)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 1152, elements: !128)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !311, line: 13, size: 1152, elements: !318)
!318 = !{!319, !321, !325, !329, !335, !340, !341, !345, !349, !353, !354, !359, !360, !361, !362, !363, !367, !368}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !317, file: !311, line: 14, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !317, file: !311, line: 15, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!86, !308, !288, !288}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !317, file: !311, line: 16, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!86, !308, !296, !296}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !317, file: !311, line: 17, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!86, !308, !288, !288, !288, !187, !187, !187, !132, !245, !178, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !317, file: !311, line: 18, baseType: !336, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!86, !308, !339, !288, !288, !288}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !317, file: !311, line: 19, baseType: !322, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !317, file: !311, line: 20, baseType: !342, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!86, !308, !132, !288, !288, !288}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !317, file: !311, line: 21, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!86, !224, !308}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !317, file: !311, line: 22, baseType: !350, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!86, !308, !283, !288, !288}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !317, file: !311, line: 23, baseType: !350, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !317, file: !311, line: 24, baseType: !355, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!86, !308, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !317, file: !311, line: 25, baseType: !322, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !317, file: !311, line: 26, baseType: !322, size: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !317, file: !311, line: 27, baseType: !320, size: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !317, file: !311, line: 28, baseType: !320, size: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !317, file: !311, line: 29, baseType: !364, size: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!86, !308, !96}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !317, file: !311, line: 30, baseType: !320, size: 64, offset: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !317, file: !311, line: 31, baseType: !364, size: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !310, file: !311, line: 39, baseType: !370, size: 64, offset: 5632)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !371, line: 14, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !371, line: 14, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !310, file: !311, line: 40, baseType: !132, size: 32, offset: 5696)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !310, file: !311, line: 41, baseType: !171, size: 64, offset: 5760)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !310, file: !311, line: 41, baseType: !171, size: 64, offset: 5824)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !310, file: !311, line: 42, baseType: !245, size: 32, offset: 5888)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 43, baseType: !379, size: 32, offset: 5920)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !310, file: !311, line: 45, baseType: !132, size: 32, offset: 5952)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !310, file: !311, line: 46, baseType: !245, size: 32, offset: 5984)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !310, file: !311, line: 47, baseType: !296, size: 64, offset: 6016)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !310, file: !311, line: 47, baseType: !296, size: 64, offset: 6080)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !310, file: !311, line: 48, baseType: !288, size: 64, offset: 6144)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !310, file: !311, line: 48, baseType: !288, size: 64, offset: 6208)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !310, file: !311, line: 49, baseType: !245, size: 32, offset: 6272)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !310, file: !311, line: 50, baseType: !245, size: 32, offset: 6304)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !310, file: !311, line: 51, baseType: !389, size: 64, offset: 6336)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!86, !308, !132, !392, !392, !358, !169}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !395, line: 11, baseType: !396)
!395 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !395, line: 11, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !310, file: !311, line: 52, baseType: !169, size: 64, offset: 6400)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !311, line: 53, baseType: !169, size: 64, offset: 6464)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !310, file: !311, line: 54, baseType: !132, size: 32, offset: 6528)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !310, file: !311, line: 55, baseType: !169, size: 64, offset: 6592)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !310, file: !311, line: 56, baseType: !403, size: 32, offset: 6656)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !310, file: !311, line: 57, baseType: !403, size: 32, offset: 6688)
!405 = !{!406, !407, !408, !409}
!406 = !DILocalVariable(name: "pc", arg: 1, scope: !305, file: !277, line: 213, type: !308)
!407 = !DILocalVariable(name: "lsc", scope: !305, file: !277, line: 215, type: !275)
!408 = !DILocalVariable(name: "ierr", scope: !305, file: !277, line: 216, type: !86)
!409 = !DILocalVariable(name: "ierr__", scope: !410, file: !277, line: 219, type: !86)
!410 = distinct !DILexicalBlock(scope: !305, file: !277, line: 219, column: 35)
!411 = !DILocation(line: 0, scope: !305)
!412 = !DILocation(line: 215, column: 3, scope: !305)
!413 = !DILocation(line: 218, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !277, line: 218, column: 3)
!415 = distinct !DILexicalBlock(scope: !416, file: !277, line: 218, column: 3)
!416 = distinct !DILexicalBlock(scope: !305, file: !277, line: 218, column: 3)
!417 = !{!418, !418, i64 0}
!418 = !{!"any pointer", !419, i64 0}
!419 = !{!"omnipotent char", !420, i64 0}
!420 = !{!"Simple C/C++ TBAA"}
!421 = !DILocation(line: 218, column: 3, scope: !415)
!422 = !DILocation(line: 218, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !277, line: 218, column: 3)
!424 = distinct !DILexicalBlock(scope: !414, file: !277, line: 218, column: 3)
!425 = !{!426, !427, i64 1536}
!426 = !{!"", !419, i64 0, !419, i64 512, !419, i64 1024, !419, i64 1280, !427, i64 1536, !427, i64 1540, !419, i64 1544}
!427 = !{!"int", !419, i64 0}
!428 = !DILocation(line: 218, column: 3, scope: !424)
!429 = !DILocation(line: 218, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !423, file: !277, line: 218, column: 3)
!431 = !{!427, !427, i64 0}
!432 = !{!426, !427, i64 1540}
!433 = !DILocation(line: 219, column: 14, scope: !305)
!434 = !{!"branch_weights", i32 2146410443, i32 1073205}
!435 = !DILocation(line: 0, scope: !410)
!436 = !DILocation(line: 219, column: 35, scope: !410)
!437 = !{!"branch_weights", i32 2000, i32 1}
!438 = !DILocation(line: 219, column: 35, scope: !439)
!439 = distinct !DILexicalBlock(scope: !410, file: !277, line: 219, column: 35)
!440 = !DILocation(line: 220, column: 21, scope: !305)
!441 = !DILocation(line: 220, column: 7, scope: !305)
!442 = !DILocation(line: 220, column: 12, scope: !305)
!443 = !{!444, !418, i64 808}
!444 = !{!"_p_PC", !445, i64 0, !419, i64 560, !418, i64 704, !427, i64 712, !447, i64 720, !447, i64 728, !419, i64 736, !419, i64 740, !427, i64 744, !419, i64 748, !418, i64 752, !418, i64 760, !418, i64 768, !418, i64 776, !419, i64 784, !419, i64 788, !418, i64 792, !418, i64 800, !418, i64 808, !427, i64 816, !418, i64 824, !419, i64 832, !419, i64 836}
!445 = !{!"_p_PetscObject", !427, i64 0, !419, i64 8, !418, i64 64, !427, i64 72, !446, i64 80, !446, i64 88, !446, i64 96, !446, i64 104, !447, i64 112, !427, i64 120, !427, i64 124, !418, i64 128, !418, i64 136, !418, i64 144, !418, i64 152, !418, i64 160, !418, i64 168, !418, i64 176, !447, i64 184, !418, i64 192, !418, i64 200, !427, i64 208, !418, i64 216, !447, i64 224, !427, i64 232, !427, i64 236, !418, i64 240, !418, i64 248, !418, i64 256, !418, i64 264, !427, i64 272, !427, i64 276, !418, i64 280, !418, i64 288, !418, i64 296, !418, i64 304, !427, i64 312, !427, i64 316, !418, i64 320, !418, i64 328, !418, i64 336, !418, i64 344, !418, i64 352, !427, i64 360, !419, i64 368, !419, i64 384, !418, i64 392, !418, i64 400, !427, i64 408, !419, i64 416, !419, i64 456, !419, i64 496, !419, i64 536, !418, i64 544, !419, i64 552}
!446 = !{!"double", !419, i64 0}
!447 = !{!"long", !419, i64 0}
!448 = !DILocation(line: 222, column: 12, scope: !305)
!449 = !DILocation(line: 222, column: 28, scope: !305)
!450 = !{!451, !418, i64 8}
