; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/wb/wb.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/wb/wb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!128 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!129 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140}
!132 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!137 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!138 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!139 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!140 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 424, baseType: !7, size: 32, elements: !142)
!142 = !{!143, !144}
!143 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!147 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!162 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!163 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!164 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 264, baseType: !7, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "PC_MG_MULTIPLICATIVE", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "PC_MG_ADDITIVE", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "PC_MG_FULL", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "PC_MG_KASKADE", value: 3, isUnsigned: true)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 297, baseType: !7, size: 32, elements: !172)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIEnumerator(name: "PC_MG_GALERKIN_BOTH", value: 0, isUnsigned: true)
!174 = !DIEnumerator(name: "PC_MG_GALERKIN_PMAT", value: 1, isUnsigned: true)
!175 = !DIEnumerator(name: "PC_MG_GALERKIN_MAT", value: 2, isUnsigned: true)
!176 = !DIEnumerator(name: "PC_MG_GALERKIN_NONE", value: 3, isUnsigned: true)
!177 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 330, baseType: !7, size: 32, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!181 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!182 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!183 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !185)
!185 = !{!186}
!186 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!187 = !{!188, !192, !193, !362, !396, !278, !28, !228, !268, !399, !402, !405, !592, !602, !603, !403, !251, !364, !7}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !189, line: 330, baseType: !190)
!189 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !189, line: 330, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !196, line: 73, size: 4480, elements: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!197 = !{!198, !200, !249, !250, !252, !255, !256, !257, !258, !266, !267, !269, !273, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !292, !294, !295, !297, !299, !300, !301, !302, !303, !306, !308, !309, !310, !311, !312, !315, !317, !318, !319, !329, !331, !332, !336, !337, !386, !391, !393, !394, !395}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !195, file: !196, line: 74, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !195, file: !196, line: 75, baseType: !201, size: 448, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 448, elements: !247)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !196, line: 53, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 45, size: 448, elements: !204)
!204 = !{!205, !211, !219, !224, !231, !235, !242}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !203, file: !196, line: 46, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !193, !210}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !203, file: !196, line: 47, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!209, !193, !215}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !216, line: 16, baseType: !217)
!216 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !216, line: 16, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !203, file: !196, line: 48, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!209, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !203, file: !196, line: 49, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!209, !193, !228, !193}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !203, file: !196, line: 50, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!209, !193, !228, !223}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !203, file: !196, line: 51, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!209, !193, !228, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !203, file: !196, line: 52, baseType: !243, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!209, !193, !228, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !195, file: !196, line: 76, baseType: !188, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !196, line: 77, baseType: !251, size: 32, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !195, file: !196, line: 78, baseType: !253, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !254)
!254 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !195, file: !196, line: 78, baseType: !253, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !195, file: !196, line: 78, baseType: !253, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !195, file: !196, line: 78, baseType: !253, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !196, line: 79, baseType: !259, size: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !262, line: 27, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !264, line: 43, baseType: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!265 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !195, file: !196, line: 80, baseType: !251, size: 32, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !195, file: !196, line: 81, baseType: !268, size: 32, offset: 992)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !195, file: !196, line: 82, baseType: !270, size: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !195, file: !196, line: 83, baseType: !274, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !195, file: !196, line: 84, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !195, file: !196, line: 85, baseType: !278, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !195, file: !196, line: 86, baseType: !278, size: 64, offset: 1280)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !195, file: !196, line: 87, baseType: !278, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !195, file: !196, line: 88, baseType: !193, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !195, file: !196, line: 89, baseType: !259, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 90, baseType: !278, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !195, file: !196, line: 91, baseType: !278, size: 64, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !195, file: !196, line: 92, baseType: !251, size: 32, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !195, file: !196, line: 93, baseType: !192, size: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 94, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !260)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !195, file: !196, line: 95, baseType: !251, size: 32, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !195, file: !196, line: 95, baseType: !251, size: 32, offset: 1888)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !195, file: !196, line: 96, baseType: !293, size: 64, offset: 1920)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !195, file: !196, line: 96, baseType: !293, size: 64, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !195, file: !196, line: 97, baseType: !296, size: 64, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !195, file: !196, line: 97, baseType: !298, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !195, file: !196, line: 98, baseType: !251, size: 32, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !195, file: !196, line: 98, baseType: !251, size: 32, offset: 2208)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !195, file: !196, line: 99, baseType: !293, size: 64, offset: 2240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !195, file: !196, line: 99, baseType: !293, size: 64, offset: 2304)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !195, file: !196, line: 100, baseType: !304, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !254)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !195, file: !196, line: 100, baseType: !307, size: 64, offset: 2432)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !195, file: !196, line: 101, baseType: !251, size: 32, offset: 2496)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !195, file: !196, line: 101, baseType: !251, size: 32, offset: 2528)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !195, file: !196, line: 102, baseType: !293, size: 64, offset: 2560)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !195, file: !196, line: 102, baseType: !293, size: 64, offset: 2624)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !195, file: !196, line: 103, baseType: !313, size: 64, offset: 2688)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !305)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !195, file: !196, line: 103, baseType: !316, size: 64, offset: 2752)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !195, file: !196, line: 104, baseType: !246, size: 64, offset: 2816)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !195, file: !196, line: 105, baseType: !251, size: 32, offset: 2880)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !195, file: !196, line: 106, baseType: !320, size: 128, offset: 2944)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, elements: !327)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !196, line: 64, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 61, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !323, file: !196, line: 62, baseType: !239, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !323, file: !196, line: 63, baseType: !192, size: 64, offset: 64)
!327 = !{!328}
!328 = !DISubrange(count: 2)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !195, file: !196, line: 107, baseType: !330, size: 64, offset: 3072)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 64, elements: !327)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !195, file: !196, line: 108, baseType: !192, size: 64, offset: 3136)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !195, file: !196, line: 109, baseType: !333, size: 64, offset: 3200)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!209, !192}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !195, file: !196, line: 111, baseType: !251, size: 32, offset: 3264)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !195, file: !196, line: 112, baseType: !338, size: 320, offset: 3328)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!209, !342, !193, !192}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !345)
!345 = !{!346, !347, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !344, file: !12, line: 100, baseType: !251, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !12, line: 101, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !359, !360, !361, !365, !367, !369, !370, !371}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !350, file: !12, line: 84, baseType: !278, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !350, file: !12, line: 85, baseType: !278, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !12, line: 86, baseType: !192, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !350, file: !12, line: 87, baseType: !270, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !350, file: !12, line: 88, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !350, file: !12, line: 89, baseType: !230, size: 8, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !350, file: !12, line: 90, baseType: !278, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !350, file: !12, line: 91, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !363, line: 46, baseType: !364)
!363 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!364 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !350, file: !12, line: 92, baseType: !366, size: 32, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !12, line: 93, baseType: !368, size: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !12, line: 94, baseType: !348, size: 64, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !350, file: !12, line: 95, baseType: !278, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !350, file: !12, line: 96, baseType: !192, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !344, file: !12, line: 102, baseType: !278, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !344, file: !12, line: 102, baseType: !278, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !344, file: !12, line: 103, baseType: !278, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !344, file: !12, line: 104, baseType: !188, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !344, file: !12, line: 105, baseType: !366, size: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !344, file: !12, line: 106, baseType: !193, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !344, file: !12, line: 107, baseType: !381, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!384 = !{!385}
!385 = !DISubrange(count: 5)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !195, file: !196, line: 113, baseType: !387, size: 320, offset: 3648)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 320, elements: !384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!209, !193, !192}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !195, file: !196, line: 114, baseType: !392, size: 320, offset: 3968)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 320, elements: !384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !195, file: !196, line: 115, baseType: !366, size: 32, offset: 4288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !195, file: !196, line: 120, baseType: !381, size: 64, offset: 4352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !195, file: !196, line: 121, baseType: !366, size: 32, offset: 4416)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !189, line: 331, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !189, line: 331, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !189, line: 338, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !189, line: 338, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !404, line: 1451, baseType: !239)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !407, line: 79, baseType: !408)
!407 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 53, size: 2240, elements: !409)
!409 = !{!410, !412, !413, !414, !416, !417, !418, !420, !421, !422, !423, !424, !425, !479, !480, !481, !482, !483, !484, !485, !486, !488, !587, !591}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !408, file: !407, line: 54, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !27, line: 264, baseType: !165)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !408, file: !407, line: 55, baseType: !251, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !408, file: !407, line: 56, baseType: !251, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !408, file: !407, line: 57, baseType: !415, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !27, line: 297, baseType: !171)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !408, file: !407, line: 58, baseType: !366, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !408, file: !407, line: 60, baseType: !366, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !408, file: !407, line: 61, baseType: !419, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !27, line: 330, baseType: !178)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !408, file: !407, line: 62, baseType: !251, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !408, file: !407, line: 63, baseType: !251, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !408, file: !407, line: 64, baseType: !366, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !408, file: !407, line: 66, baseType: !366, size: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !408, file: !407, line: 68, baseType: !251, size: 32, offset: 352)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !408, file: !407, line: 69, baseType: !426, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !407, line: 48, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 14, size: 1600, elements: !430)
!430 = !{!431, !432, !433, !434, !439, !440, !441, !445, !446, !447, !449, !453, !454, !458, !459, !460, !465, !466, !467, !468, !469, !470, !471, !472, !473, !476, !477, !478}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !429, file: !407, line: 15, baseType: !251, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !429, file: !407, line: 16, baseType: !251, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !429, file: !407, line: 17, baseType: !251, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !429, file: !407, line: 18, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !436, line: 21, baseType: !437)
!436 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !436, line: 21, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !429, file: !407, line: 19, baseType: !435, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !429, file: !407, line: 20, baseType: !435, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !429, file: !407, line: 21, baseType: !442, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !429, file: !407, line: 22, baseType: !442, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !429, file: !407, line: 23, baseType: !442, size: 64, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpace", scope: !429, file: !407, line: 24, baseType: !448, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !429, file: !407, line: 29, baseType: !450, size: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!209, !442, !435, !435, !435}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "residualtranspose", scope: !429, file: !407, line: 30, baseType: !450, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "matresidual", scope: !429, file: !407, line: 31, baseType: !455, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!209, !442, !442, !442, !442}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matresidualtranspose", scope: !429, file: !407, line: 32, baseType: !455, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !429, file: !407, line: 34, baseType: !442, size: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "smoothd", scope: !429, file: !407, line: 35, baseType: !461, size: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !462, line: 22, baseType: !463)
!462 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !462, line: 22, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "smoothu", scope: !429, file: !407, line: 36, baseType: !461, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !429, file: !407, line: 37, baseType: !461, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "crx", scope: !429, file: !407, line: 38, baseType: !435, size: 64, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "crb", scope: !429, file: !407, line: 39, baseType: !435, size: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !429, file: !407, line: 40, baseType: !442, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "restrct", scope: !429, file: !407, line: 41, baseType: !442, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "inject", scope: !429, file: !407, line: 42, baseType: !442, size: 64, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rscale", scope: !429, file: !407, line: 43, baseType: !435, size: 64, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsetup", scope: !429, file: !407, line: 44, baseType: !474, size: 32, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !475, line: 80, baseType: !28)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsolve", scope: !429, file: !407, line: 45, baseType: !474, size: 32, offset: 1504)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "eventresidual", scope: !429, file: !407, line: 46, baseType: !474, size: 32, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "eventinterprestrict", scope: !429, file: !407, line: 47, baseType: !474, size: 32, offset: 1568)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothu", scope: !408, file: !407, line: 70, baseType: !251, size: 32, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothd", scope: !408, file: !407, line: 71, baseType: !251, size: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !408, file: !407, line: 72, baseType: !305, size: 64, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !408, file: !407, line: 72, baseType: !305, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dtol", scope: !408, file: !407, line: 72, baseType: !305, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !408, file: !407, line: 72, baseType: !305, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "innerctx", scope: !408, file: !407, line: 74, baseType: !192, size: 64, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stageApply", scope: !408, file: !407, line: 75, baseType: !487, size: 32, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogStage", file: !475, line: 89, baseType: !28)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !408, file: !407, line: 76, baseType: !489, size: 64, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!209, !492, !215}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !495, line: 37, size: 6720, elements: !496)
!495 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!496 = !{!497, !499, !552, !556, !557, !558, !559, !560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !580, !581, !582, !583, !584, !586}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !494, file: !495, line: 38, baseType: !498, size: 4480)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !196, line: 122, baseType: !195)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !494, file: !495, line: 38, baseType: !500, size: 1152, offset: 4480)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 1152, elements: !247)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !495, line: 13, size: 1152, elements: !502)
!502 = !{!503, !507, !511, !515, !521, !526, !527, !531, !535, !539, !540, !545, !546, !547, !548, !549, !550, !551}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !501, file: !495, line: 14, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!209, !492}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !501, file: !495, line: 15, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!209, !492, !435, !435}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !501, file: !495, line: 16, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!209, !492, !442, !442}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !501, file: !495, line: 17, baseType: !516, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!209, !492, !435, !435, !435, !305, !305, !305, !251, !366, !296, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !501, file: !495, line: 18, baseType: !522, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!209, !492, !525, !435, !435, !435}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !501, file: !495, line: 19, baseType: !508, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !501, file: !495, line: 20, baseType: !528, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!209, !492, !251, !435, !435, !435}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !501, file: !495, line: 21, baseType: !532, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!209, !342, !492}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !501, file: !495, line: 22, baseType: !536, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!209, !492, !461, !435, !435}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !501, file: !495, line: 23, baseType: !536, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !501, file: !495, line: 24, baseType: !541, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!209, !492, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !501, file: !495, line: 25, baseType: !508, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !501, file: !495, line: 26, baseType: !508, size: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !501, file: !495, line: 27, baseType: !504, size: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !501, file: !495, line: 28, baseType: !504, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !501, file: !495, line: 29, baseType: !489, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !501, file: !495, line: 30, baseType: !504, size: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !501, file: !495, line: 31, baseType: !489, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !494, file: !495, line: 39, baseType: !553, size: 64, offset: 5632)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !67, line: 14, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !67, line: 14, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !494, file: !495, line: 40, baseType: !251, size: 32, offset: 5696)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !494, file: !495, line: 41, baseType: !289, size: 64, offset: 5760)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !494, file: !495, line: 41, baseType: !289, size: 64, offset: 5824)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !494, file: !495, line: 42, baseType: !366, size: 32, offset: 5888)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !495, line: 43, baseType: !561, size: 32, offset: 5920)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !494, file: !495, line: 45, baseType: !251, size: 32, offset: 5952)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !494, file: !495, line: 46, baseType: !366, size: 32, offset: 5984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !494, file: !495, line: 47, baseType: !442, size: 64, offset: 6016)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !494, file: !495, line: 47, baseType: !442, size: 64, offset: 6080)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !494, file: !495, line: 48, baseType: !435, size: 64, offset: 6144)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !494, file: !495, line: 48, baseType: !435, size: 64, offset: 6208)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !494, file: !495, line: 49, baseType: !366, size: 32, offset: 6272)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !494, file: !495, line: 50, baseType: !366, size: 32, offset: 6304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !494, file: !495, line: 51, baseType: !571, size: 64, offset: 6336)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!209, !492, !251, !574, !574, !544, !192}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !577, line: 11, baseType: !578)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !577, line: 11, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !494, file: !495, line: 52, baseType: !192, size: 64, offset: 6400)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !495, line: 53, baseType: !192, size: 64, offset: 6464)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !494, file: !495, line: 54, baseType: !251, size: 32, offset: 6528)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !494, file: !495, line: 55, baseType: !192, size: 64, offset: 6592)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !494, file: !495, line: 56, baseType: !585, size: 32, offset: 6656)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !494, file: !495, line: 57, baseType: !585, size: 32, offset: 6688)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "min_eigen_DinvA", scope: !408, file: !407, line: 77, baseType: !588, size: 640, offset: 960)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 640, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 10)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_eigen_DinvA", scope: !408, file: !407, line: 78, baseType: !588, size: 640, offset: 1600)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Exotic", file: !594, line: 11, baseType: !595)
!594 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/wb/wb.c", directory: "/home/users/ndemeye/xSDK")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 6, size: 256, elements: !596)
!596 = !{!597, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !594, line: 7, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCExoticType", file: !27, line: 306, baseType: !56)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !595, file: !594, line: 8, baseType: !442, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "directSolve", scope: !595, file: !594, line: 9, baseType: !366, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !595, file: !594, line: 10, baseType: !461, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !184)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!604 = !{!0}
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !384)
!606 = !{i32 7, !"Dwarf Version", i32 4}
!607 = !{i32 2, !"Debug Info Version", i32 3}
!608 = !{i32 1, !"wchar_size", i32 4}
!609 = !{i32 7, !"PIC Level", i32 2}
!610 = !{i32 7, !"uwtable", i32 1}
!611 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!612 = distinct !DISubprogram(name: "DMDAGetWireBasketInterpolation", scope: !594, file: !594, line: 19, type: !613, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!613 = !DISubroutineType(types: !614)
!614 = !{!209, !492, !553, !592, !442, !615, !544}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !41, line: 238, baseType: !60)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !675, !676, !677, !678, !679, !680, !681, !682, !697, !698, !699, !702, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !768, !770, !772, !774, !776, !778, !780, !782, !784, !786, !787, !788, !790, !792, !794, !796, !798, !803, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !835, !836, !838, !840, !845, !847, !849, !854, !856, !858, !862, !865, !867, !869, !871, !873, !875, !877, !879, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901}
!617 = !DILocalVariable(name: "pc", arg: 1, scope: !612, file: !594, line: 19, type: !492)
!618 = !DILocalVariable(name: "da", arg: 2, scope: !612, file: !594, line: 19, type: !553)
!619 = !DILocalVariable(name: "exotic", arg: 3, scope: !612, file: !594, line: 19, type: !592)
!620 = !DILocalVariable(name: "Aglobal", arg: 4, scope: !612, file: !594, line: 19, type: !442)
!621 = !DILocalVariable(name: "reuse", arg: 5, scope: !612, file: !594, line: 19, type: !615)
!622 = !DILocalVariable(name: "P", arg: 6, scope: !612, file: !594, line: 19, type: !544)
!623 = !DILocalVariable(name: "ierr", scope: !612, file: !594, line: 21, type: !209)
!624 = !DILocalVariable(name: "dim", scope: !612, file: !594, line: 22, type: !251)
!625 = !DILocalVariable(name: "i", scope: !612, file: !594, line: 22, type: !251)
!626 = !DILocalVariable(name: "j", scope: !612, file: !594, line: 22, type: !251)
!627 = !DILocalVariable(name: "k", scope: !612, file: !594, line: 22, type: !251)
!628 = !DILocalVariable(name: "m", scope: !612, file: !594, line: 22, type: !251)
!629 = !DILocalVariable(name: "n", scope: !612, file: !594, line: 22, type: !251)
!630 = !DILocalVariable(name: "p", scope: !612, file: !594, line: 22, type: !251)
!631 = !DILocalVariable(name: "dof", scope: !612, file: !594, line: 22, type: !251)
!632 = !DILocalVariable(name: "Nint", scope: !612, file: !594, line: 22, type: !251)
!633 = !DILocalVariable(name: "Nface", scope: !612, file: !594, line: 22, type: !251)
!634 = !DILocalVariable(name: "Nwire", scope: !612, file: !594, line: 22, type: !251)
!635 = !DILocalVariable(name: "Nsurf", scope: !612, file: !594, line: 22, type: !251)
!636 = !DILocalVariable(name: "Iint", scope: !612, file: !594, line: 22, type: !296)
!637 = !DILocalVariable(name: "Isurf", scope: !612, file: !594, line: 22, type: !296)
!638 = !DILocalVariable(name: "cint", scope: !612, file: !594, line: 22, type: !251)
!639 = !DILocalVariable(name: "csurf", scope: !612, file: !594, line: 22, type: !251)
!640 = !DILocalVariable(name: "istart", scope: !612, file: !594, line: 22, type: !251)
!641 = !DILocalVariable(name: "jstart", scope: !612, file: !594, line: 22, type: !251)
!642 = !DILocalVariable(name: "kstart", scope: !612, file: !594, line: 22, type: !251)
!643 = !DILocalVariable(name: "II", scope: !612, file: !594, line: 22, type: !296)
!644 = !DILocalVariable(name: "N", scope: !612, file: !594, line: 22, type: !251)
!645 = !DILocalVariable(name: "c", scope: !612, file: !594, line: 22, type: !251)
!646 = !DILocalVariable(name: "mwidth", scope: !612, file: !594, line: 23, type: !251)
!647 = !DILocalVariable(name: "nwidth", scope: !612, file: !594, line: 23, type: !251)
!648 = !DILocalVariable(name: "pwidth", scope: !612, file: !594, line: 23, type: !251)
!649 = !DILocalVariable(name: "cnt", scope: !612, file: !594, line: 23, type: !251)
!650 = !DILocalVariable(name: "mp", scope: !612, file: !594, line: 23, type: !251)
!651 = !DILocalVariable(name: "np", scope: !612, file: !594, line: 23, type: !251)
!652 = !DILocalVariable(name: "pp", scope: !612, file: !594, line: 23, type: !251)
!653 = !DILocalVariable(name: "Ntotal", scope: !612, file: !594, line: 23, type: !251)
!654 = !DILocalVariable(name: "gl", scope: !612, file: !594, line: 23, type: !655)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 832, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 26)
!658 = !DILocalVariable(name: "globals", scope: !612, file: !594, line: 23, type: !296)
!659 = !DILocalVariable(name: "Ng", scope: !612, file: !594, line: 23, type: !251)
!660 = !DILocalVariable(name: "IIint", scope: !612, file: !594, line: 23, type: !296)
!661 = !DILocalVariable(name: "IIsurf", scope: !612, file: !594, line: 23, type: !296)
!662 = !DILocalVariable(name: "Nt", scope: !612, file: !594, line: 23, type: !251)
!663 = !DILocalVariable(name: "Xint", scope: !612, file: !594, line: 24, type: !442)
!664 = !DILocalVariable(name: "Xsurf", scope: !612, file: !594, line: 24, type: !442)
!665 = !DILocalVariable(name: "Xint_tmp", scope: !612, file: !594, line: 24, type: !442)
!666 = !DILocalVariable(name: "isint", scope: !612, file: !594, line: 25, type: !576)
!667 = !DILocalVariable(name: "issurf", scope: !612, file: !594, line: 25, type: !576)
!668 = !DILocalVariable(name: "is", scope: !612, file: !594, line: 25, type: !576)
!669 = !DILocalVariable(name: "row", scope: !612, file: !594, line: 25, type: !576)
!670 = !DILocalVariable(name: "col", scope: !612, file: !594, line: 25, type: !576)
!671 = !DILocalVariable(name: "ltg", scope: !612, file: !594, line: 26, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !577, line: 30, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !577, line: 30, flags: DIFlagFwdDecl)
!675 = !DILocalVariable(name: "comm", scope: !612, file: !594, line: 27, type: !188)
!676 = !DILocalVariable(name: "A", scope: !612, file: !594, line: 28, type: !442)
!677 = !DILocalVariable(name: "Aii", scope: !612, file: !594, line: 28, type: !442)
!678 = !DILocalVariable(name: "Ais", scope: !612, file: !594, line: 28, type: !442)
!679 = !DILocalVariable(name: "Asi", scope: !612, file: !594, line: 28, type: !442)
!680 = !DILocalVariable(name: "Aholder", scope: !612, file: !594, line: 28, type: !544)
!681 = !DILocalVariable(name: "iAii", scope: !612, file: !594, line: 28, type: !442)
!682 = !DILocalVariable(name: "info", scope: !612, file: !594, line: 29, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !41, line: 1239, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 1226, size: 704, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !684, file: !41, line: 1227, baseType: !305, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !684, file: !41, line: 1228, baseType: !305, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !684, file: !41, line: 1229, baseType: !305, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !684, file: !41, line: 1230, baseType: !305, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !684, file: !41, line: 1231, baseType: !305, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !684, file: !41, line: 1232, baseType: !305, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !684, file: !41, line: 1233, baseType: !305, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !684, file: !41, line: 1234, baseType: !305, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !684, file: !41, line: 1236, baseType: !305, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !684, file: !41, line: 1237, baseType: !305, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !684, file: !41, line: 1238, baseType: !305, size: 64, offset: 640)
!697 = !DILocalVariable(name: "xsurf", scope: !612, file: !594, line: 30, type: !313)
!698 = !DILocalVariable(name: "xint", scope: !612, file: !594, line: 30, type: !313)
!699 = !DILocalVariable(name: "rxint", scope: !612, file: !594, line: 31, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!702 = !DILocalVariable(name: "ht", scope: !612, file: !594, line: 35, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTable", file: !704, line: 14, baseType: !705)
!704 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscctable.h", directory: "/home/users/ndemeye/xSDK")
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscTable", file: !704, line: 5, size: 256, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "keytable", scope: !706, file: !704, line: 6, baseType: !296, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !706, file: !704, line: 7, baseType: !296, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !706, file: !704, line: 8, baseType: !251, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tablesize", scope: !706, file: !704, line: 9, baseType: !251, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !706, file: !704, line: 10, baseType: !251, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "maxkey", scope: !706, file: !704, line: 11, baseType: !251, size: 32, offset: 224)
!714 = !DILocalVariable(name: "ierr__", scope: !715, file: !594, line: 38, type: !209)
!715 = distinct !DILexicalBlock(scope: !612, file: !594, line: 38, column: 88)
!716 = !DILocalVariable(name: "ierr__", scope: !717, file: !594, line: 41, type: !209)
!717 = distinct !DILexicalBlock(scope: !612, file: !594, line: 41, column: 55)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !594, line: 42, type: !209)
!719 = distinct !DILexicalBlock(scope: !612, file: !594, line: 42, column: 84)
!720 = !DILocalVariable(name: "ierr__", scope: !721, file: !594, line: 65, type: !209)
!721 = distinct !DILexicalBlock(scope: !612, file: !594, line: 65, column: 63)
!722 = !DILocalVariable(name: "ierr__", scope: !723, file: !594, line: 66, type: !209)
!723 = distinct !DILexicalBlock(scope: !612, file: !594, line: 66, column: 65)
!724 = !DILocalVariable(name: "ierr__", scope: !725, file: !594, line: 67, type: !209)
!725 = distinct !DILexicalBlock(scope: !612, file: !594, line: 67, column: 42)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !594, line: 131, type: !209)
!727 = distinct !DILexicalBlock(scope: !612, file: !594, line: 131, column: 45)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !594, line: 142, type: !209)
!729 = distinct !DILexicalBlock(scope: !612, file: !594, line: 142, column: 54)
!730 = !DILocalVariable(name: "ierr__", scope: !731, file: !594, line: 143, type: !209)
!731 = distinct !DILexicalBlock(scope: !612, file: !594, line: 143, column: 50)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !594, line: 162, type: !209)
!733 = distinct !DILexicalBlock(scope: !612, file: !594, line: 162, column: 45)
!734 = !DILocalVariable(name: "ierr__", scope: !735, file: !594, line: 163, type: !209)
!735 = distinct !DILexicalBlock(scope: !612, file: !594, line: 163, column: 51)
!736 = !DILocalVariable(name: "ierr__", scope: !737, file: !594, line: 164, type: !209)
!737 = distinct !DILexicalBlock(scope: !612, file: !594, line: 164, column: 60)
!738 = !DILocalVariable(name: "ierr__", scope: !739, file: !594, line: 165, type: !209)
!739 = distinct !DILexicalBlock(scope: !612, file: !594, line: 165, column: 63)
!740 = !DILocalVariable(name: "ierr__", scope: !741, file: !594, line: 166, type: !209)
!741 = distinct !DILexicalBlock(scope: !612, file: !594, line: 166, column: 52)
!742 = !DILocalVariable(name: "ierr__", scope: !743, file: !594, line: 167, type: !209)
!743 = distinct !DILexicalBlock(scope: !612, file: !594, line: 167, column: 59)
!744 = !DILocalVariable(name: "ierr__", scope: !745, file: !594, line: 168, type: !209)
!745 = distinct !DILexicalBlock(scope: !612, file: !594, line: 168, column: 78)
!746 = !DILocalVariable(name: "ierr__", scope: !747, file: !594, line: 169, type: !209)
!747 = distinct !DILexicalBlock(scope: !612, file: !594, line: 169, column: 81)
!748 = !DILocalVariable(name: "ierr__", scope: !749, file: !594, line: 170, type: !209)
!749 = distinct !DILexicalBlock(scope: !612, file: !594, line: 170, column: 36)
!750 = !DILocalVariable(name: "ierr__", scope: !751, file: !594, line: 172, type: !209)
!751 = distinct !DILexicalBlock(scope: !612, file: !594, line: 172, column: 78)
!752 = !DILocalVariable(name: "ierr__", scope: !753, file: !594, line: 174, type: !209)
!753 = distinct !DILexicalBlock(scope: !612, file: !594, line: 174, column: 29)
!754 = !DILocalVariable(name: "ierr__", scope: !755, file: !594, line: 176, type: !209)
!755 = distinct !DILexicalBlock(scope: !612, file: !594, line: 176, column: 68)
!756 = !DILocalVariable(name: "ierr__", scope: !757, file: !594, line: 177, type: !209)
!757 = distinct !DILexicalBlock(scope: !612, file: !594, line: 177, column: 69)
!758 = !DILocalVariable(name: "ierr__", scope: !759, file: !594, line: 178, type: !209)
!759 = distinct !DILexicalBlock(scope: !612, file: !594, line: 178, column: 69)
