; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/geo.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/geo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!334 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 405, baseType: !5, size: 32, elements: !336)
!336 = !{!337, !338}
!337 = !DIEnumerator(name: "PCGAMG_LAYOUT_COMPACT", value: 0, isUnsigned: true)
!338 = !DIEnumerator(name: "PCGAMG_LAYOUT_SPREAD", value: 1, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 663, baseType: !5, size: 32, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !343, !344}
!342 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!347 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tag", file: !371, line: 69, baseType: !5, size: 32, elements: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcgamgimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!373 = !DIEnumerator(name: "SET1", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "SET2", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "GRAPH", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "GRAPH_MAT", value: 3, isUnsigned: true)
!377 = !DIEnumerator(name: "GRAPH_FILTER", value: 4, isUnsigned: true)
!378 = !DIEnumerator(name: "GRAPH_SQR", value: 5, isUnsigned: true)
!379 = !DIEnumerator(name: "SET4", value: 6, isUnsigned: true)
!380 = !DIEnumerator(name: "SET5", value: 7, isUnsigned: true)
!381 = !DIEnumerator(name: "SET6", value: 8, isUnsigned: true)
!382 = !DIEnumerator(name: "FIND_V", value: 9, isUnsigned: true)
!383 = !DIEnumerator(name: "SET7", value: 10, isUnsigned: true)
!384 = !DIEnumerator(name: "SET8", value: 11, isUnsigned: true)
!385 = !DIEnumerator(name: "SET9", value: 12, isUnsigned: true)
!386 = !DIEnumerator(name: "SET10", value: 13, isUnsigned: true)
!387 = !DIEnumerator(name: "SET11", value: 14, isUnsigned: true)
!388 = !DIEnumerator(name: "SET12", value: 15, isUnsigned: true)
!389 = !DIEnumerator(name: "SET13", value: 16, isUnsigned: true)
!390 = !DIEnumerator(name: "SET14", value: 17, isUnsigned: true)
!391 = !DIEnumerator(name: "SET15", value: 18, isUnsigned: true)
!392 = !DIEnumerator(name: "SET16", value: 19, isUnsigned: true)
!393 = !DIEnumerator(name: "NUM_SET", value: 20, isUnsigned: true)
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !395)
!395 = !{!396, !397, !398, !399, !400}
!396 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!397 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!398 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!399 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!400 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!401 = !{!402, !1546, !465, !545, !462, !620, !486, !415, !410, !535, !72, !562, !525, !1304, !1640, !511, !1643, !1645, !1652, !572, !563, !5}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !404, line: 79, baseType: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 53, size: 2240, elements: !406)
!406 = !{!407, !409, !411, !412, !414, !416, !417, !419, !420, !421, !422, !423, !424, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1450, !1541, !1545}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !405, file: !404, line: 54, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !295, line: 264, baseType: !316)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !405, file: !404, line: 55, baseType: !410, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !405, file: !404, line: 56, baseType: !410, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !405, file: !404, line: 57, baseType: !413, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !295, line: 297, baseType: !322)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !405, file: !404, line: 58, baseType: !415, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !405, file: !404, line: 60, baseType: !415, size: 32, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !405, file: !404, line: 61, baseType: !418, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !295, line: 330, baseType: !329)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !405, file: !404, line: 62, baseType: !410, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !405, file: !404, line: 63, baseType: !410, size: 32, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !405, file: !404, line: 64, baseType: !415, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !405, file: !404, line: 66, baseType: !415, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !405, file: !404, line: 68, baseType: !410, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !405, file: !404, line: 69, baseType: !425, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !404, line: 48, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 14, size: 1600, elements: !429)
!429 = !{!430, !431, !432, !433, !437, !438, !439, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1438, !1439, !1440}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !428, file: !404, line: 15, baseType: !410, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !428, file: !404, line: 16, baseType: !410, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !428, file: !404, line: 17, baseType: !410, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !428, file: !404, line: 18, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !428, file: !404, line: 19, baseType: !434, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !428, file: !404, line: 20, baseType: !434, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !428, file: !404, line: 21, baseType: !440, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !443, line: 436, size: 23424, elements: !444)
!443 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!444 = !{!445, !653, !1157, !1177, !1178, !1179, !1181, !1182, !1183, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1310, !1311, !1327, !1328, !1329, !1330, !1331, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1366, !1386, !1387, !1389, !1390, !1391, !1392, !1393, !1394, !1412, !1413}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !442, file: !443, line: 437, baseType: !446, size: 4480)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !447, line: 122, baseType: !448)
!447 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !447, line: 73, size: 4480, elements: !449)
!449 = !{!450, !452, !507, !508, !509, !512, !513, !514, !515, !523, !524, !526, !530, !534, !536, !537, !538, !539, !540, !541, !542, !543, !544, !546, !548, !549, !550, !552, !553, !555, !557, !558, !559, !560, !561, !564, !566, !567, !568, !569, !570, !573, !575, !576, !577, !587, !589, !590, !594, !595, !643, !648, !650, !651, !652}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !448, file: !447, line: 74, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !448, file: !447, line: 75, baseType: !453, size: 448, offset: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 448, elements: !505)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !447, line: 53, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 45, size: 448, elements: !456)
!456 = !{!457, !469, !477, !482, !489, !493, !500}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !455, file: !447, line: 46, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !462, !464}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !466, line: 330, baseType: !467)
!466 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !466, line: 330, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !455, file: !447, line: 47, baseType: !470, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!461, !462, !473}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !474, line: 16, baseType: !475)
!474 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !474, line: 16, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !455, file: !447, line: 48, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!461, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !455, file: !447, line: 49, baseType: !483, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!461, !462, !486, !462}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !455, file: !447, line: 50, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!461, !462, !486, !481}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !455, file: !447, line: 51, baseType: !494, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!461, !462, !486, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !455, file: !447, line: 52, baseType: !501, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!461, !462, !486, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!505 = !{!506}
!506 = !DISubrange(count: 1)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !448, file: !447, line: 76, baseType: !465, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !447, line: 77, baseType: !410, size: 32, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !448, file: !447, line: 78, baseType: !510, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !511)
!511 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !448, file: !447, line: 78, baseType: !510, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !448, file: !447, line: 78, baseType: !510, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !448, file: !447, line: 78, baseType: !510, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !448, file: !447, line: 79, baseType: !516, size: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !519, line: 27, baseType: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !521, line: 43, baseType: !522)
!521 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!522 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !448, file: !447, line: 80, baseType: !410, size: 32, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !448, file: !447, line: 81, baseType: !525, size: 32, offset: 992)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !448, file: !447, line: 82, baseType: !527, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !448, file: !447, line: 83, baseType: !531, size: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !448, file: !447, line: 84, baseType: !535, size: 64, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !448, file: !447, line: 85, baseType: !535, size: 64, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !448, file: !447, line: 86, baseType: !535, size: 64, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !448, file: !447, line: 87, baseType: !535, size: 64, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !448, file: !447, line: 88, baseType: !462, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !448, file: !447, line: 89, baseType: !516, size: 64, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !447, line: 90, baseType: !535, size: 64, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !448, file: !447, line: 91, baseType: !535, size: 64, offset: 1600)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !448, file: !447, line: 92, baseType: !410, size: 32, offset: 1664)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !448, file: !447, line: 93, baseType: !545, size: 64, offset: 1728)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !448, file: !447, line: 94, baseType: !547, size: 64, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !517)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !448, file: !447, line: 95, baseType: !410, size: 32, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !448, file: !447, line: 95, baseType: !410, size: 32, offset: 1888)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !448, file: !447, line: 96, baseType: !551, size: 64, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !448, file: !447, line: 96, baseType: !551, size: 64, offset: 1984)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !448, file: !447, line: 97, baseType: !554, size: 64, offset: 2048)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !448, file: !447, line: 97, baseType: !556, size: 64, offset: 2112)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !448, file: !447, line: 98, baseType: !410, size: 32, offset: 2176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !448, file: !447, line: 98, baseType: !410, size: 32, offset: 2208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !448, file: !447, line: 99, baseType: !551, size: 64, offset: 2240)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !448, file: !447, line: 99, baseType: !551, size: 64, offset: 2304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !448, file: !447, line: 100, baseType: !562, size: 64, offset: 2368)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !511)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !448, file: !447, line: 100, baseType: !565, size: 64, offset: 2432)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !448, file: !447, line: 101, baseType: !410, size: 32, offset: 2496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !448, file: !447, line: 101, baseType: !410, size: 32, offset: 2528)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !448, file: !447, line: 102, baseType: !551, size: 64, offset: 2560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !448, file: !447, line: 102, baseType: !551, size: 64, offset: 2624)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !448, file: !447, line: 103, baseType: !571, size: 64, offset: 2688)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !563)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !448, file: !447, line: 103, baseType: !574, size: 64, offset: 2752)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !448, file: !447, line: 104, baseType: !504, size: 64, offset: 2816)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !448, file: !447, line: 105, baseType: !410, size: 32, offset: 2880)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !448, file: !447, line: 106, baseType: !578, size: 128, offset: 2944)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 128, elements: !585)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !447, line: 64, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 61, size: 128, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !581, file: !447, line: 62, baseType: !497, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !581, file: !447, line: 63, baseType: !545, size: 64, offset: 64)
!585 = !{!586}
!586 = !DISubrange(count: 2)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !448, file: !447, line: 107, baseType: !588, size: 64, offset: 3072)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 64, elements: !585)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !448, file: !447, line: 108, baseType: !545, size: 64, offset: 3136)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !448, file: !447, line: 109, baseType: !591, size: 64, offset: 3200)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!461, !545}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !448, file: !447, line: 111, baseType: !410, size: 32, offset: 3264)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !448, file: !447, line: 112, baseType: !596, size: 320, offset: 3328)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 320, elements: !641)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!461, !600, !462, !545}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !603)
!603 = !{!604, !605, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !602, file: !10, line: 100, baseType: !410, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !10, line: 101, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !617, !618, !619, !623, !624, !626, !627, !628}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !608, file: !10, line: 84, baseType: !535, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !608, file: !10, line: 85, baseType: !535, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !608, file: !10, line: 86, baseType: !545, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !608, file: !10, line: 87, baseType: !527, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !608, file: !10, line: 88, baseType: !615, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !608, file: !10, line: 89, baseType: !488, size: 8, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !608, file: !10, line: 90, baseType: !535, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !608, file: !10, line: 91, baseType: !620, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !621, line: 46, baseType: !622)
!621 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!622 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !608, file: !10, line: 92, baseType: !415, size: 32, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !10, line: 93, baseType: !625, size: 32, offset: 544)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !10, line: 94, baseType: !606, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !608, file: !10, line: 95, baseType: !535, size: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !608, file: !10, line: 96, baseType: !545, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !602, file: !10, line: 102, baseType: !535, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !602, file: !10, line: 102, baseType: !535, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !602, file: !10, line: 103, baseType: !535, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !602, file: !10, line: 104, baseType: !465, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !602, file: !10, line: 105, baseType: !415, size: 32, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !602, file: !10, line: 105, baseType: !415, size: 32, offset: 416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !602, file: !10, line: 105, baseType: !415, size: 32, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !602, file: !10, line: 106, baseType: !462, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !602, file: !10, line: 107, baseType: !638, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!641 = !{!642}
!642 = !DISubrange(count: 5)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !448, file: !447, line: 113, baseType: !644, size: 320, offset: 3648)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 320, elements: !641)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!461, !462, !545}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !448, file: !447, line: 114, baseType: !649, size: 320, offset: 3968)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 320, elements: !641)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !448, file: !447, line: 115, baseType: !415, size: 32, offset: 4288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !448, file: !447, line: 120, baseType: !638, size: 64, offset: 4352)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !448, file: !447, line: 121, baseType: !415, size: 32, offset: 4416)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !442, file: !443, line: 437, baseType: !654, size: 9472, offset: 4480)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 9472, elements: !505)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !443, line: 32, size: 9472, elements: !656)
!656 = !{!657, !666, !670, !671, !675, !679, !680, !681, !682, !683, !684, !685, !709, !713, !718, !724, !743, !748, !752, !753, !758, !763, !764, !769, !773, !777, !781, !785, !789, !790, !791, !792, !793, !797, !798, !803, !804, !805, !806, !807, !812, !819, !824, !828, !832, !836, !840, !841, !845, !846, !853, !858, !859, !860, !861, !923, !931, !932, !936, !937, !941, !942, !946, !951, !952, !956, !960, !967, !968, !969, !970, !971, !972, !977, !978, !982, !986, !990, !991, !992, !996, !1006, !1007, !1011, !1012, !1016, !1017, !1021, !1022, !1027, !1028, !1032, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1046, !1047, !1048, !1049, !1050, !1051, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1066, !1070, !1071, !1072, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1086, !1087, !1088, !1093, !1097, !1098, !1102, !1103, !1104, !1105, !1131, !1135, !1136, !1137, !1138, !1139, !1143, !1144, !1145, !1146, !1147, !1151, !1155, !1156}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !655, file: !443, line: 34, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!461, !440, !410, !661, !410, !661, !663, !665}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !655, file: !443, line: 35, baseType: !667, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!461, !440, !410, !554, !556, !574}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !655, file: !443, line: 36, baseType: !667, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !655, file: !443, line: 37, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!461, !440, !434, !434}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !655, file: !443, line: 38, baseType: !676, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!461, !440, !434, !434, !434}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !655, file: !443, line: 40, baseType: !672, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !655, file: !443, line: 41, baseType: !676, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !655, file: !443, line: 42, baseType: !672, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !655, file: !443, line: 43, baseType: !676, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !655, file: !443, line: 44, baseType: !672, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !655, file: !443, line: 46, baseType: !676, size: 64, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !655, file: !443, line: 47, baseType: !686, size: 64, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!461, !440, !689, !689, !693}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !690, line: 11, baseType: !691)
!690 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !690, line: 11, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !696, file: !36, line: 1227, baseType: !563, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !696, file: !36, line: 1228, baseType: !563, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !696, file: !36, line: 1229, baseType: !563, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !696, file: !36, line: 1230, baseType: !563, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !696, file: !36, line: 1231, baseType: !563, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !696, file: !36, line: 1232, baseType: !563, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !696, file: !36, line: 1233, baseType: !563, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !696, file: !36, line: 1234, baseType: !563, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !696, file: !36, line: 1236, baseType: !563, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !696, file: !36, line: 1237, baseType: !563, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !696, file: !36, line: 1238, baseType: !563, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !655, file: !443, line: 48, baseType: !710, size: 64, offset: 768)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!461, !440, !689, !693}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !655, file: !443, line: 49, baseType: !714, size: 64, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!461, !440, !434, !563, !717, !563, !410, !410, !434}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !655, file: !443, line: 50, baseType: !719, size: 64, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!461, !440, !722, !723}
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !655, file: !443, line: 52, baseType: !725, size: 64, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!461, !440, !728, !729}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !731, file: !36, line: 593, baseType: !510, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !731, file: !36, line: 594, baseType: !510, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !731, file: !36, line: 594, baseType: !510, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !731, file: !36, line: 594, baseType: !510, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !731, file: !36, line: 595, baseType: !510, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !731, file: !36, line: 596, baseType: !510, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !731, file: !36, line: 597, baseType: !510, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !731, file: !36, line: 598, baseType: !510, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !731, file: !36, line: 598, baseType: !510, size: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !731, file: !36, line: 599, baseType: !510, size: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !655, file: !443, line: 53, baseType: !744, size: 64, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!461, !440, !440, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !655, file: !443, line: 54, baseType: !749, size: 64, offset: 1088)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!461, !440, !434}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !655, file: !443, line: 55, baseType: !672, size: 64, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !655, file: !443, line: 56, baseType: !754, size: 64, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!461, !440, !757, !562}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !655, file: !443, line: 58, baseType: !759, size: 64, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!461, !440, !762}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !655, file: !443, line: 59, baseType: !759, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !655, file: !443, line: 60, baseType: !765, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!461, !440, !768, !415}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !655, file: !443, line: 61, baseType: !770, size: 64, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!461, !440}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !655, file: !443, line: 63, baseType: !774, size: 64, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!461, !440, !410, !661, !572, !434, !434}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !655, file: !443, line: 64, baseType: !778, size: 64, offset: 1600)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!461, !440, !440, !689, !689, !693}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !655, file: !443, line: 65, baseType: !782, size: 64, offset: 1664)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!461, !440, !440, !693}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !655, file: !443, line: 66, baseType: !786, size: 64, offset: 1728)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!461, !440, !440, !689, !693}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !655, file: !443, line: 67, baseType: !782, size: 64, offset: 1792)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !655, file: !443, line: 69, baseType: !770, size: 64, offset: 1856)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !655, file: !443, line: 70, baseType: !778, size: 64, offset: 1920)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !655, file: !443, line: 71, baseType: !786, size: 64, offset: 1984)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !655, file: !443, line: 72, baseType: !794, size: 64, offset: 2048)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!461, !440, !723}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !655, file: !443, line: 73, baseType: !770, size: 64, offset: 2112)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !655, file: !443, line: 75, baseType: !799, size: 64, offset: 2176)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!461, !440, !802, !723}
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !655, file: !443, line: 76, baseType: !672, size: 64, offset: 2240)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !655, file: !443, line: 77, baseType: !672, size: 64, offset: 2304)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !655, file: !443, line: 78, baseType: !686, size: 64, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !655, file: !443, line: 79, baseType: !710, size: 64, offset: 2432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !655, file: !443, line: 81, baseType: !808, size: 64, offset: 2496)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!461, !440, !572, !440, !811}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !655, file: !443, line: 82, baseType: !813, size: 64, offset: 2560)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!461, !440, !410, !816, !816, !722, !818}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !655, file: !443, line: 83, baseType: !820, size: 64, offset: 2624)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!461, !440, !410, !823, !410}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !655, file: !443, line: 84, baseType: !825, size: 64, offset: 2688)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!461, !440, !410, !661, !410, !661, !571}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !655, file: !443, line: 85, baseType: !829, size: 64, offset: 2752)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!461, !440, !440, !811}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !655, file: !443, line: 87, baseType: !833, size: 64, offset: 2816)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!461, !440, !434, !554}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !655, file: !443, line: 88, baseType: !837, size: 64, offset: 2880)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!461, !440, !572}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !655, file: !443, line: 89, baseType: !837, size: 64, offset: 2944)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !655, file: !443, line: 90, baseType: !842, size: 64, offset: 3008)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!461, !440, !434, !665}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !655, file: !443, line: 91, baseType: !774, size: 64, offset: 3072)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !655, file: !443, line: 93, baseType: !847, size: 64, offset: 3136)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!461, !440, !850}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !655, file: !443, line: 94, baseType: !854, size: 64, offset: 3200)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!461, !440, !410, !415, !415, !554, !857, !857, !747}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !655, file: !443, line: 95, baseType: !854, size: 64, offset: 3264)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !655, file: !443, line: 96, baseType: !854, size: 64, offset: 3328)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !655, file: !443, line: 97, baseType: !854, size: 64, offset: 3392)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !655, file: !443, line: 99, baseType: !862, size: 64, offset: 3456)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!461, !440, !865, !868}
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !690, line: 51, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !690, line: 51, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !443, line: 609, size: 6208, elements: !871)
!871 = !{!872, !873, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !892, !899, !900, !901, !902, !903, !904, !905, !906, !910, !911, !912, !913, !914, !916, !917, !918, !919, !920, !921, !922}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !870, file: !443, line: 610, baseType: !446, size: 4480)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !870, file: !443, line: 610, baseType: !874, size: 32, offset: 4480)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !505)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !870, file: !443, line: 611, baseType: !410, size: 32, offset: 4512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !870, file: !443, line: 611, baseType: !410, size: 32, offset: 4544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !870, file: !443, line: 611, baseType: !410, size: 32, offset: 4576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !870, file: !443, line: 612, baseType: !410, size: 32, offset: 4608)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !870, file: !443, line: 613, baseType: !410, size: 32, offset: 4640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !870, file: !443, line: 614, baseType: !554, size: 64, offset: 4672)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !870, file: !443, line: 615, baseType: !556, size: 64, offset: 4736)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !870, file: !443, line: 616, baseType: !823, size: 64, offset: 4800)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !870, file: !443, line: 617, baseType: !554, size: 64, offset: 4864)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !870, file: !443, line: 618, baseType: !885, size: 64, offset: 4928)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !443, line: 602, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 598, size: 128, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !887, file: !443, line: 599, baseType: !410, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !887, file: !443, line: 600, baseType: !410, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !887, file: !443, line: 601, baseType: !571, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !870, file: !443, line: 619, baseType: !893, size: 64, offset: 4992)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !443, line: 607, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 604, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !895, file: !443, line: 605, baseType: !410, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !895, file: !443, line: 606, baseType: !571, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !870, file: !443, line: 620, baseType: !571, size: 64, offset: 5056)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !870, file: !443, line: 621, baseType: !563, size: 64, offset: 5120)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !870, file: !443, line: 622, baseType: !563, size: 64, offset: 5184)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !870, file: !443, line: 623, baseType: !434, size: 64, offset: 5248)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !870, file: !443, line: 623, baseType: !434, size: 64, offset: 5312)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !870, file: !443, line: 623, baseType: !434, size: 64, offset: 5376)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !870, file: !443, line: 624, baseType: !415, size: 32, offset: 5440)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !870, file: !443, line: 625, baseType: !907, size: 64, offset: 5504)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!461}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !870, file: !443, line: 626, baseType: !545, size: 64, offset: 5568)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !870, file: !443, line: 627, baseType: !434, size: 64, offset: 5632)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !870, file: !443, line: 628, baseType: !410, size: 32, offset: 5696)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !870, file: !443, line: 629, baseType: !486, size: 64, offset: 5760)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !870, file: !443, line: 630, baseType: !915, size: 32, offset: 5824)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !870, file: !443, line: 631, baseType: !410, size: 32, offset: 5856)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !870, file: !443, line: 631, baseType: !410, size: 32, offset: 5888)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !870, file: !443, line: 632, baseType: !415, size: 32, offset: 5920)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !870, file: !443, line: 633, baseType: !415, size: 32, offset: 5952)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !870, file: !443, line: 634, baseType: !497, size: 64, offset: 6016)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !870, file: !443, line: 634, baseType: !545, size: 64, offset: 6080)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !870, file: !443, line: 635, baseType: !516, size: 64, offset: 6144)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !655, file: !443, line: 100, baseType: !924, size: 64, offset: 3520)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!461, !440, !410, !410, !927, !930}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !929)
!929 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !655, file: !443, line: 101, baseType: !770, size: 64, offset: 3584)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !655, file: !443, line: 102, baseType: !933, size: 64, offset: 3648)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!461, !440, !689, !689, !723}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !655, file: !443, line: 103, baseType: !658, size: 64, offset: 3712)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !655, file: !443, line: 105, baseType: !938, size: 64, offset: 3776)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!461, !440, !689, !689, !722, !723}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !655, file: !443, line: 106, baseType: !770, size: 64, offset: 3840)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !655, file: !443, line: 107, baseType: !943, size: 64, offset: 3904)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!461, !440, !473}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !655, file: !443, line: 108, baseType: !947, size: 64, offset: 3968)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!461, !440, !950, !722, !723}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !486)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !655, file: !443, line: 109, baseType: !907, size: 64, offset: 4032)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !655, file: !443, line: 111, baseType: !953, size: 64, offset: 4096)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!461, !440, !440, !440, !563, !440}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !655, file: !443, line: 112, baseType: !957, size: 64, offset: 4160)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!461, !440, !440, !440, !440}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !655, file: !443, line: 113, baseType: !961, size: 64, offset: 4224)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!461, !440, !964, !964}
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !690, line: 30, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !690, line: 30, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !655, file: !443, line: 114, baseType: !658, size: 64, offset: 4288)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !655, file: !443, line: 115, baseType: !774, size: 64, offset: 4352)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !655, file: !443, line: 117, baseType: !833, size: 64, offset: 4416)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !655, file: !443, line: 118, baseType: !833, size: 64, offset: 4480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !655, file: !443, line: 119, baseType: !947, size: 64, offset: 4544)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !655, file: !443, line: 120, baseType: !973, size: 64, offset: 4608)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!461, !440, !976, !747}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !655, file: !443, line: 121, baseType: !907, size: 64, offset: 4672)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !655, file: !443, line: 123, baseType: !979, size: 64, offset: 4736)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!461, !440, !410, !545}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !655, file: !443, line: 124, baseType: !983, size: 64, offset: 4800)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!461, !440, !868, !434, !545}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !655, file: !443, line: 125, baseType: !987, size: 64, offset: 4864)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!461, !600, !440}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !655, file: !443, line: 126, baseType: !672, size: 64, offset: 4928)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !655, file: !443, line: 127, baseType: !672, size: 64, offset: 4992)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !655, file: !443, line: 129, baseType: !993, size: 64, offset: 5056)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!461, !440, !823}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !655, file: !443, line: 130, baseType: !997, size: 64, offset: 5120)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!461, !440, !1000, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1002, file: !60, line: 653, baseType: !410, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1002, file: !60, line: 653, baseType: !434, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !655, file: !443, line: 131, baseType: !997, size: 64, offset: 5184)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !655, file: !443, line: 132, baseType: !1008, size: 64, offset: 5248)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!461, !440, !554, !554, !554}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !655, file: !443, line: 133, baseType: !943, size: 64, offset: 5312)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !655, file: !443, line: 135, baseType: !1013, size: 64, offset: 5376)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!461, !440, !563, !747}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !655, file: !443, line: 136, baseType: !1013, size: 64, offset: 5440)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !655, file: !443, line: 137, baseType: !1018, size: 64, offset: 5504)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!461, !440, !747}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !655, file: !443, line: 138, baseType: !658, size: 64, offset: 5568)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !655, file: !443, line: 139, baseType: !1023, size: 64, offset: 5632)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!461, !440, !1026, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !655, file: !443, line: 141, baseType: !907, size: 64, offset: 5696)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !655, file: !443, line: 142, baseType: !1029, size: 64, offset: 5760)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!461, !440, !440, !563, !440}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !655, file: !443, line: 143, baseType: !1033, size: 64, offset: 5824)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!461, !440, !440, !440}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !655, file: !443, line: 144, baseType: !907, size: 64, offset: 5888)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !655, file: !443, line: 145, baseType: !1029, size: 64, offset: 5952)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !655, file: !443, line: 147, baseType: !1033, size: 64, offset: 6016)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !655, file: !443, line: 148, baseType: !907, size: 64, offset: 6080)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !655, file: !443, line: 149, baseType: !1029, size: 64, offset: 6144)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !655, file: !443, line: 150, baseType: !1033, size: 64, offset: 6208)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !655, file: !443, line: 151, baseType: !1043, size: 64, offset: 6272)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!461, !440, !415}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !655, file: !443, line: 153, baseType: !770, size: 64, offset: 6336)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !655, file: !443, line: 154, baseType: !770, size: 64, offset: 6400)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !655, file: !443, line: 155, baseType: !770, size: 64, offset: 6464)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !655, file: !443, line: 156, baseType: !770, size: 64, offset: 6528)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !655, file: !443, line: 157, baseType: !943, size: 64, offset: 6592)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !655, file: !443, line: 159, baseType: !1052, size: 64, offset: 6656)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!461, !440, !410, !663}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !655, file: !443, line: 160, baseType: !770, size: 64, offset: 6720)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !655, file: !443, line: 161, baseType: !770, size: 64, offset: 6784)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !655, file: !443, line: 162, baseType: !770, size: 64, offset: 6848)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !655, file: !443, line: 163, baseType: !770, size: 64, offset: 6912)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !655, file: !443, line: 165, baseType: !1033, size: 64, offset: 6976)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !655, file: !443, line: 166, baseType: !1033, size: 64, offset: 7040)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !655, file: !443, line: 167, baseType: !833, size: 64, offset: 7104)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !655, file: !443, line: 168, baseType: !1063, size: 64, offset: 7168)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!461, !440, !434, !410}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !655, file: !443, line: 169, baseType: !1067, size: 64, offset: 7232)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!461, !440, !747, !554}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !655, file: !443, line: 171, baseType: !794, size: 64, offset: 7296)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !655, file: !443, line: 172, baseType: !770, size: 64, offset: 7360)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !655, file: !443, line: 173, baseType: !1073, size: 64, offset: 7424)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!461, !440, !554, !857}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !655, file: !443, line: 174, baseType: !933, size: 64, offset: 7488)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !655, file: !443, line: 175, baseType: !933, size: 64, offset: 7552)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !655, file: !443, line: 177, baseType: !672, size: 64, offset: 7616)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !655, file: !443, line: 178, baseType: !719, size: 64, offset: 7680)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !655, file: !443, line: 179, baseType: !672, size: 64, offset: 7744)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !655, file: !443, line: 180, baseType: !676, size: 64, offset: 7808)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !655, file: !443, line: 181, baseType: !1083, size: 64, offset: 7872)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!461, !440, !465, !722, !723}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !655, file: !443, line: 183, baseType: !993, size: 64, offset: 7936)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !655, file: !443, line: 184, baseType: !754, size: 64, offset: 8000)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !655, file: !443, line: 185, baseType: !1089, size: 64, offset: 8064)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!461, !440, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !655, file: !443, line: 186, baseType: !1094, size: 64, offset: 8128)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!461, !440, !410, !661, !571}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !655, file: !443, line: 187, baseType: !813, size: 64, offset: 8192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !655, file: !443, line: 189, baseType: !1099, size: 64, offset: 8256)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!461, !440, !410, !410, !554, !663}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !655, file: !443, line: 190, baseType: !907, size: 64, offset: 8320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !655, file: !443, line: 191, baseType: !1029, size: 64, offset: 8384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !655, file: !443, line: 192, baseType: !1033, size: 64, offset: 8448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !655, file: !443, line: 193, baseType: !1106, size: 64, offset: 8512)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!461, !440, !865, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !443, line: 660, size: 5312, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1111, file: !443, line: 661, baseType: !446, size: 4480)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1111, file: !443, line: 661, baseType: !874, size: 32, offset: 4480)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1111, file: !443, line: 662, baseType: !410, size: 32, offset: 4512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1111, file: !443, line: 662, baseType: !410, size: 32, offset: 4544)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1111, file: !443, line: 662, baseType: !410, size: 32, offset: 4576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1111, file: !443, line: 663, baseType: !410, size: 32, offset: 4608)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1111, file: !443, line: 664, baseType: !410, size: 32, offset: 4640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1111, file: !443, line: 665, baseType: !554, size: 64, offset: 4672)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1111, file: !443, line: 666, baseType: !554, size: 64, offset: 4736)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1111, file: !443, line: 667, baseType: !410, size: 32, offset: 4800)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1111, file: !443, line: 668, baseType: !915, size: 32, offset: 4832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1111, file: !443, line: 670, baseType: !554, size: 64, offset: 4864)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1111, file: !443, line: 670, baseType: !554, size: 64, offset: 4928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1111, file: !443, line: 671, baseType: !554, size: 64, offset: 4992)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1111, file: !443, line: 672, baseType: !554, size: 64, offset: 5056)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1111, file: !443, line: 673, baseType: !554, size: 64, offset: 5120)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1111, file: !443, line: 674, baseType: !410, size: 32, offset: 5184)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1111, file: !443, line: 675, baseType: !554, size: 64, offset: 5248)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !655, file: !443, line: 195, baseType: !1132, size: 64, offset: 8576)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!461, !1109, !440, !440}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !655, file: !443, line: 196, baseType: !1132, size: 64, offset: 8640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !655, file: !443, line: 197, baseType: !907, size: 64, offset: 8704)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !655, file: !443, line: 198, baseType: !1029, size: 64, offset: 8768)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !655, file: !443, line: 199, baseType: !1033, size: 64, offset: 8832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !655, file: !443, line: 201, baseType: !1140, size: 64, offset: 8896)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!461, !440, !410, !410}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !655, file: !443, line: 202, baseType: !808, size: 64, offset: 8960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !655, file: !443, line: 203, baseType: !676, size: 64, offset: 9024)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !655, file: !443, line: 204, baseType: !862, size: 64, offset: 9088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !655, file: !443, line: 205, baseType: !993, size: 64, offset: 9152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !655, file: !443, line: 206, baseType: !1148, size: 64, offset: 9216)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!461, !465, !440, !410, !722, !723}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !655, file: !443, line: 208, baseType: !1152, size: 64, offset: 9280)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!461, !410, !818}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !655, file: !443, line: 209, baseType: !1033, size: 64, offset: 9344)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !655, file: !443, line: 210, baseType: !825, size: 64, offset: 9408)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !442, file: !443, line: 438, baseType: !1158, size: 64, offset: 13952)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !690, line: 60, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1160, file: !114, line: 241, baseType: !465, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1160, file: !114, line: 242, baseType: !525, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1160, file: !114, line: 243, baseType: !410, size: 32, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1160, file: !114, line: 243, baseType: !410, size: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1160, file: !114, line: 244, baseType: !410, size: 32, offset: 160)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1160, file: !114, line: 244, baseType: !410, size: 32, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1160, file: !114, line: 245, baseType: !554, size: 64, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1160, file: !114, line: 246, baseType: !415, size: 32, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1160, file: !114, line: 247, baseType: !410, size: 32, offset: 352)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1160, file: !114, line: 251, baseType: !410, size: 32, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1160, file: !114, line: 252, baseType: !964, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1160, file: !114, line: 253, baseType: !415, size: 32, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1160, file: !114, line: 254, baseType: !410, size: 32, offset: 544)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1160, file: !114, line: 254, baseType: !410, size: 32, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1160, file: !114, line: 255, baseType: !410, size: 32, offset: 608)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !442, file: !443, line: 438, baseType: !1158, size: 64, offset: 14016)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !443, line: 439, baseType: !545, size: 64, offset: 14080)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !442, file: !443, line: 440, baseType: !1180, size: 32, offset: 14144)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !442, file: !443, line: 441, baseType: !415, size: 32, offset: 14176)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !442, file: !443, line: 442, baseType: !415, size: 32, offset: 14208)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !442, file: !443, line: 443, baseType: !1184, size: 448, offset: 14272)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 448, elements: !1186)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !486)
!1186 = !{!1187}
!1187 = !DISubrange(count: 7)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !442, file: !443, line: 444, baseType: !415, size: 32, offset: 14720)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !442, file: !443, line: 445, baseType: !415, size: 32, offset: 14752)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !442, file: !443, line: 446, baseType: !410, size: 32, offset: 14784)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !442, file: !443, line: 447, baseType: !547, size: 64, offset: 14848)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !442, file: !443, line: 448, baseType: !547, size: 64, offset: 14912)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !442, file: !443, line: 449, baseType: !730, size: 640, offset: 14976)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !442, file: !443, line: 450, baseType: !665, size: 32, offset: 15616)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !442, file: !443, line: 451, baseType: !1196, size: 2880, offset: 15680)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !443, line: 318, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !443, line: 319, size: 2880, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1218, !1219, !1224, !1229, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1244, !1245, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1277, !1278, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1302, !1303, !1307, !1308}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1197, file: !443, line: 320, baseType: !410, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1197, file: !443, line: 321, baseType: !410, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1197, file: !443, line: 322, baseType: !410, size: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1197, file: !443, line: 323, baseType: !410, size: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1197, file: !443, line: 324, baseType: !410, size: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1197, file: !443, line: 325, baseType: !410, size: 32, offset: 160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1197, file: !443, line: 326, baseType: !1206, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !443, line: 293, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !443, line: 295, size: 448, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1208, file: !443, line: 296, baseType: !1206, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1208, file: !443, line: 297, baseType: !571, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1208, file: !443, line: 297, baseType: !571, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1208, file: !443, line: 298, baseType: !554, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1208, file: !443, line: 298, baseType: !554, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1208, file: !443, line: 299, baseType: !410, size: 32, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1208, file: !443, line: 300, baseType: !410, size: 32, offset: 352)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1208, file: !443, line: 301, baseType: !410, size: 32, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1197, file: !443, line: 326, baseType: !1206, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1197, file: !443, line: 328, baseType: !1220, size: 64, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!461, !440, !1223, !554}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1197, file: !443, line: 329, baseType: !1225, size: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!461, !1223, !1228, !556, !556, !574, !554}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1197, file: !443, line: 330, baseType: !1230, size: 64, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!461, !1223}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1197, file: !443, line: 331, baseType: !1230, size: 64, offset: 512)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1197, file: !443, line: 334, baseType: !465, size: 64, offset: 576)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !443, line: 335, baseType: !525, size: 32, offset: 640)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1197, file: !443, line: 335, baseType: !525, size: 32, offset: 672)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1197, file: !443, line: 336, baseType: !525, size: 32, offset: 704)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1197, file: !443, line: 336, baseType: !525, size: 32, offset: 736)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1197, file: !443, line: 337, baseType: !1240, size: 64, offset: 768)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !466, line: 339, baseType: !1242)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !466, line: 339, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1197, file: !443, line: 338, baseType: !1240, size: 64, offset: 832)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1197, file: !443, line: 339, baseType: !1246, size: 64, offset: 896)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !466, line: 341, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !466, line: 351, size: 192, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1248, file: !466, line: 354, baseType: !72, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1248, file: !466, line: 355, baseType: !72, size: 32, offset: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1248, file: !466, line: 356, baseType: !72, size: 32, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1248, file: !466, line: 361, baseType: !72, size: 32, offset: 96)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1248, file: !466, line: 362, baseType: !620, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1197, file: !443, line: 340, baseType: !410, size: 32, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1197, file: !443, line: 340, baseType: !410, size: 32, offset: 992)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1197, file: !443, line: 341, baseType: !571, size: 64, offset: 1024)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1197, file: !443, line: 342, baseType: !554, size: 64, offset: 1088)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1197, file: !443, line: 343, baseType: !574, size: 64, offset: 1152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1197, file: !443, line: 344, baseType: !556, size: 64, offset: 1216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1197, file: !443, line: 345, baseType: !410, size: 32, offset: 1280)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1197, file: !443, line: 346, baseType: !1228, size: 64, offset: 1344)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1197, file: !443, line: 347, baseType: !415, size: 32, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1197, file: !443, line: 348, baseType: !410, size: 32, offset: 1440)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1197, file: !443, line: 351, baseType: !415, size: 32, offset: 1472)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1197, file: !443, line: 352, baseType: !415, size: 32, offset: 1504)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1197, file: !443, line: 353, baseType: !525, size: 32, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1197, file: !443, line: 354, baseType: !525, size: 32, offset: 1568)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1197, file: !443, line: 355, baseType: !1228, size: 64, offset: 1600)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1197, file: !443, line: 356, baseType: !1228, size: 64, offset: 1664)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1197, file: !443, line: 357, baseType: !1272, size: 64, offset: 1728)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !443, line: 310, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 308, size: 32, elements: !1275)
!1275 = !{!1276}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1274, file: !443, line: 309, baseType: !410, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1197, file: !443, line: 357, baseType: !1272, size: 64, offset: 1792)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1197, file: !443, line: 358, baseType: !1279, size: 64, offset: 1856)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !443, line: 316, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 312, size: 128, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1281, file: !443, line: 313, baseType: !545, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1281, file: !443, line: 314, baseType: !410, size: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1281, file: !443, line: 315, baseType: !488, size: 8, offset: 96)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1197, file: !443, line: 359, baseType: !1279, size: 64, offset: 1920)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1197, file: !443, line: 360, baseType: !1279, size: 64, offset: 1984)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1197, file: !443, line: 361, baseType: !410, size: 32, offset: 2048)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1197, file: !443, line: 362, baseType: !525, size: 32, offset: 2080)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1197, file: !443, line: 363, baseType: !410, size: 32, offset: 2112)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1197, file: !443, line: 364, baseType: !1228, size: 64, offset: 2176)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1197, file: !443, line: 365, baseType: !1246, size: 64, offset: 2240)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1197, file: !443, line: 366, baseType: !525, size: 32, offset: 2304)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1197, file: !443, line: 367, baseType: !525, size: 32, offset: 2336)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1197, file: !443, line: 368, baseType: !1240, size: 64, offset: 2368)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1197, file: !443, line: 369, baseType: !1240, size: 64, offset: 2432)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1197, file: !443, line: 370, baseType: !1298, size: 64, offset: 2496)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
