; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133}
!127 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!128 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!129 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!130 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!131 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!132 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!133 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !135)
!135 = !{!136}
!136 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!139 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 155, baseType: !5, size: 32, elements: !159)
!158 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!165 = !{!166, !367, !217, !296, !214, !238, !187, !657, !660, !286, !26, !663, !175, !664, !666, !669, !670, !534, !276, !671, !5}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_GMRES", file: !168, line: 55, baseType: !169)
!168 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/gmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 53, size: 1600, elements: !170)
!170 = !{!171, !176, !177, !178, !179, !180, !181, !182, !184, !185, !186, !188, !189, !639, !641, !642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !654, !655, !656}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !169, file: !168, line: 54, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !175)
!175 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !169, file: !168, line: 54, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !169, file: !168, line: 54, baseType: !174, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !169, file: !168, line: 54, baseType: !190, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !194, !187}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !197)
!197 = !{!198, !401, !454, !459, !460, !461, !462, !492, !493, !494, !495, !496, !498, !503, !504, !505, !506, !507, !508, !509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !532, !538, !539, !540, !541, !546, !547, !548, !549, !554, !555, !556, !557, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !609, !610, !611, !612, !613, !620, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !636, !637, !638}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !196, file: !102, line: 76, baseType: !199, size: 4480)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !200, line: 122, baseType: !201)
!200 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !200, line: 73, size: 4480, elements: !202)
!202 = !{!203, !205, !259, !260, !261, !263, !264, !265, !266, !274, !275, !277, !281, !285, !287, !288, !289, !290, !291, !292, !293, !294, !295, !297, !299, !300, !301, !303, !304, !306, !308, !309, !310, !311, !312, !313, !315, !316, !317, !318, !319, !320, !322, !323, !324, !334, !336, !337, !341, !342, !391, !396, !398, !399, !400}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !201, file: !200, line: 74, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !201, file: !200, line: 75, baseType: !206, size: 448, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 448, elements: !257)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !200, line: 53, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 45, size: 448, elements: !209)
!209 = !{!210, !221, !229, !234, !241, !245, !252}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !208, file: !200, line: 46, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!193, !214, !216}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !218, line: 330, baseType: !219)
!218 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !218, line: 330, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !208, file: !200, line: 47, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!193, !214, !225}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !226, line: 16, baseType: !227)
!226 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !226, line: 16, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !208, file: !200, line: 48, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!193, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !208, file: !200, line: 49, baseType: !235, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!193, !214, !238, !214}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !208, file: !200, line: 50, baseType: !242, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!193, !214, !238, !233}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !208, file: !200, line: 51, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!193, !214, !238, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !208, file: !200, line: 52, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!193, !214, !238, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!257 = !{!258}
!258 = !DISubrange(count: 1)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !201, file: !200, line: 76, baseType: !217, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !200, line: 77, baseType: !187, size: 32, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !201, file: !200, line: 78, baseType: !262, size: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !175)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !201, file: !200, line: 78, baseType: !262, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !201, file: !200, line: 78, baseType: !262, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !201, file: !200, line: 78, baseType: !262, size: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !200, line: 79, baseType: !267, size: 64, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !270, line: 27, baseType: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !272, line: 43, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!273 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !201, file: !200, line: 80, baseType: !187, size: 32, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !201, file: !200, line: 81, baseType: !276, size: 32, offset: 992)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !201, file: !200, line: 82, baseType: !278, size: 64, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !201, file: !200, line: 83, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !201, file: !200, line: 84, baseType: !286, size: 64, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !201, file: !200, line: 85, baseType: !286, size: 64, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !201, file: !200, line: 86, baseType: !286, size: 64, offset: 1280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !201, file: !200, line: 87, baseType: !286, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !201, file: !200, line: 88, baseType: !214, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !201, file: !200, line: 89, baseType: !267, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !200, line: 90, baseType: !286, size: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !201, file: !200, line: 91, baseType: !286, size: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !201, file: !200, line: 92, baseType: !187, size: 32, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !201, file: !200, line: 93, baseType: !296, size: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !201, file: !200, line: 94, baseType: !298, size: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !268)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !201, file: !200, line: 95, baseType: !187, size: 32, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !201, file: !200, line: 95, baseType: !187, size: 32, offset: 1888)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !201, file: !200, line: 96, baseType: !302, size: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !201, file: !200, line: 96, baseType: !302, size: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !201, file: !200, line: 97, baseType: !305, size: 64, offset: 2048)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !201, file: !200, line: 97, baseType: !307, size: 64, offset: 2112)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !201, file: !200, line: 98, baseType: !187, size: 32, offset: 2176)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !201, file: !200, line: 98, baseType: !187, size: 32, offset: 2208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !201, file: !200, line: 99, baseType: !302, size: 64, offset: 2240)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !201, file: !200, line: 99, baseType: !302, size: 64, offset: 2304)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !201, file: !200, line: 100, baseType: !183, size: 64, offset: 2368)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !201, file: !200, line: 100, baseType: !314, size: 64, offset: 2432)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !201, file: !200, line: 101, baseType: !187, size: 32, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !201, file: !200, line: 101, baseType: !187, size: 32, offset: 2528)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !201, file: !200, line: 102, baseType: !302, size: 64, offset: 2560)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !201, file: !200, line: 102, baseType: !302, size: 64, offset: 2624)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !201, file: !200, line: 103, baseType: !172, size: 64, offset: 2688)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !201, file: !200, line: 103, baseType: !321, size: 64, offset: 2752)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !201, file: !200, line: 104, baseType: !256, size: 64, offset: 2816)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !201, file: !200, line: 105, baseType: !187, size: 32, offset: 2880)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !201, file: !200, line: 106, baseType: !325, size: 128, offset: 2944)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 128, elements: !332)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !200, line: 64, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 61, size: 128, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !328, file: !200, line: 62, baseType: !249, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !328, file: !200, line: 63, baseType: !296, size: 64, offset: 64)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !201, file: !200, line: 107, baseType: !335, size: 64, offset: 3072)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 64, elements: !332)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !201, file: !200, line: 108, baseType: !296, size: 64, offset: 3136)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !201, file: !200, line: 109, baseType: !338, size: 64, offset: 3200)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!193, !296}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !201, file: !200, line: 111, baseType: !187, size: 32, offset: 3264)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !201, file: !200, line: 112, baseType: !343, size: 320, offset: 3328)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 320, elements: !389)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!193, !347, !214, !296}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !350)
!350 = !{!351, !352, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !349, file: !10, line: 100, baseType: !187, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !10, line: 101, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !364, !365, !366, !370, !372, !374, !375, !376}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !355, file: !10, line: 84, baseType: !286, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !355, file: !10, line: 85, baseType: !286, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !10, line: 86, baseType: !296, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !355, file: !10, line: 87, baseType: !278, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !355, file: !10, line: 88, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !355, file: !10, line: 89, baseType: !240, size: 8, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !355, file: !10, line: 90, baseType: !286, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !355, file: !10, line: 91, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !368, line: 46, baseType: !369)
!368 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!369 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !355, file: !10, line: 92, baseType: !371, size: 32, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !10, line: 93, baseType: !373, size: 32, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !10, line: 94, baseType: !353, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !355, file: !10, line: 95, baseType: !286, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !355, file: !10, line: 96, baseType: !296, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !349, file: !10, line: 102, baseType: !286, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !349, file: !10, line: 102, baseType: !286, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !349, file: !10, line: 103, baseType: !286, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !349, file: !10, line: 104, baseType: !217, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !349, file: !10, line: 105, baseType: !371, size: 32, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !349, file: !10, line: 105, baseType: !371, size: 32, offset: 416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !349, file: !10, line: 105, baseType: !371, size: 32, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !349, file: !10, line: 106, baseType: !214, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !349, file: !10, line: 107, baseType: !386, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!389 = !{!390}
!390 = !DISubrange(count: 5)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !201, file: !200, line: 113, baseType: !392, size: 320, offset: 3648)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 320, elements: !389)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!193, !214, !296}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !201, file: !200, line: 114, baseType: !397, size: 320, offset: 3968)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !389)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !201, file: !200, line: 115, baseType: !371, size: 32, offset: 4288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !200, line: 120, baseType: !386, size: 64, offset: 4352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !201, file: !200, line: 121, baseType: !371, size: 32, offset: 4416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !196, file: !102, line: 76, baseType: !402, size: 896, offset: 4480)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 896, elements: !257)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !404)
!404 = !{!405, !413, !417, !421, !429, !430, !434, !435, !439, !443, !447, !448, !452, !453}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !403, file: !102, line: 19, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!193, !194, !409, !412}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !158, line: 21, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !158, line: 21, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !403, file: !102, line: 22, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!193, !194, !409, !409, !412}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !403, file: !102, line: 25, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!193, !194}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !403, file: !102, line: 26, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!193, !194, !425, !425}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !426, line: 16, baseType: !427)
!426 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !426, line: 16, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !403, file: !102, line: 27, baseType: !418, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !403, file: !102, line: 28, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!193, !347, !194}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !403, file: !102, line: 29, baseType: !418, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !403, file: !102, line: 30, baseType: !436, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!193, !194, !183, !183}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !403, file: !102, line: 31, baseType: !440, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!193, !194, !187, !183, !183, !305}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !403, file: !102, line: 32, baseType: !444, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!193, !194, !371, !371, !305, !412, !183, !183}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !403, file: !102, line: 33, baseType: !418, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !403, file: !102, line: 34, baseType: !449, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!193, !194, !225}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !403, file: !102, line: 35, baseType: !418, size: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !403, file: !102, line: 36, baseType: !449, size: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !196, file: !102, line: 77, baseType: !455, size: 64, offset: 5376)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !456, line: 14, baseType: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !456, line: 14, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !196, file: !102, line: 78, baseType: !371, size: 32, offset: 5440)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !196, file: !102, line: 79, baseType: !371, size: 32, offset: 5472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !196, file: !102, line: 81, baseType: !187, size: 32, offset: 5504)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !196, file: !102, line: 82, baseType: !463, size: 64, offset: 5568)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !466)
!466 = !{!467, !468, !488, !489, !490, !491}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !465, file: !102, line: 55, baseType: !199, size: 4480)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !465, file: !102, line: 55, baseType: !469, size: 448, offset: 4480)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 448, elements: !257)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !471)
!471 = !{!472, !476, !477, !481, !482, !483, !487}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !470, file: !102, line: 42, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!193, !463, !409, !409}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !470, file: !102, line: 43, baseType: !473, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !470, file: !102, line: 44, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!193, !463}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !470, file: !102, line: 45, baseType: !478, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !470, file: !102, line: 46, baseType: !478, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !470, file: !102, line: 47, baseType: !484, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!193, !463, !225}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !470, file: !102, line: 48, baseType: !478, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !465, file: !102, line: 56, baseType: !194, size: 64, offset: 4928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !465, file: !102, line: 57, baseType: !425, size: 64, offset: 4992)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !465, file: !102, line: 58, baseType: !298, size: 64, offset: 5056)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !102, line: 59, baseType: !296, size: 64, offset: 5120)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !196, file: !102, line: 83, baseType: !371, size: 32, offset: 5632)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !196, file: !102, line: 84, baseType: !371, size: 32, offset: 5664)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !196, file: !102, line: 85, baseType: !371, size: 32, offset: 5696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !196, file: !102, line: 86, baseType: !371, size: 32, offset: 5728)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !196, file: !102, line: 87, baseType: !497, size: 32, offset: 5760)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !196, file: !102, line: 88, baseType: !499, size: 384, offset: 5792)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 384, elements: !500)
!500 = !{!501, !502}
!501 = !DISubrange(count: 4)
!502 = !DISubrange(count: 3)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !196, file: !102, line: 89, baseType: !174, size: 64, offset: 6208)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !196, file: !102, line: 90, baseType: !174, size: 64, offset: 6272)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !196, file: !102, line: 91, baseType: !174, size: 64, offset: 6336)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !196, file: !102, line: 92, baseType: !174, size: 64, offset: 6400)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !196, file: !102, line: 93, baseType: !174, size: 64, offset: 6464)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !196, file: !102, line: 94, baseType: !174, size: 64, offset: 6528)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !196, file: !102, line: 95, baseType: !510, size: 32, offset: 6592)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !196, file: !102, line: 96, baseType: !371, size: 32, offset: 6624)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !196, file: !102, line: 98, baseType: !409, size: 64, offset: 6656)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !196, file: !102, line: 98, baseType: !409, size: 64, offset: 6720)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !196, file: !102, line: 102, baseType: !183, size: 64, offset: 6784)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !196, file: !102, line: 103, baseType: !183, size: 64, offset: 6848)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !196, file: !102, line: 104, baseType: !187, size: 32, offset: 6912)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !196, file: !102, line: 105, baseType: !187, size: 32, offset: 6944)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !196, file: !102, line: 106, baseType: !371, size: 32, offset: 6976)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !196, file: !102, line: 107, baseType: !183, size: 64, offset: 7040)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !196, file: !102, line: 108, baseType: !183, size: 64, offset: 7104)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !196, file: !102, line: 109, baseType: !187, size: 32, offset: 7168)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !196, file: !102, line: 110, baseType: !187, size: 32, offset: 7200)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !196, file: !102, line: 111, baseType: !371, size: 32, offset: 7232)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !196, file: !102, line: 113, baseType: !187, size: 32, offset: 7264)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !196, file: !102, line: 114, baseType: !371, size: 32, offset: 7296)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !196, file: !102, line: 117, baseType: !187, size: 32, offset: 7328)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !196, file: !102, line: 120, baseType: !528, size: 320, offset: 7360)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !389)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!193, !194, !187, !174, !296}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !196, file: !102, line: 121, baseType: !533, size: 320, offset: 7680)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !389)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!193, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !196, file: !102, line: 122, baseType: !397, size: 320, offset: 8000)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !196, file: !102, line: 123, baseType: !187, size: 32, offset: 8320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !196, file: !102, line: 124, baseType: !371, size: 32, offset: 8352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !196, file: !102, line: 126, baseType: !542, size: 320, offset: 8384)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 320, elements: !389)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!193, !194, !296}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !196, file: !102, line: 127, baseType: !533, size: 320, offset: 8704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !196, file: !102, line: 128, baseType: !397, size: 320, offset: 9024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !196, file: !102, line: 129, baseType: !187, size: 32, offset: 9344)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !196, file: !102, line: 131, baseType: !550, size: 64, offset: 9408)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!193, !194, !187, !174, !553, !296}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !196, file: !102, line: 132, baseType: !338, size: 64, offset: 9472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !196, file: !102, line: 133, baseType: !296, size: 64, offset: 9536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !196, file: !102, line: 135, baseType: !296, size: 64, offset: 9600)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !196, file: !102, line: 137, baseType: !558, size: 64, offset: 9664)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !102, line: 139, baseType: !296, size: 64, offset: 9728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9792)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9824)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9888)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9920)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9952)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 9984)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10016)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10048)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10080)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10144)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !196, file: !102, line: 142, baseType: !371, size: 32, offset: 10208)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10240)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10368)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10432)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10496)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10560)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10624)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10688)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10752)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10816)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10880)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 10944)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 11008)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !196, file: !102, line: 143, baseType: !225, size: 64, offset: 11072)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11136)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11168)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11200)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11232)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11264)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11296)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11328)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11360)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11392)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11424)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11456)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11488)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11520)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !196, file: !102, line: 144, baseType: !591, size: 32, offset: 11552)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !196, file: !102, line: 147, baseType: !187, size: 32, offset: 11584)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !196, file: !102, line: 148, baseType: !412, size: 64, offset: 11648)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !196, file: !102, line: 150, baseType: !608, size: 32, offset: 11712)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !196, file: !102, line: 151, baseType: !371, size: 32, offset: 11744)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !196, file: !102, line: 153, baseType: !187, size: 32, offset: 11776)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !196, file: !102, line: 154, baseType: !187, size: 32, offset: 11808)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !196, file: !102, line: 156, baseType: !371, size: 32, offset: 11840)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !196, file: !102, line: 161, baseType: !614, size: 192, offset: 11904)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !102, line: 157, size: 192, elements: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !614, file: !102, line: 158, baseType: !425, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !614, file: !102, line: 158, baseType: !425, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !614, file: !102, line: 159, baseType: !371, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !614, file: !102, line: 160, baseType: !371, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !196, file: !102, line: 163, baseType: !621, size: 32, offset: 12096)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !196, file: !102, line: 165, baseType: !497, size: 32, offset: 12128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !196, file: !102, line: 166, baseType: !621, size: 32, offset: 12160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !196, file: !102, line: 171, baseType: !371, size: 32, offset: 12192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !196, file: !102, line: 172, baseType: !371, size: 32, offset: 12224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !196, file: !102, line: 173, baseType: !371, size: 32, offset: 12256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !196, file: !102, line: 174, baseType: !409, size: 64, offset: 12288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !196, file: !102, line: 175, baseType: !409, size: 64, offset: 12352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !196, file: !102, line: 177, baseType: !187, size: 32, offset: 12416)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !196, file: !102, line: 178, baseType: !371, size: 32, offset: 12448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !196, file: !102, line: 180, baseType: !225, size: 64, offset: 12480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !196, file: !102, line: 182, baseType: !633, size: 64, offset: 12544)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!193, !194, !409, !409, !296}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !196, file: !102, line: 183, baseType: !633, size: 64, offset: 12608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !196, file: !102, line: 184, baseType: !296, size: 64, offset: 12672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !196, file: !102, line: 184, baseType: !296, size: 64, offset: 12736)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !169, file: !168, line: 54, baseType: !640, size: 32, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !169, file: !168, line: 54, baseType: !412, size: 64, offset: 832)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !169, file: !168, line: 54, baseType: !412, size: 64, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 992)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 1024)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 1056)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !169, file: !168, line: 54, baseType: !648, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !169, file: !168, line: 54, baseType: !305, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 1248)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !169, file: !168, line: 54, baseType: !187, size: 32, offset: 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !169, file: !168, line: 54, baseType: !172, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !169, file: !168, line: 54, baseType: !409, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !169, file: !168, line: 54, baseType: !174, size: 64, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !169, file: !168, line: 54, baseType: !174, size: 64, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !218, line: 331, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !218, line: 331, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !218, line: 338, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !218, line: 338, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !125)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !665, line: 1451, baseType: !249)
!665 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewers", file: !57, line: 407, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscViewers", file: !57, line: 407, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !134)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!672 = !{i32 7, !"Dwarf Version", i32 4}
!673 = !{i32 2, !"Debug Info Version", i32 3}
!674 = !{i32 1, !"wchar_size", i32 4}
!675 = !{i32 7, !"PIC Level", i32 2}
!676 = !{i32 7, !"uwtable", i32 1}
!677 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!678 = distinct !DISubprogram(name: "KSPSetUp_GMRES", scope: !679, file: !679, line: 36, type: !419, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !680)
!679 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmres.c", directory: "/home/users/ndemeye/xSDK")
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !692, !694, !698, !700, !702, !704, !706, !708, !710, !712, !716, !718, !723, !725, !728, !730, !735}
!681 = !DILocalVariable(name: "ksp", arg: 1, scope: !678, file: !679, line: 36, type: !194)
!682 = !DILocalVariable(name: "hh", scope: !678, file: !679, line: 38, type: !187)
!683 = !DILocalVariable(name: "hes", scope: !678, file: !679, line: 38, type: !187)
!684 = !DILocalVariable(name: "rs", scope: !678, file: !679, line: 38, type: !187)
!685 = !DILocalVariable(name: "cc", scope: !678, file: !679, line: 38, type: !187)
!686 = !DILocalVariable(name: "ierr", scope: !678, file: !679, line: 39, type: !193)
!687 = !DILocalVariable(name: "max_k", scope: !678, file: !679, line: 40, type: !187)
!688 = !DILocalVariable(name: "k", scope: !678, file: !679, line: 40, type: !187)
!689 = !DILocalVariable(name: "gmres", scope: !678, file: !679, line: 41, type: !166)
!690 = !DILocalVariable(name: "ierr__", scope: !691, file: !679, line: 50, type: !193)
!691 = distinct !DILexicalBlock(scope: !678, file: !679, line: 50, column: 131)
!692 = !DILocalVariable(name: "ierr__", scope: !693, file: !679, line: 51, type: !193)
!693 = distinct !DILexicalBlock(scope: !678, file: !679, line: 51, column: 92)
!694 = !DILocalVariable(name: "ierr__", scope: !695, file: !679, line: 55, type: !193)
!695 = distinct !DILexicalBlock(scope: !696, file: !679, line: 55, column: 63)
!696 = distinct !DILexicalBlock(scope: !697, file: !679, line: 53, column: 24)
!697 = distinct !DILexicalBlock(scope: !678, file: !679, line: 53, column: 7)
!698 = !DILocalVariable(name: "ierr__", scope: !699, file: !679, line: 56, type: !193)
