; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/ftn-auto/pmapf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/ftn-auto/pmapf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscLayout = type { %struct.ompi_communicator_t*, i32, i32, i32, i32, i32, i32*, i32, i32, i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct._p_ISLocalToGlobalMapping = type opaque

; Function Attrs: nounwind uwtable
define void @petsclayoutcreate_(i32* nocapture readonly %0, %struct._n_PetscLayout** %1, i32* nocapture %2) local_unnamed_addr #0 !dbg !60 {
  call void @llvm.dbg.value(metadata i32* %0, metadata !67, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.value(metadata %struct._n_PetscLayout** %1, metadata !68, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.value(metadata i32* %2, metadata !69, metadata !DIExpression()), !dbg !70
  %4 = load i32, i32* %0, align 4, !dbg !71, !tbaa !72
  %5 = tail call %struct.ompi_communicator_t* @MPI_Comm_f2c(i32 %4) #3, !dbg !76
  %6 = tail call i32 @PetscLayoutCreate(%struct.ompi_communicator_t* %5, %struct._n_PetscLayout** %1) #3, !dbg !77
  store i32 %6, i32* %2, align 4, !dbg !78, !tbaa !72
  ret void, !dbg !79
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/ftn-auto/pmapf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!12 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!14 = !{!15, !48, !41}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !16, line: 60, baseType: !17)
!16 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !19, line: 240, size: 640, elements: !20)
!19 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!20 = !{!21, !26, !29, !31, !32, !33, !34, !36, !38, !39, !40, !44, !45, !46, !47}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !19, line: 241, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !23, line: 330, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !23, line: 330, flags: DIFlagFwdDecl)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !18, file: !19, line: 242, baseType: !27, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !28)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !18, file: !19, line: 243, baseType: !30, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !28)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !18, file: !19, line: 243, baseType: !30, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !18, file: !19, line: 244, baseType: !30, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !18, file: !19, line: 244, baseType: !30, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !18, file: !19, line: 245, baseType: !35, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !18, file: !19, line: 246, baseType: !37, size: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !18, file: !19, line: 247, baseType: !30, size: 32, offset: 352)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !18, file: !19, line: 251, baseType: !30, size: 32, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !18, file: !19, line: 252, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !16, line: 30, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !16, line: 30, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !18, file: !19, line: 253, baseType: !37, size: 32, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !18, file: !19, line: 254, baseType: !30, size: 32, offset: 544)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !18, file: !19, line: 254, baseType: !30, size: 32, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !18, file: !19, line: 255, baseType: !30, size: 32, offset: 608)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !50, line: 135, baseType: !51)
!50 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !52, line: 100, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !{i32 7, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{i32 7, !"PIC Level", i32 2}
!58 = !{i32 7, !"uwtable", i32 1}
!59 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!60 = distinct !DISubprogram(name: "petsclayoutcreate_", scope: !61, file: !61, line: 112, type: !62, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !66)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/ftn-auto/pmapf.c", directory: "/home/users/ndemeye/xSDK")
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !65, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!66 = !{!67, !68, !69}
!67 = !DILocalVariable(name: "comm", arg: 1, scope: !60, file: !61, line: 112, type: !64)
!68 = !DILocalVariable(name: "map", arg: 2, scope: !60, file: !61, line: 112, type: !65)
!69 = !DILocalVariable(name: "__ierr", arg: 3, scope: !60, file: !61, line: 112, type: !64)
!70 = !DILocation(line: 0, scope: !60)
!71 = !DILocation(line: 115, column: 15, scope: !60)
!72 = !{!73, !73, i64 0}
!73 = !{!"int", !74, i64 0}
!74 = !{!"omnipotent char", !75, i64 0}
!75 = !{!"Simple C/C++ TBAA"}
!76 = !DILocation(line: 115, column: 2, scope: !60)
!77 = !DILocation(line: 114, column: 11, scope: !60)
!78 = !DILocation(line: 114, column: 9, scope: !60)
!79 = !DILocation(line: 116, column: 1, scope: !60)
!80 = !DISubprogram(name: "PetscLayoutCreate", scope: !19, file: !19, line: 335, type: !81, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !84)
!81 = !DISubroutineType(types: !82)
!82 = !{!28, !24, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!84 = !{}
!85 = !DISubprogram(name: "MPI_Comm_f2c", scope: !23, file: !23, line: 1292, type: !86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !84)
!86 = !DISubroutineType(types: !87)
!87 = !{!24, !28}
!88 = distinct !DISubprogram(name: "petsclayoutcreatefromsizes_", scope: !61, file: !61, line: 117, type: !89, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !64, !35, !35, !35, !65, !64}
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DILocalVariable(name: "comm", arg: 1, scope: !88, file: !61, line: 117, type: !64)
!93 = !DILocalVariable(name: "n", arg: 2, scope: !88, file: !61, line: 117, type: !35)
!94 = !DILocalVariable(name: "N", arg: 3, scope: !88, file: !61, line: 117, type: !35)
!95 = !DILocalVariable(name: "bs", arg: 4, scope: !88, file: !61, line: 117, type: !35)
!96 = !DILocalVariable(name: "map", arg: 5, scope: !88, file: !61, line: 117, type: !65)
!97 = !DILocalVariable(name: "__ierr", arg: 6, scope: !88, file: !61, line: 117, type: !64)
!98 = !DILocation(line: 0, scope: !88)
!99 = !DILocation(line: 120, column: 15, scope: !88)
!100 = !DILocation(line: 120, column: 2, scope: !88)
!101 = !DILocation(line: 120, column: 24, scope: !88)
!102 = !DILocation(line: 120, column: 27, scope: !88)
