; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/stagelog.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/stagelog.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscStageLog = type { i32, i32, %struct._n_PetscIntStack*, i32, %struct._PetscStageInfo*, %struct._n_PetscEventRegLog*, %struct._n_PetscClassRegLog* }
%struct._n_PetscIntStack = type { i32, i32, i32* }
%struct._PetscStageInfo = type { i8*, i32, %struct.PetscEventPerfInfo, %struct._n_PetscEventPerfLog*, %struct._n_PetscClassPerfLog* }
%struct.PetscEventPerfInfo = type { i32, i32, i32, i32, i32, double, double, double, double, double, double, double, [8 x double], [8 x double], double, double, double, double, double, double, double }
%struct._n_PetscEventPerfLog = type { i32, i32, %struct.PetscEventPerfInfo* }
%struct._n_PetscClassPerfLog = type { i32, i32, %struct.PetscClassPerfInfo* }
%struct.PetscClassPerfInfo = type { i32, i32, i32, double, double }
%struct._n_PetscEventRegLog = type { i32, i32, %struct.PetscEventRegInfo* }
%struct.PetscEventRegInfo = type { i8*, i32, i32 }
%struct._n_PetscClassRegLog = type { i32, i32, %struct.PetscClassRegInfo* }
%struct.PetscClassRegInfo = type { i8*, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "petsc_stageLog", scope: !2, file: !53, line: 10, type: !54, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !37, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/stagelog.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 663, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!19 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!37 = !{!38, !42, !43, !45, !48, !51}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !39, line: 330, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !39, line: 330, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !44)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!52 = !{!0}
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/stagelog.c", directory: "/home/users/ndemeye/xSDK")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscStageLog", file: !55, line: 215, baseType: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscStageLog", file: !55, line: 216, size: 384, elements: !58)
!58 = !{!59, !60, !61, !71, !72, !137, !152}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "numStages", scope: !57, file: !55, line: 217, baseType: !44, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "maxStages", scope: !57, file: !55, line: 218, baseType: !44, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !57, file: !55, line: 219, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscIntStack", file: !55, line: 104, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscIntStack", file: !65, line: 5, size: 128, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/logimpl.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !64, file: !65, line: 6, baseType: !44, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !64, file: !65, line: 7, baseType: !44, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !64, file: !65, line: 8, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "curStage", scope: !57, file: !55, line: 220, baseType: !44, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "stageInfo", scope: !57, file: !55, line: 221, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscStageInfo", file: !55, line: 213, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscStageInfo", file: !55, line: 207, size: 2368, elements: !76)
!76 = !{!77, !78, !80, !110, !119}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !55, line: 208, baseType: !51, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !75, file: !55, line: 209, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "perfInfo", scope: !75, file: !55, line: 210, baseType: !81, size: 2112, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventPerfInfo", file: !55, line: 186, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 160, size: 2112, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !96, !97, !98, !102, !103, !104, !105, !106, !107, !108, !109}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !82, file: !55, line: 161, baseType: !44, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !82, file: !55, line: 162, baseType: !79, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !82, file: !55, line: 163, baseType: !79, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !82, file: !55, line: 164, baseType: !44, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !82, file: !55, line: 165, baseType: !44, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !82, file: !55, line: 166, baseType: !90, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !91)
!91 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flops2", scope: !82, file: !55, line: 166, baseType: !90, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flopsTmp", scope: !82, file: !55, line: 166, baseType: !90, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !82, file: !55, line: 167, baseType: !90, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "time2", scope: !82, file: !55, line: 167, baseType: !90, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "timeTmp", scope: !82, file: !55, line: 167, baseType: !90, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "syncTime", scope: !82, file: !55, line: 168, baseType: !90, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !82, file: !55, line: 169, baseType: !99, size: 512, offset: 640)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 512, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !82, file: !55, line: 170, baseType: !99, size: 512, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "numMessages", scope: !82, file: !55, line: 171, baseType: !90, size: 64, offset: 1664)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "messageLength", scope: !82, file: !55, line: 172, baseType: !90, size: 64, offset: 1728)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "numReductions", scope: !82, file: !55, line: 173, baseType: !90, size: 64, offset: 1792)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "memIncrease", scope: !82, file: !55, line: 174, baseType: !90, size: 64, offset: 1856)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mallocIncrease", scope: !82, file: !55, line: 175, baseType: !90, size: 64, offset: 1920)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mallocSpace", scope: !82, file: !55, line: 176, baseType: !90, size: 64, offset: 1984)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mallocIncreaseEvent", scope: !82, file: !55, line: 177, baseType: !90, size: 64, offset: 2048)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "eventLog", scope: !75, file: !55, line: 211, baseType: !111, size: 64, offset: 2240)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventPerfLog", file: !55, line: 195, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscEventPerfLog", file: !55, line: 196, size: 128, elements: !114)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "numEvents", scope: !113, file: !55, line: 197, baseType: !44, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "maxEvents", scope: !113, file: !55, line: 198, baseType: !44, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "eventInfo", scope: !113, file: !55, line: 199, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "classLog", scope: !75, file: !55, line: 212, baseType: !120, size: 64, offset: 2304)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassPerfLog", file: !55, line: 134, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscClassPerfLog", file: !55, line: 135, size: 128, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "numClasses", scope: !122, file: !55, line: 136, baseType: !44, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "maxClasses", scope: !122, file: !55, line: 137, baseType: !44, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "classInfo", scope: !122, file: !55, line: 138, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassPerfInfo", file: !55, line: 125, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 119, size: 256, elements: !130)
!130 = !{!131, !133, !134, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !129, file: !55, line: 120, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !44)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "creations", scope: !129, file: !55, line: 121, baseType: !44, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "destructions", scope: !129, file: !55, line: 122, baseType: !44, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !129, file: !55, line: 123, baseType: !90, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descMem", scope: !129, file: !55, line: 124, baseType: !90, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "eventLog", scope: !57, file: !55, line: 222, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventRegLog", file: !55, line: 188, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscEventRegLog", file: !55, line: 189, size: 128, elements: !141)
!141 = !{!142, !143, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "numEvents", scope: !140, file: !55, line: 190, baseType: !44, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "maxEvents", scope: !140, file: !55, line: 191, baseType: !44, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "eventInfo", scope: !140, file: !55, line: 192, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventRegInfo", file: !55, line: 158, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 150, size: 128, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !55, line: 151, baseType: !51, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !147, file: !55, line: 152, baseType: !132, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "collective", scope: !147, file: !55, line: 153, baseType: !79, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "classLog", scope: !57, file: !55, line: 223, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassRegLog", file: !55, line: 127, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscClassRegLog", file: !55, line: 128, size: 128, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "numClasses", scope: !155, file: !55, line: 129, baseType: !44, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "maxClasses", scope: !155, file: !55, line: 130, baseType: !44, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "classInfo", scope: !155, file: !55, line: 131, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassRegInfo", file: !55, line: 117, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 114, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !55, line: 115, baseType: !51, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !162, file: !55, line: 116, baseType: !132, size: 32, offset: 64)
!166 = !{i32 7, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 7, !"PIC Level", i32 2}
!170 = !{i32 7, !"uwtable", i32 1}
!171 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!172 = distinct !DISubprogram(name: "PetscLogGetStageLog", scope: !53, file: !53, line: 27, type: !173, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !177)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !44)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!177 = !{!178, !179, !184}
!178 = !DILocalVariable(name: "stageLog", arg: 1, scope: !172, file: !53, line: 27, type: !176)
!179 = !DILocalVariable(name: "idx", scope: !180, file: !53, line: 33, type: !183)
!180 = distinct !DILexicalBlock(scope: !181, file: !53, line: 33, column: 5)
!181 = distinct !DILexicalBlock(scope: !182, file: !53, line: 31, column: 24)
!182 = distinct !DILexicalBlock(scope: !172, file: !53, line: 31, column: 7)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !44)
!184 = !DILocalVariable(name: "errcode", scope: !180, file: !53, line: 33, type: !43)
!185 = !DILocation(line: 0, scope: !172)
!186 = !DILocation(line: 29, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !53, line: 29, column: 3)
!188 = distinct !DILexicalBlock(scope: !189, file: !53, line: 29, column: 3)
!189 = distinct !DILexicalBlock(scope: !172, file: !53, line: 29, column: 3)
!190 = !{!191, !191, i64 0}
!191 = !{!"any pointer", !192, i64 0}
!192 = !{!"omnipotent char", !193, i64 0}
!193 = !{!"Simple C/C++ TBAA"}
!194 = !DILocation(line: 29, column: 3, scope: !188)
!195 = !DILocation(line: 29, column: 3, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !53, line: 29, column: 3)
!197 = distinct !DILexicalBlock(scope: !187, file: !53, line: 29, column: 3)
!198 = !{!199, !200, i64 1536}
!199 = !{!"", !192, i64 0, !192, i64 512, !192, i64 1024, !192, i64 1280, !200, i64 1536, !200, i64 1540, !192, i64 1544}
!200 = !{!"int", !192, i64 0}
!201 = !DILocation(line: 29, column: 3, scope: !197)
!202 = !DILocation(line: 29, column: 3, scope: !203)
!203 = distinct !DILexicalBlock(scope: !196, file: !53, line: 29, column: 3)
!204 = !{!200, !200, i64 0}
!205 = !{!199, !200, i64 1540}
!206 = !DILocation(line: 30, column: 3, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !53, line: 30, column: 3)
!208 = distinct !DILexicalBlock(scope: !172, file: !53, line: 30, column: 3)
!209 = !DILocation(line: 30, column: 3, scope: !208)
!210 = !DILocation(line: 30, column: 3, scope: !211)
!211 = distinct !DILexicalBlock(scope: !208, file: !53, line: 30, column: 3)
!212 = !DILocation(line: 31, column: 8, scope: !182)
!213 = !DILocation(line: 31, column: 7, scope: !172)
!214 = !DILocation(line: 32, column: 13, scope: !181)
!215 = !DILocation(line: 32, column: 5, scope: !181)
!216 = !DILocation(line: 33, column: 5, scope: !180)
!217 = !DILocation(line: 0, scope: !180)
!218 = !DILocation(line: 33, column: 5, scope: !219)
!219 = distinct !DILexicalBlock(scope: !180, file: !53, line: 33, column: 5)
!220 = !{!192, !192, i64 0}
!221 = !DILocation(line: 33, column: 5, scope: !222)
!222 = distinct !DILexicalBlock(scope: !180, file: !53, line: 33, column: 5)
!223 = !DILocation(line: 33, column: 5, scope: !181)
!224 = !DILocation(line: 35, column: 15, scope: !172)
!225 = !DILocation(line: 34, column: 3, scope: !181)
!226 = !DILocation(line: 35, column: 13, scope: !172)
!227 = !DILocation(line: 36, column: 3, scope: !228)
