; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagda.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagda.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!75 = !DIEnumerator(name: "DMSTAG_BACK_RIGHT", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "DMSTAG_BACK_UP_LEFT", value: 7, isUnsigned: true)
!77 = !DIEnumerator(name: "DMSTAG_BACK_UP", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "DMSTAG_BACK_UP_RIGHT", value: 9, isUnsigned: true)
!79 = !DIEnumerator(name: "DMSTAG_DOWN_LEFT", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "DMSTAG_DOWN", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "DMSTAG_DOWN_RIGHT", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "DMSTAG_LEFT", value: 13, isUnsigned: true)
!83 = !DIEnumerator(name: "DMSTAG_ELEMENT", value: 14, isUnsigned: true)
!84 = !DIEnumerator(name: "DMSTAG_RIGHT", value: 15, isUnsigned: true)
!85 = !DIEnumerator(name: "DMSTAG_UP_LEFT", value: 16, isUnsigned: true)
!86 = !DIEnumerator(name: "DMSTAG_UP", value: 17, isUnsigned: true)
!87 = !DIEnumerator(name: "DMSTAG_UP_RIGHT", value: 18, isUnsigned: true)
!88 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_LEFT", value: 19, isUnsigned: true)
!89 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN", value: 20, isUnsigned: true)
!90 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_RIGHT", value: 21, isUnsigned: true)
!91 = !DIEnumerator(name: "DMSTAG_FRONT_LEFT", value: 22, isUnsigned: true)
!92 = !DIEnumerator(name: "DMSTAG_FRONT", value: 23, isUnsigned: true)
!93 = !DIEnumerator(name: "DMSTAG_FRONT_RIGHT", value: 24, isUnsigned: true)
!94 = !DIEnumerator(name: "DMSTAG_FRONT_UP_LEFT", value: 25, isUnsigned: true)
!95 = !DIEnumerator(name: "DMSTAG_FRONT_UP", value: 26, isUnsigned: true)
!96 = !DIEnumerator(name: "DMSTAG_FRONT_UP_RIGHT", value: 27, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 663, baseType: !5, size: 32, elements: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!105 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 75, baseType: !5, size: 32, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "DMSTAG_STENCIL_NONE", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "DMSTAG_STENCIL_STAR", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "DMSTAG_STENCIL_BOX", value: 2, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 14, baseType: !5, size: 32, elements: !130)
!129 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!130 = !{!131, !132}
!131 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!133 = !{!134, !138, !139, !175, !343, !309}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !135, line: 330, baseType: !136)
!135 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !135, line: 330, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !142, line: 73, size: 4480, elements: !143)
!142 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!143 = !{!144, !147, !196, !197, !199, !202, !203, !204, !205, !213, !214, !216, !220, !224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !238, !239, !241, !242, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !258, !259, !262, !264, !265, !266, !276, !278, !279, !283, !284, !333, !338, !340, !341, !342}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !141, file: !142, line: 74, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !146)
!146 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !141, file: !142, line: 75, baseType: !148, size: 448, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 448, elements: !194)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !142, line: 53, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 45, size: 448, elements: !151)
!151 = !{!152, !158, !166, !171, !178, !182, !189}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !150, file: !142, line: 46, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !139, !157}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !146)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !150, file: !142, line: 47, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!156, !139, !162}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !163, line: 16, baseType: !164)
!163 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !163, line: 16, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !150, file: !142, line: 48, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!156, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !150, file: !142, line: 49, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!156, !139, !175, !139}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !150, file: !142, line: 50, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!156, !139, !175, !170}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !150, file: !142, line: 51, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!156, !139, !175, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !150, file: !142, line: 52, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!156, !139, !175, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !141, file: !142, line: 76, baseType: !134, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !142, line: 77, baseType: !198, size: 32, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !146)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !141, file: !142, line: 78, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !201)
!201 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !141, file: !142, line: 78, baseType: !200, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !141, file: !142, line: 78, baseType: !200, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !141, file: !142, line: 78, baseType: !200, size: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !141, file: !142, line: 79, baseType: !206, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !209, line: 27, baseType: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !211, line: 43, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!212 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !141, file: !142, line: 80, baseType: !198, size: 32, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !141, file: !142, line: 81, baseType: !215, size: 32, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !146)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !141, file: !142, line: 82, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !141, file: !142, line: 83, baseType: !221, size: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !141, file: !142, line: 84, baseType: !225, size: 64, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !141, file: !142, line: 85, baseType: !225, size: 64, offset: 1216)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !141, file: !142, line: 86, baseType: !225, size: 64, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !141, file: !142, line: 87, baseType: !225, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !141, file: !142, line: 88, baseType: !139, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !141, file: !142, line: 89, baseType: !206, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 90, baseType: !225, size: 64, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !141, file: !142, line: 91, baseType: !225, size: 64, offset: 1600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !141, file: !142, line: 92, baseType: !198, size: 32, offset: 1664)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !141, file: !142, line: 93, baseType: !138, size: 64, offset: 1728)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !141, file: !142, line: 94, baseType: !236, size: 64, offset: 1792)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !207)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !141, file: !142, line: 95, baseType: !198, size: 32, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !141, file: !142, line: 95, baseType: !198, size: 32, offset: 1888)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !141, file: !142, line: 96, baseType: !240, size: 64, offset: 1920)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !141, file: !142, line: 96, baseType: !240, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !141, file: !142, line: 97, baseType: !243, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !141, file: !142, line: 97, baseType: !245, size: 64, offset: 2112)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !141, file: !142, line: 98, baseType: !198, size: 32, offset: 2176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !141, file: !142, line: 98, baseType: !198, size: 32, offset: 2208)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !141, file: !142, line: 99, baseType: !240, size: 64, offset: 2240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !141, file: !142, line: 99, baseType: !240, size: 64, offset: 2304)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !141, file: !142, line: 100, baseType: !251, size: 64, offset: 2368)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !201)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !141, file: !142, line: 100, baseType: !254, size: 64, offset: 2432)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !141, file: !142, line: 101, baseType: !198, size: 32, offset: 2496)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !141, file: !142, line: 101, baseType: !198, size: 32, offset: 2528)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !141, file: !142, line: 102, baseType: !240, size: 64, offset: 2560)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !141, file: !142, line: 102, baseType: !240, size: 64, offset: 2624)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !141, file: !142, line: 103, baseType: !260, size: 64, offset: 2688)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !252)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !141, file: !142, line: 103, baseType: !263, size: 64, offset: 2752)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !141, file: !142, line: 104, baseType: !193, size: 64, offset: 2816)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !141, file: !142, line: 105, baseType: !198, size: 32, offset: 2880)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !141, file: !142, line: 106, baseType: !267, size: 128, offset: 2944)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !274)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !142, line: 64, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 61, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !270, file: !142, line: 62, baseType: !186, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !270, file: !142, line: 63, baseType: !138, size: 64, offset: 64)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !141, file: !142, line: 107, baseType: !277, size: 64, offset: 3072)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !141, file: !142, line: 108, baseType: !138, size: 64, offset: 3136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !141, file: !142, line: 109, baseType: !280, size: 64, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!156, !138}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !141, file: !142, line: 111, baseType: !198, size: 32, offset: 3264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !141, file: !142, line: 112, baseType: !285, size: 320, offset: 3328)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !331)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!156, !289, !139, !138}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !292)
!292 = !{!293, !294, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !291, file: !10, line: 100, baseType: !198, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !10, line: 101, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !306, !307, !308, !312, !314, !316, !317, !318}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !297, file: !10, line: 84, baseType: !225, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !297, file: !10, line: 85, baseType: !225, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !10, line: 86, baseType: !138, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !297, file: !10, line: 87, baseType: !217, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !10, line: 88, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !297, file: !10, line: 89, baseType: !177, size: 8, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !297, file: !10, line: 90, baseType: !225, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !297, file: !10, line: 91, baseType: !309, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 46, baseType: !311)
!310 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!311 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !297, file: !10, line: 92, baseType: !313, size: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !10, line: 93, baseType: !315, size: 32, offset: 544)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 94, baseType: !295, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !297, file: !10, line: 95, baseType: !225, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !297, file: !10, line: 96, baseType: !138, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !10, line: 102, baseType: !225, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !291, file: !10, line: 102, baseType: !225, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !291, file: !10, line: 103, baseType: !225, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !291, file: !10, line: 104, baseType: !134, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !291, file: !10, line: 105, baseType: !313, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !291, file: !10, line: 105, baseType: !313, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !291, file: !10, line: 105, baseType: !313, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !291, file: !10, line: 106, baseType: !139, size: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !291, file: !10, line: 107, baseType: !328, size: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!331 = !{!332}
!332 = !DISubrange(count: 5)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !141, file: !142, line: 113, baseType: !334, size: 320, offset: 3648)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !331)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!156, !139, !138}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !141, file: !142, line: 114, baseType: !339, size: 320, offset: 3968)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 320, elements: !331)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !141, file: !142, line: 115, baseType: !313, size: 32, offset: 4288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !141, file: !142, line: 120, baseType: !328, size: 64, offset: 4352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !141, file: !142, line: 121, baseType: !313, size: 32, offset: 4416)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Stag", file: !345, line: 47, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmstagimpl.h", directory: "/home/users/ndemeye/xSDK")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 13, size: 1792, elements: !347)
!347 = !{!348, !352, !353, !355, !359, !361, !362, !365, !366, !369, !370, !371, !372, !374, !376, !382, !383, !384, !385, !386, !387, !389}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !346, file: !345, line: 16, baseType: !349, size: 96)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 96, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 3)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !346, file: !345, line: 17, baseType: !349, size: 96, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !346, file: !345, line: 18, baseType: !354, size: 192, offset: 192)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 192, elements: !350)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !346, file: !345, line: 19, baseType: !356, size: 128, offset: 384)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stencilType", scope: !346, file: !345, line: 20, baseType: !360, size: 32, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMStagStencilType", file: !67, line: 75, baseType: !123)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "stencilWidth", scope: !346, file: !345, line: 21, baseType: !198, size: 32, offset: 544)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "boundaryType", scope: !346, file: !345, line: 22, baseType: !363, size: 96, offset: 576)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 96, elements: !350)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nRanks", scope: !346, file: !345, line: 23, baseType: !349, size: 96, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDMType", scope: !346, file: !345, line: 26, baseType: !367, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMType", file: !368, line: 26, baseType: !175)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nGhost", scope: !346, file: !345, line: 31, baseType: !349, size: 96, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !346, file: !345, line: 32, baseType: !349, size: 96, offset: 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "startGhost", scope: !346, file: !345, line: 33, baseType: !349, size: 96, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !346, file: !345, line: 34, baseType: !373, size: 96, offset: 1120)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 96, elements: !350)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !346, file: !345, line: 35, baseType: !375, size: 64, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !346, file: !345, line: 36, baseType: !377, size: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !378, line: 59, baseType: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !378, line: 15, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !378, line: 15, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ltog_injective", scope: !346, file: !345, line: 37, baseType: !377, size: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "locationOffsets", scope: !346, file: !345, line: 38, baseType: !243, size: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "entriesPerElement", scope: !346, file: !345, line: 41, baseType: !198, size: 32, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !346, file: !345, line: 42, baseType: !198, size: 32, offset: 1504)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "entriesGhost", scope: !346, file: !345, line: 43, baseType: !198, size: 32, offset: 1536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "firstRank", scope: !346, file: !345, line: 44, baseType: !388, size: 96, offset: 1568)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 96, elements: !350)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lastRank", scope: !346, file: !345, line: 45, baseType: !388, size: 96, offset: 1664)
!390 = !{i32 7, !"Dwarf Version", i32 4}
!391 = !{i32 2, !"Debug Info Version", i32 3}
!392 = !{i32 1, !"wchar_size", i32 4}
!393 = !{i32 7, !"PIC Level", i32 2}
!394 = !{i32 7, !"uwtable", i32 1}
!395 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!396 = distinct !DISubprogram(name: "DMStagVecSplitToDMDA", scope: !397, file: !397, line: 476, type: !398, scopeLine: 477, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1142)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagda.c", directory: "/home/users/ndemeye/xSDK")
!398 = !DISubroutineType(types: !399)
!399 = !{!156, !400, !435, !1141, !198, !419, !434}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !403)
!403 = !{!404, !406, !637, !641, !642, !643, !644, !654, !655, !663, !664, !672, !673, !674, !675, !679, !680, !684, !686, !688, !689, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !717, !729, !741, !753, !762, !763, !786, !787, !788, !789, !790, !791, !793, !884, !885, !905, !906, !907, !908, !909, !910, !914, !915, !919, !920, !921, !922, !923, !924, !925, !926, !927, !929, !941, !942, !943, !952, !1040, !1041, !1129, !1130, !1131, !1132, !1134, !1136, !1137, !1138, !1139, !1140}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !402, file: !47, line: 203, baseType: !405, size: 4480)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !142, line: 122, baseType: !141)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !402, file: !47, line: 203, baseType: !407, size: 3456, offset: 4480)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 3456, elements: !194)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !409)
!409 = !{!410, !414, !415, !420, !424, !428, !429, !430, !439, !440, !441, !453, !454, !462, !471, !480, !484, !488, !489, !494, !495, !499, !500, !504, !505, !513, !517, !522, !523, !524, !525, !526, !527, !528, !532, !538, !542, !547, !551, !557, !561, !566, !573, !577, !578, !583, !594, !598, !608, !612, !620, !624, !632, !633}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !408, file: !47, line: 31, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!156, !400, !162}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !408, file: !47, line: 32, baseType: !411, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !408, file: !47, line: 33, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!156, !400, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !408, file: !47, line: 34, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!156, !289, !400}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !408, file: !47, line: 35, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!156, !400}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !408, file: !47, line: 36, baseType: !425, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !408, file: !47, line: 37, baseType: !425, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !408, file: !47, line: 38, baseType: !431, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!156, !400, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !436, line: 21, baseType: !437)
!436 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !436, line: 21, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !408, file: !47, line: 39, baseType: !431, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !408, file: !47, line: 40, baseType: !425, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !408, file: !47, line: 41, baseType: !442, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!156, !400, !243, !445, !447}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !450, line: 11, baseType: !451)
!450 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !450, line: 11, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !408, file: !47, line: 42, baseType: !416, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !408, file: !47, line: 43, baseType: !455, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!156, !400, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !408, file: !47, line: 45, baseType: !463, size: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!156, !400, !466, !467}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !450, line: 51, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !450, line: 51, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !408, file: !47, line: 46, baseType: !472, size: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!156, !400, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !477, line: 16, baseType: !478)
!477 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !477, line: 16, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !408, file: !47, line: 47, baseType: !481, size: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!156, !400, !400, !475, !434}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !408, file: !47, line: 48, baseType: !485, size: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!156, !400, !400, !475}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !408, file: !47, line: 49, baseType: !485, size: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !408, file: !47, line: 50, baseType: !490, size: 64, offset: 1152)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!156, !400, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !408, file: !47, line: 51, baseType: !485, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !408, file: !47, line: 53, baseType: !496, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!156, !400, !134, !419}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !408, file: !47, line: 54, baseType: !496, size: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !408, file: !47, line: 55, baseType: !501, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!156, !400, !198, !419}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !408, file: !47, line: 56, baseType: !501, size: 64, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !408, file: !47, line: 57, baseType: !506, size: 64, offset: 1536)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!156, !400, !509, !419}
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !510, line: 12, baseType: !511)
!510 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !510, line: 12, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !408, file: !47, line: 58, baseType: !514, size: 64, offset: 1600)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!156, !400, !435, !509, !419}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !408, file: !47, line: 60, baseType: !518, size: 64, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!156, !400, !435, !521, !435}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !408, file: !47, line: 61, baseType: !518, size: 64, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !408, file: !47, line: 62, baseType: !518, size: 64, offset: 1792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !408, file: !47, line: 63, baseType: !518, size: 64, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !408, file: !47, line: 64, baseType: !518, size: 64, offset: 1920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !408, file: !47, line: 65, baseType: !518, size: 64, offset: 1984)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !408, file: !47, line: 67, baseType: !425, size: 64, offset: 2048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !408, file: !47, line: 69, baseType: !529, size: 64, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!156, !400, !435, !435}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !408, file: !47, line: 71, baseType: !533, size: 64, offset: 2176)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!156, !400, !198, !536, !448, !419}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !408, file: !47, line: 72, baseType: !539, size: 64, offset: 2240)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!156, !419, !198, !447, !419}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !408, file: !47, line: 73, baseType: !543, size: 64, offset: 2304)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!156, !400, !243, !445, !447, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !408, file: !47, line: 74, baseType: !548, size: 64, offset: 2368)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!156, !400, !243, !445, !447, !447, !546}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !408, file: !47, line: 75, baseType: !552, size: 64, offset: 2432)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!156, !400, !198, !419, !555, !555, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !408, file: !47, line: 77, baseType: !558, size: 64, offset: 2496)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!156, !400, !198, !243, !243}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !408, file: !47, line: 78, baseType: !562, size: 64, offset: 2560)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!156, !400, !435, !565, !379}
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !408, file: !47, line: 79, baseType: !567, size: 64, offset: 2624)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!156, !400, !243, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !408, file: !47, line: 80, baseType: !574, size: 64, offset: 2688)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!156, !400, !251, !251}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !408, file: !47, line: 81, baseType: !574, size: 64, offset: 2752)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !408, file: !47, line: 82, baseType: !579, size: 64, offset: 2816)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!156, !400, !435, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !408, file: !47, line: 84, baseType: !584, size: 64, offset: 2880)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!156, !400, !252, !587, !593, !521, !435}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!156, !198, !252, !591, !198, !260, !138}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !408, file: !47, line: 85, baseType: !595, size: 64, offset: 2944)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!156, !400, !252, !509, !198, !536, !198, !536, !587, !593, !521, !435}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !408, file: !47, line: 86, baseType: !599, size: 64, offset: 3008)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!156, !400, !252, !435, !602, !521, !435}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !198, !198, !198, !536, !536, !606, !606, !606, !536, !536, !606, !606, !606, !252, !591, !198, !606, !260}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !408, file: !47, line: 87, baseType: !609, size: 64, offset: 3072)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!156, !400, !252, !509, !198, !536, !198, !536, !435, !602, !521, !435}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !408, file: !47, line: 88, baseType: !613, size: 64, offset: 3136)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!156, !400, !252, !509, !198, !536, !198, !536, !435, !616, !521, !435}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !198, !198, !198, !536, !536, !606, !606, !606, !536, !536, !606, !606, !606, !252, !591, !591, !198, !606, !260}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !408, file: !47, line: 89, baseType: !621, size: 64, offset: 3200)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!156, !400, !252, !587, !593, !435, !251}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !408, file: !47, line: 90, baseType: !625, size: 64, offset: 3264)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!156, !400, !252, !628, !593, !435, !591, !251}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!156, !198, !252, !591, !591, !198, !260, !138}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !408, file: !47, line: 91, baseType: !621, size: 64, offset: 3328)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !408, file: !47, line: 93, baseType: !634, size: 64, offset: 3392)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!156, !400, !400, !493, !493}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !402, file: !47, line: 204, baseType: !638, size: 6400, offset: 7936)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 6400, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 100)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !402, file: !47, line: 204, baseType: !638, size: 6400, offset: 14336)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !402, file: !47, line: 205, baseType: !638, size: 6400, offset: 20736)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !402, file: !47, line: 205, baseType: !638, size: 6400, offset: 27136)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !402, file: !47, line: 206, baseType: !645, size: 64, offset: 33536)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !648)
!648 = !{!649, !650, !651, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !647, file: !47, line: 143, baseType: !435, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !47, line: 144, baseType: !225, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !647, file: !47, line: 145, baseType: !652, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !47, line: 146, baseType: !645, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !402, file: !47, line: 207, baseType: !645, size: 64, offset: 33600)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !402, file: !47, line: 208, baseType: !656, size: 64, offset: 33664)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !658, file: !47, line: 151, baseType: !309, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !658, file: !47, line: 152, baseType: !138, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !47, line: 153, baseType: !656, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !402, file: !47, line: 208, baseType: !656, size: 64, offset: 33728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !402, file: !47, line: 209, baseType: !665, size: 64, offset: 33792)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !667, file: !47, line: 159, baseType: !509, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !667, file: !47, line: 160, baseType: !313, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !47, line: 161, baseType: !666, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !402, file: !47, line: 210, baseType: !509, size: 64, offset: 33856)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !402, file: !47, line: 211, baseType: !509, size: 64, offset: 33920)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !402, file: !47, line: 212, baseType: !138, size: 64, offset: 33984)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !402, file: !47, line: 213, baseType: !676, size: 64, offset: 34048)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!156, !593}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !402, file: !47, line: 214, baseType: !466, size: 32, offset: 34112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !402, file: !47, line: 215, baseType: !681, size: 64, offset: 34176)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !477, line: 1378, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !477, line: 1378, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !402, file: !47, line: 216, baseType: !685, size: 64, offset: 34240)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !436, line: 83, baseType: !175)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !402, file: !47, line: 217, baseType: !687, size: 64, offset: 34304)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !477, line: 25, baseType: !175)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !402, file: !47, line: 218, baseType: !198, size: 32, offset: 34368)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !402, file: !47, line: 219, baseType: !690, size: 64, offset: 34432)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !450, line: 30, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !450, line: 30, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !402, file: !47, line: 220, baseType: !313, size: 32, offset: 34496)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !402, file: !47, line: 221, baseType: !313, size: 32, offset: 34528)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !402, file: !47, line: 222, baseType: !198, size: 32, offset: 34560)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !402, file: !47, line: 222, baseType: !198, size: 32, offset: 34592)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !402, file: !47, line: 223, baseType: !313, size: 32, offset: 34624)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !402, file: !47, line: 224, baseType: !313, size: 32, offset: 34656)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !47, line: 225, baseType: !138, size: 64, offset: 34688)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !402, file: !47, line: 227, baseType: !400, size: 64, offset: 34752)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !402, file: !47, line: 228, baseType: !400, size: 64, offset: 34816)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !402, file: !47, line: 229, baseType: !703, size: 64, offset: 34880)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !706)
!706 = !{!707, !711, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !705, file: !47, line: 102, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!156, !400, !400, !138}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !705, file: !47, line: 103, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!156, !400, !476, !435, !476, !400, !138}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !705, file: !47, line: 104, baseType: !138, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !47, line: 105, baseType: !703, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !402, file: !47, line: 230, baseType: !718, size: 64, offset: 34944)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !721)
!721 = !{!722, !723, !727, !728}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !720, file: !47, line: 110, baseType: !708, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !720, file: !47, line: 111, baseType: !724, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!156, !400, !476, !400, !138}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !720, file: !47, line: 112, baseType: !138, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !47, line: 113, baseType: !718, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !402, file: !47, line: 231, baseType: !730, size: 64, offset: 35008)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !733)
!733 = !{!734, !735, !739, !740}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !732, file: !47, line: 118, baseType: !708, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !732, file: !47, line: 119, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!156, !400, !377, !377, !400, !138}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !732, file: !47, line: 120, baseType: !138, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !47, line: 121, baseType: !730, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !402, file: !47, line: 232, baseType: !742, size: 64, offset: 35072)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !745)
!745 = !{!746, !750, !751, !752}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !744, file: !47, line: 126, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!156, !400, !435, !521, !435, !138}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !744, file: !47, line: 127, baseType: !747, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !744, file: !47, line: 128, baseType: !138, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !47, line: 129, baseType: !742, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !402, file: !47, line: 233, baseType: !754, size: 64, offset: 35136)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !756, file: !47, line: 134, baseType: !747, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !756, file: !47, line: 135, baseType: !747, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !756, file: !47, line: 136, baseType: !138, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !47, line: 137, baseType: !754, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !402, file: !47, line: 235, baseType: !198, size: 32, offset: 35200)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !402, file: !47, line: 237, baseType: !764, size: 64, offset: 35264)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !768)
!768 = !{!769, !773, !774, !775, !776, !778, !785}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !767, file: !47, line: 27, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !771, line: 166, baseType: !772)
!771 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !771, line: 139, baseType: !5)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !767, file: !47, line: 27, baseType: !770, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !767, file: !47, line: 27, baseType: !770, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !767, file: !47, line: 27, baseType: !770, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !47, line: 27, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !767, file: !47, line: 27, baseType: !779, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !781, file: !47, line: 19, baseType: !509, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !781, file: !47, line: 20, baseType: !198, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !767, file: !47, line: 27, baseType: !434, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !402, file: !47, line: 239, baseType: !379, size: 64, offset: 35328)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !402, file: !47, line: 240, baseType: !379, size: 64, offset: 35392)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !402, file: !47, line: 241, baseType: !379, size: 64, offset: 35456)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !402, file: !47, line: 242, baseType: !379, size: 64, offset: 35520)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !402, file: !47, line: 243, baseType: !313, size: 32, offset: 35584)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !402, file: !47, line: 245, baseType: !792, size: 64, offset: 35616)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 64, elements: !274)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !402, file: !47, line: 246, baseType: !794, size: 64, offset: 35712)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !795, line: 18, baseType: !796)
!795 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !798, line: 29, size: 5760, elements: !799)
!798 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!799 = !{!800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !819, !820, !821, !822, !847, !848, !849}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !797, file: !798, line: 30, baseType: !405, size: 4480)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !797, file: !798, line: 30, baseType: !802, size: 32, offset: 4480)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !194)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !797, file: !798, line: 31, baseType: !198, size: 32, offset: 4512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !797, file: !798, line: 31, baseType: !198, size: 32, offset: 4544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !797, file: !798, line: 32, baseType: !449, size: 64, offset: 4608)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !797, file: !798, line: 33, baseType: !313, size: 32, offset: 4672)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !797, file: !798, line: 34, baseType: !313, size: 32, offset: 4704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !797, file: !798, line: 35, baseType: !243, size: 64, offset: 4736)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !797, file: !798, line: 36, baseType: !243, size: 64, offset: 4800)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !797, file: !798, line: 37, baseType: !198, size: 32, offset: 4864)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !797, file: !798, line: 38, baseType: !794, size: 64, offset: 4928)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !797, file: !798, line: 39, baseType: !243, size: 64, offset: 4992)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !797, file: !798, line: 40, baseType: !313, size: 32, offset: 5056)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !797, file: !798, line: 42, baseType: !198, size: 32, offset: 5088)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !797, file: !798, line: 43, baseType: !446, size: 64, offset: 5120)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !797, file: !798, line: 44, baseType: !243, size: 64, offset: 5184)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !797, file: !798, line: 45, baseType: !818, size: 64, offset: 5248)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !797, file: !798, line: 46, baseType: !313, size: 32, offset: 5312)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !797, file: !798, line: 47, baseType: !445, size: 64, offset: 5376)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !797, file: !798, line: 49, baseType: !139, size: 64, offset: 5440)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !797, file: !798, line: 50, baseType: !823, size: 64, offset: 5504)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !798, line: 27, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !798, line: 27, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !798, line: 27, size: 320, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !840}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !826, file: !798, line: 27, baseType: !770, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !826, file: !798, line: 27, baseType: !770, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !826, file: !798, line: 27, baseType: !770, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !826, file: !798, line: 27, baseType: !770, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !798, line: 27, baseType: !777, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !826, file: !798, line: 27, baseType: !834, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !798, line: 10, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !798, line: 8, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !836, file: !798, line: 9, baseType: !198, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !836, file: !798, line: 9, baseType: !198, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !826, file: !798, line: 27, baseType: !841, size: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !798, line: 14, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 12, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !843, file: !798, line: 13, baseType: !243, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !843, file: !798, line: 13, baseType: !243, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !797, file: !798, line: 51, baseType: !794, size: 64, offset: 5568)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !797, file: !798, line: 52, baseType: !449, size: 64, offset: 5632)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !797, file: !798, line: 53, baseType: !850, size: 64, offset: 5696)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !795, line: 33, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !798, line: 72, size: 4864, elements: !853)
!853 = !{!854, !855, !873, !874, !883}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !852, file: !798, line: 73, baseType: !405, size: 4480)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !852, file: !798, line: 73, baseType: !856, size: 192, offset: 4480)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 192, elements: !194)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !798, line: 56, size: 192, elements: !858)
!858 = !{!859, !865, !869}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !857, file: !798, line: 57, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!156, !850, !794, !198, !536, !863, !864}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !857, file: !798, line: 58, baseType: !866, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!156, !850}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !857, file: !798, line: 59, baseType: !870, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!156, !850, !162}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !852, file: !798, line: 74, baseType: !138, size: 64, offset: 4672)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !852, file: !798, line: 75, baseType: !875, size: 64, offset: 4736)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !798, line: 62, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !798, line: 64, size: 256, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !877, file: !798, line: 66, baseType: !875, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !877, file: !798, line: 67, baseType: !863, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !877, file: !798, line: 68, baseType: !864, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !877, file: !798, line: 69, baseType: !198, size: 32, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !852, file: !798, line: 76, baseType: !875, size: 64, offset: 4800)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !402, file: !47, line: 247, baseType: !794, size: 64, offset: 35776)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !402, file: !47, line: 248, baseType: !886, size: 64, offset: 35840)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !450, line: 60, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !888, file: !25, line: 241, baseType: !134, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !888, file: !25, line: 242, baseType: !215, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !888, file: !25, line: 243, baseType: !198, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !888, file: !25, line: 243, baseType: !198, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !888, file: !25, line: 244, baseType: !198, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !888, file: !25, line: 244, baseType: !198, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !888, file: !25, line: 245, baseType: !243, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !888, file: !25, line: 246, baseType: !313, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !888, file: !25, line: 247, baseType: !198, size: 32, offset: 352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !888, file: !25, line: 251, baseType: !198, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !888, file: !25, line: 252, baseType: !690, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !888, file: !25, line: 253, baseType: !313, size: 32, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !888, file: !25, line: 254, baseType: !198, size: 32, offset: 544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !888, file: !25, line: 254, baseType: !198, size: 32, offset: 576)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !888, file: !25, line: 255, baseType: !198, size: 32, offset: 608)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !402, file: !47, line: 250, baseType: !794, size: 64, offset: 35904)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !402, file: !47, line: 251, baseType: !476, size: 64, offset: 35968)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !402, file: !47, line: 253, baseType: !400, size: 64, offset: 36032)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !402, file: !47, line: 254, baseType: !435, size: 64, offset: 36096)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !402, file: !47, line: 255, baseType: !138, size: 64, offset: 36160)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !402, file: !47, line: 256, baseType: !911, size: 64, offset: 36224)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!156, !400, !138}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !402, file: !47, line: 257, baseType: !911, size: 64, offset: 36288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !402, file: !47, line: 258, baseType: !916, size: 64, offset: 36352)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!156, !400, !591, !313, !864, !138}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !402, file: !47, line: 260, baseType: !198, size: 32, offset: 36416)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !402, file: !47, line: 261, baseType: !400, size: 64, offset: 36480)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !402, file: !47, line: 262, baseType: !435, size: 64, offset: 36544)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !402, file: !47, line: 263, baseType: !435, size: 64, offset: 36608)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !402, file: !47, line: 264, baseType: !313, size: 32, offset: 36672)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !402, file: !47, line: 265, baseType: !459, size: 64, offset: 36736)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !402, file: !47, line: 266, baseType: !251, size: 64, offset: 36800)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !402, file: !47, line: 266, baseType: !251, size: 64, offset: 36864)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !402, file: !47, line: 267, baseType: !928, size: 64, offset: 36928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !402, file: !47, line: 269, baseType: !930, size: 640, offset: 36992)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 640, elements: !939)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!156, !400, !198, !198, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !477, line: 1723, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !477, line: 1723, flags: DIFlagFwdDecl)
!939 = !{!940}
!940 = !DISubrange(count: 10)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !402, file: !47, line: 270, baseType: !930, size: 640, offset: 37632)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !402, file: !47, line: 272, baseType: !198, size: 32, offset: 38272)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !402, file: !47, line: 273, baseType: !944, size: 64, offset: 38336)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !947)
!947 = !{!948, !949, !950, !951}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !946, file: !47, line: 174, baseType: !139, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !946, file: !47, line: 175, baseType: !509, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !946, file: !47, line: 176, baseType: !792, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !946, file: !47, line: 177, baseType: !313, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !402, file: !47, line: 274, baseType: !953, size: 64, offset: 38400)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !956)
!956 = !{!957, !1038, !1039}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !955, file: !47, line: 168, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !959, line: 11, baseType: !960)
!959 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !959, line: 13, size: 832, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !1029, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !961, file: !959, line: 14, baseType: !175, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !961, file: !959, line: 15, baseType: !509, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !961, file: !959, line: 16, baseType: !175, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !961, file: !959, line: 17, baseType: !198, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !961, file: !959, line: 18, baseType: !243, size: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !961, file: !959, line: 19, baseType: !969, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !970, line: 22, baseType: !971)
!970 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !959, line: 81, size: 4992, elements: !973)
!973 = !{!974, !975, !989, !990, !991, !1000}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !972, file: !959, line: 82, baseType: !405, size: 4480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !972, file: !959, line: 82, baseType: !976, size: 256, offset: 4480)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 256, elements: !194)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !959, line: 74, size: 256, elements: !978)
!978 = !{!979, !983, !984, !988}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !977, file: !959, line: 75, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!156, !969}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !977, file: !959, line: 76, baseType: !980, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !977, file: !959, line: 77, baseType: !985, size: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!156, !969, !162}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !977, file: !959, line: 78, baseType: !980, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !972, file: !959, line: 83, baseType: !138, size: 64, offset: 4736)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !972, file: !959, line: 85, baseType: !198, size: 32, offset: 4800)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !972, file: !959, line: 86, baseType: !992, size: 64, offset: 4864)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !959, line: 41, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !959, line: 36, size: 256, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !994, file: !959, line: 37, baseType: !309, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !994, file: !959, line: 38, baseType: !309, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !994, file: !959, line: 39, baseType: !309, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !994, file: !959, line: 40, baseType: !225, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !972, file: !959, line: 87, baseType: !1001, size: 64, offset: 4928)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !959, line: 54, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !959, line: 54, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !959, line: 54, size: 320, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1021}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1005, file: !959, line: 54, baseType: !770, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1005, file: !959, line: 54, baseType: !770, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1005, file: !959, line: 54, baseType: !770, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1005, file: !959, line: 54, baseType: !770, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1005, file: !959, line: 54, baseType: !777, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1005, file: !959, line: 54, baseType: !1013, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !970, line: 41, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !970, line: 35, size: 192, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1015, file: !970, line: 37, baseType: !509, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1015, file: !970, line: 38, baseType: !198, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1015, file: !970, line: 39, baseType: !198, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1015, file: !970, line: 40, baseType: !198, size: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1005, file: !959, line: 54, baseType: !1022, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !959, line: 34, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !959, line: 30, size: 96, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1024, file: !959, line: 31, baseType: !198, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1024, file: !959, line: 32, baseType: !198, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1024, file: !959, line: 33, baseType: !198, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !961, file: !959, line: 20, baseType: !1030, size: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !961, file: !959, line: 21, baseType: !198, size: 32, offset: 416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !961, file: !959, line: 22, baseType: !198, size: 32, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !961, file: !959, line: 23, baseType: !243, size: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !961, file: !959, line: 24, baseType: !186, size: 64, offset: 576)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !961, file: !959, line: 25, baseType: !186, size: 64, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !961, file: !959, line: 26, baseType: !138, size: 64, offset: 704)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !961, file: !959, line: 27, baseType: !958, size: 64, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !955, file: !47, line: 169, baseType: !509, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !47, line: 170, baseType: !953, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !402, file: !47, line: 275, baseType: !198, size: 32, offset: 38464)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !402, file: !47, line: 276, baseType: !1042, size: 64, offset: 38528)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !1045)
!1045 = !{!1046, !1127, !1128}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1044, file: !47, line: 181, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !970, line: 13, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !959, line: 98, size: 7232, elements: !1050)
!1050 = !{!1051, !1052, !1066, !1067, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1083, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1049, file: !959, line: 99, baseType: !405, size: 4480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1049, file: !959, line: 99, baseType: !1053, size: 256, offset: 4480)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 256, elements: !194)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !959, line: 91, size: 256, elements: !1055)
!1055 = !{!1056, !1060, !1061, !1065}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1054, file: !959, line: 92, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!156, !1047}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1054, file: !959, line: 93, baseType: !1057, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1054, file: !959, line: 94, baseType: !1062, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!156, !1047, !162}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1054, file: !959, line: 95, baseType: !1057, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !959, line: 100, baseType: !138, size: 64, offset: 4736)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1049, file: !959, line: 101, baseType: !1068, size: 64, offset: 4800)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1049, file: !959, line: 102, baseType: !313, size: 32, offset: 4864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !1049, file: !959, line: 103, baseType: !313, size: 32, offset: 4896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !1049, file: !959, line: 104, baseType: !198, size: 32, offset: 4928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1049, file: !959, line: 105, baseType: !198, size: 32, offset: 4960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1049, file: !959, line: 106, baseType: !170, size: 64, offset: 4992)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !1049, file: !959, line: 108, baseType: !958, size: 64, offset: 5056)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !1049, file: !959, line: 109, baseType: !313, size: 32, offset: 5120)
